{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Safety Detectives","atom:link":{"@href":"https://www.safetydetectives.com/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://www.safetydetectives.com","description":"","lastBuildDate":"Fri, 17 Nov 2023 17:37:09 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=5.8.2","item":[{"title":"Companies Are Paying Up To $500’000 For Top Cybersecurity Personnel","link":"https://www.safetydetectives.com/news/companies-are-paying-up-to-dollars-500000-for-top-cybersecurity-personnel/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Fri, 17 Nov 2023 17:37:09 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157887"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Cybersecurity-Personnel-300x199.png\" alt=\"\"></p>Researchers with the Information Security Insights and CISO Guidance (IANS) and talent-hunting company Artico found that the top 25% of companies are paying up to $500’000 for talented cybersecurity personnel. Cybersecurity experts are needed more than ever as hackers have seriously stepped up the amount of data breaches, hacks, and exploits they pull off. A [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Cybersecurity-Personnel-300x199.png\" alt=\"\"></p><p>Researchers with the Information Security Insights and CISO Guidance (IANS) and talent-hunting company Artico found that the top 25% of companies are paying up to $500’000 for talented cybersecurity personnel.</p>\n<p>Cybersecurity experts are needed more than ever as hackers have seriously stepped up the amount of data breaches, hacks, and exploits they pull off. A company requires a strong cybersecurity defense team, but to retain them, they need to offer competitive wages.</p>\n<p>The report found that the number of cybersecurity employees and their wages scaled with revenue. While smaller firms may need one-to-nine cybersecurity employees, massive corporations require hundreds of specialists.</p>\n<p>Fifteen percent of businesses are approaching (or already at) a milestone that requires them to hire a SecOps for their security organizations.</p>\n<p>&#8220;For 15% of CISOs, the head of AppSec is a likely or critical hire, followed by 13% for a head of IAM,&#8221; explains the report.</p>\n<p>Finding solutions to these various concerns is one of the main concerns for any company&#8217;s Chief Information Security Officer (CISO). Most firms follow a similar pattern when it comes to organizational patterns. For example, Fortune 500 companies would typically have 4 layers of staff underneath the CISO.</p>\n<p>Large Enterprises, companies with revenue ranging from $400 million to $6 billion, would use between 2-3 layers of cybersecurity experts under their respective CISOs.</p>\n<p>Smaller firms would typically avoid bureaucratic layers and opt for a team of specialists that each manage their own set of tasks — each employee typically has multiple responsibilities.</p>\n<p>The wage floor across these various specializations (including CISOs, SecOps, risk, compliance, etc) varies. That said, researchers found that the earnings in these fields average at $523’000, and total compensation is $640’000 with equity.</p>\n<p>The floor does vary by specialty, for example, a Deputy CISO’s floor is up to $465’000. The company an employee works for and its size also factors into how much it can afford to pay experts.</p>\n<p>As the demand for cybersecurity experts continues to rise dramatically, companies are paying increasingly competitive wages.</p>\n"}},{"title":"NordPass Releases List Of Easiest To Crack Passwords","link":"https://www.safetydetectives.com/news/nordpass-releases-list-of-easiest-to-crack-passwords/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Fri, 17 Nov 2023 17:24:38 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157885"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2022/05/Hackers-Targeting-300x200.jpg\" alt=\"\"></p>NordPass, the parent company of NordVPN, and a group of independent researchers have released a list of the most commonly used passwords. While it can be tedious to try and come up with unique passwords for every website, the convenience of falling back on commonly used passwords could cost you. Criminals are constantly attempting to [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2022/05/Hackers-Targeting-300x200.jpg\" alt=\"\"></p><p><a href=\"https://www.safetydetectives.com/best-password-managers/nordpass/\" target=\"_blank\">NordPass</a>, the parent company of <a href=\"https://www.safetydetectives.com/best-vpns/nordvpn/\" target=\"_blank\">NordVPN</a>, and a group of independent researchers have released a list of the most commonly used passwords.</p>\n<p>While it can be tedious to try and come up with unique passwords for every website, the convenience of falling back on commonly used passwords could cost you. Criminals are constantly attempting to crack accounts and a commonly used password can take just seconds to crack in many cases.</p>\n<p>This gets significantly worse when you choose a lazy password — the kind you’d see as a joke on a TV show. The study conducted by NordPass showed that these lazy passwords were the most commonly used (and cracked) passwords.</p>\n<p>Here is the list of the most commonly used passwords, plus how long it takes hackers to crack them (on average).</p>\n<table>\n<tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">Rank</td>\n<td colspan=\"1\" rowspan=\"1\">Password</td>\n<td colspan=\"1\" rowspan=\"1\">Amount used</td>\n<td colspan=\"1\" rowspan=\"1\">Time to crack</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">1</td>\n<td colspan=\"1\" rowspan=\"1\">123456</td>\n<td colspan=\"1\" rowspan=\"1\">4,524,867</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">2</td>\n<td colspan=\"1\" rowspan=\"1\">admin</td>\n<td colspan=\"1\" rowspan=\"1\">4,008,850</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">3</td>\n<td colspan=\"1\" rowspan=\"1\">12345678</td>\n<td colspan=\"1\" rowspan=\"1\">1,371,152</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">4</td>\n<td colspan=\"1\" rowspan=\"1\">123456789</td>\n<td colspan=\"1\" rowspan=\"1\">1,213,047</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">5</td>\n<td colspan=\"1\" rowspan=\"1\">1234</td>\n<td colspan=\"1\" rowspan=\"1\">969,811</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">6</td>\n<td colspan=\"1\" rowspan=\"1\">12345</td>\n<td colspan=\"1\" rowspan=\"1\">728,414</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">7</td>\n<td colspan=\"1\" rowspan=\"1\">password</td>\n<td colspan=\"1\" rowspan=\"1\">710,321</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">8</td>\n<td colspan=\"1\" rowspan=\"1\">123</td>\n<td colspan=\"1\" rowspan=\"1\">528,086</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">9</td>\n<td colspan=\"1\" rowspan=\"1\">Aa123456</td>\n<td colspan=\"1\" rowspan=\"1\">319,725</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">10</td>\n<td colspan=\"1\" rowspan=\"1\">134567890</td>\n<td colspan=\"1\" rowspan=\"1\">302,709</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">11</td>\n<td colspan=\"1\" rowspan=\"1\">UNKNOWN</td>\n<td colspan=\"1\" rowspan=\"1\">240,377</td>\n<td colspan=\"1\" rowspan=\"1\">17 Minutes</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">12</td>\n<td colspan=\"1\" rowspan=\"1\">1234567</td>\n<td colspan=\"1\" rowspan=\"1\">234,187</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">13</td>\n<td colspan=\"1\" rowspan=\"1\">123123</td>\n<td colspan=\"1\" rowspan=\"1\">224,261</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">14</td>\n<td colspan=\"1\" rowspan=\"1\">111111</td>\n<td colspan=\"1\" rowspan=\"1\">191,392</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">15</td>\n<td colspan=\"1\" rowspan=\"1\">Password</td>\n<td colspan=\"1\" rowspan=\"1\">177,725</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">16</td>\n<td colspan=\"1\" rowspan=\"1\">12345678910</td>\n<td colspan=\"1\" rowspan=\"1\">172,502</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">17</td>\n<td colspan=\"1\" rowspan=\"1\">0000000</td>\n<td colspan=\"1\" rowspan=\"1\">168,653</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">18</td>\n<td colspan=\"1\" rowspan=\"1\">admin123</td>\n<td colspan=\"1\" rowspan=\"1\">159,354</td>\n<td colspan=\"1\" rowspan=\"1\">11 Seconds</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">19</td>\n<td colspan=\"1\" rowspan=\"1\">********</td>\n<td colspan=\"1\" rowspan=\"1\">152,497</td>\n<td colspan=\"1\" rowspan=\"1\">&lt; 1 Second</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"1\">20</td>\n<td colspan=\"1\" rowspan=\"1\">user</td>\n<td colspan=\"1\" rowspan=\"1\">146,233</td>\n<td colspan=\"1\" rowspan=\"1\"></td>\n</tr>\n</tbody>\n</table>\n<p>A few notes from the study include:</p>\n<ul>\n<li>123456 has ranked as the most common password for five years.</li>\n<li>123456 and UNKNOWN are the two most common passwords for financial accounts, smartphones, and social media accounts.</li>\n<li>“Isabella” is the second most used passwords in Austria.</li>\n<li>Chinese users are the most likely to use a string of numbers, such as 123456, as many Chinese users don’t include letters in their passwords.</li>\n<li>American users included slang words as their passwords more than any other country.</li>\n<li>“Admin” has not appeared in the top 200 list in the past five years, however, this year it’s nearly topped the charts at #2.</li>\n</ul>\n<p>If you’re using any of these passwords, you should immediately change your passwords and consider using a password manager and checking for any possible data breaches on your accounts.</p>\n<p>You should also take advantage of biometric logins, like fingerprint sensors and face-scans, on any app that allows it.</p>\n"}},{"title":"ENISA: Modest Increase in Cybersecurity Spending in EU Not Enough","link":"https://www.safetydetectives.com/news/enisa-modest-increase-in-cybersecurity-spending-in-eu-not-enough/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Fri, 17 Nov 2023 16:09:26 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157821"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/10/Cybersecurity-300x201.png\" alt=\"\"></p>European companies are investing too little in cybersecurity, according to the new report of the European Union Agency for Cybersecurity (ENISA). The report showed that companies are allocating just 0,4% more of their IT budget to cybersecurity from 2021 to 2022, despite a jump of 25% of the cost of major cyber incidents in the [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/10/Cybersecurity-300x201.png\" alt=\"\"></p><p>European companies are investing too little in cybersecurity, according to the new report of the European Union Agency for Cybersecurity (ENISA).</p>\n<p>The report showed that companies are allocating just 0,4% more of their IT budget to cybersecurity from 2021 to 2022, despite a jump of 25% of the cost of major cyber incidents in the same period.</p>\n<p>The findings come from a survey that asked 1,080 OES (Operators of Essential Services) and DSP (Digital Services Providers) from all 27 member states of the European Union about how they invest in cybersecurity and whether they’re following the rules under the NIS (Network and Information) Directive.</p>\n<p>The NIS Directive is a critical piece of EU-wide legislation that sets common requirements for the cybersecurity of network and information systems. The goal of the legislation is to establish a comprehensive and collaborative approach to cybersecurity that protects both consumers and businesses​ and addresses evolving cybersecurity challenges.</p>\n<p>A little under half of all organizations that took part in the survey said they don’t plan to hire information security FTEs (Full Time Equivalents) in the next 2 years, and one of the reasons is that they’re facing some hiring issues. For instance, 83% of the surveyed organizations said they had trouble recruiting people in at least one of the listed information security domains.</p>\n<p>This, in turn, affects how vulnerabilities are managed and fixed. According to the report, only 28% of the organizations would take a week to fix critical asset vulnerabilities. More than half of the organizations in the transport sector need one month to fix critical vulnerabilities and 21% need between one and six months to do the same.</p>\n<p>In response to the report, EU Agency for Cybersecurity Executive Director, Juhan Lepassaar, highlighted the need for continual skill development and investment to deal with the evolving cyber threat landscape.</p>\n<p>“Allocating sufficient budgetary and human resources to cybersecurity is key to our success. Managing vulnerabilities is essential and must go hand-in-hand with &#8220;secure by design&#8221; initiatives. In the meantime, we do need to continually invest in areas such as identifying, managing, and reporting vulnerabilities that can have an impact on the security of the whole Digital Single Market,” Lepassaar said.</p>\n"}},{"title":"NY Governor Proposes Tightened Cybersecurity Regulations For Hospitals","link":"https://www.safetydetectives.com/news/ny-governor-proposes-tightened-cybersecurity-regulations-for-hospitals/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Fri, 17 Nov 2023 15:27:41 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157791"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Cybersecurity-300x199.png\" alt=\"\"></p>New York Governor Kathy Hochul has proposed a slew of new cybersecurity regulations for hospitals in the state aimed at boosting their technology systems to protect from cyber threats. The governor plans to allocate $500 million from its fiscal year 2024 budget to help hospitals upgrade their systems in line with the newly proposed measures. [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Cybersecurity-300x199.png\" alt=\"\"></p><p>New York Governor Kathy Hochul has proposed a slew of new cybersecurity regulations for hospitals in the state aimed at boosting their technology systems to protect from cyber threats.</p>\n<p>The governor plans to allocate $500 million from its fiscal year 2024 budget to help hospitals upgrade their systems in line with the newly proposed measures.</p>\n<p>The proposed rules announced on Monday act as a complement to the federal Health Insurance Portability and Accountability Act (HIPAA) Security Rule that safeguards patient data and records.</p>\n<p>&#8220;Our interconnected world demands an interconnected defense against cyber-attacks, leveraging every resource available, especially at hospitals. These new proposed regulations set forth a nation-leading blueprint to ensure New York State stands ready and resilient in the face of cyber threats,”  Governor Hochul <a href=\"https://www.governor.ny.gov/news/governor-hochul-announces-proposed-cybersecurity-regulations-hospitals-throughout-new-york#:~:text=Under%20the%20proposed%20provisions%2C%20hospitals,access%20or%20other%20malicious%20acts%2C\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" data-btn-name=\"Affiliate Link\">said</a> in a statement.</p>\n<p>The proposal will first be reviewed by New York&#8217;s Public Health and Health Planning Council this week. If approved, the regulations will be published in the State Register early next month for a 60-day period of public commentary. Once officially adopted, hospitals will have 1 year to comply with the finalized requirements.</p>\n<p>New York State Chief Cyber Officer Colin Ahern highlighted the need to introduce cybersecurity regulations for hospitals in the state. “As hospitals face growing cyber threats, it is imperative that we enable them to defend against attacks and these draft regulations and financial commitment do just that. We look forward to receiving public feedback over the next 60 days before finalizing the regulations to support improved cyber defenses and resilience for hospitals statewide,” he said in a statement.</p>\n<p>Under the proposed rules, hospitals will need to create their own cybersecurity programs, including written procedures, guidelines, and standards for safe use of software, evaluate cyber risks inside and outside of the organization, and establish defensive measures to protect their information systems from bad actors. One of these measures would be mandating hospital employees use multi-factor authentication for accessing internal networks from an external network.</p>\n<p>Further, hospitals would need to develop response plans for potential cybersecurity incidents, perform test runs of those plans to make sure they can continue operations as they work to restore their systems from the attack, and outline how they plan to notify the appropriate government bodies if this happens. They’ll also need a  Chief Information Security Officer who’ll be responsible for enforcing the new rules, review them every year, and update them if needed.</p>\n<p>“Under Governor Hochul’s leadership, New York State has significantly enhanced its cyber defenses, which are critically important to our healthcare system. When we protect hospitals, we protect patients,” New York State Health Commissioner Dr. James McDonald said. “These nation-leading draft cybersecurity hospital regulations build on the Governor’s state of the state priority by helping protect critical systems from cyber threats and ensuring New York’s hospitals and health care facilities stay secure.”</p>\n"}},{"title":"UK Cybersecurity Agency Warns of Potential AI's Influence on Elections","link":"https://www.safetydetectives.com/news/uk-cybersecurity-agency-warns-of-potential-ais-influence-on-elections/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Fri, 17 Nov 2023 11:45:10 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157738"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/AI-300x201.png\" alt=\"\"></p>Britain’s cybersecurity agency said Tuesday that the rise of artificial intelligence poses a serious threat to the national election in the UK, set to take place by January 2025. The National Cyber Security Centre (NCSC) pointed to increasingly realistic deepfake videos, “hyper-realistic bots,” and other forms of fabricated materials that could be used to spread [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/AI-300x201.png\" alt=\"\"></p><p>Britain’s cybersecurity agency said Tuesday that the rise of artificial intelligence poses a serious threat to the national election in the UK, set to take place by January 2025.</p>\n<p>The National Cyber Security Centre (NCSC) pointed to increasingly realistic deepfake videos, “hyper-realistic bots,” and other forms of fabricated materials that could be used to spread disinformation during a campaign and influence voter preference.</p>\n<p>&#8220;The NCSC assesses that democratic events, such as elections, almost certainly represent attractive targets for malicious actors and so organizations and individuals need to be prepared for threats, old and new,&#8221; the agency, which is part of Britain’s cyberespionage agency, GCHQ, said in the annual review of cybersecurity issues.</p>\n<p>It acknowledged that paper voting, which the UK still predominantly uses, can’t be directly targeted by bad actors, but it doesn’t make the country immune to attacks, especially as AI technology continues to make strides.</p>\n<p>&#8220;While the UK&#8217;s use of paper voting in general elections makes it significantly harder to interfere with our elections, the next election will be the first to take place against the backdrop of significant advances in AI,&#8221; the group said.</p>\n<p>&#8220;But rather than presenting entirely new risks, it is AI&#8217;s ability to enable existing techniques which poses the biggest threat,” the statement continued. &#8220;Any interference or attempts to undermine our political discourse are completely unacceptable and the UK government is committed to enhancing our capabilities and countering the threat from online harms, such as disinformation.”</p>\n<p>The agency said cyberattacks by hostile countries and their proxies are another significant cause for concern. The statement noted how the past year has seen “the emergence of a new class of cyber adversary in the form of state-aligned actors, who are often sympathetic to Russia’s further invasion of Ukraine and are ideologically, rather than financially, motivated.”</p>\n<p>The statement also flagged China’s technological advancements as an ongoing threat to the UK, labeling it “an epoch-defining challenge for UK security.”</p>\n<p>“We risk China becoming the predominant power in cyberspace if our efforts to raise resilience and develop our capabilities do not keep pace,” the agency explained.</p>\n"}},{"title":"TikTok Pushes Back On Criticisms Of Having An Anti-Israel Bias","link":"https://www.safetydetectives.com/news/tiktok-pushes-back-on-criticisms-of-having-an-anti-israel-bias/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Thu, 16 Nov 2023 16:59:05 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157553"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/05/TikTok-300x198.png\" alt=\"\"></p>The popular video-sharing app, TikTok, is pushing back against claims that it pushes anti-Israel content that steers US youths into supporting Palestine. Prominent US politicians, including Senator Josh Hawley (R) and Senator Marc Rubio (R), have levied aggressive criticisms that “China’s TikTok Pushes Pro-Hamas Propaganda.” “TikTok, and its parent company ByteDance, are threats to American [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/05/TikTok-300x198.png\" alt=\"\"></p><p>The popular video-sharing app, TikTok, is pushing back against claims that it pushes anti-Israel content that steers US youths into supporting Palestine.</p>\n<p>Prominent US politicians, including Senator Josh Hawley (R) and Senator Marc Rubio (R), have levied aggressive criticisms that “China’s TikTok Pushes Pro-Hamas Propaganda.”</p>\n<p>“TikTok, and its parent company ByteDance, are threats to American national security,” <a href=\"https://www.hawley.senate.gov/hawley-renews-effort-ban-tiktok-following-rise-pro-hamas-content\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" data-btn-name=\"Affiliate Link\">said Josh Hawley in an open letter.</a> “According to one poll, 51% of Americans between the ages of 18 and 24 believe that Hamas’s murder of civilians was justified.”</p>\n<p>“The Marxist bias on TikTok reflects more than left-wing thought among millennials and Generation Z,” <a href=\"https://www.rubio.senate.gov/icymi-chinas-tiktok-pushes-pro-hamas-propaganda/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" data-btn-name=\"Affiliate Link\">Rubio said in a press release.</a> “Torrents of pro-Hamas, anti-Israel content now flood TikTok.”</p>\n<p>TikTok responded to these claims by stating that its algorithm doesn’t take sides and that the stats Republican lawmakers are using are misrepresentative of the full situation.</p>\n<p>“Blunt comparisons of hashtags is severely flawed and misrepresentative of the activity on TikTok,” <a href=\"https://newsroom.tiktok.com/en-us/the-truth-about-tiktok-hashtags-and-content-during-the-israel-hamas-war?utm_source=substack&amp;utm_medium=email\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" data-btn-name=\"Affiliate Link\">TikTok said.</a> They use the example of #standwithIsrael, which is associated with fewer videos than  #freePalestine, but gets 68% more views per video in the US.</p>\n<p>They retort that a difference in views is to be expected when they have a large number of users in the Middle East and Southeast Asia, meaning the total number of hashtags tells you nothing.</p>\n<p>TikTok also denied claims of growing anti-semitism on its platform by stating that it “removed 100% of antisemitic or Holocaust denial content,” and that “Nine times out of ten, TikTok removes hate speech before it&#8217;s reported.”</p>\n<p>TikTok also reports that it finds the same volume of anti-Israel content on other popular social media platforms, like Facebook. It compares the 5.7 million total posts on Facebook tagged with #FreePalestine, while only 278K posts were tagged with #standwithIsrael.</p>\n<p>Despite TikTok’s counterarguments, Republican lawmakers are making continued efforts to push for a national TikTok ban.</p>\n"}},{"title":"Australia Ports Resume Operations Following Cyber Incident","link":"https://www.safetydetectives.com/news/australia-ports-resume-operations-following-cyber-incident/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Thu, 16 Nov 2023 16:50:35 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157550"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Australia_Ports-300x204.png\" alt=\"\"></p>One of Australia’s biggest port operators, DP World Australia, restarted work at all facilities this week after a cybersecurity attack forced it to shut down and pause all operations for three days. The cyberattack led to a huge backup of cargo as DP World Australia, which is owned by Dubai-based logistics giant DP World — [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Australia_Ports-300x204.png\" alt=\"\"></p><p>One of Australia’s biggest port operators, DP World Australia, restarted work at all facilities this week after a cybersecurity attack forced it to shut down and pause all operations for three days.</p>\n<p>The cyberattack led to a huge backup of cargo as DP World Australia, which is owned by Dubai-based logistics giant DP World — it manages the flow of nearly 40% of the country’s goods. The cybersecurity incident affected all of its four ports in Sydney, Melbourne, Brisbane, and Fremantle.</p>\n<p>&#8220;Operations resumed at the company&#8217;s ports across Australia at 9 a.m. today (2200 GMT, Sunday) &#8230; following successful tests of key systems overnight,&#8221; the company said in a statement, noting that resuming operations “does not mean that this incident has concluded.”</p>\n<p>The statement added that they’d move about 5,000 out of its four terminals across the country. According to the Australian Financial Review, that’s just under 17% of DP World Australia’s overall affected load, which counts about 30,000 shipping containers.</p>\n<p>The company may face “some necessary, temporary disruptions” to port services as they’re making efforts to further protect their system and help with investigations into the incident. DP World Australia explained the investigations will likely take “some time.”</p>\n<p>Nicolaj Noes, the executive vice president of DP World’s Oceania, said the company has cyber insurance, and that it wasn’t asked to pay ransom.</p>\n<p>Details on the nature of the attack are still unclear. The company reported on Friday that it detected “unauthorized activity in its system,” after which it shut down access to the system and disconnected from the internet. This meant that the data exchange between trucks and the stevedore was disabled, and as a result, trucks were unable to enter DP World&#8217;s terminals to either collect or deposit containers.</p>\n<p>During the weekend, the docks saw a significant buildup of containers, occupying around 90% of the available storage space at the stevedore&#8217;s facility.</p>\n<p>“For some, it’s not a big deal because some furniture was supposed to go into stores anyway. But it could also have been a critical spare part missing to keep a factory running or for someone to start up their operation on a Monday,” explained Noes.</p>\n<p>Australian Minister for Home Affairs Clare O’Neil on Sunday called the incident “a reminder of the serious risk that cyber attacks pose to our country, and to the vital infrastructure we all rely on.”</p>\n<p>The incident puts DP World Australia on a growing list of terminal operators and ports that have been on the receiving end of a cyberattack. The list includes Japan’s Nagoya port which stopped work for 2 days earlier this year due to a cyberattack and a couple of Dutch ports that were hit by hackers.</p>\n"}},{"title":"FBI: Royal Ransomware Hacker Group Extorts $275M","link":"https://www.safetydetectives.com/news/fbi-royal-ransomware-hacker-group-extorts-dollars-275m/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Wed, 15 Nov 2023 20:39:00 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157359"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Ransomware-300x202.png\" alt=\"\"></p>The FBI and CISA have issued a public warning about the Royal Ransomware group after a severe string of extortions. Since September 2022, over 350 people have been targeted by the group — money stolen through extortion has surpassed $275 million. The amount extorted from individuals ranges from $1 million to $11 million. The hacker group [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Ransomware-300x202.png\" alt=\"\"></p><p>The FBI and CISA have issued <a href=\"https://www.cisa.gov/news-events/alerts/2023/11/13/cisa-releases-update-royal-ransomware-advisory\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" data-btn-name=\"Affiliate Link\">a public warning about the Royal Ransomware group</a> after a severe string of extortions.</p>\n<p>Since September 2022, over 350 people have been targeted by the group — money stolen through extortion has surpassed $275 million. The amount extorted from individuals ranges from $1 million to $11 million.</p>\n<p>The hacker group obtains sensitive data, mostly through phishing scams, and then runs a double-extortion scam. This scam sees the hacker publish the victim&#8217;s data to hacking forums if they won’t pay for the extortion. After the information has been posted, other hacking groups are free to use it however they see fit.</p>\n<p>Some hacking groups are known to refuse to give the information back after paying exorbitant amounts, so victims are typically encouraged not to pay the hacker.</p>\n<p>“FBI and CISA believe this variant, which uses its own custom-made file encryption program, evolved from earlier iterations that used “Zeon” as a loader,” says the FBI’s report. “After gaining access to victims’ networks, Royal actors disable antivirus software and exfiltrate large amounts of data before ultimately deploying the ransomware and encrypting the systems.”</p>\n<p>Instead of the group&#8217;s first note being payment instructions or a specific request, the note gives them directions to a .onion URL that can be reached using the Tor browser. After the victim is on their website, they deliver their requests.</p>\n<p>The end result is that victims are helpless as their data is encrypted after falling victim to the phishing scam.</p>\n<p>Agencies affected are “including, but not limited to, Manufacturing, Communications, Healthcare and Public Healthcare (HPH), and Education.”</p>\n<p>Royal Ransomware isn’t the only hacking group to employ these tactics. As the FBI notes, other groups like Blacksuit Ransomware share many characteristics with Royal.</p>\n<p>Phishing scams are the most popular vector for hackers — it’s important to be careful when opening links from unknown sources, downloading email attachments, or visiting strange websites.</p>\n"}},{"title":"Government of Maine Confirms Data Breach Affecting 1.3 Million People","link":"https://www.safetydetectives.com/news/government-of-maine-confirms-data-breach-affecting-1-3-million-people/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Wed, 15 Nov 2023 18:55:51 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157347"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Data-Breach-300x202.png\" alt=\"\"></p>The government of Maine confirmed that it suffered a massive data breach on Thursday. “The State of Maine has determined that this incident has impacted approximately 1.3 million individuals,” explains their recent report. Maine is one of the latest victims of the MOVEit file transfer software data breach that occurred earlier this year. MOVEit was [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/Data-Breach-300x202.png\" alt=\"\"></p><p>The government of Maine confirmed that it suffered a massive data breach on Thursday.</p>\n<p>“The State of Maine has determined that this incident has impacted approximately 1.3 million individuals,” explains their recent report.</p>\n<p>Maine is one of the latest victims of the MOVEit file transfer software data breach that occurred earlier this year. MOVEit was used by massive corporations and government entities worldwide to transfer important files and documents. When a Russian-linked hacker group was able to exploit vulnerabilities in MOVEit’s software, it gained access to an unparalleled amount of sensitive information.</p>\n<p>The report by the Maine government breaks down which agencies and departments were affected the most.</p>\n<p>Over 50% of the stolen info is from the Maine Department of Health and Human Services. Between 10-30% of it was from the Maine Department of Education, while the breach is broken up between a number of agencies, including the Maine Workers’ Compensation and the Maine Bureau of Motor Vehicles</p>\n<p>Maine stated that the information hackers obtained may include a person&#8217;s full name, social security number, address, date of birth, driver&#8217;s license, and other identifiable tax information. It’s not known how old the stolen data is or how much hackers may have been able to obtain for every case.</p>\n<p>After finishing their assessment, Maine has been notifying individuals whose information was compromised. Hackers gained access to files between May 28 and May 29. Maine responded by blocking internet access to the MOVEit file transfer service.</p>\n<p>“The State also implemented security measures recommended by Progress Software, engaged the services of outside legal counsel, and engaged external cybersecurity experts to investigate the nature and scope of the incident,” states the report.</p>\n<p>In addition, Maine is offering two years if credit monitoring and identity theft protection to anyone who had their social security number or taxpayer information stolen.</p>\n"}},{"title":"Russia To Tighten Grip On VPN Services Over Security Concerns","link":"https://www.safetydetectives.com/news/russia-to-tighten-grip-on-vpn-services-over-security-concerns/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Tue, 14 Nov 2023 14:55:29 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=157192"},"description":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/VPN-300x203.png\" alt=\"\"></p>The Russian government is set to block specific VPNs (Virtual Private Networks) and protocols that a special expert commission identifies as threats to the country’s security. The news was first reported by the state news agency RIA, which cited correspondence from Russia’s digital ministry. The correspondence came in response to concerns raised by lawmaker Anton [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://static.safetydetectives.com/wp-content/uploads/2023/11/VPN-300x203.png\" alt=\"\"></p><p>The Russian government is set to block specific VPNs (Virtual Private Networks) and protocols that a special expert commission identifies as threats to the country’s security. The news was first reported by the state news agency RIA, which cited correspondence from Russia’s digital ministry.</p>\n<p>The correspondence came in response to concerns raised by lawmaker Anton Tkachev about potential plans to block VPN technology. Tkachev argued that plans to block all VPNs would intensify pressure on Russians by disrupting access to basic household appliances connected to the internet.</p>\n<p>In its reply, the ministry confirmed, according to RIA, that &#8220;based on the decision of the expert commission, the filtration of certain VPN services and VPN protocols can be carried out on the mobile communication network for foreign traffic identified as a threat.&#8221;</p>\n<p>The ministry added that getting around restrictions to access specific information is perceived as a threat.</p>\n<p>If Russia moves forward with this decision, it would be an escalation of the 2017 Russian law that required VPN providers to register with the government, comply with data retention laws, and block access to content the government has banned.</p>\n<p>Talks about VPNs among Russian lawmakers have increased as more people in the country sought to use VPN technology after authorities blocked certain social media sites in the aftermath of the start of the Russia-Ukraine war in 2022. In March of that year, Russia banned Instagram, saying the platform is guilty of “extremist activities” because Facebook temporarily allowed users in some countries to call for violence against Russian soldiers and Russian President Vladimir Putin.</p>\n<p>&#8220;Our policies are focused on protecting people&#8217;s rights to speech as an expression of self-defense in reaction to a military invasion of their country,&#8221; Meta&#8217;s president of global affairs, Nick Clegg, <a href=\"https://twitter.com/nickclegg/status/1502349805221126144\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" data-btn-name=\"Affiliate Link\">said in a statement on Twitter</a>. He explained this doesn’t mean Meta will allow &#8220;Russophobia or any kind of discrimination, harassment or violence towards Russians on our platform … We have no quarrel with the Russian people.&#8221;</p>\n<p>Roskomnadzor had already blocked Facebook after the tech giant complied with EU sanctions that required the site to ban Russian-backed media outlets in the EU. The regulator characterized the move as “discrimination” at the time.</p>\n<p>Twitter, which banned Russian media site RT and Sputnik in compliance with EU sanctions, later confirmed that people in Russia are increasingly  &#8220;having difficulty&#8221; using the platform. According to the Russian government&#8217;s online registry, Russian authorities restricted access to Twitter in line with a federal law regulating calls for extremism and riots, and the spread of false information.</p>\n"}}]}}}