{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","@xmlns:georss":"http://www.georss.org/georss","@xmlns:geo":"http://www.w3.org/2003/01/geo/wgs84_pos#","channel":{"title":"World – TIME","atom:link":{"@href":"https://time.com/world/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://time.com","description":"Current & Breaking News | National & World Updates","lastBuildDate":"Sat, 18 Nov 2023 22:04:32 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.1.4","site":{"@xmlns":"com-wordpress:feed-additions:1","#text":"211197034"},"item":[{"title":"Most Patients, Staff and Displaced Have Left Shifa Hospital, Palestinian Health Authorities Report","link":"https://time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/","comments":"https://time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/#respond","dc:creator":{"#cdata-section":"AJIB JOBAIN, BASSEM MROUE, CARA ANNA / AP"},"pubDate":"Sat, 18 Nov 2023 16:02:32 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"Israel-Hamas War"},{"#cdata-section":"News Desk"},{"#cdata-section":"wire"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6337235"},"description":{"#cdata-section":"Patients and staff left Gaza's main hospital, health officials said, leaving behind Israeli forces and a small crew for remaining patients."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337235\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/AP23322421699164.jpg\" alt=\"Israel-Hamas-War\"/>\n\n\n\n<p>KHAN YOUNIS, Gaza Strip &mdash; Patients, staff and displaced people departed Gaza&#8217;s largest hospital Saturday, health officials said, leaving behind only Israeli forces and a skeleton crew to care for those too sick to move. The exodus came the day internet and phone service was restored to the Gaza Strip, ending a <a href=\"https://apnews.com/article/israel-hamas-war-news-11-16-2023-6c7daa3b8c3a6b8dddf186ce631dfaad\"  target=\"_blank\">telecommunications</a> outage that forced the United Nations to shut down critical aid deliveries.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Dozens of people were killed in the urban Jabaliya refugee camp when what witnesses described as an Israeli airstrike hit a crowded U.N. shelter in the main combat zone of northern Gaza. It caused massive destruction in the camp&#8217;s Fakhoura school, said Ahmed Radwan and Yassin Sharif.</p>\n\n\n\n<p>&ldquo;The scenes were horrifying. Corpses of women and children were on the ground. Others were screaming for help,&rdquo; Radwan said by phone. Associated Press&#8217; photos from a local hospital showed more than 20 bodies wrapped in bloodstained sheets.</p>\n\n\n\n<p>The Israeli military, which had warned Jabaliya residents and others in a social media post in Arabic to leave, had no immediate comment on the strike and said only that its troops were active in the Jabaliya area &ldquo;with the aim of hitting terrorists.&rdquo; It rarely comments on individual strikes, saying only that it targets Hamas while trying to minimize harm to civilians.</p>\n\n\n\n<p>&ldquo;Receiving horrifying images &amp; footage of scores of people killed and injured in another UNRWA school sheltering thousands of displaced in the north of the Gaza Strip. These attacks cannot become commonplace, they must stop. A humanitarian ceasefire cannot wait any longer,&rdquo; Philippe Lazzarini, the commissioner general of the U.N. agency for Palestinian refugees, or UNRWA, said on X, formerly Twitter.</p>\n\n\n\n<p>Attacks also continued in southern Gaza. An Israeli airstrike hit a residential building on the outskirts of the town of Khan Younis, killing at least 26 Palestinians, according to a doctor at the hospital where the bodies were taken.</p>\n\n\n\n<p><a href=\"https://apnews.com/article/israel-hamas-war-news-11-15-2023-b85e828db648f5f911278fa217e827e7\"  target=\"_blank\">Israel&#8217;s military has been searching</a>&nbsp;Shifa Hospital for traces of a Hamas command center that it alleges was located under the building &mdash; a claim&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-war-shifa-hospital-ce8fda9821a011a6cb6e4a3df5c90916\"  target=\"_blank\">Hamas and the hospital staff deny</a>&nbsp;&mdash; and urging the several thousand people still there to leave.</p>\n\n\n\n<p>On Saturday, the military said it had been asked by the hospital&rsquo;s director to help those who would like to leave do so by a secure route. The military said it did not order any evacuation, and that medical personnel were being allowed to remain in the hospital to support patients who cannot be moved.</p>\n\n\n\n<p>But Medhat Abbas, a spokesman for the Health Ministry in Hamas-controlled Gaza, said the military had ordered the facility cleared, giving the hospital an hour to get people out.</p>\n\n\n\n<p>After it appeared the evacuation was mostly complete, Dr. Ahmed Mokhallalati, a Shifa physician, said on social media that some 120 patients remained who were unable to leave, including some in intensive care and premature babies, and that he and five other doctors were staying to care for them.</p>\n\n\n\n<p>It was not immediately clear where those who left the hospital had gone, with 25 of Gaza&#8217;s hospitals non-functional due to lack of fuel, damage and other problems and the other 11 only partially operational, according to the World Health Organization.</p>\n\n\n\n<p>Israel has said hospitals in northern Gaza were a key target of its ground offensive aimed at crushing Hamas, claiming they were used as militant command centers and weapons depots, which both Hamas and medical staff deny.</p>\n\n\n\n<p>Israeli troops have encircled or entered several hospitals, while others stopped functioning because of dwindling supplies and loss of electricity.</p>\n\n\n\n<p>The war, now in its seventh week, was triggered by&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-attack-military-war-a8f63b07641212f0de61861844e5e71e\"  target=\"_blank\">Hamas&rsquo; Oct. 7 attack in southern Israel</a>, in which militants killed about 1,200 people, mostly civilians, and&nbsp;<a href=\"https://apnews.com/article/israel-hamas-war-hostages-gaza-ca1466cc052b08a642fff88280eb0b22\"  target=\"_blank\">abducted some 240 men, women and children</a>. Fifty-two soldiers have been killed since the Israeli offensive began.</p>\n\n\n\n<p>More than 11,500 Palestinians have been killed in the war, according to Palestinian health authorities. Another 2,700 have been reported missing,&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-gaza-buried-rubble-airstrikes-89c0e8d0934d573d94d2fbfeba44d933\"  target=\"_blank\">believed buried under rubble</a>. The count&nbsp;<a href=\"https://apnews.com/article/israel-hamas-war-gaza-health-ministry-health-death-toll-59470820308b31f1faf73c703400b033\"  target=\"_blank\">does not differentiate</a>&nbsp;between civilians and combatants, but more than two-thirds of those killed were women and children; Israel says it has killed thousands of militants.</p>\n\n\n\n<p>After the war, &#8220;there&rsquo;ll be no Arab troops going to Gaza. None. We&rsquo;re not going to be seen as the enemy,&rdquo; <a href=\"https://apnews.com/article/bahrain-manama-dialogue-israel-palestinians-hamas-war-gaza-331a642d62f2a52b13b66c45ab520168\"  target=\"_blank\">Jordan&rsquo;s foreign minister</a>, Ayman Safadi, told a conference in Bahrain organized by the International Institute for Strategic Studies. &ldquo;How could anybody talk about the future of Gaza when we do not know what kind of Gaza will be left once this aggression ends?&rdquo;</p>\n\n\n\n<p>Gaza&rsquo;s main power plant shut down early in the war, and Israel has cut off electricity. That makes fuel necessary to power the generators needed to run the telecommunications network, water treatment plants, sanitation facilities, hospitals and other critical infrastructure.</p>\n\n\n\n<p>Juliette Touma, spokeswoman for the agency for Palestinian refugees, said 120,000 liters (31,700 gallons) of fuel arrived , meant to last for two days, after Israel agreed Friday to allow in that amount for the U.N.&#8217;s use. It is also allowing another 10,000 liters (2,642 gallons) to keep the telecommunications systems running.</p>\n\n\n\n<p>The U.N. has warned that Gaza&rsquo;s 2.3 million people are running critically short of food and water, and said the amount of fuel being provided is only half of the daily minimum requirement. It was not immediately clear when UNRWA would resume the delivery of <a href=\"https://apnews.com/article/israel-hamas-war-news-11-17-2023-1811384fac6394329dd71e3aaf461eb5\"  target=\"_blank\">aid that was put on hold Friday</a>.</p>\n\n\n\n<p>Gaza has received only 10% of its required food supplies each day in&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-gaza-captives-border-aid-f5976ed58ba508f14d45b72b428125ac\"  target=\"_blank\">shipments from Egypt</a>, according to the U.N., and the water system shutdown has left most of the population&nbsp;<a href=\"https://apnews.com/article/gaza-israel-water-humanitarian-crisis-cfeabcda00fefdd03c2877495c4dcd09\"  target=\"_blank\">drinking contaminated water</a>, causing an outbreak of disease. Dehydration and malnutrition are growing, with nearly all residents in need of food, according to the U.N.&rsquo;s World Food Program.</p>\n\n\n\n<p>In Jerusalem, thousands of marchers &mdash; including families of more than 50 hostages &mdash; were arriving on the last leg of a five-day trek from Tel Aviv calling on the government to do more to rescue some 240 hostages held by Hamas. Many are furious with the government for refusing to tell them more about what is being done to rescue them.</p>\n\n\n\n<p>Israel has signaled&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-gaza-war-humanitarian-shifa-29388314e3286b2b0f1152f7d15e2d7b\"  target=\"_blank\">plans to expand its offensive south</a>, where most of Gaza&rsquo;s population is now sheltering, including hundreds of thousands of people who heeded Israel&rsquo;s calls to evacuate Gaza City and the north ahead of its ground offensive.</p>\n\n\n\n<p>People continued to move south. Some recovered bodies of strangers along the way. &ldquo;I found these young men inside the car. The car was destroyed,&rdquo; said Moemen Abu Erban, one man on the move. The bodies had been placed on a horse cart and covered with blankets. &ldquo;Frankly, it is a difficult thing. There is complete destruction.&#8221;</p>\n\n\n\n<p>Elsewhere, the Israeli military said its aircraft struck what it described as a hideout for militants in the urban refugee camp of Balata in the occupied West Bank. The Palestinian Red Crescent ambulance service said five Palestinians were killed.</p>\n\n\n\n<p>The deaths raised to 212 the number of Palestinians killed in West Bank violence since the war began, making it the deadliest period in the territory since the second Palestinian uprising in the early 2000s.</p>\n"},"wfw:commentRss":"https://api.time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6337235"}},{"title":"U.N. Stops Delivery of Food and Supplies to Gaza as Communications Blackout Hinders Aid","link":"https://time.com/6337026/gaza-aid-halted-united-nations/","comments":"https://time.com/6337026/gaza-aid-halted-united-nations/#respond","dc:creator":{"#cdata-section":"WAFAA SHURAFA, JACK JEFFERY and LEE KEATH / AP"},"pubDate":"Fri, 17 Nov 2023 20:28:31 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"Gaza and the West Bank"},{"#cdata-section":"News Desk"},{"#cdata-section":"wire"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6337026"},"description":{"#cdata-section":"The communications blackout largely cuts off Gaza’s 2.3 million people from one another and the outside world."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337026\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6337026/gaza-aid-halted-united-nations/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/AP23321558433438.jpg\" alt=\"APTOPIX Israel Palestinians\"/>\n\n\n\n<p>DEIR AL-BALAH, Gaza Strip &mdash; The United Nations was forced to stop deliveries of food and other necessities to Gaza on Friday and warned of the growing possibility of widespread starvation after internet and telephone services collapsed in <a href=\"https://apnews.com/hub/israel-hamas-war\"  target=\"_blank\">the besieged enclave</a> because of a lack of fuel.</p>\n\n\n\n<p>Israel announced that it will allow two tanker trucks of fuel daily into Gaza for the U.N. and communications systems. The amount is half of what the U.N. said it needs to conduct lifesaving functions for hundreds of thousands of people in Gaza, including fueling water systems, hospitals, bakeries and its trucks delivering aid.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Israel has barred entry of fuel since the start of the war, saying it would be diverted by Hamas for military means. It has also blocked food, water and other supplies except for a trickle of aid from Egypt that aid workers say falls far short of what&rsquo;s needed.</p>\n\n\n\n<p>The&nbsp;<a href=\"https://apnews.com/article/israel-hamas-war-news-11-16-2023-6c7daa3b8c3a6b8dddf186ce631dfaad\"  target=\"_blank\">communications blackout</a>, now in its second day, largely cuts off Gaza&rsquo;s 2.3 million people from one another and the outside world.</p>\n\n\n\n<p>The U.N. agency for Palestinian refugees, known as UNRWA, couldn&#8217;t bring in its aid convoy Friday because of the communications cut-off and won&#8217;t be able to as long it continues, said spokesperson Juliette Touma.</p>\n\n\n\n<p>&ldquo;An extended blackout means an extended suspension of our humanitarian operations in the Gaza Strip,&rdquo; Touma told The Associated Press.</p>\n\n\n\n<p>Israeli forces have signaled they could expand their offensive toward Gaza&rsquo;s south even while continuing operations in the north. Troops have been searching the territory&rsquo;s biggest hospital, Shifa, for traces of a Hamas command center Israel alleges was located under the building &mdash; a claim Hamas and the hospital staff deny.</p>\n\n\n\n<p>On Friday, the military said it found the body of another hostage, Cpl. Noa Marciano, in a building adjacent to Shifa, like that of another hostage found Thursday, Yehudit Weiss. Hundreds of mourners, many carrying Israeli flags, attended Marciano&rsquo;s funeral Friday in her home town of Modi&rsquo;in.</p>\n\n\n\n<p>The war, now in its sixth week, was triggered by&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-attack-military-war-a8f63b07641212f0de61861844e5e71e\"  target=\"_blank\">Hamas&rsquo; Oct. 7 attack in southern Israel</a>, in which the militants killed more than 1,200 people, mostly civilians, and&nbsp;<a href=\"https://apnews.com/article/israel-hamas-war-hostages-gaza-ca1466cc052b08a642fff88280eb0b22\"  target=\"_blank\">abducted some 240 men, women and children</a>.</p>\n\n\n\n<p>More than 11,400 Palestinians have been killed in the war, two-thirds of them women and minors, according to Palestinian health authorities. Another 2,700 have been reported missing, <a href=\"https://apnews.com/article/israel-palestinians-gaza-buried-rubble-airstrikes-89c0e8d0934d573d94d2fbfeba44d933\"  target=\"_blank\">believed buried under rubble</a>. The count <a href=\"https://apnews.com/article/israel-hamas-war-gaza-health-ministry-health-death-toll-59470820308b31f1faf73c703400b033\"  target=\"_blank\">does not differentiate</a> between civilians and militants, and Israel says it has killed thousands of militants.</p>\n\n\n\n<h2>Aid dries up</h2>\n\n\n\n<p>After an American request, Israel agreed to let a &ldquo;very minimal&rdquo; amount of fuel into Gaza each day, national security adviser Tzachi Hanegbi said. COGAT, the Israeli military body responsible for Palestinian affairs, said it would amount to 60,000 liters (15,850 gallons) a day for the U.N.</p>\n\n\n\n<p>For the communications network, Israel also agreed on another 10,000 liters a day (2,640 gallons), a U.S. State Department official said .</p>\n\n\n\n<p>UNRWA and other humanitarian groups need at least 120,000 liters (31,700 gallons) a day to run lifesaving functions, Touma said. It was not immediately known if the fuel for communications would be enough to revive the network.</p>\n\n\n\n<p>Gaza has received only 10% of its required food supplies each day in shipments from Egypt, according to the U.N., and the water system shutdown has left most of the population drinking contaminated water, causing an outbreak of disease.</p>\n\n\n\n<p>Dehydration and malnutrition are growing, with nearly all residents in need of food, said Abeer Etefa, a Mideast regional spokeswoman for the U.N.&rsquo;s World Food Program.</p>\n\n\n\n<p>&ldquo;People are facing the immediate possibility of starvation,&rdquo; she said Thursday from Cairo.</p>\n\n\n\n<h2>March for hostages </h2>\n\n\n\n<p>Israeli officials previously vowed fuel would not be let in until Gaza militants release the hostages. The government has been under heavy public pressure in Israel to show it is doing all it can to bring back the men, women and children abducted in Hamas&rsquo; attack.</p>\n\n\n\n<p>Thousands of marchers &mdash; including families of over 50 hostages &mdash; embarked Friday on the fourth leg of a five-day walk from Tel Aviv to Jerusalem, chanting, &ldquo;Bring them home!&rdquo; They are marching to Prime Minister Benjamin Netanyahu&rsquo;s office, calling on his War Cabinet to do more to rescue their loved ones. They have urged the cabinet to consider a cease-fire or prisoner swap in return for the hostages.</p>\n\n\n\n<p>Hamas has offered to exchange all hostages for some 6,000 Palestinians in Israeli jails, which the cabinet has rejected.</p>\n\n\n\n<h2>Conditions at Shifa </h2>\n\n\n\n<p>With Israeli troops fanned out around the Shifa hospital complex, doctors spoke of horrifying conditions inside. Electricity has been out nearly a week, leaving incubators for infants and ventilators for ICU patients defunct. Nearly 7,000 people are trapped there with little food, including patients, staff and civilian families.</p>\n\n\n\n<p>Hospital director, Mohammed Abu Selmia, told Al-Jazeera television that 52 patients have died since fuel ran out &mdash; up from 40 reported before Israeli troops stormed in on Wednesday. He said staff were amputating limbs of some injured to avoid infection spreading because of shortages in medicines.</p>\n\n\n\n<p>More were on the verge of death as their wounds are &ldquo;open with maggots coming out of them,&rdquo; another doctor, Faisal Siyam, told Al-Jazeera.</p>\n\n\n\n<p>Dr. Ahmad Mukhalalti, said most of the 36 premature infants suffer from severe diarrhea because there is no clean water. He said Israeli troops had taken away all the bodies from the morgue and from a mass grave that staff dug days earlier in the courtyard. The Israeli military had no comment on the report. The doctors&#8217; accounts could not be independently verified.</p>\n\n\n\n<p>Abu Selmia said Israeli troops should either bring them fuel to power equipment or allow an evacuation.</p>\n\n\n\n<p>&ldquo;The hospital has become a giant prison,&rdquo; he said. &ldquo;We are surrounded by death.&rdquo;</p>\n\n\n\n<p>Israel&rsquo;s military said it delivered 4,000 liters of water and 1,500 ready-made meals to Shifa, but staff said it was too little for the numbers there.</p>\n\n\n\n<p>Israeli military spokesman Col. Richard Hecht acknowledged that the troops&#8217; search for traces of Hamas was going slowly. &ldquo;It&rsquo;s going to take time,&rdquo; he said.</p>\n\n\n\n<p>Israel faces&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-war-shifa-hospital-ce8fda9821a011a6cb6e4a3df5c90916\"  target=\"_blank\">pressure to prove its claim</a>&nbsp;that Hamas set up its main command center in and under the hospital. So far, Israel has shown photos and video of weapons caches that it says were found inside as well as what it said was a tunnel entrance. The AP could not independently verify the Israeli claims.</p>\n\n\n\n<p>The allegations are part of Israel&rsquo;s broader accusation that Hamas uses Palestinians as human shields across the Gaza Strip, contending that is the reason for the large numbers of civilian casualties during weeks of bombardment.</p>\n\n\n\n<h2>Strikes in the south</h2>\n\n\n\n<p>Airstrikes continued to hammer the southern sector of Gaza, where most of the territory&rsquo;s population is now sheltering. Among them are hundreds of thousands of people who heeded Israel&rsquo;s calls to evacuate Gaza City and the north to get out of the way of its ground offensive.</p>\n\n\n\n<p>In the Nusseirat refugee camp, a strike crushed a building to rubble killing at least 41 people, staff at the nearby hospital said. Residents said dozens more were buried in the wreckage.</p>\n\n\n\n<p>Early morning strikes outside the city of Khan Younis killed 11 members of a family who had evacuated from Gaza City. Dozens of wounded, including babies and young children, streamed into the nearby hospital.</p>\n\n\n\n<p>At the morgue, Alaa Abu Hasira wept over the bodies from the strike, lined side-by-side on the floor, including her son, daughter and several sisters. &ldquo;All my loved ones are gone. All my loved ones are gone,&rdquo; she sobbed.</p>\n\n\n\n<p>So far, Israel&rsquo;s ground assault has focused on northern Gaza as it vows to remove Hamas from power and crush its military capabilities. If the assault moves into the south, it is not clear where Palestinians can go. Egypt has&nbsp;<a href=\"https://apnews.com/article/palestinian-jordan-egypt-israel-refugee-502c06d004767d4b64848d878b66bd3d\"  target=\"_blank\">refused to allow a mass transfer</a>&nbsp;onto its soil.</p>\n\n\n\n<p>As the war continues to inflame tensions elsewhere, Israeli troops clashed with Palestinian gunmen in Jenin in the occupied West Bank, killing at least three Palestinians. The fighting broke out late Thursday during an Israeli raid.</p>\n\n\n\n<p>Israel&rsquo;s military said five militants were killed. The Palestinian Health Ministry said three people died. The militant Islamic Jihad group claimed the three dead as members and identified one as a local commander.</p>\n\n\n\n<p></p>\n"},"wfw:commentRss":"https://api.time.com/6337026/gaza-aid-halted-united-nations/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6337026"}},{"title":"Argentina Faces a Bleak Election","link":"https://time.com/6336721/argentina-milei-massa-election/","comments":"https://time.com/6336721/argentina-milei-massa-election/#respond","dc:creator":{"#cdata-section":"Christopher Sabatini"},"pubDate":"Fri, 17 Nov 2023 16:33:52 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"world affairs"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6336721"},"description":{"#cdata-section":"Voters must choose between the firebrand libertarian Javier Milei and the Peronist establishment candidate Sergio Massa. "},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6336721\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6336721/argentina-milei-massa-election/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1701035946.jpg\" alt=\"Javier Milei Presidential Rally In Buenos Aires\"/>\n\n\n\n<p>Argentines head to the polls this Sunday, Nov. 19 for the second round of the most divisive <a href=\"https://time.com/6326834/javier-milei-argentina-presidential-race-candidate-bio/\" >presidential election</a> in decades. The choice couldn&rsquo;t be more stark&mdash;between an establishment Minister of Economy who has presided over an inflation rate that stands at a <a href=\"https://www.reuters.com/business/retail-consumer/cant-buy-new-jeans-argentinas-100-inflation-draws-crowds-used-clothes-markets-2023-11-13/\"  target=\"_blank\">staggering 140%</a> and a firebrand libertarian that is making international markets jittery.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>The establishment candidate, Sergio Massa, is part of the Peronist government of President Alberto Fern&aacute;ndez. Javier Milei, a relative political outsider and self-described anarcho-capitalist, is the upstart promising to <a href=\"https://edition.cnn.com/2023/10/23/business/javier-milei-argentina-dollerization-explainer/index.html\"  target=\"_blank\">abolish Argentina&rsquo;s peso</a> and central bank as part of a campaign to radically reduce the Argentine state and its role in the economy. </p>\n\n\n\n<p>Polls suggest a surprisingly <a href=\"https://www.as-coa.org/articles/poll-tracker-argentinas-2023-presidential-election\"  target=\"_blank\">tight race</a>. If you&rsquo;re asking how an incumbent economy minister in a country that is in an economic tailspin stands a good chance of becoming President on Sunday, you have not grasped the extent to which <a href=\"https://content.time.com/time/subscriber/article/0,33009,925510,00.html\" >Peronists</a> have dominated Argentina&rsquo;s politics for the past seven decades and the outrageousness of his competitor, Milei.  </p>\n\n\n\n<p>The Peronists that Massa represents is no average party and was formed by Juan Per&oacute;n in the 1940s by fusing right-wing elements of the military with a unified labor movement. That personalist, top-down movement has since evolved into the heterogenous political machine of labor unions, crony capitalists, neoliberal reformers, traditional leftists, and a vast network of neighborhood political bosses. This ideological flexibility&mdash;critics would say cynicism&mdash;and party machinery has been key to Peronism&rsquo;s electoral successes. </p>\n\n\n\n<p>Massa has remained a pragmatist who has served in several past Peronist governments of different ideological leanings, especially the leftist-populist governments of <a href=\"https://content.time.com/time/specials/packages/article/0,28804,2036683_2036477_2036992,00.html\" >N&eacute;stor Kirchner</a> (2003-2007) and his wife <a href=\"https://content.time.com/time/world/article/0,8599,1666879,00.html\" >Cristina Fern&aacute;ndez de Kirchner</a> (2007-2015). A recent and massive tax reduction for the working classes and a <a href=\"https://www.ft.com/content/70c7ec92-3bb4-4007-aa99-f3b312985813\"  target=\"_blank\">cash give-away</a> program for pensioners ahead of the Oct. 19 first-round presidential election have helped Massa&rsquo;s chances. But it is his image as the status quo candidate&mdash;despite the government&rsquo;s track record&mdash;that has helped him most among non-Peronist voters. </p>\n\n\n\n<p>Milei, a TV personality who made his reputation trashing Argentina&rsquo;s political class and state-centric economic model, has captured popular anger over the country&rsquo;s chronic boom-bust economy. Argentines love to remind outsiders that at the turn of the 20th century, their country was richer than Italy and Spain, and on par with the U.S., Australia, and Canada. This historical slide, particularly in the past 20 years, stings for many Argentines.&nbsp;</p>\n\n\n\n<p>So, when Milei rails against the establishment it resonates with voters. This is particularly true for Argentina&rsquo;s under 30s, many of whom have known little but a peso in free fall and dimming job prospects. It&rsquo;s no surprise then that <a href=\"https://www.reuters.com/world/americas/argentinas-young-electorate-faces-one-in-a-generation-vote-2023-10-17/\"  target=\"_blank\">younger voters</a> form a strong core of support for the moppy-haired outsider who used to be part of a Rolling Stones tribute band. </p>\n\n\n\n<p>Given Argentina&rsquo;s chronic inflationary troubles, stemming from political leaders&rsquo; inability to curtail profligate public spending by printing more money, some of Milei&rsquo;s radical ideas make sense on the surface. Dollarization would eliminate the government&rsquo;s currency printing presses and tie macroeconomic policy to a more stable U.S. monetary policy. But the Argentine central bank lacks sufficient U.S. dollar reserves to make it a national currency. It may be tempting to take monetary policy out of the hands of Argentina&rsquo;s infamously spendthrift politicians and place it in the hands of the U.S. Treasury and Federal Reserve. Yet that would limit the scope and agency of a diverse, <a href=\"https://data.worldbank.org/indicator/NY.GDP.MKTP.CD?locations=AR\"  target=\"_blank\">$630 billion</a> economy to set its own policies domestically and internationally. A simpler and much-less disruptive approach would be to once and for all ensure the independence of Argentina&rsquo;s central bank from political influence. </p>\n\n\n\n<p>Milei&rsquo;s pledge to cut public spending by <a href=\"https://www.economist.com/the-americas/2023/09/07/meet-javier-milei-the-frontrunner-to-be-argentinas-next-president\"  target=\"_blank\">15% of GDP</a> is, however, more sensible. But it would be painful to millions of Argentines who depend on subsidies on energy&mdash;which this year will total <a href=\"https://www.reuters.com/business/energy/argentinas-presidential-candidates-face-12-bln-energy-subsidy-conundrum-2023-11-15/\"  target=\"_blank\">$8 billion alone</a>&mdash;and on public transport. Slashing the state budget will directly reduce the standard of living for a large segment of Argentina&rsquo;s population. </p>\n\n\n\n<p>Milei&rsquo;s radical agenda would of course face major obstacles considering that his Libertarian Party only occupies a handful of seats in the country&rsquo;s Congress. But there are also concerns that a President Milei would test the fragile checks and balances of Argentina&rsquo;s democracy given the lack of tolerance he has expressed toward opponents and the political system generally. The <a href=\"https://apnews.com/article/milei-argentina-chainsaw-fed35a37c6137b951e4adada3d866436\"  target=\"_blank\">chainsaw he famously waves</a> around at rallies to symbolize his slashing of the state is a not-so-subtle indication of his political temperament.  </p>\n\n\n\n<p>That&rsquo;s not to say a Massa win will comfort voters. For one, it remains unclear what Massa will do beyond what he has already tried. The inflation rate has gone from <a href=\"https://www.economist.com/the-americas/2023/10/23/argentinas-presidential-election-delivers-a-surprise-result\"  target=\"_blank\">79% when he became economy minister</a> in August 2022 to 140% today. He would also still need to contend with a diverse party that includes Cristina Fern&aacute;ndez de Kirchner and her allies as well as the party&rsquo;s labor wing that will contest many of the necessary efforts to reduce expenditures and tackle market distortions. Nevertheless, both Massa and the Peronist movement have shown a historical capacity to adapt and negotiate. It&rsquo;s not a sense one gets from Milei.</p>\n\n\n\n<p>Whoever wins this Sunday will inherit a complex economic crisis in which there are no easy answers. Argentina&rsquo;s historic economic fragility is bound up in decades of inefficient&mdash;even corrupt&mdash;public policy and the lack of checks and balances on fiscal and monetary policy. But a majority of Argentines have come to depend on unsustainable state largesse that fuels market inefficiencies, public debt, and inflation. </p>\n\n\n\n<p>The best that can be hoped for is a broad centrist coalition to brace the country for the difficult choices it needs to make. While Massa has detractors, a Peronist insider like him may be best positioned to fashion that support. This is one consideration that millions of voters will weigh up as Argentina braces for one of its most consequential elections yet. But the most important one is broad frustration&mdash;even anger&mdash;over the dire state of affairs. </p>\n"},"wfw:commentRss":"https://api.time.com/6336721/argentina-milei-massa-election/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6336721"}},{"title":"Jewish American Calls for a Ceasefire Highlight Divisions in the Community","link":"https://time.com/6335528/jewish-american-ceasefire-progressive-jews/","comments":"https://time.com/6335528/jewish-american-ceasefire-progressive-jews/#respond","dc:creator":{"#cdata-section":"Sanya Mansoor"},"pubDate":"Fri, 17 Nov 2023 16:22:56 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"Israel-Hamas War"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6335528"},"description":{"#cdata-section":"Progressive Jews are shutting down U.S. train stations, highways and buildings—and highlighting community divisions."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6335528\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6335528/jewish-american-ceasefire-progressive-jews/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1743282377.jpg\" alt=\"Protesters Hold A Rally Outside The U.S. Capitol Building Calling For A Ceasefire In Mideast War\"/>\n\n\n\n<p>Progressive Jews calling for a ceasefire in the Israel-Hamas war are shutting down U.S. train stations, highways, and government buildings. Their rallying cries: &ldquo;Not in our name,&rdquo; &ldquo;never again for anyone&rdquo; and &ldquo;ceasefire now.&rdquo; </p>\n\n\n\n<p>So far, thousands of Jewish American protesters have participated in more than a dozen civil disobedience actions since Oct. 7, at places ranging from an office building near <a href=\"https://www.washingtonpost.com/dc-md-va/2023/10/18/dc-protest-israel-gaza-ceasefire-jewish/\"  target=\"_blank\">Capitol Hill in Washington</a>, D.C.; <a href=\"https://www.nytimes.com/2023/10/27/world/middleeast/grand-central-protest-nyc-israel-hamas-gaza.html\"  target=\"_blank\">Grand Central Station</a> and the <a href=\"https://nymag.com/intelligencer/2023/11/statue-of-liberty-protest-calls-for-israel-ceasefire-in-gaza.html\"  target=\"_blank\">Statue of Liberty</a> in New York City; and <a href=\"https://6abc.com/philadelphia-protest-30th-street-station-gaza-ceasefire-israel-hamas/14004336/\"  target=\"_blank\">Philadelphia&rsquo;s 30th Street Station</a>, to the<a href=\"https://apnews.com/article/israelhamas-war-gaza-protest-jewish-359e92cfde9444c1a59b0635543853a6\"  target=\"_blank\"> Israeli consulate in Chicago</a>, a <a href=\"https://apnews.com/article/israel-hamas-war-oakland-california-protest-8779b45f8da272f9acd715bba6c19c93\"  target=\"_blank\">federal building in Oakland, Calif</a>., a <a href=\"https://www.wcvb.com/article/jewish-organization-calling-for-cease-fire-in-israel-blocks-traffic-on-boston-university-bridge/45859537\"  target=\"_blank\">bridge in Boston</a>, and a<a href=\"https://spectrumlocalnews.com/nc/charlotte/news/2023/11/03/-demand-ceasefire---protestors-stage-sit-in-on-durham-freeway\"  target=\"_blank\"> highway in Durham, N.C</a>. </p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Their calls for a ceasefire align with <a href=\"https://www.dataforprogress.org/blog/2023/10/19/voters-agree-the-us-should-call-for-a-ceasefire-and-de-escalation-of-violence-in-gaza\"  target=\"_blank\">66% of U.S. voters</a>, who say they &#8220;strongly agree&#8221; or &#8220;somewhat agree&#8221; with the idea, according to a poll conducted between Oct. 18-19 from <a href=\"https://www.filesforprogress.org/datasets/2023/10/dfp_ceasefire_house_speaker_tabs.pdf\"  target=\"_blank\">Data for Progress</a>, a progressive think tank and polling firm.</p>\n\n\n\n<p>The relationship between America&#8217;s Jewish population and Israel has long been complicated. While almost half say caring about Israel is &#8220;essential&#8221; to what being Jewish means, 16% say it is &#8220;not important&#8221; to their Jewish identity, <a href=\"https://www.pewresearch.org/short-reads/2021/05/21/u-s-jews-have-widely-differing-views-on-israel/\"  target=\"_blank\">according to a 2021 Pew survey</a>, and the rest fall somewhere in-between, considering it &#8220;important, but not essential.&#8221; </p>\n\n\n\n<p>Other polling supports the finding that the population&#8217;s views on Israel <a href=\"https://jewishcurrents.org/recent-polls-of-us-jews-reflect-polarized-community\"  target=\"_blank\">differ widely</a>. A <a href=\"https://www.jewishfederations.org/fedworld/poll-70-of-jews-feel-less-safe-since-the-war-451833\"  target=\"_blank\">Jewish Federations of North America survey</a> released on Nov. 9 indicated widespread support for military aid to Israel; 87% of Jewish Americans were in favor. But other polls reflect intense criticism of the Israeli government. A <a href=\"https://www.jta.org/2021/07/13/politics/sizeable-minorities-of-us-jewish-voters-believe-israel-is-guilty-of-genocide-apartheid\"  target=\"_blank\">2021 Jewish Electorate Institute poll</a> found that one-quarter of Jewish American voters agreed with the statement that &#8220;Israel is an apartheid state.&#8221; Groups like Jewish Voice for Peace, which have spearheaded many recent civil disobedience actions in the U.S., are not new. But in the last several weeks, the conflict in the Middle East has put divisions within the American Jewish community into stark relief.</p>\n\n\n\n<p>In the time since the Oct. 7 Hamas attack that killed more than 1,200 Israelis and took more than 200 hostages, Israel&rsquo;s assault on Gaza has killed more than 11,000 Palestinians, <a href=\"https://time.com/6328885/gaza-death-toll-explainer/\" >per the city&rsquo;s health ministry</a>. More than two-thirds of the region&rsquo;s hospitals have closed because of damage from airstrikes or are running out of fuel, according to Gaza&#8217;s health ministry. The commissioner-general of the United Nations Relief and Works Agency for Palestine Refugees in the Near East, Philippe Lazzarini, said that by the end of Wednesday Nov. 15, more than two-thirds of Gaza&rsquo;s population would not have access to clean water. &ldquo;Our entire operation is now on the verge of collapse,&rdquo; he says. </p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1767723746.jpg?w=560\" alt=\"Jewish Voice of Peace Activists Occupy The Statue Of Liberty Calling For Ceasefire In Gaza\"/>\n\n\n\n<p>More than 2 million people live in Gaza, half of whom are children, and face the spread of disease and malnutrition as Israel continues its blockade. In recent years, international <a href=\"https://www.hrw.org/report/2021/04/27/threshold-crossed/israeli-authorities-and-crimes-apartheid-and-persecution\"  target=\"_blank\">human rights groups</a> have referred to <a href=\"https://www.amnesty.org/en/latest/campaigns/2022/02/israels-system-of-apartheid/\"  target=\"_blank\">Israel&rsquo;s treatment of Palestinians</a> over the decades as <a href=\"https://www.btselem.org/topic/apartheid\"  target=\"_blank\">apartheid</a> and consider Gaza to be an <a href=\"https://www.npr.org/2023/11/04/1210645265/gaza-is-called-an-open-air-prison-how-did-it-get-to-this\"  target=\"_blank\">open-air prison</a>. Many pro-Palestinian protesters argue the high civilian death toll is a sign of a disproportionate response towards an occupied territory. (While Israel formally pulled out of the Gaza strip in 2005, the U.N. considers the strip to be under occupation because of Israel&#8217;s control of land, air, and sea access.) </p>\n\n\n\n<p>After Jewish protesters occupied the rotunda of the U.S. Capitol, the <a href=\"https://twitter.com/JGreenblattADL/status/1714791774869487973?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1714791774869487973%7Ctwgr%5Ea2f71147883db9649f1dccb3af3ea818bb31eec4%7Ctwcon%5Es1_c10&amp;ref_url=https%3A%2F%2Ftheintercept.com%2F2023%2F11%2F11%2Fpalestine-israel-protests-ceasefire-antisemitic%2F\"  target=\"_blank\">Anti-Defamation League&#8217;s CEO Jonathan Greenblatt spoke out on X,</a> taking issue with challenges to Israel&#8217;s right to defend itself after Hamas&#8217; surprise attack; the U.S. government and Israel consider Hamas a terrorist group. The protesters, Greenblatt wrote, were &#8220;radical far-left groups [that] don&#8217;t represent the Jewish community&#8221; and instead represent the &#8220;ugly core&#8221; of anti-Zionism: antisemitism. </p>\n\n\n\n<p><strong>Read more:<em> </em></strong><em><a href=\"https://time.com/6333456/jewish-students-college-antisemitism-essay/\" >Column: It&#8217;s Not Easy to Be Jewish on American Campuses Today</a></em></p>\n\n\n\n<p>The ADL has condemned Jewish Voice for Peace&#8217;s leaders for arguing that Israel was the <a href=\"https://www.jewishvoiceforpeace.org/2023/10/11/jvp-in-the-news-2/\"  target=\"_blank\">&#8220;root cause&#8221;</a> of the violence on Oct. 7 and said in a statement that their &#8220;<a href=\"https://www.adl.org/resources/blog/jewish-voice-peace-jvp-what-you-need-know\"  target=\"_blank\">most inflammatory ideas</a> can help give rise to antisemitism.&#8221; Jewish Voice For Peace accuses the ADL of fueling Islamophobia, <a href=\"https://www.cair.com/wp-content/uploads/2022/05/SJPJVPCAIR.pdf\"  target=\"_blank\">securing impunity for the Israeli government</a>, and conflating anti-Zionism with antisemitism. Many pro-Palestinian supporters, including some Jewish Americans, describe themselves as anti-Zionist. </p>\n\n\n\n<p>&ldquo;It&rsquo;s totally reprehensible to conflate those speaking out for Palestinian rights with the very real existence of antisemitism,&rdquo; says Morgan Bassichis, a Jewish artist who organized a group of artists and writers to get arrested at the Grand Central protest and a member of Jewish Voice for Peace. &ldquo;Essential to my Judaism is a deep belief that Palestinians should be free,&rdquo; they say. </p>\n\n\n\n<p>At a Nov. 1 fundraiser in Minneapolis, U.S. President Joe Biden&mdash;who is pushing to supply Israel with an additional $14 billion in military aid<strong>&mdash;</strong>was confronted by a protesting rabbi. &ldquo;Mr. President, you care about Jewish people. As a rabbi, I need you to call for a cease-fire right now,&rdquo; said Rabbi Jessica Rosenberg. She later wrote in a <a href=\"https://www.cnn.com/2023/11/13/opinions/israel-gaza-ceasefire-palestinian-biden-rabbi-rosenberg/index.html#:~:text=%E2%80%9CDo%20you%20want%20to%20hear,such%20breaks%20in%20its%20bombardments.\"  target=\"_blank\">CNN op-ed </a>that Israel&rsquo;s pause for a few hours each day to allow Gazans to flee to the South has done little to help. On Monday, Palestinian Representative Rashida Tlaib, along with fellow Democratic Representatives Alexandria Ocasio-Cortez and Ilhan Omar, joined some rabbis in calling for a ceasefire outside the U.S. Capitol. </p>\n\n\n\n<p>Many<strong> </strong>within Israel, <a href=\"https://twitter.com/OrenZiv_/status/1721980034003480965\"  target=\"_blank\">including some family members of hostages</a>, have also protested their own country&#8217;s response to the Hamas attack. For example,<strong> </strong>Maoz Inon, whose parents were kidnapped by Hamas, <a href=\"https://www.timesofisrael.com/at-knesset-protest-two-mourners-blame-netanyahu-for-oct-7-urge-end-to-the-war/\"  target=\"_blank\">started a protest</a> outside the Israeli parliament building and called on Prime Minister Netanyahu to resign and end the war.</p>\n\n\n\n<p>Rosalind Petchesky, a Jewish feminist scholar, was the oldest person arrested at the Oct. 27 Grand Central protest in New York City. Hundreds packed the train station; police arrested about 400 people. She organized a group of more than 30 Jewish seniors to join. &ldquo;I&rsquo;m 81 years old. I&rsquo;m now older than the state of Israel,&rdquo; she says. &ldquo;I&#8217;ve been doing this work for a long time, but I&#8217;ve never seen a moment like this one and I&rsquo;m horrified at&hellip;the hideous war mongering of our government and the Israeli government&hellip;and what we consider to be an out-and-out genocide against the Palestinian people in Gaza.&rdquo; </p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-893171398.jpg?w=560\" alt=\"Protestors In Chicago Rally Against Trump's Jerusalem Decision\"/>\n\n\n\n<p>For Petchesky, getting arrested isn&rsquo;t an act of courage, but of commitment. &ldquo;I&#8217;m retired. I don&#8217;t have to show up at a job tomorrow,&rdquo; she says. &ldquo;People like me who are in a situation of privilege have a responsibility to put our bodies on the line. I don&#8217;t think there&#8217;s any great nobility in being arrested, but it is a kind of symbolic act that says &#8216;I stand for these values.&#8217;&rdquo;</p>\n\n\n\n<p>Petchesky has friends in Israel and Gaza. She says she worries that a Palestinian journalist she knows and his family won&#8217;t survive; she has also had tough conversations with a former graduate student of hers, an Israeli Jew who is critical of Israel&#8217;s government but upset about Jewish Voice For Peace&#8217;s lack of slogans centered on hostages. &ldquo;She said &lsquo;what about us? Aren&rsquo;t we people, too?&rsquo;&rdquo; Petchesky says. &ldquo;I have been trying to answer her as honestly as I can, and trying to convince her that saying &#8216;stop the bombing, ceasefire now,&#8217; is an expression of support for the hostages because otherwise I&#8217;m convinced they&#8217;re going to die.&rdquo;</p>\n\n\n\n<p>New York Assembly Member Zohran Mamdani, a Muslim and vocal supporter of Palestinian rights, was arrested alongside Petchesky. Mamdani argues that recent civil disobedience shows that many Jewish Americans don&#8217;t believe their participation in such protests is in conflict with their Judaism. &ldquo;When anyone tries to sell you a monolith, they are selling you fiction,&rdquo; he says. &ldquo;There is no one group of people that believe one thing.&rdquo;</p>\n\n\n\n<p>Irena Klepfisz, an 82-year-old Holocaust survivor and poet who was born in the Warsaw Ghetto, wanted to be at the New York protests but couldn&rsquo;t because she is immunocompromised. &ldquo;I&rsquo;m very moved by it,&rdquo; she says, about the two civil disobedience acts. &ldquo;I don&#8217;t know how killing more Palestinians in Gaza is going to do anything.&#8221;</p>\n\n\n\n<p>Kelpfiz formed the Jewish Women&rsquo;s Committee to End the Occupation more than three decades ago. &ldquo;The war marked me,&rdquo; she says. &ldquo;I didn&rsquo;t have a father, I didn&rsquo;t have grandparents, I didn&rsquo;t have family&hellip;I grew up with that. I know what that can do to people. That&rsquo;s what&rsquo;s happened to children of those killed in Hamas&rsquo; attack and Israel&rsquo;s airstrikes.&rdquo;</p>\n\n\n\n<p>For Bassichis, the artist, Grand Central&rsquo;s protest &ldquo;felt like a glimmer of hope, in a time of such profound despair.&rdquo;</p>\n"},"wfw:commentRss":"https://api.time.com/6335528/jewish-american-ceasefire-progressive-jews/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6335528"}},{"title":"Philippines Hit By Earthquake of 6.8 Magnitude. Here’s What to Know","link":"https://time.com/6336648/philippines-earthquake-aftershocks-tsunami-threat/","comments":"https://time.com/6336648/philippines-earthquake-aftershocks-tsunami-threat/#respond","dc:creator":{"#cdata-section":"Mallory Moench"},"pubDate":"Fri, 17 Nov 2023 11:35:51 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"News Desk"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6336648"},"description":{"#cdata-section":"The Office of Civil Defense told TIME in an email that “information on the number of casualties is all subject to validation.”"},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6336648\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6336648/philippines-earthquake-aftershocks-tsunami-threat/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1252314848.jpg\" alt=\"Philippines&mdash;Mindanao\"/>\n\n\n\n<p>A powerful 6.8 magnitude undersea earthquake rocked the Philippines on Friday, Nov. 17, officials said. The quake occurred in the southern Mindanao region at 4:14 p.m. local time. Although<a href=\"https://news.sky.com/story/philippines-hit-by-6-9-magnitude-earthquake-13010090\"  target=\"_blank\"> initially logged as having a magnitude of 7.2</a>, the Philippine Institute of Volcanology and Seismology (<a href=\"https://www.phivolcs.dost.gov.ph/index.php/about-us/about-phivolcs\"  target=\"_blank\">PHIVOLCS</a>) later downgraded the earthquake to 6.8,<a href=\"https://twitter.com/PTVph/status/1725457344862282115?s=20\"  target=\"_blank\"> local news reported</a>. There is currently<a href=\"https://tsunami.phivolcs.dost.gov.ph/Tsunami_Information/2023_Tsunami_Information/Nov/17/20231117_0814z_Advisory0_1.html\"  target=\"_blank\"> no tsunami warning in effect</a>.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>When news of the earthquake first broke on Friday, it was logged that no injuries or casualties had been noted, yet reports of both have since emerged. At present, the official death toll remains unknown. The <a href=\"https://www.ocd.gov.ph/\"  target=\"_blank\">Office of Civil Defense</a> told TIME in an email on Saturday that &ldquo;information on the number of casualties is all subject to validation.&rdquo;</p>\n\n\n\n<p>The<a href=\"https://ndrrmc.gov.ph/\"  target=\"_blank\"> National Disaster Risk Reduction and Management Council</a> (NDRMMC) told TIME in a separate email that it had tallied a total of seven deaths so far, but is still verifying reports of the casualties spanning three municipalities. The working group is currently investigating three reported deaths in General Santos City, South Cotabato, two in Glan, Sarangani, one in Jose Abad Santos, Davao Occidental, and another in Malapatan, Sarangani. TIME reached out to the relevant government authorities for further details.</p>\n\n\n\n<p>Local police told TIME that three people have died in General Santos City.</p>\n\n\n\n<p>Corporal Christopher Lara&ntilde;o, of <a href=\"https://www.facebook.com/p/Police-Station-4-General-Santos-City-Police-Office-PRO-12-100068943408591/?paipv=0&amp;eav=AfZWxfOdGteLqL5Fnux2AAAILSU6wbd7HaDbuk3oTDFxG26pneGSgWrhoXq3j2xwgDA&amp;_rdr\"  target=\"_blank\">General Santos City Police Station 4</a>, told TIME in a phone call at around 1 a.m. Saturday local time that his police station now &#8220;had two victims of the earthquake.&rdquo; He said a married couple&mdash;believed to be an 18-year-old female and a 26-year-old male&mdash;died when a wall fell on them.&nbsp;</p>\n\n\n\n<p>Speaking <a href=\"https://www.facebook.com/PulisEstasyonSays/\"  target=\"_blank\">from Police Station 6,</a> Corporal Peter Paul Malangan told TIME that one person had been found dead in a mall in General Santos City at around 12:30 a.m. on Saturday, local time. Others were injured, Malangan said, but he could not provide an exact number during the phone call.</p>\n\n\n\n<p>Meanwhile, Sarangani&#8217;s government confirmed in a message, delivered via Facebook, to TIME that two people had died in the province&mdash;one in Malapatan and another in Glan. No further information on the casualties was given.</p>\n\n\n\n<p>Amid the fallout from the 6.8 magnitude earthquake, Glan police were <a href=\"https://www.theguardian.com/world/2023/nov/18/philippines-earthquake-authorities-report-deaths-from-falling-debris\"  target=\"_blank\">reportedly dispatched</a> to check on a landslide in a nearby village on Saturday. Sarangani&rsquo;s governor, Rogelio &ldquo;Ruel&rdquo; Pacquiao, shared an update <a href=\"https://www.facebook.com/photo/?fbid=733591628835776&amp;set=a.232284002299877\"  target=\"_blank\">on the government&rsquo;s Facebook page</a> around midnight Friday. He said that local agencies were conducting ongoing assessment of the damage. &ldquo;But we have not received any report of major damage to buildings and infrastructure, he said. &ldquo;Landslide going to [the] Glan area has been cleared and the road is now passable. Power supply and telecommunications are stabilized.&rdquo; He urged the public to &#8220;stay vigilant&#8221; and &#8220;take precautionary measures.&#8221;</p>\n\n\n\n<p>On Saturday, the government of General Santos City, via its official Facebook page, said <a href=\"https://www.facebook.com/photo?fbid=354140467311296&amp;set=pcb.354140563977953\"  target=\"_blank\">541 individuals were brought to nearby hospitals</a>. 509 people were treated as outpatients, while 32 were admitted. The announcement said that families of earthquake victims will be given financial assistance and hospital bills will be covered by the government.</p>\n\n\n\n<p>In an earlier public post, the government <a href=\"https://www.facebook.com/photo/?fbid=354005920658084&amp;set=a.252344380824239\"  target=\"_blank\">shared an update from the city&rsquo;s mayor</a>, Lorelie Geronimo-Pacquiao, about disruption to the schooling system. &ldquo;Classes are suspended in both public and private institutions from elementary to tertiary level until further notice.&rdquo;</p>\n\n\n\n<p>Earthquakes are common in the Philippines. The country lies on the &#8220;Ring of Fire,&#8221; a belt of volcanoes circling the Pacific Ocean, prone to seismic activity.</p>\n\n\n\n<p>Initial<a href=\"https://twitter.com/ABSCBNNews/status/1725460689568088339\"  target=\"_blank\"> videos of the earthquake, shared by a local news</a> outlet on Friday, showed people forced to<a href=\"https://twitter.com/ABSCBNNews/status/1725450548873478231?s=20\"  target=\"_blank\"> evacuate from buildings and huddling on the floor</a> of a shopping mall, amid thunderous shakes in General Santos City.</p>\n\n\n\n<p>Further footage showed the quake causing signs and antennas on the top of a 17-story building to shake. The building&#8217;s employees were safely evacuated,<a href=\"https://x.com/ABSCBNNews/status/1725454718087086323?s=20\"  target=\"_blank\"> local media shared.</a> The earthquake is also reported to have<a href=\"https://x.com/ABSCBNNews/status/1725451736591311339?s=20\"  target=\"_blank\"> cracked and shut down</a> the Old Buayan Bridge, which joins General Santos and Sarangani.</p>\n\n\n\n<p>According<a href=\"https://x.com/ABSCBNNews/status/1725473798206710051?s=20\"  target=\"_blank\"> to a local reporter</a>, the airport in General Santos City sustained minor damage, including hairline cracks along columns in the building. They reported that no injuries had been logged among passengers or employees.</p>\n\n\n\n<p>In the aftermath of the earthquake, the Philippine Red Cross<a href=\"https://www.facebook.com/phredcross\"  target=\"_blank\"> shared via Facebook</a> that it was &ldquo;providing first aid and medical attention to students who collapsed.&#8221;</p>\n\n\n\n<p>The Philippines&#8217;<a href=\"https://www.ocd.gov.ph/\"  target=\"_blank\"> Office of Civil Defense</a> said in an email to TIME on Friday that the earthquake had resulted in power outages in General Santos, Lebak and Sultan Kudarat, in addition to damaged houses in Sarangani and an affected school. The office said it had sent emergency alerts and warnings to six areas. By 6:30 p.m. local time, power had been restored in some parts of General Santos City and the Province of Sarangani, the local government<a href=\"https://www.facebook.com/LguGensan/\"  target=\"_blank\"> posted on its Facebook</a> page.</p>\n\n\n\n<p><em>With additional reporting from Chad de Guzman.</em></p>\n"},"wfw:commentRss":"https://api.time.com/6336648/philippines-earthquake-aftershocks-tsunami-threat/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6336648"}},{"title":"China and Japan Agree to Try to Resolve Fukushima Water Dispute Through Dialogue","link":"https://time.com/6336621/china-japan-xi-kishida-fukushima-water-resolution/","comments":"https://time.com/6336621/china-japan-xi-kishida-fukushima-water-resolution/#respond","dc:creator":{"#cdata-section":"Isabel Reynolds and Takashi Hirokawa / Bloomberg"},"pubDate":"Fri, 17 Nov 2023 07:00:00 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"News Desk"},{"#cdata-section":"wire"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6336621"},"description":{"#cdata-section":"China imposed an import ban on Japanese seafood in response to Japan’s ocean discharge of wastewater from the Fukushima nuclear plant."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6336621\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6336621/china-japan-xi-kishida-fukushima-water-resolution/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/kishida-xi-apec-nuclear-wastewater.jpg\" alt=\"Kishida-Xi meeting in Bangkok\"/>\n\n\n\n<p>Japanese Prime Minister Fumio Kishida and Chinese President Xi Jinping agreed to seek a resolution through dialogue to a dispute over wastewater from the Fukushima nuclear plant, Kishida said after their first summit in a year.&nbsp;</p>\n\n\n\n<p>&ldquo;I urged that this be dealt with calmly on a scientific basis,&rdquo; Kishida told reporters in San Francisco. &ldquo;We will hold discussions based on science at an expert level,&rdquo; he added. He described the summit as &ldquo;very meaningful.&rdquo;</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p><strong>Read More: </strong><em><a href=\"https://time.com/6307923/fukushima-wastewater-seafood-safety-radioactive-science/\" >Japan Is Releasing Wastewater Into the Pacific: What to Know About Radioactivity and Seafood</a></em></p>\n\n\n\n<p>Xi told Kishida Japan&rsquo;s discharge is a matter of international public interest and the country needs to handle the issue in a responsible and constructive manner, China Central Television reported.</p>\n\n\n\n<p>The meeting Thursday came a day after Joe Biden hailed an improvement in U.S. relations with China following his own talks with Xi. That warmer tone helped open the way for U.S. ally Japan to pursue its efforts to shore up ties with its biggest trade partner.</p>\n\n\n\n<p>The Asian neighbors have been wrangling over everything from semiconductors to nuclear waste and the fate of Japanese citizens detained in China. A territorial dispute over uninhabited islands near Taiwan continues to simmer.</p>\n\n\n\n<p>Kishida said he urged Xi to end a ban on imports of Japanese seafood, imposed by China in response to Japan&rsquo;s ocean discharge of wastewater from the wrecked Fukushima nuclear plant. The International Atomic Energy Agency has said the release is safe.</p>\n\n\n\n<p><strong>Read More: </strong><em><a href=\"https://time.com/6311984/china-japan-nuclear-wastewater-science-politics/\" >China&rsquo;s Concern About Nuclear Wastewater May Be More About Politics Than Science</a></em></p>\n\n\n\n<p>The wastewater issue has hurt sales in China for Japanese companies including cosmetics-maker Shiseido Co., which slashed its profit forecast last week. The Chinese reaction has been a factor in turning the Japanese public their most negative on China since 2014, according to a poll published last month.&nbsp;</p>\n\n\n\n<p>Xi told Kishida at the start of the meeting that the two countries should focus on common interests, properly handle differences and re-confirm their reciprocal strategic relationship, state broadcaster China Central Television reported.</p>\n\n\n\n<p>Supply chains between Japan and China are deeply intertwined, he said, adding it was in no one&rsquo;s interest to decouple and break those chains, China&rsquo;s Xinhua reported.</p>\n\n\n\n<p>&ldquo;I want to work with you to create a brighter future for Japan-China ties for the sake of the next generation,&rdquo; Kishida responded. &nbsp;</p>\n\n\n\n<p>Japan has faced Chinese recriminations for following the lead of the U.S. in strengthening the regulation of chip-related exports to China. Japan and China agreed at ministerial talks this week to establish an export control dialogue, China&rsquo;s commerce ministry announced. </p>\n\n\n\n<p>The leaders also agreed to restart high-level economic talks at an appropriate time, according to a statement on the Japanese Foreign Ministry website.</p>\n\n\n\n<p>During the meeting, Kishida expressed concern about the situation in the East China Sea, where government ships from both nations patrol waters around a chain of uninhabited islands claimed by both countries. The Japanese premier also called on Xi to remove a buoy placed in what Japan sees as its exclusive economic zone.&nbsp;</p>\n\n\n\n<p>Tokyo last year dubbed its neighbor an &ldquo;unprecedented security challenge&rdquo; and is planning its biggest military buildup since World War II, a stance that has riled Beijing. </p>\n\n\n\n<p><strong>Read More: </strong><em><a href=\"https://time.com/6278122/fumio-kishida-japan-prime-minister-interview-g7/\" >Prime Minister Fumio Kishida Is Giving a Once Pacifist Japan a More Assertive Role on the Global Stage</a></em></p>\n\n\n\n<p>Kishida also called for the release of Japanese citizens being held in China, calling for the individuals to be returned and legal processes made transparent. The detentions have cast a pall over the business environment in China, though Beijing has defended its moves as part of the protection of its national security.</p>\n\n\n\n<p>One Japanese man in his 50s had a 12-year sentence confirmed this month, while an employee of drugmaker Astellas Pharma Inc, also in his 50s, was indicted in October after being detained earlier in the year. Details of the allegations haven&rsquo;t been made public.</p>\n"},"wfw:commentRss":"https://api.time.com/6336621/china-japan-xi-kishida-fukushima-water-resolution/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6336621"}},{"title":"How India Became Pro-Israel","link":"https://time.com/6336217/india-modi-pro-israel/","comments":"https://time.com/6336217/india-modi-pro-israel/#respond","dc:creator":{"#cdata-section":"Nicolas Blarel"},"pubDate":"Fri, 17 Nov 2023 06:00:00 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"world affairs"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6336217"},"description":{"#cdata-section":"The South Asian country was once a leading pro-Palestinian voice, but India-Israel ties have blossomed under Prime Minister Modi. "},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6336217\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6336217/india-modi-pro-israel/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1158264395.jpg\" alt=\"ISRAEL-VOTE-POLITICS\"/>\n\n\n\n<p>When Hamas launched its <a href=\"https://time.com/6321849/israel-attack/\" >unprecedented attack</a> against Israel on Oct. 7, killing <a href=\"https://www.jpost.com/israel-news/article-773049\"  target=\"_blank\">1,200 people</a>, Indian Prime Minister Narendra Modi, like most world leaders, condemned Hamas&rsquo;s horrific actions and expressed &ldquo;solidarity with Israel at this difficult hour.&rdquo; But the Modi government&rsquo;s approach in the days and weeks that followed have set it apart from many non-Western peers. That divergence notably includes India <a href=\"https://scroll.in/latest/1058247/india-abstains-from-un-resolution-for-humanitarian-truce-between-israel-hamas\"  target=\"_blank\">abstaining from a U.N. resolution</a> on Oct. 27 that called for a &ldquo;humanitarian truce&rdquo; (120 countries voted in favor). </p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>India&rsquo;s approach has surprised many observers for various reasons. First, the Indian government&rsquo;s relative quiet about the plight of Palestinians in Gaza as the death toll <a href=\"https://www.washingtonpost.com/world/interactive/2023/gaza-rising-death-toll-civilians/\"  target=\"_blank\">tops 11,000</a> marks a departure from its consistent support for Palestinians since 1948. Even in the recent past, as India and Israel developed defense and commercial ties, New Delhi&rsquo;s support for Israel was tempered by its historical ties. Second, through its <a href=\"https://time.com/6311246/g20-summit-new-delhi-india-modi-global-south/\" >presidency of the G-20</a> in 2023, India signaled its ambition to represent the voice of the Global South and ensure the developing world&rsquo;s concerns get heard. </p>\n\n\n\n<p>Historically, India has had a very different relationship with Israelis and Palestinians. During India&rsquo;s struggle for independence from the British, the Indian anti-colonial movement supported Palestinian nationalists and India <a href=\"https://www.un.org/unispal/history2/origins-and-evolution-of-the-palestine-problem/part-ii-1947-1977/\"  target=\"_blank\">proposed a plan in 1947</a> to create an independent federal state of Palestine (with constitutional safeguards for the Jewish minority). The reasons were complex, stemming in part from the unease of India&rsquo;s post-colonial, nationalist elites about the wisdom of creating what they perceived to be a settler state in the erstwhile British Mandate for Palestine. Consequently, when the U.N. General Assembly passed a resolution in 1947 that recommended establishing the State of Israel alongside a Palestinian one, a newly independent India was one of the few non-Arab countries that <a href=\"https://abcnews.go.com/International/wireStory/india-bars-protests-support-palestinians-analysts-pro-israel-104711267\"  target=\"_blank\">voted against</a> the measure.</p>\n\n\n\n<p>Pragmatic considerations shaped India&rsquo;s position. Indian leaders felt that they could not endorse a state that was founded on religious grounds, especially coming so soon after the violent Partition of India in 1947 that led to Pakistan&rsquo;s creation, an outcome that they had staunchly opposed. </p>\n\n\n\n<p>India formally recognized Israel in 1950. But Indo-Israeli contacts were limited given Prime Minister Jawaharlal Nehru&rsquo;s fear of stirring opposition, particularly from Indian Muslims. At the time, India also wanted to present itself as a standard-bearer against colonialism and to demonstrate its solidarity with newly decolonized Arab states, which were being courted by Pakistan. In 1974, India became the first non-Arab country to <a href=\"https://indianexpress.com/article/explained/arc-of-indias-ties-with-israel-8974060/\"  target=\"_blank\">recognize</a> the Palestine Liberation Organization as the &ldquo;sole and legitimate representative of the Palestinian people.&rdquo; India again claimed another first when it became the first non-Arab country to recognize the State of Palestine when the PLO <a href=\"https://www.nytimes.com/1988/11/15/world/plo-proclaims-palestine-to-be-an-independent-state-hints-at-recognizing-israel.html\"  target=\"_blank\">proclaimed</a> it in 1988. </p>\n\n\n\n<p>It was not until 1992 that India <a href=\"https://www.livemint.com/Politics/0pe5Cc2BoZ24xWX3t90iaP/How-India-Israel-diplomatic-ties-came-to-fruition.html\"  target=\"_blank\">granted full diplomatic recognition</a> to Israel, including the opening of the Israeli Embassy in New Delhi. With the Cold War over and the impending Oslo Accords&mdash;which sought rapprochement between Israel and the Palestinians&mdash;India chose to end its policy of keeping Israel at a calculated distance. Since then, the Indo-Israeli relationship has developed steadily, especially when it comes to defense cooperation. A turning point came in 1999 when India went to war with Pakistan over the disputed Kashmir region and Israel demonstrated its willingness to provide arms and ammunition. In recent years, India has purchased about <a href=\"https://www.haaretz.com/israel-news/2022-12-11/ty-article/.premium/why-does-israel-sell-india-so-many-weapons/00000184-f247-d887-a98c-f3c731150000\"  target=\"_blank\">$2 billion</a> worth of weapons annually from Israel. India has bought missiles, drones, bombs, and border-security equipment, and is now the Israeli defense industry&rsquo;s biggest foreign customer. </p>\n\n\n\n<p>Modi&rsquo;s election in 2014 put the Indo-Israeli rapprochement into higher gear. While previous governments had made sure to keep their dealings with Israel largely silent, the Modi government has been public in its engagement with Israel. Modi was the first Indian Prime Minister <a href=\"https://www.bbc.co.uk/news/world-asia-india-40489746\"  target=\"_blank\">to visit</a> Israel in 2017, which was reciprocated when Netanyahu <a href=\"https://www.aljazeera.com/news/2018/1/14/defence-trade-and-bollywood-netanyahu-visits-india\"  target=\"_blank\">traveled to Delhi</a> in 2018. The ideological alignment between the two right-wing leaders has certainly been more apparent than with previous governments. Members of Modi&rsquo;s Hindu nationalist Bharatiya Janata Party have long regarded Israel as a model religious-nationalist state to potentially build on, in contrast to India&rsquo;s founding as a secular and multi-religious one. </p>\n\n\n\n<p>Still, India has reaffirmed its support for the Palestinian cause in recent years. Modi became the first Indian Prime Minister in 2018 to <a href=\"https://www.aljazeera.com/news/2018/2/10/modi-visits-ramallah-backs-independent-palestine-state\"  target=\"_blank\">visit Ramallah</a> in the occupied West Bank. India has also increased its donations to the U.N. Relief and Works Agency for Palestine Refugees in the Near East. These various gestures were meant to remind both internal and external audiences of India&rsquo;s complicated stance on the Israeli-Palestinian conflict. </p>\n\n\n\n<p>India&rsquo;s tilt toward Israel encompasses growing trade and defense cooperation, ideological and leadership affinities, and a focus on counter-terrorism cooperation. But India is aware of potential diplomatic costs and Modi has spoken to various Arab Gulf leaders to coordinate positions; earlier this month, India voted <a href=\"https://www.msn.com/en-in/news/India/india-votes-in-favour-of-un-resolution-against-israeli-settlements-in-palestine/ar-AA1jLuIM\"  target=\"_blank\">in favor</a> of a U.N. General Assembly resolution that condemned Israeli settlements in East Jerusalem, the West Bank, and Golan Heights.</p>\n\n\n\n<p>The challenge for India ahead is maintaining the strategic defense and commercial ties with Israel while navigating its role as a Global South leader. It is a tight rope to walk. </p>\n"},"wfw:commentRss":"https://api.time.com/6336217/india-modi-pro-israel/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6336217"}},{"title":"How Netanyahu Is Undermining Biden’s Gaza Strategy","link":"https://time.com/6336245/benjamin-netanyahu-undermining-bidens-gaza-strategy/","comments":"https://time.com/6336245/benjamin-netanyahu-undermining-bidens-gaza-strategy/#respond","dc:creator":{"#cdata-section":"Nimrod Novik"},"pubDate":"Thu, 16 Nov 2023 20:32:37 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"freelance"},{"#cdata-section":"Israel"},{"#cdata-section":"Israel-Hamas War"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6336245"},"description":{"#cdata-section":"The U.S. is trying to help imagine a post-Hamas Gaza but Netanyahu is attacking those efforts."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6336245\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6336245/benjamin-netanyahu-undermining-bidens-gaza-strategy/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/netanyahu-biden-gaza-strategy.jpg\" alt=\"Israeli prime minister Benjamin Netanyahu during a press conference\"/>\n\n\n\n<p>Israel Prime Minister Netanyahu threw a political grenade at U.S. diplomacy during a recent press conference. Its explosion threatened to sabotage American efforts to put together a three-way, win-win, post-Gaza war regional architecture. First, the U.S. plan would relieve Israel of the need to govern Gaza&#8217;s 2.2 million Palestinians with no exit in sight. Second, it would offer Palestinians a credible political horizon and thereby prevent the West Bank from sliding into a Gaza-like crisis, while prepping the Palestinian Authority (PA) for controlling Gaza in the future. Third, it was to consolidate a powerful, U.S.-led regional coalition to check Iran&#8217;s and its proxies&rsquo; regional meddling, with revived talk of Israeli-Saudi normalization included.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>But, in&nbsp;<a href=\"https://www.timesofisrael.com/netanyahu-stances-frustrating-us-attempts-to-rally-arab-support-for-post-hamas-gaza/\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">declaring his flat objection for having Gaza run by the PA</a>, Netanyahu removed the cornerstone on which Secretary of State Blinken had been trying to mobilize regional support.</p>\n\n\n\n<p>President Biden, the best friend Israel has ever had in the White House, who enjoys more credit with the Israeli public than any predecessor, is yet to tell the reckless Netanyahu &#8220;enough is enough.&#8221;</p>\n\n\n\n<p>The farthest he has gone in that direction came when he was asked whether he had been frustrated with Netanyahu&rsquo;s belated acceptance of limited humanitarian pauses, long sought by the U.S. In typical understatement, Biden responded, <a href=\"https://www.timesofisrael.com/liveblog_entry/pm-swats-down-any-notion-of-tension-with-biden-over-humanitarian-pauses-in-gaza/\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">&ldquo;It&rsquo;s taken a little longer than I had hoped.&rdquo;</a></p>\n\n\n\n<p>Frustration seems to have characterized American efforts to persuade Jerusalem to consider the context, not just the military dimensions, of the Gaza operation.</p>\n\n\n\n<p>Similarly, Secretary of State Anthony Blinken&#8217;s Middle East shuttle diplomacy and Amman meeting with Arab foreign ministers the previous week ended in disappointment. Intended to get them to agree on the contours of a Gaza &lsquo;morning after&rsquo; strategy, his interlocutors refused to engage.</p>\n\n\n\n<p>Like Blinken, they view a future reinvigorated Palestinian Authority as the likely and desired long-term solution for the Gaza Strip, none was willing to discuss the &#8220;missing link&#8221;&mdash;the one-to-two-year period between the likely gradual IDF exit from Gaza and the equally phased PA take-over. Those Arab states refused to discuss such matters as who governs, polices, and provides security in Gaza; who reinvents the PA and preps it so that it is able to govern the Strip and what its rejuvenation entails; who coordinates, oversees and, yes, funds it all. Their refusal to discuss&mdash;let alone commit to contribute to&mdash;a day-after strategy had little to do with Blinken&rsquo;s formidable diplomatic skill, nor even with Gaza. It was largely about Jerusalem, or more precisely, the Netanyahu government.</p>\n\n\n\n<p><strong><em>Read More: <a href=\"https://time.com/6334832/peace-plan-israel-gaza/\" >Why Peace Is Possible for Israel and Gaza </a></em></strong></p>\n\n\n\n<p>It appears that Blinken&#8217;s Arab interlocutors saw no point in discussing their role in saving Israel from its Gaza dilemma absent a clear message from Jerusalem concerning its contribution to the enormous post-war Gaza stabilization, reconstruction, and governance effort. That contribution, they reportedly insisted, must involve a complete change in Israel&rsquo;s West Bank policy (settler violence and settlement expansion included), attitude toward the PA (including releasing all its funds), restoring and preserving the status quo on Temple Mount/Haram al-Sharif, and, most importantly, a credible political horizon for the Palestinians.</p>\n\n\n\n<p>Alas, employing his long-perfected diversion technique, Netanyahu seems to have gotten the U.S. Secretary of State involved in endless arguments over the number of trucks to enter Gaza, what their cargo might include, and the duration and frequency of humanitarian pauses. All to avoid discussing the morning after.&nbsp;<a>As Netanyahu reportedly told a frustrated President Biden, an equally astonished Secretary of Defense Austin, and repeatedly Secretary Blinken, words to the effect: &#8220;Not now. Now we focus on winning this&#8221;</a><a href=\"https://mail.google.com/mail/u/1/#m_6706936201478847174__msocom_1\"  target=\"_blank\"></a><a href=\"https://mail.google.com/mail/u/1/#m_6706936201478847174__msocom_2\"  target=\"_blank\"></a></p>\n\n\n\n<p>He repeated this mantra on Sunday, publicly, when he&nbsp;told CNN&rsquo;s Dana Bash: &ldquo;<a href=\"https://www.cnn.com/videos/world/2023/11/12/benjamin-netanyahu-war-bash-interview-sotu-vpx.cnn\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">The first thing we have to do is to destroy Hamas</a>.&rdquo;</p>\n\n\n\n<p>Some in Washington give him the credit that he just doesn&#8217;t get it. That he doesn&#8217;t understand the importance of preparing now&mdash;and adjusting the conduct of the war to&mdash;Israel&#8217;s desired morning after. Others know him better. They know that he understands it better than most, as do Minister of Defense Yoav Galant and former IDF chiefs Benny Gantz and Gadi Eisenkot, who are now members of the war cabinet.</p>\n\n\n\n<p>They all realize that discussing the morning after exposes the need for Israel to change course on the Palestinian issue. Since Netanyahu&rsquo;s annexationist, messianic coalition partners would not hear of it, advancing such measures is a sure trigger for a coalition crisis. Although these reckless partners are replaceable with no need for new elections, and wartime certainly justifies such emergency measures, what&rsquo;s at stake is not only his coalition structure, but something far more important for Netanyahu: his legal predicament. Unlike those far-right coalition partners, those replacing them would not provide him with an exit&mdash;legislated or otherwise&mdash;before his trial for corruption charges runs its course and a verdict is reached.</p>\n\n\n\n<p>On the West Bank too, ignoring warnings from his security establishment and an increasingly agitated Washington, Netanyahu prioritizes his coalition over national security. His allowing reckless efforts that choke the PA financially, Jewish terrorism in the <a href=\"https://time.com/6329142/west-bank-settler-violence-israel-security/\" >West Bank</a>, and settlement expansion to continue might well lead to the PA becoming one of the victims of this war. Whether that is due to Palestinian leadership&rsquo;s fatigue, a popular uprising, or the continued loss of control over important swaths of West Bank territory, a chaotic West Bank sliding in the direction of a Gaza-like crisis is a real possibility. Were it to materialize, the outcome for Israel might involve no exit strategy from Gaza, governing the lives of well over five million Palestinians, and a possible fallout affecting peaceful relations with Arab neighbors, near and far. If that happens, the entire new US regional architecture would lay in ruins.</p>\n\n\n\n<p>To avert this eventuality, it seems that the time has come for Washington to use all venues&mdash; Defense Secretary Austin to Galant, Blinken to Israel&rsquo;s war cabinet, and Biden to Bibi&mdash;to deliver a clear message:</p>\n\n\n\n<p>&ldquo;<em>Look, we are with you all the way. We will deter all the bad guys around. And you are a sovereign country. So Gaza is your call. But note these two things:</em></p>\n\n\n\n<p><em>First, you can&#8217;t ask us to shield you from an internationally imposed premature ceasefire while your ministers shoot their mouths on nuking Gaza or forcing its population on Egypt, while your finance minister chokes the PA financially, while your violent settlers go wild, and while you argue to death every humanitarian truck and every ten minutes of a humanitarian pause.</em></p>\n\n\n\n<p><em>Second, no one in the neighborhood and beyond is willing to consider relieving you of the burden of Gaza once the morning after arrives, unless you change policy on the West Bank and vis-&agrave;-vis the PA, accept that the PA is part of the long-term solution to Gaza, and agree now to a two-state peace process later.</em></p>\n\n\n\n<p><em>So, no pressure, friends. It&#8217;s totally up to you: change course and allow a regional-international solution, or handle Gaza on your own. Though your decisions affect our national security as well, nonetheless, it&#8217;s not the U.S. that will be stuck in Gaza for decades.&rdquo;</em></p>\n"},"wfw:commentRss":"https://api.time.com/6336245/benjamin-netanyahu-undermining-bidens-gaza-strategy/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6336245"}},{"title":"Why Fred Swaniker Is All In on Education","link":"https://time.com/6333485/fred-swaniker-time100-impact-awards/","comments":"https://time.com/6333485/fred-swaniker-time100-impact-awards/#respond","dc:creator":{"#cdata-section":"Anna Gordon"},"pubDate":"Thu, 16 Nov 2023 15:49:39 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"franchise"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6333485"},"description":{"#cdata-section":"Swaniker has dedicated himself to building new programs that could develop students' unrealized talent—and, in doing so, help to drive change for their communities."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6333485\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6333485/fred-swaniker-time100-impact-awards/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/time100-impact-awards-rwanda-fred-swaniker.jpg\" alt=\"\"/>\n\n\n\n<p>Fred Swaniker&rsquo;s first experience as an educator came when he was barely an adult himself. He was 18 years old when his mother asked him to help her run a small church school she was planning to establish in Botswana for kids ages 5 to 12. His father had just passed away, and the family needed the steady income from her full-time job as a high school teacher, so she turned to <a href=\"https://time.com/collection/100-most-influential-people-2019/5567703/fred-swaniker/\" >Swaniker</a>. &ldquo;I became a headmaster at the age of 18,&rdquo; he says. &ldquo;I was teaching classes and managing other teachers. It was a pivotal experience.&rdquo;</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Working at the school <a href=\"https://time.com/5603886/african-leadership-university-mauritius-fred-swaniker/\" >ignited a passion for education that Swaniker</a>, now 47, has carried throughout his career. After an MBA at Stanford in 2004, the Ghanaian entrepreneur decided to dedicate himself to building new programs that could develop students&#8217; unrealized talent&mdash;and, in doing so, help to drive change for their communities.</p>\n\n\n\n<p>&ldquo;There are many challenges in Africa: healthcare, education, infrastructure, governance, food security, corruption,&rdquo; Swaniker says. &ldquo;I realized that there&#8217;s no way that I could, in my lifetime, solve any one of those issues. But if I could create <a href=\"https://time.com/5879437/fred-swaniker-coronavirus-african-entrepreneurs/\" >an army of problem-solvers and innovators</a> that would allow me to have a system for <a href=\"https://time.com/5574441/fred-swaniker-time-100-gala-toast/\" >addressing all these problems</a>.&rdquo; </p>\n\n\n\n<p>With this mission in mind, Swaniker set out to construct programs that could educate a generation of trailblazers. In 2004, working with colleagues he met while at Stanford, Swaniker devised a business plan for the African Leadership Academy with the goal of finding and training promising students from across Africa in entrepreneurship and leadership. Based in Johannesburg, South Africa, the two-year high school now educates approximately 250 11th and 12th graders each year, selected from a competitive application process to which thousands of students apply.&nbsp;&nbsp;</p>\n\n\n\n<p>The academy&rsquo;s success and the demand for the program it offers led Swaniker to open a new institution in 2015&mdash;the African Leadership University (ALU). The school, which has campuses in both Mauritius and Rwanda, offers bachelor&rsquo;s degree programs in software engineering and entrepreneurial leadership to 2,000 students each year. Seeing the growth of the tech sector on the continent and the potential for remote learning to reach an even broader swath of students, Swaniker created the African Leadership Xcelerator (ALX) a few years after the ALU&rsquo;s debut. ALX offers a series of virtual courses&mdash;between four and six months in length&mdash;that provide short-term technical training for students interested in pursuing jobs in software engineering, cloud computing, data analytics, and more. More than 97,000 students have completed the program since its inception.</p>\n\n\n\n<p>Graduates from these programs join an alumni network working in a diverse array of industries. The schools&rsquo; former students include diplomats, filmmakers, medical innovators, and founders of companies and nonprofits. One recent success story: Joseph Rutakangwa, who graduated African Leadership University in 2019, went on to start Rwazi, a startup providing major brands with data analysis on consumer habits in African countries and other emerging markets. In March, Rwazi raised $4 million <a href=\"https://techcrunch.com/2023/03/23/rwazi-to-scale-its-market-intelligence-platform-backed-by-4-million-seed-funding/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cubGlua2VkaW4uY29tLw&amp;guce_referrer_sig=AQAAAA428F-9BQhlXhBYy2NW5N7rXIKfXd2LE4vQDKi0Jq2f_lgESkGyi--nqF884cT8wCqm_N2u7KxT7GJ6UGYvYd8n8po1UHZVwDFm0VX2mDNOa4u-XqOEO8QlqBZN-aAE2rxmbmLHf-qb66EXpPS2Bz8YvDC1-8mk7Fo0oS0Hqm-j\"  target=\"_blank\">in seed funding</a>. Meanwhile, an alum from the African Leadership Academy&rsquo;s 2010 class, Spencer Horne, is the force behind Cloudline, a startup that uses drone technology to help deliver essential goods like food and medicine to rural populations. After years of development, Cloudline unveiled <a href=\"https://www.thesouthernafricantimes.com/cloudlines-solar-powered-airships-set-to-transform-aerial-operations/\"  target=\"_blank\">its first drone</a>&mdash;a solar-powered airship that can travel up to 250 miles&mdash;to the public at the Paris Air Show this summer.&nbsp;</p>\n\n\n\n<p>Altogether, over 200,000 students engage with the programs&rsquo; curriculums each year, but Swaniker has his sights set higher&mdash;he aims to train 3 million leaders by 2035, and is moving quickly to reach that goal. Demographic shifts may work in his favor. As the global population ages in coming decades, many countries will have a shortage of young, technically skilled workers. But Swaniker sees the huge opportunity these shifts create for the students in his programs, who will help bolster the global labor force in the future. &ldquo;Africa remains the youngest continent in the world, and<a href=\"https://www.theguardian.com/global-development/2022/jan/20/by-2050-a-quarter-of-the-worlds-people-will-be-african-this-will-shape-our-future#:~:text=1%20year%20old-,By%202050%2C%20a%20quarter%20of%20the%20world's%20people%20will%20be,this%20will%20shape%20our%20future&amp;text=In%202022%20the%20world's,planet%2C%20according%20to%20respected%20demographers.\"  target=\"_blank\"> will be 40 percent of the world&#8217;s population</a> by 2050,&rdquo; says Swaniker. &ldquo;We&rsquo;re looking at how to leverage the talent that&#8217;s there.&rdquo;<br><br><em>This profile is published as a part of TIME&rsquo;s <a href=\"https://time.com/collection/time100-impact-awards/\" >TIME100 Impact Awards</a> initiative, which recognizes leaders from across the world who are driving change in their communities. The next TIME100 Impact Awards ceremony will be held on Nov. 17 in Kigali, Rwanda.</em></p>\n"},"wfw:commentRss":"https://api.time.com/6333485/fred-swaniker-time100-impact-awards/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6333485"}},{"title":"Why Ukraine’s Stalemate Will Likely Last Another Year","link":"https://time.com/6335084/ukraine-stalemate-ian-bremmer-essay/","comments":"https://time.com/6335084/ukraine-stalemate-ian-bremmer-essay/#respond","dc:creator":{"#cdata-section":"Ian Bremmer"},"pubDate":"Thu, 16 Nov 2023 11:00:00 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"freelance"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6335084"},"description":{"#cdata-section":"Ian Bremmer on why Ukraine's stalemate with Russia is unlikely to break in the next year."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6335084\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6335084/ukraine-stalemate-ian-bremmer-essay/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1782807416.jpg\" alt=\"Military mobility of Ukrainian soldiers in the direction of Lugansk\"/>\n\n\n\n<p>Things are looking up for Vladimir Putin. Ukraine&rsquo;s much-vaunted counteroffensive has made little progress on the ground, heightening fears in the West that U.S. and European taxpayers are bankrolling an increasingly costly stalemate. Russian counterattacks have accomplished little, but the ability of well-entrenched Russian forces to absorb Ukrainian blows without buckling leaves the Kremlin in control of about 18 percent of Ukraine&rsquo;s land. Russia has expanded its missile strikes to the highest levels this year and boosted in domestic production of missiles and ammunition. Significant material support from <a href=\"https://www.reuters.com/world/russian-delegation-led-by-natural-resources-minister-arrives-pyongyang-kcna-2023-11-14/\"  target=\"_blank\">North Korea</a> and more drones from Iran are helping.  </p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Putin can also celebrate the fallout from Israel&rsquo;s war with Hamas. The U.S. and Europe are mightily distracted by the carnage in Gaza, which is roiling their domestic politics. Western aid that might have gone to Ukraine is now sharing focus with support for Israel and humanitarian aid for Palestinian civilians trapped in harm&rsquo;s way. Making matters worse, Washington and European governments don&rsquo;t see eye to eye on this battle as they do on Ukraine, and divisions among Western governments are adding to the stress. The war in Gaza also helps Russia argue that America is run by neocolonialist hypocrites who make righteous speeches about human rights in Ukraine while green-lighting Israel&rsquo;s assault on Palestinians who can&rsquo;t flee as Ukrainians have.  </p>\n\n\n\n<p>Quietly, Western leaders are warning <a href=\"https://time.com/6329188/ukraine-volodymyr-zelensky-interview/\" >Ukraine&rsquo;s President Volodymyr Zelensky</a> that time is not on his country&rsquo;s side. Despite the fights in Washington over <a href=\"https://time.com/6319570/ukraine-u-s-aid-republicans/\" >Ukraine funding</a>, more U.S. aid is probably coming. President Biden should still be able to secure a decent fraction of the $60 billion in military support he has requested from Congress. But uncertainty about the future of U.S. support is taking hold. </p>\n\n\n\n<p><strong><em>Read More: <a href=\"https://time.com/6329188/ukraine-volodymyr-zelensky-interview/\" >Zelensky&#8217;s Struggle to Keep Ukraine in the Fight</a></em></strong></p>\n\n\n\n<p>Yet, Western efforts to push Zelensky to begin bargaining with Putin will are going nowhere for now. Ukraine&rsquo;s president is in no position to offer up captured Ukrainian land that tens of thousands of his soldiers died to defend. That&rsquo;s especially true at a time when other voices are finding favor with the Ukrainian public&mdash;see recent <a href=\"https://www.economist.com/zaluzhny-transcript?utm_medium=cpc.adword.pd&amp;utm_source=google&amp;ppccampaignID=17210591673&amp;ppcadID=&amp;utm_campaign=a.22brand_pmax&amp;utm_content=conversion.direct-response.anonymous&amp;gad_source=1&amp;gclid=CjwKCAiA9dGqBhAqEiwAmRpTC_2JfDRtVxUgK8veSAB-KQd4Cd22EEd5MIW3Yd3Ax-9VTpfDjJzLqRoCEEQQAvD_BwE&amp;gclsrc=aw.ds\"  target=\"_blank\">public comments</a> from Valery Zaluzhny, Ukraine&rsquo;s top military commander&mdash;and as he faces growing pressure to drop his objections to holding a wartime election in 2024.  </p>\n\n\n\n<h3>More From TIME</h3>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=fIMiiB8k autostart=\"viewable\"]</div>\n\n\n\n<p>What could the West offer Zelensky in exchange for his willingness to begin haggling with Putin? On the economic side, the West could promise to finance full reconstruction of the country&mdash;including via the seizure of <a href=\"https://time.com/6317191/russia-frozen-assets-rebuild-ukraine/\" >Russia&rsquo;s frozen assets</a>. The European Union could promise (eventual) membership. On the security side, NATO could offer full membership, with the protection guarantees that come with it. But members on both sides of the Atlantic will balk at moving large numbers of troops and weapons into Ukraine and at committing to war with Russia if missile strikes continue across the country. The U.S. can send Ukraine more advanced weapons systems in 2024, and NATO leaders can use the 75th anniversary summit next July to make some commitment on Ukraine&rsquo;s future membership. But what happens if Donald Trump then wins the White House? What would that mean for NATO commitments&mdash;or for the future of NATO itself? No one can answer these questions with confidence.   </p>\n\n\n\n<p>Knowing all this, Putin has no interest in offering any credible concession that Zelensky believes he could afford to accept. It&rsquo;s too easy for Russia&rsquo;s president to call up more recruits in numbers Ukraine can&rsquo;t match, even if only to throw them on the fire. He can also wait and see what happens to Western support over the next year and what American voters decide next November. Aware of all this, Zelensky has no incentive to offer anything he knows Putin will only see as a sign of weakness. &nbsp;</p>\n\n\n\n<p>For all these reasons, the stalemate in Ukraine will likely extend for (at least) another year. &nbsp;</p>\n"},"wfw:commentRss":"https://api.time.com/6335084/ukraine-stalemate-ian-bremmer-essay/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6335084"}}]}}}