{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Security Intelligence","atom:link":{"@href":"http://securityintelligence.com/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://securityintelligence.com","description":"Analysis and Insight for Information Security Professionals","lastBuildDate":"Wed, 15 Nov 2023 14:22:05 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.3.2","image":{"url":"https://securityintelligence.com/wp-content/uploads/2016/04/SI_primary_rgb-80x80.png","title":"Security Intelligence","link":"https://securityintelligence.com","width":"32","height":"32"},"item":[{"title":"Pentesting vs. Pentesting as a Service: Which is better?","link":"https://securityintelligence.com/articles/pentesting-vs-pentesting-as-a-service/","dc:creator":{"#cdata-section":"Josh Nadeau"},"pubDate":"Wed, 15 Nov 2023 14:00:00 +0000","category":[{"#cdata-section":"Security Services"},{"#cdata-section":"pentesting"},{"#cdata-section":"pentesting as a service"},{"#cdata-section":"Penetration Testing"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446718"},"description":{"#cdata-section":"<p>In today&#8217;s quickly evolving cybersecurity landscape, organizations constantly seek the most effective ways to secure their digital assets. Penetration testing (pentesting) has emerged as a leading solution for identifying potential system vulnerabilities while closing security gaps that can lead to an attack. At the same time, a newer entrant into the security arena is Pentesting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/pentesting-vs-pentesting-as-a-service/\">Pentesting vs. Pentesting as a Service: Which is better?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>In today&rsquo;s quickly evolving cybersecurity landscape, organizations constantly seek the most effective ways to secure their digital assets. <a href=\"https://www.ibm.com/topics/penetration-testing\"  target=\"_blank\" rel=\"noopener nofollow\" >Penetration testing (pentesting)</a> has emerged as a leading solution for identifying potential system vulnerabilities while closing security gaps that can lead to an attack.</p>\n<p>At the same time, a newer entrant into the security arena is Pentesting as a Service (PTaaS). Although PTaaS shares some similarities with pentesting, distinct differences make them two separate solutions.</p>\n<p>This article will discuss how these methodologies function, their applicability in different contexts and how they can enhance an organization&rsquo;s cyber readiness.</p>\n<h2>What is involved with penetration testing (pentesting)?</h2>\n<p>Penetration testing, popularly known as pentesting, is a proactive and authorized effort to evaluate the security of an IT infrastructure. However, the process of pentesting is not just about finding loopholes and reporting them. Pentesting services like <a href=\"https://www.ibm.com/services/penetration-testing\"  target=\"_blank\" rel=\"noopener nofollow\" >IBM&rsquo;s X-Force Red</a> apply a comprehensive process that involves several stages:</p>\n<ol>\n<li><strong>Planning and reconnaissance. </strong>This is the initial stage, where the pentesting team defines the scope and goals of the test, including the systems to be addressed and the testing methods to be used. They also gather intelligence (like domain names and mail servers) to understand how the target works and identify potential areas of vulnerability.</li>\n<li><strong>Scanning. </strong>This step involves using automated tools to understand how the target application will respond to different intrusion attempts. This can be done through static analysis (inspecting an application&rsquo;s code to estimate its behavior while running) or dynamic analysis (inspecting an application&rsquo;s code in a running state).</li>\n<li><strong>Gaining access. </strong>Here, the pentester uses web application attacks, such as cross-site scripting, SQL injection and backdoors, to uncover a target&rsquo;s vulnerabilities. The aim is to exploit these vulnerabilities by escalating privileges, stealing data, intercepting traffic, etc., to understand the damage they can cause.</li>\n<li><strong>Maintaining access.</strong> This stage aims to see if the vulnerability can be used to achieve a persistent presence in the exploited system, mimicking the activities of advanced persistent threats (APTs).</li>\n<li><strong>Analysis and reporting. </strong>The final step involves compiling a detailed report with the vulnerabilities discovered, the data accessed and how long the pentester could remain in the system unnoticed. This report can provide valuable insights into potential damages in an actual attack and recommendations for preventing them.</li>\n</ol>\n<a class=\"btn orange1 large\" href=\"https://www.ibm.com/services/penetration-testing\" >Explore X-Force pentesting services</a>\n<h2>Types of penetration testing</h2>\n<p>Pentesting can cover various areas and can be deployed for different purposes. Some of the most popular types include:</p>\n<p><strong>Application testing</strong></p>\n<p>Application testing is specialized penetration testing targeting software applications like web-based, mobile and desktop applications. Its main goal is to uncover any vulnerabilities in an application&rsquo;s architecture or code to protect it from cyberattacks.</p>\n<p>Through a meticulous testing process, several vulnerabilities can start to show. These vulnerabilities may include SQL injection, Cross-Site Scripting (XSS), Cross-Site Request Forgery (CSRF) and other critical risks identified by the Open Web Application Security Project (OWASP).</p>\n<p><strong>Network testing</strong></p>\n<p>Here, the focus shifts to an organization&rsquo;s network infrastructure. Network pentesting aims to identify weak spots in internal and external networks that attackers could leverage.</p>\n<p>This type of testing can reveal vulnerabilities related to insecure protocols, misconfigured firewalls, unpatched network devices or weak <span class=\"resolved\">network device</span> passwords. The insights from network testing can be invaluable in fortifying the organization&rsquo;s first line of digital defense.</p>\n<p><strong>Personnel testing</strong></p>\n<p>Often overlooked, personnel testing is a vital aspect of a comprehensive pentesting strategy. Also known as social engineering testing, this approach targets the human element within an organization.</p>\n<p>It involves simulated phishing attacks, pretexting, baiting and other tactics designed to trick employees into revealing sensitive information or granting unauthorized access. The results of personnel testing can inform targeted cybersecurity training and awareness programs.</p>\n<p><strong>Hardware testing</strong></p>\n<p>Last but not least, hardware testing involves probing physical devices such as servers, workstations, network routers and switches for vulnerabilities. This could mean exploiting firmware vulnerabilities, USB ports or other physical access points. In an age where IoT devices are proliferating, hardware testing is becoming increasingly important to ensure the security of all interconnected devices.</p>\n<h2>How is Pentesting as a Service (PTaaS) different?</h2>\n<p>Pentesting as a Service (PTaaS) is an emerging cybersecurity concept quickly gaining traction. With its innovative approach and numerous advantages, PTaaS enables organizations to efficiently and effortlessly carry out penetration tests.</p>\n<p>By harnessing the power of the cloud and offering on-demand accessibility, PTaaS streamlines the testing process, enhances scalability and provides more flexibility for organizations.</p>\n<p>So, how is PTaaS different from traditional pentesting? Below are some key distinctions:</p>\n<p><strong>Continuous testing</strong></p>\n<p>Traditional pentesting provides a snapshot of your security posture at a specific moment. However, with the ever-evolving nature of cyber threats, this approach may not accurately assess ongoing security risks. In contrast, PTaaS offers continuous testing capabilities, allowing you to constantly monitor your systems for vulnerabilities. This ensures that your defenses are always up-to-date and effective.</p>\n<p><strong>Scalability and flexibility</strong></p>\n<p>With PTaaS, you can scale your testing efforts up or down based on your current needs. This flexibility is particularly beneficial for businesses with fluctuating demand or those undergoing rapid growth. Traditional pentesting, with its more rigid structure, may not offer the same level of scalability.</p>\n<p><strong>Real-time reporting and collaboration</strong></p>\n<p>One of the standout features of PTaaS is its real-time reporting capabilities. Through a dedicated platform, stakeholders can view test results in real-time, track progress and even collaborate directly with testers. This level of transparency and collaboration is rarely found in traditional pentesting.</p>\n<p><strong>Cost-effectiveness</strong></p>\n<p>PTaaS operates on a subscription model, which can be more cost-effective than hiring external pentesters or maintaining an in-house team. You pay for what you use, making it an affordable option for many businesses.</p>\n<p><strong>Integration with DevOps</strong></p>\n<p>PTaaS solutions can often integrate seamlessly with existing DevOps workflows. This integration allows for regular code scanning in the development phase, enabling early detection and remediation of vulnerabilities.</p>\n<h2>Are there any disadvantages of PTaaS when compared to traditional pentesting?</h2>\n<p>As with any technology or service, PTaaS has potential drawbacks. While it offers numerous advantages over traditional pentesting, there are a few considerations that organizations should bear in mind:</p>\n<ol>\n<li><strong>Potential for oversights. </strong>Automated scanning tools used in PTaaS are great for identifying common vulnerabilities quickly, but they may miss complex or business logic-based vulnerabilities that a human pentester might catch. Traditional pentesting, particularly when carried out by experienced professionals, can sometimes provide a deeper, more nuanced understanding of your security posture.</li>\n<li><strong>Less customization.</strong> While PTaaS offers scalability and flexibility, it may not meet the specific security requirements of every organization. A one-size-fits-all approach may not be effective for addressing unique security needs.</li>\n<li><strong>Data security concerns. </strong>Given that PTaaS operates in a cloud-based environment, there could be concerns about the security of sensitive data. While most providers have stringent security measures in place, it&rsquo;s important to understand how your data will be handled and protected.</li>\n<li><strong>Limited scope.</strong>&nbsp;Some PTaaS solutions might only focus on certain security aspects, such as web application testing, and may not comprehensively evaluate all potential attack vectors. In contrast, traditional pentesting can cover many areas, from network and application testing to social engineering and physical security tests.</li>\n</ol>\n<h2><span class=\"resolved\">Choose the right solution for your organization</span></h2>\n<p>Ultimately, the decision between traditional pentesting and PTaaS will depend on the organization&rsquo;s specific needs and budget. A combination of both approaches can provide the best outcome for most businesses.</p>\n<p>While specific tasks may be best suited to a traditional pentesting approach, others can benefit from the cost-effectiveness and scalability of PTaaS. The key is identifying where you need the most help and choosing the option that best meets your security requirements.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/pentesting-vs-pentesting-as-a-service/\">Pentesting vs. Pentesting as a Service: Which is better?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"The evolution of ransomware: Lessons for the future","link":"https://securityintelligence.com/posts/the-evolution-of-ransomware-lessons/","dc:creator":{"#cdata-section":"MacKenzie Milligan"},"pubDate":"Tue, 14 Nov 2023 14:00:00 +0000","category":[{"#cdata-section":"Risk Management"},{"#cdata-section":"ransomware attacks"},{"#cdata-section":"ransomware examples"},{"#cdata-section":"ransomware as a service"},{"#cdata-section":"history of ransomware"},{"#cdata-section":"cloud-aware ransomware"},{"#cdata-section":"Artificial Intelligence (AI)"},{"#cdata-section":"Extortion"},{"#cdata-section":"Linux"},{"#cdata-section":"Ransomware"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446711"},"description":{"#cdata-section":"<p>Ransomware has been part of the cyber crime ecosystem since the late 1980s and remains a major threat in the cyber landscape today. Evolving ransomware attacks are becoming increasingly more sophisticated as threat actors leverage vulnerabilities, social engineering and insider threats. While the future of ransomware is full of unknown threats, we can look to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/the-evolution-of-ransomware-lessons/\">The evolution of ransomware: Lessons for the future</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>Ransomware has been part of the cyber crime ecosystem since the late 1980s and remains a major threat in the cyber landscape today. Evolving <a href=\"https://www.ibm.com/topics/ransomware\"  target=\"_blank\" rel=\"noopener nofollow\" ><span class=\"resolved\">ransomware attacks</span></a> are becoming increasingly more sophisticated as threat actors leverage vulnerabilities, social engineering and insider threats. While the future of ransomware is full of unknown threats, we can look to the past and recent trends to predict the future.</p>\n<h2>2005 to 2020: A rapidly changing landscape</h2>\n<p>While the first ransomware incident was observed in 1989, <a href=\"https://www.trendmicro.com/vinfo/us/security/research-and-analysis/predictions/2023\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >ransomware attacks</a> rapidly escalated in 2005.</p>\n<ul>\n<li>In 2005, the Archiveus trojan was the first ransomware to use RSA and asymmetrically encrypt all files in the &ldquo;<a href=\"https://flashpoint.io/blog/the-history-and-evolution-of-ransomware-attacks/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >My Documents</a>&rdquo; folder.</li>\n<li>In 2009, a virus emerged dubbed <a href=\"https://flashpoint.io/blog/the-history-and-evolution-of-ransomware-attacks/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Vundo</a> that encrypted computers and sold decryptors, allowing groups to obtain more profit.</li>\n<li>In 2012, a new tactic emerged known as <a href=\"https://flashpoint.io/blog/the-history-and-evolution-of-ransomware-attacks/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >&ldquo;scareware,&rdquo;</a> which contained messages claiming to be law enforcement and suggested the victim needed to pay to avoid prosecution. Scareware resulted in increased payments to threat actors.</li>\n<li><a href=\"https://flashpoint.io/blog/the-history-and-evolution-of-ransomware-attacks/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Between 2013 and 2016</a>, ransomware became more widespread across the globe, spreading via botnets. In addition, the first true ransomware for Mac increased the opportunity for even more victims.</li>\n<li>In 2016, the first <a href=\"https://socradar.io/evolution-of-ransomware-so-far-and-hereafter/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Ransomware-as-Service</a> (RaaS) variants were observed. The development of RaaS eliminated the need for threat actors to develop their own malware, allowing inexperienced groups to successfully target organizations. This contributed to an increase in ransomware attacks.</li>\n<li><a href=\"https://flashpoint.io/blog/the-history-and-evolution-of-ransomware-attacks/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Between 2019 and 2020</a>, ransomware groups created dedicated leak sites that put more pressure on victims to pay the ransom to avoid the potential threat of publication of stolen data, resulting in further financial loss for victims. This threat actor tactic was popularly named &ldquo;double extortion.&rdquo;</li>\n</ul>\n<h2>2021 to present: More attacks, greater sophistication</h2>\n<p>Ransomware continues to be a relevant threat in today&rsquo;s environment. Since 2021, ransomware groups have become more sophisticated by updating their tactics, forming new groups, finding new targets and taking advantage of outside factors. These changes are important for ransomware groups to stay ahead of security measures and help secure larger ransom payments.</p>\n<p><strong>Tactics, techniques and procedure (TTP) changes</strong></p>\n<p>Groups still employ double extortion tactics; however, certain groups now use &ldquo;<a href=\"https://securityintelligence.com/articles/triple-extortion-erased-data-new-ransomware-norm/\"  target=\"_blank\" rel=\"noopener nofollow\" >triple extortion</a>&rdquo; and &ldquo;<a href=\"https://socradar.io/evolution-of-ransomware-so-far-and-hereafter/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >quadruple extortion</a>&rdquo; tactics to convince victims to pay ransom. Triple extortion increases the potential of a victim paying the ransom, especially for critical infrastructure organizations. In triple extortion, threat actors threaten distributed denial of service (DDoS) attacks in addition to encrypting systems and exposing data if a ransom is not paid, potentially resulting in long periods of downtime for public-private interdependent sectors like the government, healthcare or utilities. In comparison to triple extortion, quadruple extortion pressures victims by contacting customers and business partners, informing them that their sensitive information has been stolen. This adds another layer of pressure for the victims to pay.</p>\n<p>To gain initial access to victims, ransomware groups employ various methods, including contacting individuals who work within the target organization (<a href=\"https://securityintelligence.com/posts/detecting-insider-threats-leverage-user-behavior-analytics/\"  target=\"_blank\" rel=\"noopener nofollow\" >insider threat</a>), posting advertisements requesting initial access to a specific target and working with initial access brokers who sell existing access to various targets.</p>\n<p><a href=\"https://www.crowdstrike.com/wp-content/uploads/2023/02/2023-Global-Threat-Report-Executive-Summary.pdf\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" ><span class=\"resolved\">According to CrowdStrike</span></a>, 2022 saw an increase in initial access broker offerings, with more than 2,500 posts offering initial access and the top sector offerings for these posts, including academia and technology companies. This was a 112% increase in comparison to 2021, making it clear that ransomware groups have an interest in purchasing initial access instead of doing it on their own.</p>\n<a class=\"btn orange1 large\" href=\"https://www.ibm.com/reports/threat-intelligence?utm_medium=OSocial&amp;utm_source=Blog&amp;utm_content=RSRWW&amp;utm_id=SI-Blog-CTA-Button-XFTII-2023\" >Read the Threat Intelligence Index</a>\n<p><strong>Even more new ransomware groups</strong></p>\n<p>Many factors could have led to the increase in new <a href=\"https://www.zscaler.com/resources/industry-reports/2023-threatlabz-ransomware-report.pdf?_ga=2.44894756.1642523648.1691503579-1676295557.1691503579&amp;_gac=1.208849446.1691503604.EAIaIQobChMIg77S653NgAMVyDHUAR18_gyPEAAYASAAEgJxyfD_BwE&amp;_gl=1*g0xoel*_ga*MTY3NjI5NTU1Ny4xNjkxNTAzNTc5*_ga_10SPJ4YJL9*MTY5MTUwMzU3OS4xLjEuMTY5MTUwMzg3NS4yNC4wLjA.\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >ransomware groups</a>, including affiliates working for more than one group and code leaks. Since 2021, many observed ransomware source code and builder leaks have enabled groups with little-to-no experience to create or modify their ransomware. <a href=\"https://blog.talosintelligence.com/code-leaks-new-ransomware-actors/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Code leaks,</a> including Babuk, Conti, Lockbit3.0 and Chaos, have allowed new groups to produce more frequent attacks, thereby changing the threat landscape. However, researchers have observed that groups that use these leaked builders tend to ask for a lower ransom payment. This may indicate that these groups are trying to avoid attention while testing their new variants.</p>\n<p><strong>Targeting Linux and ESXi machines</strong></p>\n<p>Ransomware groups continue to target operating systems and platforms such as <a href=\"https://www.darkreading.com/vulnerabilities-threats/linux-ransomware-poses-significant-threat-to-critical-infrastructure\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Linux or ESXi machines</a>. These are prime targets because they often host file servers, databases and web servers. Groups will also create Linux encryption with the purpose of specifically encrypting ESXi virtual machines. Linux continues to be the most popular operating system for embedded, constrained and Internet of Things devices used by critical infrastructure sectors like manufacturing and energy. In addition, attacks on Linux systems <a href=\"https://www.cynet.com/ransomware/linux-ransomware-attack-anatomy-examples-and-protection/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >increased by 75% in 2022</a> and will likely continue to increase in the latter half of 2023.</p>\n<p><strong>Influence of global and geopolitical factors</strong></p>\n<p>Recent <a href=\"https://www.verizon.com/about/news/ransomware-threat-rises-verizon-2022-data-breach-investigations-report\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >global and geopolitical factors</a> have also influenced the increase in ransomware attacks. Global factors, including COVID-19, made the healthcare sector an appealing target, whether to obtain information on vaccines or an opportunistic attack where overwhelmed hospitals were more likely to pay a ransom. Geopolitical tensions and sanctions also continue to influence ransomware attacks. APT groups linked to governments in Russia, North Korea and China have utilized ransomware for financial gain and disruption.</p>\n<h2>How will ransomware continue to evolve?</h2>\n<p>Ransomware attacks will continue to evolve and become more sophisticated, advanced and targeted. Threat actors are mastering a new technique where attackers exploit vulnerabilities in the supply chain to launch large extortion campaigns. For instance, this year, Cl0p ransomware infiltrated <a href=\"https://www.techtarget.com/searchsecurity/news/366539278/Ransomware-actors-exploiting-MoveIt-Transfer-vulnerability\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >MOVEit</a>, a secure managed file transfer application, which continues to impact hundreds of companies. For a bigger payout, threat actors will likely continue to find initial access to companies that many organizations rely on.</p>\n<p>There will likely be an increase in <a href=\"https://www.sentinelone.com/cybersecurity-101/cloud-ransomware-understanding-and-combating-this-evolving-threat/#:~:text=Cloud%20ransomware%20is%20a%20type,and%20release%20the%20affected%20data.\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >cloud-aware ransomware</a> due to companies continuing to move their critical data into cloud storage. Ransomware groups could exploit cloud services, applications and infrastructure to gain initial access. It is an attractive opportunity for threat actors due to the larger amounts of critical information available to target and hold for ransom.</p>\n<p>Groups will continue to use <a href=\"https://www.forbes.com/sites/forbestechcouncil/2023/02/01/intermittent-encryption-is-a-growing-ransomware-threat-that-requires-a-proactive-cyber-defense/?sh=652218ef56af\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >intermittent encryption</a>, a process where only parts of files are encrypted. The encryption is able to avoid products like endpoint security and extended detection and response, which makes it harder for a security system to detect it. By only encrypting specific lines of data, intermittent encryption also enables a faster decryption process, which might entice a victim to pay the ransom.</p>\n<p><a href=\"https://www.zscaler.com/resources/industry-reports/2023-threatlabz-ransomware-report.pdf?_ga=2.44894756.1642523648.1691503579-1676295557.1691503579&amp;_gac=1.208849446.1691503604.EAIaIQobChMIg77S653NgAMVyDHUAR18_gyPEAAYASAAEgJxyfD_BwE&amp;_gl=1*g0xoel*_ga*MTY3NjI5NTU1Ny4xNjkxNTAzNTc5*_ga_10SPJ4YJL9*MTY5MTUwMzU3OS4xLjEuMTY5MTUwMzg3NS4yNC4wLjA.\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Encryptionless</a> ransom attacks will also continue; these are known as extortion or data theft attacks. These attacks have been used for many years and continue to trend up and down, depending on the need and threat actor sophistication. In these attacks, groups steal data and threaten to expose it instead of encrypting it.</p>\n<p>With the <a href=\"https://www.trendmicro.com/vinfo/us/security/research-and-analysis/predictions/2023\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >development</a> of artificial intelligence (AI) and AI models like ChatGPT, ransomware groups will likely follow the trend and utilize <a href=\"https://securityintelligence.com/articles/what-to-know-about-new-generative-ai-tools-for-criminals/\"  target=\"_blank\" rel=\"noopener nofollow\" >AI tools</a> like chatbots, AI-developed malware, automated processes and machine learning algorithms. AI will likely help groups develop more advanced and sophisticated techniques to evade current ransomware prevention and guidance. We can expect all types of ransomware threat actors to leverage AI to help them complete successful attacks.</p>\n<h2>Learning from the past</h2>\n<p>Looking back on the evolution of ransomware makes one thing clear: the future of cybersecurity is likely to be as unpredictable as its past. Still, the history of ransomware attacks offers much to learn. By maintaining a solid and adaptable cybersecurity strategy, organizations have a better chance of navigating the challenges to come.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/the-evolution-of-ransomware-lessons/\">The evolution of ransomware: Lessons for the future</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Empowering cybersecurity leadership: Strategies for effective Board engagement","link":"https://securityintelligence.com/posts/empowering-cybersecurity-leadership-strategies-for-effective-board-engagement/","dc:creator":{"#cdata-section":"Claire Nuñez"},"pubDate":"Mon, 13 Nov 2023 14:00:00 +0000","category":[{"#cdata-section":"CISO"},{"#cdata-section":"X-Force"},{"#cdata-section":"Chief Information Security Officer (CISO)"},{"#cdata-section":"Cybersecurity"},{"#cdata-section":"Data Protection"},{"#cdata-section":"Data Security"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446704"},"description":{"#cdata-section":"<p>With the increased regulation surrounding cyberattacks, more and more executives are seeing these attacks for what they are &#8211; serious threats to business operations, profitability and business survivability. But what about the Board of Directors? Are they getting all the information they need? Are they aware of your organization&#8217;s cybersecurity initiatives? Do they understand why [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/empowering-cybersecurity-leadership-strategies-for-effective-board-engagement/\">Empowering cybersecurity leadership: Strategies for effective Board engagement</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>With the <a href=\"https://www.sec.gov/news/press-release/2023-139\" target=\"_blank\" rel=\"noopener nofollow\" >increased regulation surrounding cyberattacks</a>, more and more executives are seeing these attacks for what they are &ndash; serious threats to business operations, <a >profitability and business </a>survivability. But what about the Board of Directors? Are they getting all the information they need? Are they aware of your organization&rsquo;s cybersecurity initiatives? Do they understand why those initiatives matter? Maybe not.</p>\n<p><a >According to </a><a href=\"https://hbr.org/2023/05/boards-are-having-the-wrong-conversations-about-cybersecurity\" target=\"_blank\" rel=\"noopener nofollow\" >Harvard Business Review</a>, only 47% of board members regularly engage with their CISO. <a >There appears to be a huge disconnect between cybersecurity reality and Board of Director awareness.</a><a href=\"#_msocom_5\" ></a> And in the case of a cyber crisis, your organization&rsquo;s Board may be critical in making those key decisions that customers/clients, the public and now regulatory bodies further require.</p>\n<h2><b>The value of engaging the Board of Directors</b></h2>\n<p>As evidenced by the <a href=\"https://www.ibm.com/reports/data-breach\" >Cost of a Data Breach Report 2023</a>, cyberattack and data breach costs are increasing year over year. In 2023, the cost of a data breach has increased by 15.3% since 2020. The attack surface of many organizations is also increasing with digital transformation efforts.</p>\n<p>With recovery costs skyrocketing and more technology to secure, boards need to be involved in key decisions and they should be aware of what kinds of protections are in place. Boards of Directors are responsible for ensuring an organization stays profitable and accountable to its stakeholders. An ill-informed board may be frustrated <a >and left with the feeling of being </a>unprepared in the case of a cyber crisis. It is better to inform them of security-related efforts sooner rather than later.</p>\n<p>For several years, the U.S. Securities and Exchange Commission (SEC) has been flirting with the idea of implementing <a href=\"https://www.sec.gov/files/rules/proposed/2022/33-11038.pdf\" target=\"_blank\" rel=\"noopener nofollow\" >cybersecurity requirement</a>s that fall upon the Board of Directors for compliance and ownership. The most recent proposed rule requires public companies to disclose if board members have appropriate cybersecurity expertise and adequate awareness to respond to a cyber crisis within their organization. This requirement represents a growing desire for organizations to take more ownership of data security and enlists additional attack consequences of cyber crisis activities upon the Board of Directors and those who are responsible for informing and arming them with critical crisis response capabilities.</p>\n<h2><b>How cybersecurity leadership can foster a strong relationship <a >with the Board of Directors</a></b></h2>\n<p>Engaging the board of directors may seem like a difficult task, but there are steps an organization can take to ensure that the Board of Directors is aligned with cybersecurity goals and objectives.</p>\n<p><strong><a >Step 1: </a><a href=\"https://securityintelligence.com/articles/educating-your-board-of-directors-on-cybersecurity/\" >Educate your Board</a></strong></p>\n<ul>\n<li>Be sure to provide an overview of the latest regulations impacting your organization and the locations it operates in. Those not in security roles may not know the intricacies of breach notification timelines or the thresholds for disclosure.</li>\n<li>Ensure the board knows how security teams operate within your organization. Make sure they have awareness of the different vendors that are used to augment a response. In addition, familiarizing your board members with response plans, even at a high level, can further elevate the connection between cybersecurity leadership and board members.</li>\n</ul>\n<p><strong>Step 2: Develop a common vernacular with board members</strong></p>\n<ul>\n<li>Establish a common security language with your board. This means ensuring everyone knows what acronyms stand for (ahem, CSIRP, CSERT and the like &ndash; they&rsquo;ve become second nature to security professionals but not everyone else). Also, determine a baseline understanding of general security terms and threats. It is better to have a common definition within your organization.</li>\n<li>Define what a crisis is&mdash;and isn&rsquo;t. By establishing a <a href=\"https://www.ibm.com/services/incident-response\" >Cyber Crisis Management Plan</a>, your organization will have baseline qualification criteria and definitions. We&rsquo;ve seen it many times before, when teams don&rsquo;t agree on these <i>before</i> a crisis, it causes a plethora of issues.</li>\n</ul>\n<p><strong>Step 3: <a >Enlist support</a></strong></p>\n<ul>\n<li>Enlist both internal and external resources to support your cybersecurity initiatives. Mobilize your organization&rsquo;s C-Suite to foster a deep security culture across the organization.</li>\n<li>Providing a quality threat intelligence briefing to your Board of Directors can provide awareness and perspective that is tailored to the strategic goals board members care about. <a href=\"https://www.ibm.com/services/threat-intelligence\"  target=\"_blank\" rel=\"noopener nofollow\" >IBM X-Force Threat Intelligence</a> is poised to provide this tailored threat intelligence to your Board of Directors. X-Force has a wealth of knowledge that can help your organization&rsquo;s Board prepare and understand.</li>\n<li>Find support within the Board itself &ndash; some people, including board members, are security nerds at heart. Engage those individuals more and they&rsquo;ll be your champions. Help them learn more. You may even have a cybersecurity expert on the board already.</li>\n</ul>\n<p><strong>Step 4: Communicate with the Board effectively</strong></p>\n<ul>\n<li>Provide the board with monthly or quarterly high-level security updates highlighting key efforts including product implementation, tabletop or simulation findings and any other important security activities.</li>\n<li>Be sure to keep conversations non-technical and provide key metrics. These stakeholders don&rsquo;t need all the nitty gritty details, but it is helpful for them to know roles, timelines and when they need to be involved. Remember that a security response is a whole-of-business job and the Board is a part of that.</li>\n<li>Keep the line of communication open and involve the Board in any security newsletters or internal awareness campaigns.</li>\n</ul>\n<p><strong>Step 5: Practice</strong></p>\n<ul>\n<li>If your board of directors wants a more hands-on and immersive scenario, the <a href=\"https://www.ibm.com/services/security-operations-center\" >IBM X-Force Cyber Range</a> has Business Response Challenges geared toward this audience. The team engages board members in conversations around regulations, business impact and health and safety. These experiences give board members the opportunity to respond to a cyberattack in a safe environment.</li>\n</ul>\n<p>Engaging and communicating with your board of directors doesn&rsquo;t have to be a daunting task. Take the time to understand members&rsquo; concerns and bring them meaningful updates, threat intelligence and metrics. The hardest part is opening the line of conversation and determining what each party needs. Once the relationship is developed, security teams and the Board will be able to converse more easily and effectively, and your organization will be better poised to protect itself.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/empowering-cybersecurity-leadership-strategies-for-effective-board-engagement/\">Empowering cybersecurity leadership: Strategies for effective Board engagement</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Data security tools make data loss prevention more efficient","link":"https://securityintelligence.com/articles/data-security-tools-make-data-loss-prevention-more-efficient/","dc:creator":{"#cdata-section":"Josh Nadeau"},"pubDate":"Wed, 08 Nov 2023 14:00:00 +0000","category":[{"#cdata-section":"Data Protection"},{"#cdata-section":"IBM discover and classify"},{"#cdata-section":"data security tools"},{"#cdata-section":"Data Loss"},{"#cdata-section":"Data Loss Prevention (DLP)"},{"#cdata-section":"Data Security"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446692"},"description":{"#cdata-section":"<p>As businesses navigate the complexities of modern-day cybersecurity initiatives, data loss prevention (DLP) software is the frontline defense against potential data breaches and exfiltration. DLP solutions allow organizations to detect, react to and prevent data leakage or misuse of sensitive information that can lead to catastrophic consequences. However, while DLP solutions play a critical role [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/data-security-tools-make-data-loss-prevention-more-efficient/\">Data security tools make data loss prevention more efficient</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>As businesses navigate the complexities of modern-day cybersecurity initiatives, data loss prevention (DLP) software is the frontline defense against potential data breaches and exfiltration. DLP solutions allow organizations to detect, react to and prevent data leakage or misuse of sensitive information that can lead to catastrophic consequences.</p>\n<p>However, while DLP solutions play a critical role in cybersecurity, their effectiveness significantly improves when integrated with the right tools and infrastructure.</p>\n<h2>Key limitations of DLP solutions (and how to overcome them)</h2>\n<p>DLP solutions are invaluable tools in the fight against data breaches, providing a frontline defense that monitors, detects and blocks sensitive data across various platforms. But despite their significant contributions to data security, they do have limitations that can hamper their effectiveness. By keeping the following limitations in mind, you can ensure your organization remains well-protected.</p>\n<p><strong>1. The high-maintenance nature of DLP</strong></p>\n<p>One of the primary challenges is the high-maintenance nature of DLP solutions. These tools often require extensive upkeep, tuning and supervision, which can be resource-intensive. Regular updates and configurations are necessary to keep the systems up-to-date and effective, leading to a significant allocation of time and effort from your IT team.</p>\n<p><strong>2. Partial data discovery</strong></p>\n<p>Another limitation relates to data discovery. Traditional DLP solutions often deliver only partial discovery data. This means they may not capture all instances of sensitive data, leaving potential vulnerabilities unaddressed. This partial visibility can result in gaps in your data protection strategy, making breaches easier.</p>\n<p><strong>3. Lack of lineage and accurate tracking</strong></p>\n<p>DLP solutions also often lack lineage, transaction analysis and accurate data tracking in motion. The absence of these features results in an incomplete picture of your data&rsquo;s journey. This lack of a holistic approach to data security leads to inadequate enforcement of overly restrictive policies, numerous false positives and poor user experience. Without full visibility and understanding of how data moves within and outside of your organization, it becomes challenging to implement effective data protection measures.</p>\n<p><strong><span class=\"resolved\">4. Struggling with the shift to cloud</span></strong></p>\n<p>The move towards cloud computing has also posed a new challenge for DLP solutions. As businesses increasingly migrate their data storage and operations to the cloud, the number of locations where copies of sensitive data exist has exponentially increased. Unfortunately, traditional DLP solutions cannot keep up with this shift, often struggling to maintain comprehensive coverage across an ever-expanding digital landscape.</p>\n<h2><strong>Benefits of integrating DLP with <span class=\"resolved\">data security tools</span></strong></h2>\n<p>Integrating DLP solutions with additional <a href=\"https://www.ibm.com/guardium?utm_content=SRCWW&amp;p1=Search&amp;p4=43700074604556223&amp;p5=p&amp;gclid=Cj0KCQjwpc-oBhCGARIsAH6ote_7LPNOBQvo1DZcdvfOkdiLqlb_c7BolYsvGUXurmrun6ItO3kReLoaAvAQEALw_wcB&amp;gclsrc=aw.ds\"  target=\"_blank\" rel=\"noopener nofollow\" >data security tools</a> can significantly improve your organization&rsquo;s data protection strategy. This combination offers several key benefits that address the limitations of standalone DLP solutions, enhancing their effectiveness and efficiency.</p>\n<p><strong>1. Enhanced data protection</strong></p>\n<p>You can achieve a more comprehensive and robust data protection framework by integrating DLP with data security tools. These additional tools can fill the gaps left by DLP solutions, ensuring that all sensitive data is adequately protected. For instance, data security tools can provide full discovery data, enabling your organization to locate and protect all instances of sensitive information.</p>\n<p><strong>2. Comprehensive data discovery and tracking</strong></p>\n<p>Data security tools can provide the lineage tracking, transaction analysis and data tracking tools that DLP solutions alone may lack. These features provide a holistic view of your data&rsquo;s journey, allowing for better understanding and control over how data moves within and outside your organization. This comprehensive visibility significantly reduces the risk of data breaches.</p>\n<p class=\"wc-normal\" style=\"font-size: 16px; line-height: 24px;\"><strong>3. Reduced maintenance and resource allocation</strong></p>\n<p>Data security tools can automate many tasks associated with maintaining DLP solutions. This automation reduces the manual effort required, freeing up resources that can be better used elsewhere. In addition, these tools can also enhance the efficiency of your DLP solution, reducing false positives and minimizing the enforcement of overly restrictive policies.</p>\n<p><strong>4. Improved adaptability to cloud migration</strong></p>\n<p>With most organizations transitioning their operations to the cloud, it is crucial for data security tools to adapt to this change. These tools are engineered to function efficiently in cloud settings, guaranteeing that confidential data is safeguarded irrespective of location. By incorporating these tools into your DLP solution, you can facilitate a smooth migration to the cloud without jeopardizing data security.</p>\n<h2><strong>Get the most out of your data loss prevention solution</strong></h2>\n<p>While DLP solutions can provide excellent protection against data loss, they must be augmented with the right data security tools to maximize their effectiveness. By integrating these tools into your DLP solution, you can reduce resource allocation and maintenance and improve the adaptability and visibility of your sensitive information.</p>\n<p><a href=\"https://www.ibm.com/products/ibm-security-discover-and-classify\"  target=\"_blank\" rel=\"noopener nofollow\" >IBM Security Discover and Classify</a> is the leading solution for effectively discovering and classifying sensitive data at scale, whether at rest or in motion. Seamlessly extending traditional DLP solutions, IBM Security Discover and Classify provides a comprehensive set of flexible tools that complement and leverage DLP capabilities. This holistic solution meets all data loss prevention needs and enables seamless discovery, analysis, lineage and more.</p>\n<p>Integrating IBM Security Discover and Classify with a DLP solution can extend data loss prevention capabilities and save valuable time. With the ability to identify sensitive data, label it accurately and respond quickly to threats, you can maintain secure operations with minimal disruption. This leads to an improved security posture and greater efficiency in responding to data loss events.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/data-security-tools-make-data-loss-prevention-more-efficient/\">Data security tools make data loss prevention more efficient</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"NIST’s security transformation: How to keep up","link":"https://securityintelligence.com/articles/nist-security-transformation-how-to-keep-up/","dc:creator":{"#cdata-section":"Sue Poremba"},"pubDate":"Tue, 07 Nov 2023 14:00:00 +0000","category":[{"#cdata-section":"Government"},{"#cdata-section":"digital transformation"},{"#cdata-section":"cybersecurity transformation"},{"#cdata-section":"security transformation"},{"#cdata-section":"Artificial Intelligence (AI)"},{"#cdata-section":"National Institute of Standards and Technology (NIST)"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446673"},"description":{"#cdata-section":"<p>One thing that came out of the pandemic years was a stronger push toward an organization-wide digital transformation. Working remotely forced companies to integrate digital technologies, ranging from cloud computing services to AI/ML, across business operations to allow workers to keep up high production and efficiency standards. Now that businesses and consumers have adjusted to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/nist-security-transformation-how-to-keep-up/\">NIST&#8217;s security transformation: How to keep up</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>One thing that came out of the pandemic years was a stronger push toward an organization-wide digital transformation. Working remotely forced companies to integrate digital technologies, ranging from cloud computing services to AI/ML, across business operations to allow workers to keep up high production and efficiency standards.</p>\n<p>Now that businesses and consumers have adjusted to the new normal of digital transformation, it is time to develop a security transformation strategy.</p>\n<h2>Coping with the speed of change</h2>\n<p>A constantly evolving tech environment means that security needs and systems are constantly shifting. For an easy example, just look at how quickly cybersecurity must change to adapt to generative AI. In less than a year, organizations and cybersecurity analysts are searching for ways to use generative AI to<a href=\"https://securityintelligence.com/posts/using-chatgpt-as-an-enabler-for-risk-and-compliance/\"  target=\"_blank\" rel=\"noopener nofollow\" > improve cyber defenses</a>, while threat actors have already discovered ways to launch more sophisticated and harder-to-detect attacks (<a href=\"https://securityintelligence.com/articles/chatgpt-confirms-data-breach/\"  target=\"_blank\" rel=\"noopener nofollow\" >not to mention targeting the AI tool itself).</a></p>\n<p>Like any transformation, the problem is knowing where to start and what needs to be updated. Luckily, the security transformation has blueprints to follow, starting with the National Institute of Standards and Technology (NIST) Cybersecurity Framework (CSF). From there, organizations can use reference points such as recent White House Executive Orders around cybersecurity readiness and state, federal, industry and international data privacy compliance regulations. Cybersecurity insurance requirements provide more useful guidelines.</p>\n<p>And like the digital transformation, the security transformation will evolve to fit your organization&rsquo;s needs. There may be some push to move quickly &mdash; you want protections or policies in place for a ransomware attack sooner rather than later, for instance. However, it is better to be methodical to ensure that you are building the right security program for your needs.</p>\n<h2>The NIST CSF update offers an example for your transformation</h2>\n<p>The <a href=\"https://www.nist.gov/news-events/news/2014/02/nist-releases-cybersecurity-framework-version-10\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >original NIST CSF </a>was released in 2014 and was designed to improve security around critical infrastructure. It was developed from an Executive Order released by the Obama White House in 2013 to provide &ldquo;a consensus description of what&rsquo;s needed for a comprehensive cybersecurity program,&rdquo; according to then-Under Secretary of Commerce for Standards and Technology and NIST Director Patrick D. Gallagher.</p>\n<p>However, ten months is a long time in our digital society, let alone ten years. When NIST CSF 1.0 was introduced, it was revolutionary for its era. It also came before cloud computing was part of every business environment, before ransomware was shutting down hospitals and casinos and before APIs became a major attack vector. In fact, smartphones were still in their early years, and BYOD was a fairly new term.</p>\n<p>&ldquo;NIST is updating the Framework to account for the changes in the cybersecurity landscape, including changes in threats, technologies and standards,&rdquo; Cherilyn Pascoe, lead developer of the framework, told <a href=\"https://www.cybersecuritydive.com/news/nist-draft-overhaul-cybersecurity-framework/690381/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Cybersecurity Dive.</a></p>\n<a class=\"btn orange1 large\" href=\"https://www.ibm.com/thought-leadership/institute-business-value/en-us/report/ceo-generative-ai/cybersecurity\" ><em>Related: CEO&rsquo;s guide to generative AI &ndash; Cybersecurity</em></a>\n<h2>New guidelines bring NIST into the future</h2>\n<p>CSF 2.0 is a methodical update. In February 2022, NIST put out a request for information, asking for guidance from tech and cybersecurity companies on how to best update CSF, as well as address the growing threat around supply chain risks. NIST then opened up the framework for public comments before the final version of CSF 2.0 goes live.</p>\n<p>Despite being designed for those industries that make up the critical infrastructure, such as utilities, gas and oil, CSF 1.0 was used as a guide across industries trying to figure out how to best introduce cybersecurity into their organizations. <a href=\"https://csrc.nist.gov/News/2023/just-released-nist-csf-2-0-reference-tool#:~:text=The%20CSF%202.0%20draft%20reflects,Friday%2C%20November%204%2C%202023.\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >CSF 2.0</a> builds on what worked in the original while adding &ldquo;an expanded scope, the addition of a sixth function, Govern and improved and expanded guidance on implementing the CSF &mdash; especially for creating profiles.&rdquo;</p>\n<p>NIST recognized that while CSF 1.0 added value, it was no longer meeting the cybersecurity challenges industries face today. NIST is following a similar <a href=\"https://www.nist.gov/itl/ai-risk-management-framework\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >framework</a> path to address the security concerns around AI. A <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >White House Executive Order</a> expounds on the value of a zero trust model, and the <a href=\"https://fedtechmagazine.com/article/2021/08/what-cybersecurity-maturity-model-certification-and-how-can-it-be-achieved-perfcon\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Department of Defense introduced the Cybersecurity Maturity Model Certification</a> in 2020 to ensure that defense contractors were meeting cybersecurity standards, but the CMMC framework continues to evolve and change.</p>\n<h2>Why your organization needs a methodical security transformation</h2>\n<p>There are two important takeaways from these government initiatives. First, the federal government sees the importance of nationwide standards to protect sensitive information critical to business operations and consumer personal security. Second, while nothing ever happens quickly when it involves the government, this methodical system of creating and updating these frameworks shows that security transformation takes a lot of thought, a lot of planning and a lot of time.</p>\n<p>Completing your organization should also be done in a methodical, deliberative manner. As security analysts repeat on a loop, there is no one-size-fits-all solution. There are risks that are similar and threat actors do have favored attack vectors and attack types. But, the threats facing your organization are uniquely yours, and it is time to transform your security program to meet your needs.</p>\n<h2>Where to get started</h2>\n<p>It begins with a thorough evaluation of what you are protecting, the biggest risk factors to your industry and business operations, the regulatory compliances you are required to follow and the type of threats and attacks you&rsquo;ve dealt with in the past. Tools that offer full visibility into your infrastructure and that provide identity management solutions are a starting point. Deploying least privilege principles and MFA can be an immediate solution to one of the top security problems today &mdash; credential theft.</p>\n<p>You may need a managed security service provider to help with your security transformation. The MSSP can provide a range of tools, like data loss prevention (DLP), extended detection and response (EDR) and identity and access management (IAM).</p>\n<p>This is a good time to evaluate your security awareness program. There are new approaches to security awareness that gamify learning or treat training films more like entertainment for better retainment.</p>\n<p>Where and how you begin your security transformation will depend on your organization&rsquo;s security maturity. From there, it is both building on your strengths and addressing your weaknesses (and you&rsquo;ll probably want to go with the latter first). The goal is to meet the threat actors where they are targeting their attacks right now and then anticipate how their attacks are evolving against your industry.</p>\n<p>And if you aren&rsquo;t sure how to shape your security transformation, don&rsquo;t worry. This is one time when the government has the help you need.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/nist-security-transformation-how-to-keep-up/\">NIST&#8217;s security transformation: How to keep up</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Defense in depth: Layering your security coverage","link":"https://securityintelligence.com/articles/defense-in-depth-layering-your-security-coverage/","dc:creator":{"#cdata-section":"Sue Poremba"},"pubDate":"Thu, 02 Nov 2023 13:00:00 +0000","category":[{"#cdata-section":"Data Protection"},{"#cdata-section":"Risk Management"},{"#cdata-section":"Cybersecurity"},{"#cdata-section":"Data Security"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446667"},"description":{"#cdata-section":"<p>The more valuable a possession, the more steps you take to protect it. A home, for example, is protected by the lock systems on doors and windows, but the valuable or sensitive items that a criminal might steal are stored with even more security &#8212; in a locked filing cabinet or a safe. This provides [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/defense-in-depth-layering-your-security-coverage/\">Defense in depth: Layering your security coverage</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>The more valuable a possession, the more steps you take to protect it. A home, for example, is protected by the lock systems on doors and windows, but the valuable or sensitive items that a criminal might steal are stored with even more security &mdash; in a locked filing cabinet or a safe. This provides layers of protection for the things you really don&rsquo;t want a thief to get their hands on. You tailor each item&rsquo;s protection accordingly, depending on its worth to you and the likelihood of theft.</p>\n<p>Your corporate network and data are the same. Protecting the valuable assets within your network requires layers. Often called defense in depth, this strategy offers multiple levels of security tools and strategies that are designed to guard against attacks.</p>\n<p>However, these security systems aren&rsquo;t perfect, and that&rsquo;s exactly what threat actors are determined to exploit. In your home, you may have put the jewels in the safe, but if the safe isn&rsquo;t locked, anyone can gain access. Same with your SOC. If your defense system has gaps, it&rsquo;s only a matter of time before someone will gain access to your data.</p>\n<h2>Fear of patching</h2>\n<p>Having a state-of-the-art security system that appears to cover every type of attack is good, but you may not be addressing how threat actors access your system or what they&rsquo;re looking for. Adversaries don&rsquo;t like change, Phil Neray, VP of cyber defense strategy at CardinalOps, said at Splunk&rsquo;s .conf23 event. Stolen credentials and exploited vulnerabilities remain the most popular attack vectors, according to <a href=\"https://www.verizon.com/business/resources/reports/dbir/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Verizon&rsquo;s Data Breach Investigations Report.</a></p>\n<p>But if users within the company are falling for phishing scams or ignoring patch updates, it no longer matters how solid your layers are. Threat actors will find their way inside.</p>\n<p>And why do people ignore patching? They fear a lack of availability to their system while the patches and updates are put in place.</p>\n<p><a class=\"btn orange1 large\" href=\"https://ibm.webcasts.com/starthere.jsp?ei=1632347&amp;tp_key=f13a23c0f1\" target=\"_blank\" rel=\"noopener nofollow\" ><i>Register for the webinar: Scale your SOC</i></a><b><i> </i></b></p>\n<h2>Moving through the network</h2>\n<p>There&rsquo;s a tendency to think of layers in terms of top to bottom or left to right &mdash; if you can&rsquo;t stop them at point A, then there is defense at point B. But that often ignores how threat actors actually move within the system. Depending on the type of attack, they are moving wherever they see an opening, and one missed layer of protection can impair defenses, such as missed encryption on passwords stored in an otherwise well-defended vault.</p>\n<p>Your layered defenses are also only as strong as your ability to detect anomalies or intrusions. Neray offered four questions to ask when looking at the quality of detections in your layered defense:</p>\n<ul>\n<li>Where are you missing detections?</li>\n<li>Are detections broken or too noisy?</li>\n<li>How do you quickly onboard new detections?</li>\n<li>How are you leveraging automation?</li>\n</ul>\n<p>Each detection should cover multiple security layers rather than just a single location, Neray stated.</p>\n<h2>Embrace sophisticated defenses</h2>\n<p>You want more than just layers, but threat-informed defenses based on the threats unique to your organization, said Neray. Once you understand what you are protecting and where those assets are stored, you can build your layers of protection to defend against those threats.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/defense-in-depth-layering-your-security-coverage/\">Defense in depth: Layering your security coverage</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"What is data security posture management?","link":"https://securityintelligence.com/posts/what-is-data-security-posture-management/","dc:creator":{"#cdata-section":"Dayja Brooks"},"pubDate":"Wed, 01 Nov 2023 13:00:00 +0000","category":[{"#cdata-section":"Cloud Security"},{"#cdata-section":"Data Protection"},{"#cdata-section":"data security posture management"},{"#cdata-section":"Data Security"},{"#cdata-section":"Hybrid Cloud"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446657"},"description":{"#cdata-section":"<p>Do you know where all your organization&#8217;s data resides across your hybrid cloud environment? Is it appropriately protected? How sure are you? 30%? 50%? It may not be enough. The Cost of a Data Breach Report 2023 revealed that 82% of breaches involved data in the cloud, and 39% of breached data was stored across [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/what-is-data-security-posture-management/\">What is data security posture management?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div>\n<p>Do you know where all your organization&rsquo;s data resides across your hybrid cloud environment? Is it appropriately protected? How sure are you? 30%? 50%? It may not be enough. The <a href=\"https://www.ibm.com/reports/data-breach\"  target=\"_blank\" rel=\"noopener nofollow\" >Cost of a Data Breach Report 2023</a> revealed that 82% of breaches involved data in the cloud, and 39% of breached data was stored across multiple types of environments.</p>\n</div>\n<div>\n<p>If you have any doubt, your enterprise should consider acquiring a <a href=\"https://www.ibm.com/topics/data-security-posture-management\"  target=\"_blank\" rel=\"noopener nofollow\" ><span class=\"resolved\">data security posture management (DSPM)</span></a> solution. With the global average cost of a data breach rising to $4.45 million in 2023, it is more important now than ever to be aware and understand where your data lives, who has access to it and how it is being utilized. A DSPM solution can help your organization meet its <a href=\"https://www.ibm.com/topics/data-security\"  target=\"_blank\" rel=\"noopener nofollow\" >data security</a> and compliance needs.</p>\n</div>\n<div>\n<div>\n<h2>What is DSPM, and how does it work?</h2>\n</div>\n<div>\n<p>As <a href=\"https://www.gartner.com/reviews/market/data-security-posture-management\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >defined by Gartner</a>, &ldquo;data security posture management (DSPM) provides visibility as to where sensitive data is, who has access to that data, how it has been used and what the security posture of the data stored or application is.&rdquo;</p>\n</div>\n<div>\n<p>The DSPM approach aims to help organizations in three ways to improve their security posture: cloud data visibility, cloud data movement and cloud data protection.</p>\n</div>\n<div>\n<ol>\n<li><strong>Cloud data visibility</strong><strong>: </strong>Discover shadow data rapidly expanding in the cloud with autonomous data discovery. This capability provides a powerful and frictionless way to find data that sprawls within cloud service providers and Software-as-a-Service (SaaS) apps. Understanding where your data resides helps to shrink your attack surface and reduce data risks.</li>\n<li><strong>Cloud data movement</strong><strong>: </strong>Analyze potential and actual data flows across the cloud. Identifying where and how data moves will help provide clarity on which data access controls and policies can best prevent vulnerabilities and misconfigurations.</li>\n<li><strong>Cloud data protection</strong><strong>:</strong> Uncover vulnerabilities in data and compliance controls and posture. DSPM gives a risk-based prioritization of data vulnerabilities and remediation recommendations to resolve potential issues rapidly.</li>\n</ol>\n</div>\n</div>\n<div>\n<div>\n<h2>The benefits of DSPM</h2>\n</div>\n<div>\n<p>Data security teams can deploy a DSPM tool to prevent risks in the following areas:</p>\n</div>\n<div>\n<p><strong>Eliminate exposed data to reduce the likelihood of a data breach or noncompliance fine. </strong></p>\n<p>Tying up loose ends and ensuring your data is securely shared only with the intended recipient and inaccessible to unauthorized parties help to remove the risk of a vulnerability arising. With your cloud vendors and SaaS applications, make sure to remove any sensitive information they could expose without your knowledge.</p>\n<p><strong>Prevent data leaks by safeguarding your valuable data and keeping it out of the wrong hands. </strong></p>\n<p>Closely monitoring the movement of your sensitive information as it flows between different cloud environments and various SaaS applications helps with your understanding of where and how your data is used. Data breaches across multiple environments (public cloud, private cloud and on-premises) reached a higher-than-average cost of $4.75 million.</p>\n</div>\n</div>\n<div>\n<div>\n<p><strong>Reduce third-party exposure by gaining a detailed perspective on third-party vendors that can access your organization&rsquo;s cloud workloads. </strong></p>\n<p>Determining which vendors have access to sensitive data and whether they possess the necessary certifications to manage such information is a crucial part of data security. Evaluating whether maintaining or excluding their data access is appropriate should be a continuous effort. This process helps to streamline the assessment risks from external vendors and determine the best course of action to stay protected.</p>\n<p><strong>Monitor data transactions more efficiently and accurately.</strong></p>\n<p>DSPM solutions can help with overseeing data transactions between countries to help ensure compliance with regulations that require regional data retention. Identifying the pertinent services and their responsible parties to halt such data flow and maintain continuous data compliance can help ensure confidence in your security posture.</p>\n<h2>Keep data safe across your cloud environment</h2>\n</div>\n<div>\n<p>A DSPM solution helps organizations unify their data security efforts for cloud workloads and SaaS applications, which is the ultimate way to safeguard sensitive data from security risks. It allows data security professionals to confidently discover, classify and protect their cloud data more holistically and efficiently.</p>\n</div>\n<div>\n<p>If you&rsquo;re interested in learning more about DSPM, please check out &ldquo;<a href=\"https://www.youtube.com/watch?v=KUYCksB7e0g\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Got Sensitive Cloud? Data Security Posture Management Helps Protect It</a>&rdquo; on the @IBMTechnology YouTube channel. Ready to improve your data security posture? Start with <a href=\"https://www.ibm.com/products/guardium-insights/dspm\"  target=\"_blank\" rel=\"noopener nofollow\" >IBM Security Guardium Insights SaaS DSPM</a>.</p>\n</div>\n</div>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/what-is-data-security-posture-management/\">What is data security posture management?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Could a threat actor socially engineer ChatGPT?","link":"https://securityintelligence.com/articles/could-a-threat-actor-socially-engineer-chatgpt/","dc:creator":{"#cdata-section":"Sue Poremba"},"pubDate":"Tue, 31 Oct 2023 13:00:00 +0000","category":[{"#cdata-section":"Artificial Intelligence"},{"#cdata-section":"chatGPT"},{"#cdata-section":"large language models"},{"#cdata-section":"Artificial Intelligence (AI)"},{"#cdata-section":"Data Security"},{"#cdata-section":"Social Engineering"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446660"},"description":{"#cdata-section":"<p>As the one-year anniversary of ChatGPT approaches, cybersecurity analysts are still exploring their options. One primary goal is to understand how generative AI can help solve security problems while also looking out for ways threat actors can use the technology. There is some thought that AI, specifically large language models (LLMs), will be the equalizer [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/could-a-threat-actor-socially-engineer-chatgpt/\">Could a threat actor socially engineer ChatGPT?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>As the one-year anniversary of ChatGPT approaches, cybersecurity analysts are still exploring their options. One primary goal is to understand how generative AI can help solve security problems while also looking out for ways threat actors can use the technology. There is some thought that AI, specifically large language models (LLMs), will be the equalizer that cybersecurity teams have been looking for: the learning curve is similar for analysts and threat actors, and because generative AI relies on the data sets created by users, there is more control over what threat actors can access.</p>\n<p>What gives threat actors an advantage is the expanded attack landscape created by LLMs. The freewheeling use of generative AI tools has opened the door for accidental data leaks. And, of course, threat actors see tools like ChatGPT as a way to create more realistic and targeted social engineered attacks.</p>\n<p>LLMs are designed to provide users with an accurate response based on the data in its system based on the prompt offered. They are also designed with safeguards in place to prevent them from going rogue or being manipulated for evil purposes. However, these guardrails aren&rsquo;t foolproof. IBM researchers, for example, were <a href=\"https://securityintelligence.com/posts/unmasking-hypnotized-ai-hidden-risks-large-language-models/\"  target=\"_blank\" rel=\"noopener nofollow\" >able to &ldquo;hypnotize&rdquo; LLMs </a>that offered a pathway for AI to provide wrong answers or leak confidential information.</p>\n<p>There&rsquo;s another way that threat actors can manipulate ChatGPT and other generative AI tools: prompt injections. By combining prompt engineering and classic social engineering tactics, threat actors are able to disable the safeguards on generative AI and can do anything from creating malicious code to extracting sensitive data.</p>\n<h2>How prompt injections work</h2>\n<p>When voice-activated AI tools like Alexa and Siri first hit the scene, users would prompt them with ridiculous questions to push the limits on the responses. Unless you were asking Siri the best places to bury a dead body, this was harmless fun. But it also was the precursor to prompt engineering when generative AI became universally available.</p>\n<p>A normal prompt is the request that guides AI&rsquo;s response. But when the request includes manipulative language, it skews the response. Looking at it in cybersecurity terms, prompt injection is similar to SQL injections &mdash; there is a directive that looks normal but is meant to manipulate the system.</p>\n<p>&ldquo;Prompt injection is a type of security vulnerability that can be exploited to control the behavior of a ChatGPT instance,&rdquo; <a href=\"https://github.com/utkusen/promptmap\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Github</a> explained.</p>\n<p>A prompt injection can be as simple as telling the LLM to ignore the pre-programmed instructions. It could ask specifically for a nefarious action or to circumvent filters to create incorrect responses.</p>\n<a class=\"btn orange1 large\" href=\"https://securityintelligence.com/posts/unmasking-hypnotized-ai-hidden-risks-large-language-models/\" ><strong>Related: </strong>The hidden risks of LLMs</a>\n<h2>The risk of sensitive data</h2>\n<p>Generative AI depends on the data sets created by users. However, high-level information may not produce the type of responses that users need, so they begin to add more sensitive information, like proprietary strategies, product details, customer information or other sensitive data. Given the nature of generative AI, this could be putting that information at risk: If another user were to give a maliciously engineered prompt, they could potentially gain access to that information.</p>\n<p>The prompt injection can be manipulated to gain access to that sensitive information, essentially using social engineering tactics through the prompt to get the content that could best benefit threat actors. Could threat actors use LLMs to get access to login credentials or financial data? Yes, if that information is readily available in the data set. Prompt injections can also lead users to malicious websites or exploit vulnerabilities.</p>\n<h2>Protect your data</h2>\n<p>There is a surprisingly high level of trust in LLM models. Users expect the generated information to be correct. It&rsquo;s time to stop trusting ChatGPT and put best security practices into action. They include:</p>\n<ul>\n<li>Avoid sharing sensitive or proprietary information in LLM. If it is necessary for that information to be available to run your tasks, do so in a manner that masks any identifiers. Make the information as anonymous and generic as possible.</li>\n<li>Verify then trust. If you are instructed to answer an email or check a website, do your due diligence to ensure the path is legitimate.</li>\n<li>If something doesn&rsquo;t seem right, contact the IT and security teams.</li>\n</ul>\n<p>By following these steps, you can help keep your data protected as we continue to discover what LLMs will mean for the future of cybersecurity.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/could-a-threat-actor-socially-engineer-chatgpt/\">Could a threat actor socially engineer ChatGPT?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Virtual credit card fraud: An old scam reinvented","link":"https://securityintelligence.com/posts/virtual-credit-card-fraud-old-scam-reinvented/","dc:creator":{"#cdata-section":"Camila Sablotny"},"pubDate":"Mon, 30 Oct 2023 16:00:00 +0000","category":[{"#cdata-section":"Banking & Finance"},{"#cdata-section":"Endpoint"},{"#cdata-section":"Fraud Protection"},{"#cdata-section":"Bank Fraud"},{"#cdata-section":"Credit Card Fraud"},{"#cdata-section":"Financial Fraud"},{"#cdata-section":"IBM Security Trusteer"},{"#cdata-section":"Risk Assessment"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446529"},"description":{"#cdata-section":"<p>In today&#8217;s rapidly evolving financial landscape, as banks continue to broaden their range of services and embrace innovative technologies, they find themselves at the forefront of a dual-edged sword. While these advancements promise greater convenience and accessibility for customers, they also inadvertently expose the financial industry to an ever-shifting spectrum of emerging fraud trends. This [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/virtual-credit-card-fraud-old-scam-reinvented/\">Virtual credit card fraud: An old scam reinvented</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>In today&rsquo;s rapidly evolving financial landscape, as banks continue to broaden their range of services and embrace innovative technologies, they find themselves at the forefront of a dual-edged sword. While these advancements promise greater convenience and accessibility for customers, they also inadvertently expose the financial industry to an ever-shifting spectrum of emerging fraud trends. This delicate balance between new offerings and security controls is a key part of the modern banking challenges. In this blog, we explore such an example.</p>\n<p>IBM Security Trusteer recently observed a new trend in a Spanish retail bank with the creation of virtual credit cards for fraudulent purposes, which turned out to be a little-protected service of the offering bank. Fraudsters exploited it to defraud victims of their entire account balance, reinventing a known and effective scam.</p>\n<h2>The fraud, step by step</h2>\n<p>Each security attack has a unique anatomy and flow. We will examine the flow of this specific fraud here.</p>\n<ol start=\"1\" type=\"1\">\n<li>Fraudsters initiate the attack by sending an SMS to the victim. The SMS will appear under the same section as previous messages from the bank. This is done using a tactic called <a href=\"https://us.norton.com/blog/mobile/sms-spoofing\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >SMS spoofing</a>. The topic of SMS spoofing is outside the scope of this blog but is indeed a facilitator of this fraud flow.</li>\n<li>The fraudsters, appearing to be the bank, inform the victim via SMS of a security issue with their banking account. They further explain that a bank representative will call the victim soon and provide a numeric code to identify themselves. The code is provided in the message as well.</li>\n<li>Next, a fraudster calls the victim, providing the code from the SMS sent earlier to &ldquo;identify&rdquo; themselves and elaborate on the security issue: they often claim that the victim&rsquo;s banking account was compromised and that to protect the money, they will need to move it to a new banking account that was created for them.</li>\n<li>Note that the fraudster established reliability via the SMS and by providing the code at this point. The stressed victim provides the fraudster(s) with their credentials, allowing them to log into the banking account.</li>\n<li>At this point, fraudsters have two options. They can try to empty the banking account using traditional wire transfers. However, these are often capped at a specific daily limit, are monitored for fraudulent activity by the bank, and require a fraudulent destination account (otherwise known as a mule account). The second option is to create virtual credit cards, which is a convenient alternative for the following reasons:</li>\n<li style=\"list-style: none;\">\n<ul>\n<li>No daily limit: The virtual cards&rsquo; limit is several thousand euros, but the fraudster can create as many virtual cards as the victim&rsquo;s account balance allows. For example, if the victim has 10,000 euros in the account, the fraudster could create multiple virtual cards with a limit of several thousand euros each. This action requires authentication, but the victims provide the <a href=\"https://www.ibm.com/topics/2fa\"  target=\"_blank\" rel=\"noopener nofollow\" >2FA</a> under pressure.</li>\n<li>No need for a mule account: Once the credit card is created, fraudsters use it to buy cryptocurrency and disappear from the traditional banking system.</li>\n</ul>\n</li>\n</ol>\n<p>This MO surfaced in early 2023 and slowly grew in popularity. It now compromises 41-48% of the fraudulent &ldquo;transaction&rdquo; attempts.</p>\n<a class=\"btn orange1 large\" href=\"https://www.ibm.com/account/reg/us-en/signup?formid=urx-43251\" >Discover the ROI of fraud detection</a>\n<h2>Trusteer&rsquo;s solution</h2>\n<p>The virtual credit card creation is, for now, exclusively available via the browser (and not the banking app). As such, we addressed this fraud by analyzing the user flow data (URLs) and transactional data.</p>\n<p>In general, user flow data can provide valuable insights into potentially risky and unauthorized actions in the account. This includes, but is not limited to:</p>\n<ul type=\"disc\">\n<li>Reset passwords &mdash; an action that occurs before the actual login</li>\n<li>Change of contact details, such as phone numbers</li>\n<li>Change of transaction limits</li>\n<li>Enrolling a new device to receive soft tokens (2FAs)</li>\n</ul>\n<p>The prerequisite for user flow analysis is complete visibility into all flows of the banking application and a risk assessment at the correct time during the session (pre-login or post-login).</p>\n<p>Once the data is available in Trusteer&rsquo;s systems, our fraud prevention solutions can incorporate the data into the security policy.</p>\n<p>In this specific case, Trusteer alerts the bank to suspicious virtual credit card creations, allowing them to take action.</p>\n<h2>What banks must keep in mind</h2>\n<p>As banks continuously innovate and introduce new services to meet their clients&rsquo; expectations, they simultaneously open new opportunities for fraud. End-to-end visibility and robust data collection are key to creating security controls for new offerings.</p>\n<p>By using <a href=\"https://www.ibm.com/trusteer\"  target=\"_blank\" rel=\"noopener nofollow\" >Trusteer&rsquo;s risk assessment</a>, banks have the essential resources to stay ahead of the curve and promptly identify and prevent developing fraud trends. This approach safeguards both the banks and the trust of their valued clients.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/virtual-credit-card-fraud-old-scam-reinvented/\">Virtual credit card fraud: An old scam reinvented</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"The evolution of 20 years of cybersecurity awareness","link":"https://securityintelligence.com/articles/20-years-of-cybersecurity-awareness/","dc:creator":{"#cdata-section":"Jonathan Reed"},"pubDate":"Fri, 27 Oct 2023 13:00:00 +0000","category":[{"#cdata-section":"CISO"},{"#cdata-section":"Risk Management"},{"#cdata-section":"CISA"},{"#cdata-section":"cybersecurity strategy"},{"#cdata-section":"Cybersecurity awareness month"},{"#cdata-section":"Cybersecurity"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446503"},"description":{"#cdata-section":"<p>Since 2004, the White House and Congress have designated October National Cybersecurity Awareness Month. This year marks the 20th anniversary of this effort to raise awareness about the importance of cybersecurity and online safety. How have cybersecurity and malware evolved over the last two decades? What types of threat management tools surfaced and when? The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/20-years-of-cybersecurity-awareness/\">The evolution of 20 years of cybersecurity awareness</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>Since 2004, the White House and Congress have designated October National Cybersecurity Awareness Month. This year marks the <a href=\"https://www.cisa.gov/cybersecurity-awareness-month\" target=\"_blank\" rel=\"noopener nofollow\" >20th anniversary</a> of this effort to raise awareness about the importance of cybersecurity and online safety.</p>\n<p>How have cybersecurity and malware evolved over the last two decades? What types of threat management tools surfaced and when? The <a href=\"https://staysafeonline.org/programs/about-cybersecurity-awareness-month/\" target=\"_blank\" rel=\"noopener nofollow\" >Cybersecurity Awareness Month themes</a> over the years give us a clue.</p>\n<h2>2004 &ndash; 2009: Inaugural year and beyond</h2>\n<p>This early period emphasized general cybersecurity hygiene, such as using strong passwords, keeping software updated and being cautious about phishing attempts.</p>\n<p>For example, in <a href=\"https://web.archive.org/web/20051029043122/https://staysafeonline.org/\" target=\"_blank\" rel=\"noopener nofollow\" >2005, the National Cybersecurity Alliance</a> emphasized:</p>\n<ul>\n<li>Protecting personal information, especially when asked for personal data online</li>\n<li>Using anti-virus software, a firewall and anti-spyware</li>\n<li>Setting up operating systems and Web browser software properly with regular updates</li>\n<li>The use of strong passwords or strong authentication technology</li>\n<li>Backing up important files.</li>\n</ul>\n<h2>2009 &ndash; 2018: Our shared responsibility</h2>\n<p><a href=\"https://security.ucop.edu/resources/security-awareness/cyber-security-month.html#:~:text=In%202009%2C%20our%20own%20President,participate%20in%20the%20month's%20activities\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" ><span class=\"resolved\">In 2009, DHS Secretary Janet Napolitano </span></a>inaugurated Cybersecurity Awareness Month at an event in Washington, D.C. At the time, Napolitano was the highest-ranking government official to participate in the campaign&rsquo;s activities. This period emphasized cybersecurity as a shared responsibility involving individuals, businesses and governments.</p>\n<h2>2010: STOP. THINK. CONNECT. initiative begins</h2>\n<p>In 2010, the <a href=\"https://www.stopthinkconnect.org/\" target=\"_blank\" rel=\"noopener nofollow\" >STOP. THINK. CONNECT.</a> initiative was unveiled at that year&rsquo;s Cybersecurity Awareness Month with a proclamation from <a href=\"https://obamawhitehouse.archives.gov/the-press-office/2010/10/01/presidential-proclamation-national-cybersecurity-awareness-month%20\" target=\"_blank\" rel=\"noopener nofollow\" >President Barack Obama</a>. Continuing to this day, the initiative addresses human behavior online, and for good reason. The most recent Verizon <a href=\"https://www.verizon.com/business/resources/reports/dbir/\" target=\"_blank\" rel=\"noopener nofollow\" >Data Breach Investigations Report</a> reveals the human element continues to be a key driver of 74<span class=\"resolved\">%</span> of breaches, including social engineering hacks, errors and misuse.</p>\n<h2>2014: Call for built-in security</h2>\n<p>In <a href=\"https://web.archive.org/web/20141015022246/http://www.staysafeonline.org/ncsam/about\" target=\"_blank\" rel=\"noopener nofollow\" >2014</a>, a new emphasis was placed on building security into information technology products. That year, the National Cybersecurity Alliance stated that security is an essential element of software design, development, testing and maintenance. The goal back then was to engage with stakeholders and educate others about what to do and look for in products.</p>\n<p>This theme resonates even more powerfully today, as seen in the current <a href=\"https://securityintelligence.com/news/new-white-house-cybersecurity-strategy-plots-the-road-ahead/\" >National Cybersecurity Strategy</a>. The strategy proposes new measures and regulations aimed at encouraging secure development practices from software vendors.</p>\n<h2>2015 &ndash; 2019: The era of encryption</h2>\n<p>The <a href=\"https://www.ponemon.org/local/upload/file/2015%20Global%20CODB%20FINAL%203%20copy.pdf\" target=\"_blank\" rel=\"noopener nofollow\" >2015 IBM Cost of a Data Breach report</a> was the first to provide a detailed breakdown of mitigating factors for data breach costs. And from 2015 to 2019, the top two factors held a five-year winning streak. The leading factors during those years were the formation of an incident response (IR) team followed by the extensive use of encryption.</p>\n<h2>2018: The birth of CISA</h2>\n<p>In 2018, President Donald Trump signed the <a href=\"https://www.cisa.gov/news-events/alerts/2018/11/19/cybersecurity-and-infrastructure-security-agency\" target=\"_blank\" rel=\"noopener nofollow\" >Cybersecurity and Infrastructure Security Agency Act of 2018</a>, which established the Cybersecurity and Infrastructure Security Agency (CISA). CISA assists both other government agencies and private sector organizations in addressing cybersecurity issues. CISA now spearheads Cybersecurity Awareness Month efforts, which were previously under the auspices of the <a href=\"https://staysafeonline.org/programs/cybersecurity-awareness-month/\" target=\"_blank\" rel=\"noopener nofollow\" >National Cybersecurity Alliance</a>.</p>\n<h2>2019 &ndash; 2022: Do Your Part. #BeCyberSmart</h2>\n<p>During this period, the Do Your Part. #BeCyberSmart campaign was launched. This theme encourages individuals and organizations to own their role in protecting their part of cyberspace, stressing personal accountability and the importance of taking proactive steps to enhance cybersecurity.</p>\n<p>Over the last decade, ransomware has grown significantly as a security concern. The number of ransomware attacks has increased along with the damage associated with each incident. Security solutions that gained more traction during this period included strategies such as identity and access management (IAM), zero trust and <a href=\"https://www.ibm.com/security/artificial-intelligence\" >AI-assisted cybersecurity</a>.</p>\n<h2>2023 and beyond</h2>\n<p>This year, CISA challenges everyone to help &lsquo;Secure our World&rsquo; by adopting four simple steps that everyone can take to stay safe online:</p>\n<ul>\n<li>Use strong passwords (long, random and unique)</li>\n<li>Turn on multifactor authentication on all accounts that offer it</li>\n<li>Recognize and report phishing (&ldquo;think before you click&rdquo;)</li>\n<li>Update software (enable automatic updates and patches).</li>\n</ul>\n<p>&ldquo;As cyber threats become more sophisticated, individuals and families, small and medium businesses and large companies all have an important role to play in keeping our digital world safe and secure,&rdquo; said <a href=\"https://www.cisa.gov/news-events/news/cisa-kicks-20th-anniversary-cybersecurity-awareness-month-new-public-awareness-campaign\" target=\"_blank\" rel=\"noopener nofollow\" >CISA Director Jen Easterly</a>. &ldquo;This Cybersecurity Awareness Month we are asking everyone to do their part to &lsquo;Secure Our World&rsquo; by adopting key behaviors that promote online safety and security.&rdquo;</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/20-years-of-cybersecurity-awareness/\">The evolution of 20 years of cybersecurity awareness</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}}]}}}