{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@version":"2.0","channel":{"title":"Ubuntu security notices","link":"https://ubuntu.com/security/notices/rss.xml","description":"Recent content on Ubuntu security notices","atom:link":{"@href":"https://ubuntu.com/security/notices/rss.xml","@rel":"self"},"copyright":"2023 Canonical Ltd. Ubuntu and Canonical are registered trademarks of Canonical Ltd.","docs":"http://www.rssboard.org/rss-specification","generator":"Feedgen","lastBuildDate":"Sun, 19 Nov 2023 05:17:40 +0000","item":[{"title":"USN-6485-1: Intel Microcode vulnerability","link":"https://ubuntu.com/security/notices/USN-6485-1","description":"Benoit Morgan, Paul Grosen, Thais Moreira Hamasaki, Ke Sun, Alyssa Milburn,\nHisham Shafi, Nir Shlomovich, Tavis Ormandy, Daniel Moghimi, Josh Eads, Salman\nQazi, Alexandra Sandulescu, Andy Nguyen, Eduardo Vela, Doug Kwan, and Kostik\nShtoyk discovered that some Intel(R) Processors did not properly handle certain\nsequences of processor instructions. A local attacker could possibly use this to\ncause a core hang (resulting in a denial of service), gain access to sensitive\ninformation or possibly escalate their privileges.\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6485-1"},"pubDate":"Fri, 17 Nov 2023 00:12:04 +0000"},{"title":"USN-6484-1: OpenVPN vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6484-1","description":"It was discovered that OpenVPN incorrectly handled the --fragment option\nin certain configurations. A remote attacker could possibly use this issue\nto cause OpenVPN to crash, resulting in a denial of service.\n(CVE-2023-46849)\n\nIt was discovered that OpenVPN incorrectly handled certain memory\noperations. A remote attacker could use this issue to cause OpenVPN to\ncrash, obtain sensitive information, or possibly execute arbitrary code.\n(CVE-2023-46850)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6484-1"},"pubDate":"Thu, 16 Nov 2023 13:09:52 +0000"},{"title":"USN-6480-1: .NET vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6480-1","description":"Barry Dorrans discovered that .NET did not properly implement certain\nsecurity features for Blazor server forms. An attacker could possibly\nuse this issue to bypass validation, which could trigger unintended\nactions. (CVE-2023-36558)\n\nPiotr Bazydlo discovered that .NET did not properly handle untrusted\nURIs provided to System.Net.WebRequest.Create. An attacker could possibly\nuse this issue to inject arbitrary commands to backend FTP servers.\n(CVE-2023-36049)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6480-1"},"pubDate":"Wed, 15 Nov 2023 14:51:43 +0000"},{"title":"USN-6483-1: HTML Tidy vulnerability","link":"https://ubuntu.com/security/notices/USN-6483-1","description":"Neeraj Pal discovered that HTML Tidy incorrectly handled parsing certain\nHTML data. If a user or automated system were tricked into parsing\nspecially crafted HTML data, a remote attacker could cause HTML Tidy to\nconsume resources, leading to a denial of service, or possibly execute\narbitrary code.\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6483-1"},"pubDate":"Wed, 15 Nov 2023 14:31:49 +0000"},{"title":"USN-6482-1: Quagga vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6482-1","description":"It was discovered that Quagga incorrectly handled certain BGP messages. A\nremote attacker could possibly use this issue to cause Quagga to crash,\nresulting in a denial of service.\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6482-1"},"pubDate":"Wed, 15 Nov 2023 14:24:42 +0000"},{"title":"USN-6481-1: FRR vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6481-1","description":"It was discovered that FRR incorrectly handled certain malformed NLRI data.\nA remote attacker could possibly use this issue to cause FRR to crash,\nresulting in a denial of service. (CVE-2023-46752)\n\nIt was discovered that FRR incorrectly handled certain BGP UPDATE messages.\nA remote attacker could possibly use this issue to cause FRR to crash,\nresulting in a denial of service. (CVE-2023-46753)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6481-1"},"pubDate":"Wed, 15 Nov 2023 14:20:35 +0000"},{"title":"USN-6473-2: pip vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6473-2","description":"USN-6473-1 fixed vulnerabilities in urllib3. This update provides the\ncorresponding updates for the urllib3 module bundled into pip.\n\nOriginal advisory details:\n\n It was discovered that urllib3 didn't strip HTTP Authorization header\n on cross-origin redirects. A remote attacker could possibly use this \n issue to obtain sensitive information. This issue only affected\n Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2018-25091)\n \n It was discovered that urllib3 didn't strip HTTP Cookie header on \n cross-origin redirects. A remote attacker could possibly use this \n issue to obtain sensitive information. (CVE-2023-43804)\n \n It was discovered that urllib3 didn't strip HTTP body on status code\n 303 redirects under certain circumstances. A remote attacker could \n possibly use this issue to obtain sensitive information. (CVE-2023-45803)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6473-2"},"pubDate":"Wed, 15 Nov 2023 11:27:24 +0000"},{"title":"USN-6449-2: FFmpeg regression","link":"https://ubuntu.com/security/notices/USN-6449-2","description":"\nUSN-6449-1 fixed vulnerabilities in FFmpeg. Unfortunately that update\ncould introduce a regression in tools using an FFmpeg library, like VLC. \n\nThis updated fixes the problem. We apologize for the inconvenience.\n\nOriginal advisory details: \n\nIt was discovered that FFmpeg incorrectly managed memory resulting \nin a memory leak. An attacker could possibly use this issue to cause\na denial of service via application crash. This issue only \naffected Ubuntu 18.04 LTS and Ubuntu 20.04 LTS. (CVE-2020-22038)\n\nIt was discovered that FFmpeg incorrectly handled certain input files, \nleading to an integer overflow. An attacker could possibly use this issue\nto cause a denial of service via application crash. This issue only \naffected Ubuntu 20.04 LTS. (CVE-2020-20898, CVE-2021-38090, \nCVE-2021-38091, CVE-2021-38092, CVE-2021-38093, CVE-2021-38094)\n\nIt was discovered that FFmpeg incorrectly managed memory, resulting in\na memory leak.  If a user or automated system were tricked into \nprocessing a specially crafted input file, a remote attacker could\npossibly use this issue to cause a denial of service, or execute \narbitrary code. (CVE-2022-48434)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6449-2"},"pubDate":"Wed, 15 Nov 2023 09:38:15 +0000"},{"title":"USN-6479-1: Linux kernel (OEM) vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6479-1","description":"Kyle Zeng discovered that the netfilter subsystem in the Linux kernel\ncontained a race condition in IP set operations in certain situations. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2023-42756)\n\nAlex Birnberg discovered that the netfilter subsystem in the Linux kernel\ndid not properly validate register length, leading to an out-of- bounds\nwrite vulnerability. A local attacker could possibly use this to cause a\ndenial of service (system crash). (CVE-2023-4881)\n\nIt was discovered that the Quick Fair Queueing scheduler implementation in\nthe Linux kernel did not properly handle network packets in certain\nconditions, leading to a use after free vulnerability. A local attacker\ncould use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2023-4921)\n\nKevin Rich discovered that the netfilter subsystem in the Linux kernel did\nnot properly handle removal of rules from chain bindings in certain\ncircumstances, leading to a use-after-free vulnerability. A local attacker\ncould possibly use this to cause a denial of service (system crash) or\nexecute arbitrary code. (CVE-2023-5197)\n\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6479-1"},"pubDate":"Tue, 14 Nov 2023 22:15:29 +0000"},{"title":"USN-6478-1: Traceroute vulnerability","link":"https://ubuntu.com/security/notices/USN-6478-1","description":"It was discovered that Traceroute did not properly parse command\nline arguments. An attacker could possibly use this issue to\nexecute arbitrary commands.\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6478-1"},"pubDate":"Tue, 14 Nov 2023 10:43:25 +0000"}]}}}