{
    "?xml": {
        "@version": "1.0",
        "@encoding": "UTF-8"
    },
    "rss": {
        "@version": "2.0",
        "@xmlns:content": "http://purl.org/rss/1.0/modules/content/",
        "@xmlns:wfw": "http://wellformedweb.org/CommentAPI/",
        "@xmlns:dc": "http://purl.org/dc/elements/1.1/",
        "@xmlns:atom": "http://www.w3.org/2005/Atom",
        "@xmlns:sy": "http://purl.org/rss/1.0/modules/syndication/",
        "@xmlns:slash": "http://purl.org/rss/1.0/modules/slash/",
        "@xmlns:georss": "http://www.georss.org/georss",
        "@xmlns:geo": "http://www.w3.org/2003/01/geo/wgs84_pos#",
        "channel": {
            "title": "TIME",
            "atom:link": {
                "@href": "https://time.com/feed/",
                "@rel": "self",
                "@type": "application/rss+xml"
            },
            "link": "https://time.com",
            "description": "Current & Breaking News | National & World Updates",
            "lastBuildDate": "Sat, 18 Nov 2023 23:39:08 +0000",
            "language": "en-US",
            "sy:updatePeriod": "\n\thourly\t",
            "sy:updateFrequency": "\n\t1\t",
            "generator": "https://wordpress.org/?v=6.1.4",
            "site": {
                "@xmlns": "com-wordpress:feed-additions:1",
                "#text": "211197034"
            },
            "item": [
                {
                    "title": "Adam Johnson’s Hockey Team Return to Ice For Memorial Game Weeks After Player’s Tragic Death",
                    "link": "https://time.com/6337281/adam-johnson-death-hockey-team-memorial-game/",
                    "comments": "https://time.com/6337281/adam-johnson-death-hockey-team-memorial-game/#respond",
                    "dc:creator": {
                        "#cdata-section": "KEN MAGUIRE / AP"
                    },
                    "pubDate": "Sat, 18 Nov 2023 19:28:44 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "News Desk"
                        },
                        {
                            "#cdata-section": "wire"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337281"
                    },
                    "description": {
                        "#cdata-section": "The Panthers haven't played since that Oct. 28 game and will take to the ice on Saturday in a memorial game."
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337281\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module video-2\" data-src=\"https://time.com/6337281/adam-johnson-death-hockey-team-memorial-game/\" data-widget-id=\"SB_4\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/AP23311016402939.jpg\" alt=\"England-Player-Death\"/>\n\n\n\n<p>NOTTINGHAM, England &mdash; A makeshift shrine for Adam Johnson keeps growing outside the arena where the Nottingham Panthers play hockey.</p>\n\n\n\n<p>Fans have left flowers, wreaths, jerseys, team scarves and handwritten notes to honor the 29-year-old American&nbsp;<a href=\"https://apnews.com/article/hockey-player-dies-adam-johnson-accident-nottingham-098abfe508a908cdc64bdf1b6d4f4e4e\"  target=\"_blank\">who died</a>&nbsp;after an opposing player&rsquo;s skate cut his neck during a game last month in Sheffield.</p>\n\n\n\n<p>&ldquo;We&rsquo;re not just hockey fans &mdash; we&rsquo;re a hockey family,&rdquo; Panthers fan Margaret Cartwright said Saturday. The death of the former Pittsburgh Penguins player has not only forced the sport to <a href=\"https://apnews.com/article/hockey-player-adam-johnson-dies-ab5b059012fe119cca2dfd12724f3156\"  target=\"_blank\">reexamine safety regulations</a> but also sparked a criminal investigation locally that <a href=\"https://apnews.com/article/adam-johnson-uk-ice-hockey-death-suspect-bailed-f4d7cf00d8ee0ef6f41f53f36669a8fc\"  target=\"_blank\">led to an arrest</a> of a man on suspicion of manslaughter.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>The Panthers haven&#8217;t played since that Oct. 28 game and will take the ice on Saturday at Motorpoint Arena against the Manchester Storm in a memorial game &ldquo;to celebrate the life of Adam and the remarkable person he was,&rdquo; the team said.</p>\n\n\n\n<p>The Nottingham Panthers retired Johnson&#8217;s No. 47 jersey ahead of the game. &ldquo;He will forever be our No. 47,&rdquo; announcer Stef Litchfield said. &ldquo;He was not only an outstanding hockey player but also a great teammate. He was an incredible person with his whole life ahead of him. We will miss him dearly.&rdquo;</p>\n\n\n\n<p>The game, which will be broadcast free on YouTube, does not count in the Elite Ice Hockey League standings. Instead, it&#8217;s meant to bring players and fans together as they try to move forward.</p>\n\n\n\n<p>A postmortem examination confirmed Johnson, who was 29, died as a result of a neck injury. South Yorkshire Police did not identify the suspect or provide his age. He was arrested Tuesday and released on bail a day later.</p>\n\n\n\n<p>Matt Petgrave, a defenseman for the Sheffield Steelers, was the other player involved in the incident. Johnson had skated with the puck across the blue line &mdash; into Sheffield&#8217;s defensive zone &mdash; when Petgrave collided with another Panthers player nearby. Petgrave&rsquo;s left skate kicked up as he began to fall and the blade hit Johnson in the neck.</p>\n\n\n\n<p>Neither the Steelers nor the league has provided an update on Petgrave&#8217;s roster status. His agent declined to comment when reached by The Associated Press earlier this week.</p>\n\n\n\n<p>&ldquo;Everybody&rsquo;s dealing with it in their own way, some are being negative. The majority of us are trying to be positive,&rdquo; Cartwright said. &ldquo;It was just a really, really unfortunate accident. The poor guy that caused it has got to live with that for the rest of life. I think that should be punishment enough. Nobody would do that deliberately &mdash; nobody. It&rsquo;s just how it happened, in a split second something went wrong and unfortunately, we lost poor Adam.&rdquo;</p>\n\n\n\n<p>The Minnesota native was in his first season at Nottingham &mdash; a central England city known as home to Robin Hood &mdash; after stints in Germany and a handful of games for the Penguins in the 2018-19 and 2019-20 seasons. He was living in Nottingham with his American girlfriend.</p>\n\n\n\n<p>The English Ice Hockey Association, which governs the sport below the Elite League, reacted to Johnson&rsquo;s death by requiring all players in England to&nbsp;<a href=\"https://apnews.com/article/skate-cut-safety-adam-johnson-d1016a502de6b49eefc4c00ee0fac9f9\"  target=\"_blank\">wear neck guards</a>&nbsp;from the start of 2024.</p>\n\n\n\n<p>The game in Sheffield was part of the league&#8217;s Challenge Cup &mdash; like soccer&#8217;s FA Cup tournament in Britain &mdash; but the Panthers have since withdrawn from that competition. They will resume their season against the Belfast Giants on Nov. 26.</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337281/adam-johnson-death-hockey-team-memorial-game/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337281"
                    }
                },
                {
                    "title": "SpaceX Launches Giant New Rocket But Explosions End the Second Test Flight",
                    "link": "https://time.com/6337265/spacex-rocket-launch-test-flight-explosions/",
                    "comments": "https://time.com/6337265/spacex-rocket-launch-test-flight-explosions/#respond",
                    "dc:creator": {
                        "#cdata-section": "MARCIA DUNN / AP"
                    },
                    "pubDate": "Sat, 18 Nov 2023 17:54:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "News Desk"
                        },
                        {
                            "#cdata-section": "wire"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337265"
                    },
                    "description": {
                        "#cdata-section": "SpaceX launched its mega rocket Starship but lost both the booster and the spacecraft in a pair of explosions minutes into the test flight."
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337265\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module video-2\" data-src=\"https://time.com/6337265/spacex-rocket-launch-test-flight-explosions/\" data-widget-id=\"SB_4\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/AP23322505598558.jpg\" alt=\"SpaceX-Starship-Launch\"/>\n\n\n\n<p>SpaceX launched its mega rocket Starship but lost both the booster and the spacecraft in a pair of explosions minutes into Saturday&rsquo;s test flight.</p>\n\n\n\n<p>The rocketship reached space following liftoff from South Texas before communication suddenly was lost. SpaceX officials said it appears the ship&rsquo;s self-destruct system blew it up over the Gulf of Mexico.</p>\n\n\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n<p>Minutes earlier, the separated booster had exploded over the gulf. By then, though, its job was done. Saturday&rsquo;s demo lasted eight or so minutes, about twice as long as the first test in April, which also <a href=\"https://apnews.com/article/spacex-starship-launch-elon-musk-d9989401e2e07cdfc9753f352e44f6e2\"  target=\"_blank\">ended in an explosion.</a> The latest flight came to an end as the ship&rsquo;s six engines were almost done firing to put it on an around-the-world path.</p>\n\n\n\n<p>At nearly 400 feet (121 meters),&nbsp;<a href=\"https://apnews.com/article/spacex-musk-starship-launch-test-flight-11de145e989e0534b6399640bc437b8e\"  target=\"_blank\">Starship is the biggest</a>&nbsp;and most powerful rocket ever built, with the goal of ferrying people to the moon and Mars.</p>\n\n\n\n<p>&ldquo;The real topping on the cake today, that successful liftoff,&rdquo; said SpaceX commentator John Insprucker, noting that all 33 booster engines fired as designed, unlike last time. The booster also separated seamlessly from the spaceship, which reached an altitude of 92 miles (148 kilometers). Added commentator Kate Tice: &#8220;We got so much data, and that will all help us to improve for our next flight.&rdquo;</p>\n\n\n\n<p>SpaceX founder Elon Musk watched from behind launch controllers at the southern tip of Texas near the Mexico border, near Boca Chica Beach. At company headquarters in Hawthorne, California, employees cheered as Starship soared at daybreak. The room grew quiet once it was clear that the spaceship had been destroyed.</p>\n\n\n\n<p>SpaceX had been aiming for an altitude of 150 miles (240 kilometers), just high enough to send the bullet-shaped spacecraft around the globe before ditching into the Pacific near Hawaii about 1 1/2 hours after liftoff, short of a full orbit.</p>\n\n\n\n<p>Following April&#8217;s flight demo, SpaceX made&nbsp;<a href=\"https://apnews.com/article/spacex-starship-faa-launch-758c515440a5f79c4059e84c70eed1d8\"  target=\"_blank\">dozens of improvements</a>&nbsp;to the rocket as well as the launch pad. The Federal Aviation Administration cleared the rocket for flight on Wednesday, after confirming that all safety and environmental concerns had been met.</p>\n\n\n\n<p>After Saturday&#8217;s launch, the FAA said no injuries or public damage had been reported and that an investigation was underway to determine what went wrong. SpaceX cannot launch another Starship until the review is complete and corrections made, the FAA added.</p>\n\n\n\n<p>NASA is counting on Starship to land astronauts on the moon by the end of 2025 or shortly thereafter. The space agency awarded SpaceX a $3 billion contract to make it happen, by transferring astronauts from its Orion capsule to Starship in lunar orbit before heading down to the surface.</p>\n\n\n\n<p>&ldquo;Today&rsquo;s test is an opportunity to learn &mdash; then fly again,&rdquo; noted NASA Administrator Bill Nelson via X, formerly known as Twitter.</p>\n\n\n\n<p>Starship is 34 feet (10 meters) taller than NASA&rsquo;s Saturn V rocket which carried men to the moon more than a half-century ago, and 75 feet (23 meters) taller than NASA&rsquo;s Space Launch System rocket that flew around the moon and back, without a crew, last year. And it&rsquo;s got approximately double the liftoff thrust.</p>\n\n\n\n<p>Like before, nothing of value was aboard Starship for the trial run. Once Starship is proven, Musk plans to use the fully reusable mega rockets to launch satellites into orbit around Earth and equipment and people to the moon, and eventually, to Mars.</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337265/spacex-rocket-launch-test-flight-explosions/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337265"
                    }
                },
                {
                    "title": "Taylor Swift Fan Dies Before Eras Concert in Rio, Attendees Complain About Venue Conditions",
                    "link": "https://time.com/6337249/taylor-swift-fan-dies-rio-concert-conditions/",
                    "comments": "https://time.com/6337249/taylor-swift-fan-dies-rio-concert-conditions/#respond",
                    "dc:creator": {
                        "#cdata-section": "DIANE JEANTET / AP"
                    },
                    "pubDate": "Sat, 18 Nov 2023 17:08:51 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "News Desk"
                        },
                        {
                            "#cdata-section": "wire"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337249"
                    },
                    "description": {
                        "#cdata-section": "A 23-year-old fan died at the Eras Tour concert in Rio on Friday night, according to a statement from the show's organizers in Brazil. "
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337249\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6337249/taylor-swift-fan-dies-rio-concert-conditions/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1786607992.jpg\" alt=\"BRAZIL-MUSIC-SWIFT-CHRIST THE REDEEMER\"/>\n\n\n\n<p>RIO DE JANEIRO &mdash; A 23-year-old Taylor Swift fan died at <a href=\"https://apnews.com/article/taylor-swift-brazil-christ-redeemer-statue-097dcffa307e7b80bda2c522a52d4337\"  target=\"_blank\">the singer&#8217;s Eras Tour concert in Rio de Janeiro</a> Friday night, according to a statement from the show&#8217;s organizers in Brazil. Both Swifties and politicians reacted to the news with outrage.</p>\n\n\n\n<p>While a cause of death for Ana Clara Benevides Machado has not been announced, fans complained they were not allowed to take water into Nilton Santos Olympic Stadium despite soaring temperatures.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>A group launched an online petition Saturday morning calling for a &ldquo;Benevides Law&rdquo; to &ldquo;make water in events mandatory.&rdquo;</p>\n\n\n\n<p>The petition garnered more than 150,000 signatures in just a few hours. Federal authorities announced that free water would be made available at all future concerts.</p>\n\n\n\n<p>In a handwritten note shared on her social media, Swift said she had a &ldquo;shattered heart.&#8221;</p>\n\n\n\n<p>&ldquo;There&rsquo;s very little information I have other than the fact that she was so incredibly beautiful and far too young,&rdquo; the singer wrote of the young woman.</p>\n\n\n\n<p>The show&#8217;s organizer, Time4Fun, said on Instagram that paramedics attended to Benevides after she reported feeling unwell. She was taken to a first-aid center and then to a hospital, where she died an hour later, the statement from the Brazilian live entertainment company said.</p>\n\n\n\n<p>Concert-goers said they were not allowed to bring water bottles into the stadium even though Rio and most of Brazil have had record-breaking temperatures this week amid&nbsp;<a href=\"https://apnews.com/article/brazil-heat-wave-climate-environment-wildfires-1e4714fb2c6566120c13cf4e2b657f7d\"  target=\"_blank\">a dangerous and lasting heat wave</a>. The daytime high in Rio on Friday was 39.1 degrees Celsius (102.4 degrees Fahrenheit), but it felt much hotter.</p>\n\n\n\n<p>Elizabeth Morin, 26, who recently moved to Rio from Los Angeles, described &ldquo;sauna-like&rdquo; conditions inside the stadium. &ldquo;It was extremely hot. My hair got so wet from sweat as soon as I came in,&rdquo; she said. &ldquo;There was a point at which I had to check my breathing to make sure I wasn&rsquo;t going to pass out.&rdquo;</p>\n\n\n\n<p>Morin said she drank plenty of water but saw &ldquo;a good amount of people looking distressed&rdquo; and others &ldquo;yelling for water.&rdquo; She said she was able to get water from the sidelines of the area she was standing in, but that water was a lot harder to access from other parts of the stadium, &ldquo;especially if you were concerned about losing your specific position.&rdquo;</p>\n\n\n\n<p>During the show, Swift paused her performance and asked from the stage for water to be brought to a group of people who had successfully caught the singer&#8217;s attention, according to Morin. &ldquo;They were holding up their phones saying &lsquo;We need water,&rsquo;&rdquo; she recalled.</p>\n\n\n\n<p>Justice Minister Fl&aacute;vio Dino said on X that the ministry would implement &ldquo;emergency rules&#8221; in response to the situation. He later announced that &#8220;water bottles for personal use, in suitable material, will be allowed&#8221; at concerts and other events and that show producers must provide free and easily accessible drinking water.</p>\n\n\n\n<p>Before the show, Benevides posted a video of herself on Instgram wearing a Taylor Swift T-shirt and waiting in line to enter the stadium while seeking shade under an umbrella. Like her, thousands of fans waited hours in the sun before being allowed inside.</p>\n\n\n\n<p>She told her followers while fanning her face that she&rsquo;d arrived at 11 a.m. &mdash; the show began around 7:30 p.m. &mdash; and was &ldquo;still in the mess.&rdquo;</p>\n\n\n\n<p>Benevides&#8217; friend, Daniele Menin, who attended the concert with her, told online news site G1 that her friend passed out at the beginning of the concert, as Swift performed her second song, &ldquo;Cruel Summer.&rdquo;</p>\n\n\n\n<p>&ldquo;We always said that when (Taylor Swift) came to Brazil we would find a way to go. The ticket was very expensive, but we still found a way&rdquo;, Menin told G1.</p>\n\n\n\n<p>Rio de Janeiro Mayor Eduardo Paes said on X the &ldquo;loss of a young woman&rsquo;s life &#8230; is unacceptable.&rdquo; While authorities are investigating the circumstances of the death, Paes wrote, the municipality will demand Saturday that the show&rsquo;s production company provide new water distribution points, more brigades and ambulances, and advance entrance to the show by one hour.</p>\n\n\n\n<p>Swift has two more shows scheduled in Rio, one on Saturday and one on Sunday. &ldquo;I&#8217;m not going to be able to speak about this from stage because I feel overwhelmed by grief when I even try to talk about it,&rdquo; she wrote. &ldquo;I want to say now I feel this loss deeply and my broken heart goes out to her family and friends.&rdquo;</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337249/taylor-swift-fan-dies-rio-concert-conditions/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337249"
                    }
                },
                {
                    "title": "Most Patients, Staff and Displaced Have Left Shifa Hospital, Palestinian Health Authorities Report",
                    "link": "https://time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/",
                    "comments": "https://time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/#respond",
                    "dc:creator": {
                        "#cdata-section": "AJIB JOBAIN, BASSEM MROUE, CARA ANNA / AP"
                    },
                    "pubDate": "Sat, 18 Nov 2023 16:02:32 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "Israel-Hamas War"
                        },
                        {
                            "#cdata-section": "News Desk"
                        },
                        {
                            "#cdata-section": "wire"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337235"
                    },
                    "description": {
                        "#cdata-section": "Patients and staff left Gaza's main hospital, health officials said, leaving behind Israeli forces and a small crew for remaining patients."
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337235\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/AP23322421699164.jpg\" alt=\"Israel-Hamas-War\"/>\n\n\n\n<p>KHAN YOUNIS, Gaza Strip &mdash; Patients, staff and displaced people departed Gaza&#8217;s largest hospital Saturday, health officials said, leaving behind only Israeli forces and a skeleton crew to care for those too sick to move. The exodus came the day internet and phone service was restored to the Gaza Strip, ending a <a href=\"https://apnews.com/article/israel-hamas-war-news-11-16-2023-6c7daa3b8c3a6b8dddf186ce631dfaad\"  target=\"_blank\">telecommunications</a> outage that forced the United Nations to shut down critical aid deliveries.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Dozens of people were killed in the urban Jabaliya refugee camp when what witnesses described as an Israeli airstrike hit a crowded U.N. shelter in the main combat zone of northern Gaza. It caused massive destruction in the camp&#8217;s Fakhoura school, said Ahmed Radwan and Yassin Sharif.</p>\n\n\n\n<p>&ldquo;The scenes were horrifying. Corpses of women and children were on the ground. Others were screaming for help,&rdquo; Radwan said by phone. Associated Press&#8217; photos from a local hospital showed more than 20 bodies wrapped in bloodstained sheets.</p>\n\n\n\n<p>The Israeli military, which had warned Jabaliya residents and others in a social media post in Arabic to leave, had no immediate comment on the strike and said only that its troops were active in the Jabaliya area &ldquo;with the aim of hitting terrorists.&rdquo; It rarely comments on individual strikes, saying only that it targets Hamas while trying to minimize harm to civilians.</p>\n\n\n\n<p>&ldquo;Receiving horrifying images &amp; footage of scores of people killed and injured in another UNRWA school sheltering thousands of displaced in the north of the Gaza Strip. These attacks cannot become commonplace, they must stop. A humanitarian ceasefire cannot wait any longer,&rdquo; Philippe Lazzarini, the commissioner general of the U.N. agency for Palestinian refugees, or UNRWA, said on X, formerly Twitter.</p>\n\n\n\n<p>Attacks also continued in southern Gaza. An Israeli airstrike hit a residential building on the outskirts of the town of Khan Younis, killing at least 26 Palestinians, according to a doctor at the hospital where the bodies were taken.</p>\n\n\n\n<p><a href=\"https://apnews.com/article/israel-hamas-war-news-11-15-2023-b85e828db648f5f911278fa217e827e7\"  target=\"_blank\">Israel&#8217;s military has been searching</a>&nbsp;Shifa Hospital for traces of a Hamas command center that it alleges was located under the building &mdash; a claim&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-war-shifa-hospital-ce8fda9821a011a6cb6e4a3df5c90916\"  target=\"_blank\">Hamas and the hospital staff deny</a>&nbsp;&mdash; and urging the several thousand people still there to leave.</p>\n\n\n\n<p>On Saturday, the military said it had been asked by the hospital&rsquo;s director to help those who would like to leave do so by a secure route. The military said it did not order any evacuation, and that medical personnel were being allowed to remain in the hospital to support patients who cannot be moved.</p>\n\n\n\n<p>But Medhat Abbas, a spokesman for the Health Ministry in Hamas-controlled Gaza, said the military had ordered the facility cleared, giving the hospital an hour to get people out.</p>\n\n\n\n<p>After it appeared the evacuation was mostly complete, Dr. Ahmed Mokhallalati, a Shifa physician, said on social media that some 120 patients remained who were unable to leave, including some in intensive care and premature babies, and that he and five other doctors were staying to care for them.</p>\n\n\n\n<p>It was not immediately clear where those who left the hospital had gone, with 25 of Gaza&#8217;s hospitals non-functional due to lack of fuel, damage and other problems and the other 11 only partially operational, according to the World Health Organization.</p>\n\n\n\n<p>Israel has said hospitals in northern Gaza were a key target of its ground offensive aimed at crushing Hamas, claiming they were used as militant command centers and weapons depots, which both Hamas and medical staff deny.</p>\n\n\n\n<p>Israeli troops have encircled or entered several hospitals, while others stopped functioning because of dwindling supplies and loss of electricity.</p>\n\n\n\n<p>The war, now in its seventh week, was triggered by&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-attack-military-war-a8f63b07641212f0de61861844e5e71e\"  target=\"_blank\">Hamas&rsquo; Oct. 7 attack in southern Israel</a>, in which militants killed about 1,200 people, mostly civilians, and&nbsp;<a href=\"https://apnews.com/article/israel-hamas-war-hostages-gaza-ca1466cc052b08a642fff88280eb0b22\"  target=\"_blank\">abducted some 240 men, women and children</a>. Fifty-two soldiers have been killed since the Israeli offensive began.</p>\n\n\n\n<p>More than 11,500 Palestinians have been killed in the war, according to Palestinian health authorities. Another 2,700 have been reported missing,&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-gaza-buried-rubble-airstrikes-89c0e8d0934d573d94d2fbfeba44d933\"  target=\"_blank\">believed buried under rubble</a>. The count&nbsp;<a href=\"https://apnews.com/article/israel-hamas-war-gaza-health-ministry-health-death-toll-59470820308b31f1faf73c703400b033\"  target=\"_blank\">does not differentiate</a>&nbsp;between civilians and combatants, but more than two-thirds of those killed were women and children; Israel says it has killed thousands of militants.</p>\n\n\n\n<p>After the war, &#8220;there&rsquo;ll be no Arab troops going to Gaza. None. We&rsquo;re not going to be seen as the enemy,&rdquo; <a href=\"https://apnews.com/article/bahrain-manama-dialogue-israel-palestinians-hamas-war-gaza-331a642d62f2a52b13b66c45ab520168\"  target=\"_blank\">Jordan&rsquo;s foreign minister</a>, Ayman Safadi, told a conference in Bahrain organized by the International Institute for Strategic Studies. &ldquo;How could anybody talk about the future of Gaza when we do not know what kind of Gaza will be left once this aggression ends?&rdquo;</p>\n\n\n\n<p>Gaza&rsquo;s main power plant shut down early in the war, and Israel has cut off electricity. That makes fuel necessary to power the generators needed to run the telecommunications network, water treatment plants, sanitation facilities, hospitals and other critical infrastructure.</p>\n\n\n\n<p>Juliette Touma, spokeswoman for the agency for Palestinian refugees, said 120,000 liters (31,700 gallons) of fuel arrived , meant to last for two days, after Israel agreed Friday to allow in that amount for the U.N.&#8217;s use. It is also allowing another 10,000 liters (2,642 gallons) to keep the telecommunications systems running.</p>\n\n\n\n<p>The U.N. has warned that Gaza&rsquo;s 2.3 million people are running critically short of food and water, and said the amount of fuel being provided is only half of the daily minimum requirement. It was not immediately clear when UNRWA would resume the delivery of <a href=\"https://apnews.com/article/israel-hamas-war-news-11-17-2023-1811384fac6394329dd71e3aaf461eb5\"  target=\"_blank\">aid that was put on hold Friday</a>.</p>\n\n\n\n<p>Gaza has received only 10% of its required food supplies each day in&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-gaza-captives-border-aid-f5976ed58ba508f14d45b72b428125ac\"  target=\"_blank\">shipments from Egypt</a>, according to the U.N., and the water system shutdown has left most of the population&nbsp;<a href=\"https://apnews.com/article/gaza-israel-water-humanitarian-crisis-cfeabcda00fefdd03c2877495c4dcd09\"  target=\"_blank\">drinking contaminated water</a>, causing an outbreak of disease. Dehydration and malnutrition are growing, with nearly all residents in need of food, according to the U.N.&rsquo;s World Food Program.</p>\n\n\n\n<p>In Jerusalem, thousands of marchers &mdash; including families of more than 50 hostages &mdash; were arriving on the last leg of a five-day trek from Tel Aviv calling on the government to do more to rescue some 240 hostages held by Hamas. Many are furious with the government for refusing to tell them more about what is being done to rescue them.</p>\n\n\n\n<p>Israel has signaled&nbsp;<a href=\"https://apnews.com/article/israel-palestinians-hamas-gaza-war-humanitarian-shifa-29388314e3286b2b0f1152f7d15e2d7b\"  target=\"_blank\">plans to expand its offensive south</a>, where most of Gaza&rsquo;s population is now sheltering, including hundreds of thousands of people who heeded Israel&rsquo;s calls to evacuate Gaza City and the north ahead of its ground offensive.</p>\n\n\n\n<p>People continued to move south. Some recovered bodies of strangers along the way. &ldquo;I found these young men inside the car. The car was destroyed,&rdquo; said Moemen Abu Erban, one man on the move. The bodies had been placed on a horse cart and covered with blankets. &ldquo;Frankly, it is a difficult thing. There is complete destruction.&#8221;</p>\n\n\n\n<p>Elsewhere, the Israeli military said its aircraft struck what it described as a hideout for militants in the urban refugee camp of Balata in the occupied West Bank. The Palestinian Red Crescent ambulance service said five Palestinians were killed.</p>\n\n\n\n<p>The deaths raised to 212 the number of Palestinians killed in West Bank violence since the war began, making it the deadliest period in the territory since the second Palestinian uprising in the early 2000s.</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337235/most-shifa-hospital-patients-staff-and-displaced-leave/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337235"
                    }
                },
                {
                    "title": "There’s a Difference Between Responding and Reacting",
                    "link": "https://time.com/6336418/responding-thoughtfully-internet-essay/",
                    "comments": "https://time.com/6336418/responding-thoughtfully-internet-essay/#respond",
                    "dc:creator": {
                        "#cdata-section": "Brad Stulberg"
                    },
                    "pubDate": "Sat, 18 Nov 2023 12:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "freelance"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6336418"
                    },
                    "description": {
                        "#cdata-section": "We must reclaim the space between stimulus and response. Our collective future depends on it, writes Brad Stulberg. "
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6336418\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6336418/responding-thoughtfully-internet-essay/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/Responding-Social-Media.jpg\" alt=\"Smartphone connects people.\"/>\n\n\n\n<p>For centuries, philosophers have noted that between stimulus and response there is a space, and within it lies the freedom to choose our actions. That space represents our agency and humanity&mdash;unlike other animals, we can be thoughtful and discerning instead of instinctively reacting. At the individual level, that space is crucial for mental health. Collectively, it&rsquo;s what gives rise to civilization, allowing us to work together, compromise, and resolve disputes without violence.</p>\n\n\n\n<p>I fear that space is collapsing. And if we don&rsquo;t do something about it, the consequences will be dire.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>When faced with change and disorder, most people go down one of two roads: They either respond or react. Responding, a spinoff of the word responsibility, is considerate and deliberate. Reacting, on the other hand, literally means to meet one action with another. It is immediate and rash. Responding creates more space between an event and what you do, or don&rsquo;t do, about it. In that space, you give immediate emotions room to breathe, you gain a better understanding of what is happening, and you bring online your prefrontal cortex, the most evolved part of your brain. As such, you rarely regret responding. But you often regret reacting.</p>\n\n\n\n<p>Plenty has been written about what you can do internally to cultivate responsiveness. For instance, one <a href=\"https://click.convertkit-mail2.com/5quo03xw9pb7hv73l37a6hrno0l44/7qh7h8hom5vxv4fz/aHR0cHM6Ly9saW5rLm1haWwuYmVlaGlpdi5jb20vc3MvYy9MVDF3cWRWN20zTDBHamNIUjRMdWlmN21GVXo2WGMtQXl4V1FMWTYyOGRNRVI4aWE0Z08tTlZvblA1bV9Tejd6c2xfMUhGeXpzZ3YyUVpqbUJJUU95dmhRcEhvbVdMeXVnWTNYaUUtODRtWFZiZURQX0J4SmNmZExxbmtLd3VzaTNBZzN6RWVjX2xkMFlMLVd3VmpKa21tNGtCS3pvc1FlVXVZOUVLRmhLaC1tWEp5ZnFmQWlJRC1yZjVvQlFnVDBmd1JEX2s3S09PSlB4eW5HaTdkY3pYZEhvY3JCLW5GVFFZZE91NzBMREFRLzN6bC9OSHBYV1FyQVMtdURwMmVLcEFQM1hBL2gxMS9TUmIwdTlWMU9VeFdhaVFSeTFFSHVnb1lmQk5RdWRpdWxfQ0cyZ0I2VTk4\"  target=\"_blank\">study</a> showed how that affect labeling, or naming your emotions, helps create space between you and a difficult situation. Mindfulness meditation <a href=\"https://academic.oup.com/scan/article/8/1/93/1693835\"  target=\"_blank\">is also beneficial</a>. But the external matters too. You can do all the affect labeling and meditation in the world, yet if you regularly inhabit reactive environments, it&rsquo;s hard not to become a more reactive person. More and more of our environments are becoming decidedly reactive.</p>\n\n\n\n<p><em><strong>Read More:</strong></em> <em><a href=\"https://time.com/6223229/loneliness-vulnerable-extremist-views/\" >Extended Loneliness Can Make You More Vulnerable to Extremist Views</a></em></p>\n\n\n\n<p>The communication theorist <a href=\"https://entertainment.time.com/2011/08/30/all-time-100-best-nonfiction-books/slide/understanding-media-by-marshall-mcluhan/\" >Marshall McLuhan</a> famously began his 1964 book, <em>Understanding Media</em>, with the phrase &ldquo;the medium is the message.&rdquo; He went on to explain that &ldquo;the personal and social consequences of any medium&mdash;that is, of any extension of ourselves&mdash;result from the new scale that is introduced into our affairs by each extension of ourselves.&rdquo; In layperson&rsquo;s terms: the more we use a given technology or inhabit a given environment, the more we come to resemble it in our actions, or in today&rsquo;s day and age, our reactions.</p>\n\n\n\n<p>I&rsquo;ve experienced this firsthand. When I spend too much time on social media, I&rsquo;m more likely to snap on my children, feel restless and frustrated, and my work&mdash;my ability to think deeply&mdash;<a href=\"https://time.com/4882372/social-media-facebook-instagram-unhappy/\" >deteriorates significantly</a>. Yet I&rsquo;m becoming increasingly concerned that it&rsquo;s not just me and it&rsquo;s not just social media, but our entire culture that is making us more reactive, essentially turning us into impulsive lab rats at a time when we need our humanity more than ever.</p>\n\n\n\n<p>Our modern economy increasingly relies on capturing people&rsquo;s attention. The incentives reward speed, flair, and outrage. Reactivity is a feature not a bug. The goal is to be first, to be extreme, and to capture as much gaze as possible. It&rsquo;s why start-up companies pride themselves on &ldquo;moving fast and breaking things.&rdquo; It&rsquo;s why social media quickly devolves into a toxic, tribal, and angry cesspool. It&rsquo;s why the space for legitimate disagreement and discussion on college campuses seems to be shrinking by the day<strong>, </strong>giving way to hatred and vitriol instead. It&rsquo;s how legacy media organizations make consequential errors in a rush to break news. And it&rsquo;s how governments make brutal mistakes in highly-charged situations that leave so much devastation in their wake.</p>\n\n\n\n<p>There are no silver bullet solutions, but explicitly naming and describing the problem is an important first step: Our culture and economy encourage reactivity; as a result, we&rsquo;re becoming a more reactive people, precisely at a time when our most pressing challenges&mdash;war, pandemic, climate change, political dysfunction&mdash;require our utmost capacity to respond.</p>\n\n\n\n<p>We can push back against mass reactivity by intentionally creating more responsive environments in our own lives. We can read print books or newspapers instead of the digital versions. We can go to the gym or take walks without our phones. We can set aside spaces to be device free. We can develop constraints for how much time we spend online, perhaps especially on social media. Institutionally, there ought to be processes in place to encourage a deliberate response even&mdash;and perhaps especially&mdash;when inertia is pushing for an immediate reaction.</p>\n\n\n\n<p>If we are to have any chance at navigating our turbulent times, we must find ways to reclaim and preserve the space between stimulus and response, which is to say we must find ways to reclaim and preserve our humanity. Our collective future depends on it.</p>\n\n\n\n<p><em>Adapted from </em><a href=\"https://www.amazon.com/Master-Change-Everything-Changing-Including/dp/006325316X\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">Master of Change</a> <em>by Brad Stulberg and reprinted with permission from HarperOne, an imprint of HarperCollins Publishers. Copyright 2023.</em></p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6336418/responding-thoughtfully-internet-essay/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6336418"
                    }
                },
                {
                    "title": "How Netflix’s Rustin Creates a New Blueprint for Films About the Civil Rights Era ",
                    "link": "https://time.com/6337107/bayard-rustin-civil-rights-organizing-blueprint-netflix/",
                    "comments": "https://time.com/6337107/bayard-rustin-civil-rights-organizing-blueprint-netflix/#respond",
                    "dc:creator": {
                        "#cdata-section": "Tanisha C. Ford"
                    },
                    "pubDate": "Fri, 17 Nov 2023 22:40:18 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "culturepod"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337107"
                    },
                    "description": {
                        "#cdata-section": "Netflix's Bayard Rustin biopic puts the civil rights organizer’s genius in grassroots organizing."
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337107\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6337107/bayard-rustin-civil-rights-organizing-blueprint-netflix/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/RSTN_20211217_23872_R_f.jpg\" alt=\"Rustin\"/>\n\n\n\n<p>In a pivotal scene in <em><a href=\"https://time.com/6331426/bayard-rustin-netflix-what-to-know/\" >Rustin</a></em>, a biopic coming to Netflix on Nov. 17, organizer Bayard Rustin (Coleman Domingo) stares down his antagonist, Congressman Rev. Adam Clayton Powell Jr. (Jeffrey Wright). The film has been building to this moment: throughout, Powell has taken several vile jabs at Rustin about his sexuality. And he is now, through a sly hypothetical question, insinuating that Rustin, a gay man, should resign his post as deputy director of the 1963 March on Washington, lest he derail the movement for racial justice. The camera slowly pans around the room, lingering on the disapproving facial expressions of the civil rights organizers&mdash;young and older, Black and white, women and men&mdash;who are also gathered at this key strategy meeting. </p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>&ldquo;Hypothetically speaking,&rdquo; a poised Rustin says in response to Powell&rsquo;s query, &ldquo;I&rsquo;d send them on their way. Unless, the person in question happened to be me.&rdquo; Several people burst into laughter. Rustin, then empowers his team of teenaged and young adult organizers to <a href=\"https://time.com/6331241/rustin-movie-who-are-the-civil-rights-leaders/\" >regale the senior civil rights leaders</a> with news of what they have accomplished&mdash;working fifteen hours a day&mdash;in the mere seven weeks that they&rsquo;ve been diligently toiling to plan what will be the largest demonstration in civil rights history. They roll off an impressive list: securing 2220 chartered buses, 40 trains, and 6 planes to bring marchers to the nation&rsquo;s capital; 80,000 boxed lunches, 292 toilets, and 22 first aid stations. It is then that viewers begin to comprehend the herculean task of executing a large-scale civil rights demonstration. Rustin&rsquo;s genius is on full display. </p>\n\n\n\n<p><strong>Read More: <a href=\"https://time.com/6331426/bayard-rustin-netflix-what-to-know/\" >The History Behind <em>Rustin</em></a></strong></p>\n\n\n\n<p>Bayard Rustin is beyond deserving of a biopic. From his Quaker youth, Rustin devoted his life to the movement for Black Freedom. By adulthood, he had matured into a brilliant intellectual, skilled debater, and grassroots organizer. Rustin&rsquo;s teachings about radical pacifism and the power of direct nonviolent action influenced Dr. Martin Luther King&rsquo;s own politics. Yet Rustin remained in the shadows of the movement as King and others rose to national prominence. Certainly, his identity as an out (by 1960s standards) gay, Black man in a movement with strong religious overtones was a factor. As were his ties to the Communist Party in the 1930s. LGBTQ activists and historians have worked since Rustin&rsquo;s death, in 1987, to center his legacy in U.S. civil rights history. And finally, Barack and Michelle Obama&rsquo;s Higher Ground production company has brought Rustin&rsquo;s story to life in a feature-length film. </p>\n\n\n\n<p>&ldquo;[Rustin] is a role model for what it means to be an American,&rdquo; director George C. Wolfe says in the film&rsquo;s press notes. &ldquo;What it means to daily, moment-to-moment, commit to democracy, commit to freedom, commit to possibility.&rdquo; Wolfe knows the biopic genre well, having directed the critically acclaimed <em>Ma Rainey&rsquo;s Black Bottom</em> (2020) and <em>The Immortal Life of Henrietta Lacks</em> (2017). With <em>Rustin</em>, he knew he needed to show the complexities of Rustin, his &ldquo;sense of service, expansive curiosity, and caring for those in need&rdquo; as well as &ldquo;the organizational brain of this man.&rdquo;</p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2023/11/Rustin-1.jpg?w=560\" alt=\"\"/>\n\n\n\n<p>The challenge for <em>Rustin</em> filmmakers would be creating a new visual lexicon for a civil rights era film. Viewers are accustomed to movement films such as <em>Mississippi Burning</em> (1988) that show the horrors of anti-Black violence across the South, <em>Malcolm X</em> (1992), with its extended scenes of Malcolm&rsquo;s soaring oratory, and <em>Selma</em> (2014), which visually depicted the scope and scale of marches and freedom rides. Yet, Bayard Rustin&rsquo;s organizational work, by the 1960s, was largely conducted in meeting rooms and offices. And the film is set in New York City, not the more common Deep South. How could they visually convey the intellectualism, influence, and reach of a movement organizer who was not on the front lines, in a style that would feel familiar and engaging for audiences encountering Rustin for the first time? </p>\n\n\n\n<p>Centering the film in the two months leading up to the March on Washington helps give it a sense of urgency. The film&rsquo;s hard bop jazz score anchors it temporally and serves as a sonic representation of Rustin&rsquo;s cerebral nature. <em>Rustin</em>&rsquo;s immensely talented (and in many ways underutilized) supporting cast&mdash;including Chris Rock, Audra McDonald, Glenn Turman, and CCH Pounder&mdash;help convey the fractured political state of the movement in 1963. Still these elements alone would not be enough to help viewers reimagine the civil rights genre.&nbsp;</p>\n\n\n\n<p>Wolfe creates what can be described as a &ldquo;two room&rdquo; visual strategy that allows him to depict the genius and impact of  Rustin&rsquo;s vision for democratic worldbuilding&mdash;and how it stood in contrast to the work of other civil rights leaders. Room One: the conference room of the NAACP headquarters. Scenes filmed here are dark and drab. A large conference table, at which NAACP leader Roy Wilkins (played by Chris Rock) sits at the head, is positioned at the center of the room, making a literal distinction between those (men) who have a seat at the table and those (women and openly queer folks) who do not. Mahogany wood paneled walls and dim lighting evoke the staid politics of these old guard leaders. The men seated around the table are dressed in dark or neutral-toned suits, their voices even and serious. Rustin eventually shouts out, disrupting the status quo of the meeting. He is seated in the corner of the room, next to the female secretaries. Wilkins, having no interest in those seated at the margins, had no clue Rustin was even in the room&mdash;or was at least willing to ignore him unless Rustin made his presence known. Wolfe opts for a long camera angle shot to create even greater spatial distance between the two men, which symbolizes the gulf between their politics. </p>\n\n\n\n<p><strong>Read More:</strong> <a href=\"https://time.com/6337000/rustin-netflix-civil-rights-activists-true-story/\" >Civil Rights Activists in Netflix&rsquo;s <em>Rustin</em> Recall Planning the March on Washington</a></p>\n\n\n\n<p>Room Two: Rustin&rsquo;s March on Washington headquarters, at the Utopia Neighborhood Club House, in Harlem, is abuzz with energy. It stands in stark contrast to the NAACP headquarters. The color palette of the room is a vibrant yellow. There is no conference table in the middle of the room, in fact, most people are working on their feet, bustling about the space as they make phone calls and check off their to-do lists. In this configuration, there is no defined center and margins, there is no hierarchy. The interracial staff of organizers, who Rustin refers to as &ldquo;angelic troublemakers&rdquo; are dressed more casually and on trend with the styles of the day. Some folks are gay, some present as gender nonbinary. They are the more progressive members of organizations such as the NAACP, SNCC, CORE, and SCLC. &ldquo;Talk. Shout. Take command!&rdquo; Rustin says to the group of budding organizers during a key planning meeting. He encourages them to be effective disrupters. This room is the world Bayard Rustin has made. </p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2023/11/RSTN_20211201_20326_R_f.jpg?w=560\" alt=\"Rustin. Colman Domingo as Bayard Rustin, Melissa Rakiro as Yvette, Ayana Workman as Eleanor, Jordan-Amanda Hall as Charlene, Jakeem Dante Powell as Norm in Rustin. Cr. David Lee/Netflix &copy; 2023\"/>\n\n\n\n<p><em>Rustin</em> does not offer any altogether new revelations about the significance of the March on Washington. In fact, it reifies the widely accepted narrative of the march as a triumphant moment for the movement and a transformative moment in US history. It does not zoom out beyond the groups assembled in its two rooms to show the degree to which the march was hotly contested by the more radical, grassroots arm of the movement. For example, <a href=\"https://kinginstitute.stanford.edu/march-washington-jobs-and-freedom\"  target=\"_blank\">Malcolm X referred to the march</a> as the &ldquo;Farce on Washington.&rdquo; He was critical of the White House&rsquo;s heavy involvement in the planning of the march and the big dollar donations that &ldquo;Big Six&rdquo; civil rights leaders such as Wilkins, King, and Whitney Young received from philanthropic foundations to underwrite it.  </p>\n\n\n\n<p>But the film is triumphant in that it proves that centering the most marginalized, like Bayard Rustin, brings other underappreciated, undercelebrated activists into the national conversation. In the film&rsquo;s closing scene, Bayard Rustin is collecting trash from the National Mall lawn. King has given his now classic &ldquo;I have a Dream&rdquo; speech, to rousing applause. Wilkins and the Big Six have brokered an Oval Office meeting with President Kennedy to make him commit to civil rights legislation. And yet Rustin&mdash;somewhat by his own choice&mdash;does not enter that room. As this scene conveys, his work is, literally, at the grassroots. Thus, by focusing on grassroots organizers, <em>Rustin</em> pays tribute to people such as Anna Arnold Hedgeman, Ella Baker, Joyce and Dorie Ladner, Eleanor Holmes Norton, Cortland Cox, Rachelle Horowitz&mdash;many of whom are still alive to receive their flowers. </p>\n\n\n\n<p><em>Tanisha C. Ford is a history professor at the Graduate Center, CUNY. She is also the author of several books, including </em>Our Secret Society: Mollie Moon and the Glamour, Money, and Power Behind the Civil Rights Movement. </p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337107/bayard-rustin-civil-rights-organizing-blueprint-netflix/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337107"
                    }
                },
                {
                    "title": "We’re Not Too Far From the Reality of The Ballad of Songbirds and Snakes",
                    "link": "https://time.com/6337113/hunger-games-squid-game-dystopian-reality/",
                    "comments": "https://time.com/6337113/hunger-games-squid-game-dystopian-reality/#respond",
                    "dc:creator": {
                        "#cdata-section": "Laura Zornosa"
                    },
                    "pubDate": "Fri, 17 Nov 2023 22:20:07 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "culturepod"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337113"
                    },
                    "description": {
                        "#cdata-section": "'The Ballad of Songbirds and Snakes,' alongside recent pop culture like 'Squid Game: The Challenge,' asks what price we'll pay for a good show."
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337113\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6337113/hunger-games-squid-game-dystopian-reality/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/The-Ballad-of-Songbirds-and-Snakes-3.jpg\" alt=\"\"/>\n\n\n\n<p>The Hunger Games themselves feel like a car crash: bloody and brutal but you can&rsquo;t look away. And the key to that morbid watchability comes from a high school assignment. <a href=\"https://www.youtube.com/watch?v=NxW_X4kzeus\"  target=\"_blank\"><em>The Ballad of Songbirds and Snakes</em></a>, the new prequel movie joining the hit <em>Hunger Games</em> franchise, examines how the Capitol, which controls the dystopian nation of Panem, convinced its citizens to watch two dozen teenagers fight to the death.&nbsp;</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Set during the 10th annual Hunger Games, <em>The Ballad of Songbirds and Snakes </em>begins some 64 years before the events of the original trilogy. Capitol citizens have grown bored of the games, which were created as punishment after the districts of Panem lost a bitter rebellion. To boost ratings, Casca Highbottom (Peter Dinklage), the dean of the Academy&mdash;a high school attended by the children of the Capitol elite&mdash;and<strong> </strong>Head Gamemaker Dr. Volumnia Gaul (Viola Davis) assign each district tribute to a mentor from the school. Their role, as Highbottom puts it, is &ldquo;to turn these children into spectacles, not survivors.&rdquo;</p>\n\n\n\n<p>The fulcrum between others&rsquo; pain and one&rsquo;s own pleasure slides dangerously toward sadism. <em>The Ballad of Songbirds and Snakes</em> joins a spate of recent pop culture offerings that reckon with this<strong> </strong>phenomenon, from the reality TV show <em>Squid Game: The Challenge</em> and Nathan Fielder&rsquo;s <a href=\"https://time.com/6331126/the-curse-review-nathan-fielder/\" ><em>The Curse</em></a> to Jordan Peele&rsquo;s <a href=\"https://time.com/6199449/nope-explained-meaning-jordan-peele/\" ><em>Nope</em></a> and Nana Kwame Adjei-Brenyah&rsquo;s National Book Award finalist <em>Chain-Gang All-Stars</em>. What does that say about the consumers of this art that creeps closer and closer to reality? What price are we willing to pay for a good show? And what price tag does that pin on performers?</p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2023/11/The-Ballad-of-Songbirds-and-Snakes-1.jpg?w=560\" alt=\"\"/>\n\n\n\n<p>In the movie, conscientious Academy student Sejanus Plinth (Josh Andr&eacute;s Rivera) insists during a classroom outburst that the real reason Capitol citizens don&rsquo;t want to watch the Hunger Games is because they know that tributes&mdash;and proletariat district residents, for that matter&mdash;are people too. His classmate, Coriolanus Snow (Tom Blyth), who will go on to become President Snow in the <em>Hunger Games</em> trilogy, takes that idea and twists it. If they want Capitol citizens to watch, he posits, they need to make things personal. He suggests allowing Capitol citizens to bet on the tributes. They need to feel invested, literally.</p>\n\n\n\n<p>Here and elsewhere, to get viewers to care, those in power must work to humanize their performers. But they will always remain just that: entertainers, designed to elicit interest, maybe sympathy,<strong> </strong>but never true empathy. As we watch a show-within-a-show unfold onscreen or in our pages, though, it becomes increasingly difficult not to become spectators ourselves.</p>\n\n\n\n<p>The eccentric and calculating Head Gamemaker Gaul asks Snow to write up his suggestions for increased viewership into an essay assignment. And thus the trademark appeal of the Hunger Games is born: Alongside the betting, Snow proposes sponsorships, in which Capitol citizens can donate to a tribute, and their mentor can use those donations to send them life-saving gifts in the arena.</p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2023/11/The-Ballad-of-Songbirds-and-Snakes-2.jpg?w=560\" alt=\"\"/>\n\n\n\n<p>The 10th annual Hunger Games become the blueprint for the next 65 Games to come. They hire a host for the first time, the flamboyant Lucretius &ldquo;Lucky&rdquo; Flickerman (Jason Schwartzman), predecessor of the<em> Hunger Games</em>&rsquo; Caesar Flickerman (Stanley Tucci). And they implement televised tribute interviews, one more way of turning them into bonafide reality stars.<strong> </strong></p>\n\n\n\n<p>Snow develops a connection with his tribute, Lucy Gray (Rachel Zegler), a traveling musician from District 12, where she used to sing of her own free will. Selected for the 10th Hunger Games, she must now sing for her life, in her TV interview. As she does, keening about going to her grave in &ldquo;a voice husky from smoke and sadness,&rdquo; donations flash by onscreen. Tears roll down the faces of Capitol citizens. They seem genuinely moved by Lucy&rsquo;s appeal to empathy&mdash;but not quite enough to call off the<strong> </strong>Games.</p>\n\n\n\n<p>The scene evokes the framing of and the reaction to the news in 2023. Israel&#8217;s military offensive in Gaza has killed <a href=\"https://www.washingtonpost.com/world/interactive/2023/gaza-rising-death-toll-civilians/\"  target=\"_blank\">more than 11,000</a> people since Oct. 7, when a deadly Hamas attack prompted the country to declare war. United Nations experts have warned that Palestinians are at &#8220;<a href=\"https://www.reuters.com/world/middle-east/un-experts-say-ceasefire-needed-palestinians-grave-risk-genocide-2023-11-02/#:~:text=%22We%20remain%20convinced%20that%20the,Israeli%20mission%20to%20the%20U.N.\"  target=\"_blank\">grave risk of genocide</a>.&#8221; As the war continues, Palestinians are forced to package themselves as worthy of attention, even on the brink of death, writes Dr. Hala Alyan, a Palestinian American writer and psychologist.&nbsp;</p>\n\n\n\n<p>&ldquo;The task of the Palestinian is to be palatable or to be condemned. The task of the Palestinian, we&rsquo;ve seen in the past two weeks, is to audition for empathy and compassion. To prove that we deserve it. To earn it,&rdquo; she writes in an Oct. 25 New York <em>Times </em><a href=\"https://www.nytimes.com/2023/10/25/opinion/palestine-war-empathy.html\"  target=\"_blank\">guest essay</a>. &ldquo;These days, everyone is trying to write about the children. An incomprehensible number of them dead and counting. We are up at night, combing through the flickering light of our phones, trying to find the metaphor, the clip, the photograph to prove a child is a child.&rdquo;</p>\n\n\n\n<p>Suzanne Collins, the author of the <em>Hunger Games</em> trilogy and prequel, felt <a href=\"https://www.nytimes.com/2018/10/18/books/suzanne-collins-talks-about-the-hunger-games-the-books-and-the-movies.html\"  target=\"_blank\">compelled</a> to write the series after an experience she had channel-surfing TV late at night illustrated the dissonance. As she flipped from channel to channel, coverage of the Iraq war and footage from a reality TV show &ldquo;began to <a href=\"https://www.theguardian.com/books/2012/apr/27/suzanne-collins-hunger-games-profile\"  target=\"_blank\">fuse together</a> in a very unsettling way,&rdquo; she told <em>The Guardian </em>in 2012. Both were sensationalized, and thus desensitized. Media framing was blurring the line between pain and pleasure.</p>\n\n\n\n<p>That line is even blurrier today. On Nov. 22, <em>Squid Game: The Challenge</em>, a competition reality TV series based on the <a href=\"https://time.com/6218245/lee-you-mi/\" >2021 dystopian survival drama</a>, a damning indictment of socioeconomic inequality, will arrive on Netflix. In it, 456 players compete for a $4.56 million prize (without the lethal consequences.)</p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2023/11/Squid-Game-The-Challenge.jpg?w=560\" alt=\"\"/>\n\n\n\n<p>The original <em>Squid Game</em> creator, Hwang Dong-hyuk, has said that the idea for the smash hit show came from his own life: He couldn&rsquo;t work, and he, his mother, and his grandmother had to take out loans to survive a global financial crisis. &ldquo;It&rsquo;s not profound!&rdquo; he <a href=\"https://www.theguardian.com/tv-and-radio/2021/oct/26/squid-games-creator-rich-netflix-bonus-hwang-dong-hyuk\"  target=\"_blank\">told</a> The <em>Guardian</em>. &ldquo;It&rsquo;s very simple! I do believe that the overall global economic order is unequal and that around 90% of the people believe that it&rsquo;s unfair.&rdquo;</p>\n\n\n\n<p>To twist Hwang&rsquo;s concept&mdash;456 people playing games to the death for 45.6 billion Korean won&mdash;into a reality TV show misses the point entirely, bringing viewers over the line from mere observers to actual participants. Placing real people in a <em>Squid Game</em> simulation implies that viewers didn&rsquo;t just relate to protagonist<strong> </strong>Seong Gi-hun&rsquo;s (Lee Jung-jae) struggles&mdash;to some degree, they enjoyed watching him suffer and inflict suffering. </p>\n\n\n\n<p>In the first <em>Hunger Games</em> movie, Katniss (Jennifer Lawrence) and Gale (Liam Hemsworth) sit in a field just outside of District 12 on the morning of the Reaping, the day that tribute names are drawn. &ldquo;Just one year,&rdquo; Gale says, &ldquo;what if everyone just stopped watching?&rdquo; &ldquo;They won&rsquo;t,&rdquo; Katniss replies. &ldquo;If no one watches, then they don&rsquo;t have a game,&rdquo; Gale says. &ldquo;It&rsquo;s as simple as that.&rdquo;</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337113/hunger-games-squid-game-dystopian-reality/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337113"
                    }
                },
                {
                    "title": "Sam Altman Departs OpenAI After Board Loses Confidence in Him",
                    "link": "https://time.com/6337102/sam-altman-departs-openai/",
                    "comments": "https://time.com/6337102/sam-altman-departs-openai/#respond",
                    "dc:creator": {
                        "#cdata-section": "Will Henshall"
                    },
                    "pubDate": "Fri, 17 Nov 2023 22:06:51 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "Artificial Intelligence"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337102"
                    },
                    "description": {
                        "#cdata-section": "Mira Murati, OpenAI’s chief technology officer, will serve as interim CEO."
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337102\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module video-2\" data-src=\"https://time.com/6337102/sam-altman-departs-openai/\" data-widget-id=\"SB_4\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/GettyImages-1786606042.jpg\" alt=\"Sam Altman\"/>\n\n\n\n<p>OpenAI, the company behind <a href=\"https://time.com/6253615/chatgpt-fastest-growing/\" >ChatGPT</a>, has <a href=\"https://openai.com/blog/openai-announces-leadership-transition\"  target=\"_blank\">announced</a> that CEO and co-founder <a href=\"https://time.com/collection/time100-ai/6309022/sam-altman-ai/\" >Sam Altman</a> will immediately leave his role leading the company and step down from its board of directors.</p>\n\n\n\n<p>Altman was not &ldquo;consistently candid in his communications with the board, hindering its ability to exercise its responsibilities,&rdquo; leading to the board losing confidence in his ability to lead the company, according to the announcement in a blog post on Nov. 17.&nbsp;</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p><a href=\"https://time.com/6252404/mira-murati-chatgpt-openai-interview/\" >Mira Murati</a>, OpenAI&rsquo;s chief technology officer, will serve as interim CEO, the company said in the blog post. The company also announced that <a href=\"https://time.com/collection/time100-ai/6309033/greg-brockman/\" >Greg Brockman</a>, another OpenAI co-founder and president, would step down from his role as chairman of the board, although he would remain in his role as president, reporting to Murati.</p>\n\n\n\n<p>The sudden departure comes as a shock to the tech world. Altman was an OpenAI <a href=\"https://openai.com/blog/introducing-openai\"  target=\"_blank\">founding</a> co-chair in 2015 along with <a href=\"https://time.com/collection/time100-ai/6310657/elon-musk-ai/\" >Elon Musk</a>. Since then, Altman has been the public face of the company, speaking at <a href=\"https://time.com/6280372/sam-altman-chatgpt-regulate-ai/\" >congressional hearings</a> and <a href=\"https://time.com/6282325/sam-altman-openai-eu/\" >conferences</a>, and playing a starring role at the company&rsquo;s <a href=\"https://time.com/6331994/chatgpt-cutomizable-gpt4-turbo/\" >inaugural Developer Day conference</a> last week.</p>\n\n\n\n<p>In a <a href=\"https://x.com/sama/status/1725631621511184771?s=20\"  target=\"_blank\">post on X</a> (previously Twitter), Altman wrote: &#8220;i loved my time at openai. it was transformative for me personally, and hopefully the world a little bit. most of all i loved working with such talented people.&#8221; He added that he &#8220;will have more to say about what&rsquo;s next later.&#8221;</p>\n\n\n\n<h3>More From TIME</h3>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=EU3F7DHt autostart=\"viewable\"]</div>\n\n\n\n<p>Without Altman and Brockman, OpenAI&rsquo;s board comprises chief scientist <a href=\"https://time.com/collection/time100-ai/6309011/ilya-sutskever/\" >Ilya Sutskever</a> and three independent directors: tech entrepreneur Tasha McCauley, Quora CEO Adam D&rsquo;Angelo, and <a href=\"https://time.com/author/helen-toner/\" >Helen Toner</a>, director of strategy and foundational research grants at think tank the Center for Security and Emerging Technology.</p>\n\n\n\n<p>A board statement accompanying the announcement said: &ldquo;OpenAI was deliberately structured to advance our mission: to ensure that artificial general intelligence benefits all humanity. The board remains fully committed to serving this mission. We are grateful for Sam&rsquo;s many contributions to the founding and growth of OpenAI. At the same time, we believe new leadership is necessary as we move forward. As the leader of the company&rsquo;s research, product, and safety functions, Mira is exceptionally qualified to step into the role of interim CEO. We have the utmost confidence in her ability to lead OpenAI during this transition period.&rdquo;</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337102/sam-altman-departs-openai/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337102"
                    }
                },
                {
                    "title": "The Meaning Behind “The Hanging Tree” Song in The Hunger Games Prequel",
                    "link": "https://time.com/6336331/hunger-games-hanging-tree-song-prequel/",
                    "comments": "https://time.com/6336331/hunger-games-hanging-tree-song-prequel/#respond",
                    "dc:creator": {
                        "#cdata-section": "Moises Mendez II"
                    },
                    "pubDate": "Fri, 17 Nov 2023 21:30:32 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "culturepod"
                        },
                        {
                            "#cdata-section": "Explainer"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6336331"
                    },
                    "description": {
                        "#cdata-section": "The meaning behind the song, which features prominently in 'The Hunger Games' and 'The Ballad of Songbirds and Snakes'"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6336331\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6336331/hunger-games-hanging-tree-song-prequel/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/hunger-games-hanging-tree-song.jpg\" alt=\"Rachel Zegler as Lucy Gray Baird in The Hunger Games: The Ballad of Songbirds and Snakes; Jennifer Lawrence as Katniss Everdeen in The Hunger Games: Mockingjay Part I\"/>\n\n\n\n<p><strong>Warning: This post contains spoilers for </strong><strong><em>The Ballad of Songbirds and Snakes</em></strong></p>\n\n\n\n<p>During one of Rachel Zegler&rsquo;s first red carpet appearances for<em> </em><a href=\"https://time.com/4119956/hunger-games-rigged/\" ><em>The Hunger Games</em></a><em> </em>prequel <a href=\"https://time.com/6336379/the-hunger-games-the-ballad-of-songbirds-and-snakes-review/\" ><em>The Ballad of Songbirds and Snakes</em></a>, the actor was asked about the difference between her character Lucy Gray and the protagonist of the original series, Katniss Everdeen (played by Jennifer Lawrence). &ldquo;Lucy Gray is a performer forced to fight and Katniss is a fighter forced to perform,&rdquo; Zegler said, highlighting how the two characters differ in their motivations, but remain connected through the aspect of performance. </p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p><a href=\"https://time.com/6336296/ballad-of-songbirds-and-snakes-hunger-games-what-to-know/\" ><em>The Ballad of Songbirds and Snakes</em></a> sees Lucy trying to use her voice to convince the Capitol that what they&rsquo;re doing with the Hunger Games is wrong, but no matter how loud or how much she sings, they don&rsquo;t listen. Katniss is forced into the role of a martyr and ends up being the face of rebellion. In <a href=\"https://time.com/3581905/hunger-games-mockingjay-movie-review/\" ><em>Mockingjay &#8211; Part 1</em>, the third film in <em>The Hunger Games</em> series</a>, Katniss finally has the Capitol&rsquo;s attention and sings a song, &ldquo;The Hanging Tree,&rdquo; that becomes a powerful anthem and tool of civil unrest.</p>\n\n\n\n<p>Suzanne Collins, author of <em>The Hunger Games </em>series and the prequel, wrote the lyrics to the song, which originally appeared in the novel <em>Mockingjay</em>, and worked with The Lumineers&rsquo; Jeremiah Fraites and Wesley Schultz to bring it to the movie adaptation. &ldquo;The Hanging Tree,&rdquo; which featured vocals from Lawrence, became a haunting folk ballad with influences from Appalachian music, and drew comparisons to Billie Holiday&rsquo;s &ldquo;Strange Fruit&rdquo; and the civil rights protest song &ldquo;We Shall Overcome.&rdquo;</p>\n\n\n\n<p>During an appearance on <em>Late Night With David Letterman</em>, Lawrence said she was nervous about singing the song in front of other people and had asked the director, Francis Lawrence, to see if <a href=\"https://time.com/3601652/lorde-yellow-flicker-beat-live-amas/\" >Lorde, who appeared throughout the film&rsquo;s official soundtrack</a>, could record song, with Lawrence lip-syncing. But eventually, Lawrence became comfortable with her voice. The song became a runaway hit outside of the film, climbing to No. 12 on the Billboard Hot 100 chart in 2014. </p>\n\n\n\n<p>In <em>The Ballad of Songbirds and Snake</em>s, &ldquo;The Hanging Tree&rdquo; gets new life via Zegler. </p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"article-video\"><div class=\"time-embed time-embed__youtube video-wrapper\" data-provider=\"youtube\" data-url=\"https://www.youtube.com/watch?v=cRsv8MHwJXg\" ><iframe loading=\"lazy\" title=\"Rachel Zegler &ndash; The Hanging Tree (from The Hunger Games: The Ballad of Songbirds &amp; Snakes)\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/cRsv8MHwJXg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div></div>\n</div></figure>\n\n\n\n<h2><strong>How &ldquo;The Hanging Tree&rdquo; became a crucial part of </strong><strong><em>The Hunger Games</em></strong></h2>\n\n\n\n<p>In <em>Mockingjay &#8211; Part 1</em>, the president of the <a href=\"https://time.com/101506/julianne-moore-hunger-games-mockingjay/\" >secret rebel District 13 Alma Coin (Julianne Moore)</a> uses Katniss as a face for a propaganda campaign to fuel the rebellion against the Capitol, asking her to become their &ldquo;Mockingjay.&rdquo; When Katniss and the rebels are making their way to a bombed District 12, her former home, she sings &ldquo;The Hanging Tree&rdquo; to a colony of mockingjays who mimic her, and the crew begins filming her to broadcast to all the districts, empowering the citizens of District 5 to destroy a hydroelectric dam&mdash;the Capitol&rsquo;s main source of electricity. Because of Katniss, the song becomes the soundtrack to the revolution.</p>\n\n\n\n<p>In <em>Mockingjay</em>, Katniss is said to have learned the song from her father and would sing it while making necklaces with her sister Primrose. Her mother banned the song from being sung in their house after hearing it.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"article-video\"><div class=\"time-embed time-embed__youtube video-wrapper\" data-provider=\"youtube\" data-url=\"https://www.youtube.com/watch?v=vZPzZ_NEwEQ\" ><iframe loading=\"lazy\" title=\"Katniss Sings &#039;The Hanging Tree&#039; | The Hunger Games: Mockingjay Part 1\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/vZPzZ_NEwEQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div></div>\n</div></figure>\n\n\n\n<p>In the prequel book, <em>The Ballad of Songbirds and Snakes</em>, it&rsquo;s revealed that Lucy Gray Baird wrote the song after witnessing the murder of a man named Arlo Chance, who is hanged at a tree where executions take place. He was accused of murdering two Peacekeepers and a coal mine boss (hence the lyrics, &ldquo;say he murdered three&rdquo;). His lover, Lil, attempted to plead his innocence. Lucy Gray writes the song but is asked not to perform it. Somehow, the tune gets passed down to Katniss.</p>\n\n\n\n<p>&ldquo;The Hanging Tree&rdquo; is featured in the film adaptation of <em>The Ballad of Songbirds and Snakes</em>, when Lucy is seen sitting in a field with a guitar singing the tune. She is back in District 12 after she wins the Hunger Games. Coriolanus Snow, <a href=\"https://time.com/6336929/hunger-games-prequel-snow-katniss/\" >her mentor in the games who falls in love with the tribute, finds her</a>. It&rsquo;s their first reunion since he was excommunicated from the Capitol and managed to get stationed in District 12 as a Peacekeeper. After hearing her sing &ldquo;The Hanging Tree,&rdquo; he comes to associate it with her forever. Toward the end of the movie, they make an unsuccessful attempt to run away together. But Lucy she doesn&rsquo;t seem to trust Snow, and there&rsquo;s a moment when something fundamental shifts in Snow, as the warmth leaves his body and he becomes the icy President we later come to know in <em>The Hunger Games</em>.</p>\n\n\n\n<p>When Katniss sings the song in <em>Mockingjay</em>, she doesn&rsquo;t realize exactly how deeply the song affects President Snow. A larger question still looms over the connection between Lucy and Katniss: How does Katniss learn the song if we don&rsquo;t know Lucy&rsquo;s fate? <em>The Ballad of Songbirds and Snakes </em>doesn&rsquo;t quite provide the answer but does leave the door open for another installment.</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6336331/hunger-games-hanging-tree-song-prequel/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6336331"
                    }
                },
                {
                    "title": "Rosalynn Carter, 96-Year-Old Former First Lady, Is in Hospice Care at Home",
                    "link": "https://time.com/6337042/rosalynn-carter-hospice-care/",
                    "comments": "https://time.com/6337042/rosalynn-carter-hospice-care/#respond",
                    "dc:creator": {
                        "#cdata-section": "BILL BARROW / AP"
                    },
                    "pubDate": "Fri, 17 Nov 2023 20:42:02 +0000",
                    "category": [
                        {
                            "#cdata-section": "Uncategorized"
                        },
                        {
                            "#cdata-section": "News Desk"
                        },
                        {
                            "#cdata-section": "wire"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://time.com/?p=6337042"
                    },
                    "description": {
                        "#cdata-section": "The center said the 96-year-old is at home with former President Jimmy Carter, now 99. "
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module ad-300-250\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6337042\"></div></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2023/11/carter.jpg\" alt=\".\"/>\n\n\n\n<p>Former first lady Rosalynn Carter is in hospice care at home in Plains, Georgia, the Carter Center announced Friday.</p>\n\n\n\n<p>The center said the&nbsp;<a href=\"https://apnews.com/article/rosalynn-jimmy-carter-birthday-first-lady-president-3ba02fcffd3669877ac2130395a18970\"  target=\"_blank\">96-year-old</a>&nbsp;is at home with former President Jimmy Carter, now 99. The Carter family said through the statement that they are &ldquo;grateful for the outpouring of love and support.&rdquo;</p>\n\n\n\n<p>The family announced earlier this year that the former first lady is suffering from dementia. The former president entered hospice care at home in February.</p>\n\n\n\n<p>They have been married for more than 77 years, through his rise from their Georgia farm to his election to the presidency in 1976. After his 1980 defeat, the couple established The Carter Center in Atlanta as a global center to advocate human rights, democracy and public health.</p>\n"
                    },
                    "wfw:commentRss": "https://api.time.com/6337042/rosalynn-carter-hospice-care/feed/",
                    "slash:comments": "0",
                    "post-id": {
                        "@xmlns": "com-wordpress:feed-additions:1",
                        "#text": "6337042"
                    }
                }
            ]
        }
    }
}