{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"0.92","channel":{"title":"Latest World News Headlines | Daily Telegraph","link":"https://www.dailytelegraph.com.au","description":"We're for Sydney","lastBuildDate":"Sun, 19 Nov 2023 05:06:52 +0000","docs":"http://backend.userland.com/rss092","language":"en-US","item":[{"title":"‘We will weather this storm’: People in Israel continue to suffer from war with Hamas","description":{"#cdata-section":"Dotz Nano CEO Sharon Malka says the people in Israel \"will weather this storm\" as the war continues with Hamas.\n\nIsrael declared war on Hamas after the Palestinian terrorist organisation fired thousands of rockets as far north as Tel Aviv.\n\n\"All of us in Israel are still bleeding,\" he told Sky News Australia.\n\n\"Their heart is broken, and the thoughts and prayers with the families ... but with that, we are always looking forward.\n\n\"We are always being better, stronger, and after every war, every battle that we have, and I believe that we will weather this storm again and will become better like that.\""},"link":"https://www.dailytelegraph.com.au/news/world/we-will-weather-this-storm-people-in-israel-continue-to-suffer-from-war-with-hamas/video/20883dbf30573358170f561019fa9029"},{"title":"Taylor Swift fan dies before Eras Tour show in Rio","description":{"#cdata-section":"Taylor Swift has postponed her concert in Rio de Janeiro after a fan died at her Eras Tour show the night before amid sweltering heat.\n\n23-year-old Ana Clara Benevides became unwell during last night’s show – later dying in hospital.\n\nAuthorities are investigating the case of her death.\n\nMs Swift paid tribute to the fan on social media, saying: “I’m not going to be able to speak about this from the stage because I feel overwhelmed by grief. I want to say now I feel this loss deeply, and my broken heart goes out to her family and friends.”\n\nThis comes as Brazil suffers through a record-breaking heatwave, with temperatures reaching almost 40 degrees Celsius."},"link":"https://www.dailytelegraph.com.au/lifestyle/taylor-swift-fan-dies-before-eras-tour-show-in-rio/video/9ac84a6c2f2458dbfeede17100646184"},{"title":"LaVista apartment residents threaten lawsuit","description":{"#cdata-section":"Residents of the burned apartments at the Reserve at LaVista Walk announced they plan to file a class-action lawsuit against the apartment's owners. They claim the owners knew of problems with the fire suppression system as well as other issues, but ignored them."},"link":"https://www.dailytelegraph.com.au/news/world/lavista-apartment-residents-threaten-lawsuit/video/a11a7963514cd22266569669b8a79725"},{"title":"Atlanta teacher accused of slapping child with autism","description":{"#cdata-section":"A metro Atlanta mom wants answers after she says her seven-year-old son, who has autism, was slapped by his teacher. Now, officials with Atlanta Public Schools are investigating the incident."},"link":"https://www.dailytelegraph.com.au/news/world/atlanta-teacher-accused-of-slapping-child-with-autism/video/c826e188362b2e368324f996857fd791"},{"title":"Many killed in Israeli attacks on two schools in northern Gaza","description":{"#cdata-section":"Hundreds of Palestinians sought shelter at schools, survivors use shovels and hands to extricate people from rubble."},"link":"https://www.dailytelegraph.com.au/news/world/many-killed-in-israeli-attacks-on-two-schools-in-northern-gaza/video/a914be5372f4e7e1e067320067759907"},{"title":"Detroit family searching for missing emotional support dog","description":{"#cdata-section":"Despite extensive search efforts by foot, bike, car, and drone within a two-mile radius, there's been no trace of the dog."},"link":"https://www.dailytelegraph.com.au/news/world/detroit-family-searching-for-missing-emotional-support-dog/video/7399f1285044d919d1947ade02e4cc99"},{"title":"Hamas had not planned to attack music festival, Israeli report says","description":{"#cdata-section":"First police investigation of Supernova festival also found Israeli forces responsible for some deaths."},"link":"https://www.dailytelegraph.com.au/news/world/hamas-had-not-planned-to-attack-music-festival-israeli-report-says/video/2ce42f870be49e76640d1ff69daf90ad"},{"title":"Hundreds pack Love Park for opening of Christmas Village","description":{"#cdata-section":"The holiday shopping season is underway in Center City, with a soft opening of Christmas Village, a beloved tradition. The official start to the Village is Wednesday."},"link":"https://www.dailytelegraph.com.au/news/world/hundreds-pack-love-park-for-opening-of-christmas-village/video/cef168f9f0ffda53409a0ff88e886b5d"},{"title":"Virginia woman running 29 races in 1 year to raise trauma awareness","description":{"#cdata-section":"It’s Philadelphia Marathon weekend and one runner from Virginia is running with a very special mission."},"link":"https://www.dailytelegraph.com.au/news/world/virginia-woman-running-29-races-in-1-year-to-raise-trauma-awareness/video/6894f3bd27a98599a3f8b0dd15b5bda5"},{"title":"SEPTA, Transit Police Union have no deal as stike deadline looms","description":{"#cdata-section":"SEPTA Transit Police officers are preparing for a possible strike, with a deadline of early Monday morning."},"link":"https://www.dailytelegraph.com.au/news/world/septa-transit-police-union-have-no-deal-as-stike-deadline-looms/video/4c1ecf965a5432332c84dad6385566c3"}]}}}