{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Security @ Cisco Blogs","atom:link":{"@href":"https://blogs.cisco.com/security/feed","@rel":"self","@type":"application/rss+xml"},"link":"https://blogs.cisco.com/security","description":"","lastBuildDate":"Fri, 17 Nov 2023 17:42:12 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=5.9.2","image":{"url":"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2020/03/8c630e69-cropped-b44a9049-cropped-screen-shot-2019-11-08-at-12.24.33-pm-32x32.png","title":"Security @ Cisco Blogs","link":"https://blogs.cisco.com/security","width":"32","height":"32"},"item":[{"title":"Finding the Courage to Continue: Top 3 Takeaways from the Security Outcomes Report for Zero Trust","link":"https://blogs.cisco.com/security/finding-the-courage-to-continue-top-3-takeaways-from-the-security-outcomes-report-for-zero-trust/","comments":"https://blogs.cisco.com/security/finding-the-courage-to-continue-top-3-takeaways-from-the-security-outcomes-report-for-zero-trust/#respond","dc:creator":{"#cdata-section":"J. Wolfgang Goerlich"},"pubDate":"Thu, 16 Nov 2023 13:00:06 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Zero Trust"},{"#cdata-section":"zero trust security"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=443192"},"description":{"#cdata-section":"The Security Outcomes Report: Adoption, Access, And Automation Trends shows that 86.5% of orgs have begun zero trust, only 2% reaching maturity."},"content:encoded":{"#cdata-section":"<p style=\"text-align: center;\">&#8220;Success is not final, failure is not fatal: It is the courage to continue that counts.&#8221;<br />\n&#8211; Winston Churchill</p>\n<p>When it comes to zero trust, teams are finding the courage to continue, based on the latest <a href=\"https://www.cisco.com/c/en/us/products/security/zero-trust-outcomes-report.html\" target=\"_blank\" rel=\"noopener\">Security Outcomes Report on Zero Trust: Adoption, Access, And Automation Trends</a>.</p>\n<p>Let’s start with some good news. Zero trust security adoption is on the rise.</p>\n<p>A large majority of organizations &#8211; <strong>86.5% &#8211;</strong> report starting on some aspect of zero trust – whether implementing multi-factor authentication (MFA), securing remote user access, deploying network segmentation, or enforcing micro-segmentation in cloud workloads.</p>\n<p><img class=\"aligncenter size-full wp-image-443193\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.42.57 PM.png\" alt=\"\" width=\"594\" height=\"380\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.42.57 PM.png 594w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.42.57 PM-300x192.png 300w\" sizes=\"(max-width: 594px) 100vw, 594px\" /></p>\n<p>That’s the good news. The not so good news? Only a tiny sliver of respondents &#8211; <strong>2%</strong> &#8211; claim to have achieved maturity across the zero trust pillars.</p>\n<p>That said, more than a third of organizations have reached maturity in at least one zero trust pillar.*</p>\n<p>*The zero trust pillars used in the report are a simplified version of (and loosely align to) Cisco’s <a href=\"https://www.cisco.com/c/en/us/products/security/cisco-security-reference-architecture.html\">zero trust security reference architecture</a> as well as <a href=\"https://www.cisa.gov/sites/default/files/2023-04/zero_trust_maturity_model_v2_508.pdf\">CISA’s model</a>. They are: Identity; Device; Network and Workload; and Automation and Orchestration.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>The seeds of courage: zero trust aligns with operational excellence</strong></span></h2>\n<p>These findings give CISOs and our teams the rationale as well as the courage to continue adopting zero trust security. But how do we engage the rest of the organization to join the initiative?</p>\n<p>The answer lies in aligning the outcomes from zero trust programs to the objectives of the organization. Thankfully, we found zero trust improves several outcomes. From adapting to external events to maturing their security capability, organizations with zero trust in place report a double digit increase in excellence at achieving these outcomes than those without zero trust.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-443194\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.44.36 PM.png\" alt=\"\" width=\"602\" height=\"358\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.44.36 PM.png 602w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.44.36 PM-300x178.png 300w\" sizes=\"(max-width: 602px) 100vw, 602px\" /></p>\n<h2><span style=\"color: #6abf4b;\"><strong>Top Three Takeaways</strong></span></h2>\n<p><strong>1. The more pillars pursued; the more achievements unlocked. </strong>Progress is measured in pillars; the more pillars of zero trust are implemented, the better the outcomes, which supports the idea that zero trust requires a holistic approach to reap measurable benefits.</p>\n<p>Key findings:</p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>Organizations not yet started on the zero trust journey are <strong>twice as likely</strong> to report incidents than those completing all zero trust pillars &#8211; from <strong>67% to 33%</strong>.</li>\n<li>As organizations add zero trust technologies to their security stack, the percentage of reported incidents drops from <strong>74% to 38%.</strong></li>\n<li>Moving from completing three pillars to four pillars involves a huge perception jump in terms of whether zero trust is viewed in place: from <strong>53% to over 82%.</strong></li>\n</ul>\n</li>\n</ul>\n<p><strong>2. Order matters: Identity first, then segmentation, then automation and orchestration. </strong>The most common question we receive in our <a href=\"https://www.cisco.com/c/en/us/products/security/zero-trust-workshops.html\" target=\"_blank\" rel=\"noopener\">Zero Trust Workshops</a> is consistently ‘where do I start?’ The findings from the report suggest that most organizations start by securing user access via multi-factor authentication (MFA), continuous user validation, role-based access control (RBAC), and other identity and access management technologies. The next use cases to follow involve segmenting networks and cloud workloads and setting up automated and orchestrated SOC workflows (e.g., <a href=\"https://www.cisco.com/site/us/en/products/security/xdr/index.html\" target=\"_blank\" rel=\"noopener\">XDR</a>).</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-443195\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.45.53 PM.png\" alt=\"\" width=\"594\" height=\"298\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.45.53 PM.png 594w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/Screenshot-2023-10-06-at-6.45.53 PM-300x151.png 300w\" sizes=\"(max-width: 594px) 100vw, 594px\" /></p>\n<p>Benefits to taking this approach include:</p>\n<ul>\n<li><strong>Improved incident response.</strong> User controls like MFA have the biggest impact on reducing incidents highlighting the value these preventative controls can have on the productivity of SecOps teams. Fewer incidents is good news for all.</li>\n<li><strong>Reduced risk of ransomware.</strong> Organizations completing the Identity pillar were nearly <strong>11% less likely</strong> to have a ransomware attack than orgs with no progress on that pillar.</li>\n</ul>\n<p><strong>Pro-tip:</strong> Check out our on-demand <a href=\"https://duo.com/resources/webinars/your-zero-trust-roadmap-five-steps-to-securing-user-access-to-applications\">webinar</a> where we cover the five key steps to take when moving from MFA to full zero trust security when securing user access to apps.</p>\n<p><strong>3. Automation accelerates zero trust adoption</strong>. Automation and Orchestration have taken the lead for how security teams evaluate their zero trust architecture. But while many agree with the need for automation, few have fully realized the benefits. This is the area where maturing programs are focusing on. After all, without the speed to remediation that orchestrated workflows can bring, achieving zero trust security will remain an elusive goal.</p>\n<p>Key findings:</p>\n<ul>\n<li>Organizations who deployed SOAR were <strong>7%</strong> <strong>more likely</strong> to claim zero trust to be in place.</li>\n<li>Organizations completing the Automation and Orchestration pillar are <strong>14% more likely</strong> to be successful at adapting to external change events.</li>\n</ul>\n<p>Download the <a href=\"https://www.cisco.com/c/en/us/products/security/zero-trust-outcomes-report.html\" target=\"_blank\" rel=\"noopener\">full report</a> to discover more insights about how to continue gaining momentum for your zero trust rollout.</p>\n<p>Watch our on-demand <a href=\"https://duo.com/resources/webinars/your-zero-trust-roadmap-five-steps-to-securing-user-access-to-applications\">webinar</a> to map out your zero trust roadmap for securing user access to devices.</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/finding-the-courage-to-continue-top-3-takeaways-from-the-security-outcomes-report-for-zero-trust/feed","slash:comments":"0"},{"title":"The nominees to the Cybersecurity Defender of 2023 for the Asia Pacific Region.","link":"https://blogs.cisco.com/security/the-nominees-to-the-cybersecurity-defender-of-2023-for-the-asia-pacific-region/","comments":"https://blogs.cisco.com/security/the-nominees-to-the-cybersecurity-defender-of-2023-for-the-asia-pacific-region/#respond","dc:creator":{"#cdata-section":"Cristina Errico"},"pubDate":"Wed, 15 Nov 2023 13:00:56 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Live"},{"#cdata-section":"security heroes"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=445198"},"description":{"#cdata-section":"Meet the four fabulous cybersecurity leaders and professionals who had been nominee by other cisco customers for Cybersecurity Defender of the Year in APJC. Let that their stories will inspire you and show another way to afford your daily fight against threats"},"content:encoded":{"#cdata-section":"<p>In cybersecurity, professionals from all walks of life come together to protect sensitive data and share their knowledge with others. Cisco is proud to recognize and celebrate exceptional cybersecurity advocates in each region with the Cybersecurity Defender of 2023 Award.</p>\n<p>During a special ceremony at Cisco Live in Melbourne, four outstanding advocates from the Asia Pacific region will be honored, and one will be named the winner. Their stories are truly remarkable and serve as an inspiration to the broader cybersecurity community. We are grateful for their tireless efforts to safeguard critical data and unwavering commitment to the cause.</p>\n<p>On the 5<sup>th</sup> of December, we will announce the winner of this award here on the Cisco Security Blog and during the Security Innovation Forum at Cisco Live Melbourne.</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #6abf4b;\"><strong>Nominees for the Cybersecurity Defender of 2023 in Asia Pacific Region Award</strong></span></h2>\n<h2><a href=\"https://www.linkedin.com/in/johncarse/\" target=\"_blank\" rel=\"noopener\">John Carse, CISO of Dyson</a></h2>\n<p>John started his IT career at Apple twenty years ago. Today, he is the Chief Information Security Officer (CISO) at Dyson. John is a passionate advocate for cybersecurity and will share his knowledge and views at two interviews at Cisco Live Melbourne. His commitment to making the digital world safer has earned him recognition from Cisco. John&#8217;s journey is a testament to the fact that anything is possible with hard work, dedication, and a passion for what you do.</p>\n<p>John’s latest endeavor is overseeing cybersecurity building advanced capabilities to ensure resilience. His vision is to incorporate these capabilities into other plants, making Dyson a leader in innovation and sustainability.</p>\n<h2><a href=\"https://www.linkedin.com/in/cheukwong/\" target=\"_blank\" rel=\"noopener\">Cheuk Wong, CISO at Melbourne International Airport</a></h2>\n<p>Cheuk Wong is a cybersecurity leader who has built a team of experts to protect one of the largest airports in Australia. As the Senior Director of Cybersecurity at Melbourne Airport, Cheuk Wong understands that preserving the airport&#8217;s systems is crucial to ensuring the safety and security of millions of passengers annually.</p>\n<p>He is constantly learning and anticipating potential threats to provide robust protection 24/7. Recently, Cheuk Wong spoke at the <a href=\"https://video.cisco.com/detail/video/6340163695112\" target=\"_blank\" rel=\"noopener\">Cisco Security Virtual Summit Asia Pacific session</a>, sharing how Melbourne International Airport achieved superior security outcomes with a small team that punches above its weight.  His dedication and passion for cybersecurity inspire others to strive for excellence.</p>\n<p>Melbourne International Airport caters to roughly 100,000 passengers daily; the uptime of the networks and infrastructure to support the services that passengers and operations staff rely on is paramount.  Cheuk Wong and his team leverage the ecosystem of Cisco technology in their environment to ensure the airport continues to operate and remain secure at all times.</p>\n<p>Cheuk Wong will attend Cisco Live Melbourne, where he will continue sharing his insights and knowledge with others.</p>\n<h2><a href=\"https://www.linkedin.com/in/satishchowdhary/?originalSubdomain=au\" target=\"_blank\" rel=\"noopener\">Satish Chowdhary, Network Enterprise Architect at Ampol</a></h2>\n<p><a href=\"https://video.cisco.com/detail/video/6316271531112\" target=\"_blank\" rel=\"noopener\">Satish Chowdhary</a> is a network enterprise architect at <a href=\"https://www.cisco.com/c/en/us/about/case-studies-customer-success-stories/ampol.html\" target=\"_blank\" rel=\"noopener\">Ampol</a> who believes data is the new oil.</p>\n<p>He has securely implemented IoT technology across Ampol&#8217;s operational, Retail infrastructure and Ampol Energy Services, leveraging security technologies to proactively manage the company&#8217;s complex infrastructure.</p>\n<p>His critical thinking and expertise in managing diverse threat vectors were crucial in helping secure Ampol&#8217;s Datacentre Infrastructure covering refineries, fueling stations, and significant pipelines.</p>\n<p>Satish collaborated with Cisco to provide robust layers of security, simplification, and proactive threat mitigation, enabling Ampol to manage its IoT devices securely and efficiently. His contributions have enhanced customer experience and service reliability, significantly contributing to AMPOL’s cyber security domain.</p>\n<p>He has shared his experience and insights <a href=\"https://www.cisco.com/c/en/us/about/case-studies-customer-success-stories/ampol.html?ccid=cc000160&amp;oid=csysc030637&amp;dtid=oblgcdc000651#~the-story\" target=\"_blank\" rel=\"noopener\">on multiple occasions</a> and will continue to do so at Cisco Live Melbourne.</p>\n<h2><a href=\"https://www.linkedin.com/in/peter-mckenzie-16102a61/\" target=\"_blank\" rel=\"noopener\">Peter McKenzie, Cisco Instructor at Chisholm Institute</a></h2>\n<p>Peter, <a href=\"https://blogs.cisco.com/insidervoices/cisco-global-advocate-awards-2021-winner-peter-mckenzie-shares-what-it-means-to-him\" target=\"_blank\" rel=\"noopener\">the Cisco Everyday Hero of 2021 award recipient</a>, is a passionate advocate for cybersecurity education.</p>\n<p>He encourages aspiring technology professionals to focus on CyberOps and DevOps, stating that &#8220;that&#8217;s what&#8217;s needed today!&#8221; Peter has seen the impact of cybersecurity education firsthand, especially for women in the field.</p>\n<p>As he explains, &#8220;Networking and cybersecurity are still predominantly male-oriented fields. However, a couple of years ago, I had three female students who were mentored at Cisco&#8217;s office in Melbourne. Those students told me they got jobs as a result, and they thanked me for pushing them to complete the Cisco program. It gave them the confidence to enter the workforce.&#8221;</p>\n<p>Peter&#8217;s dedication to cybersecurity education is inspiring, and he will continue to share his knowledge and insights at events like Cisco Live Melbourne and through his LinkedIn profile.</p>\n<p>I hope that these outstanding cybersecurity professionals&#8217; incredible stories and achievements have inspired you as much as they have inspired me. Stay tuned to the Cisco Security Blog on the 5th of December to find out who will be named the Cybersecurity Defender of 2023 for the Asia Pacific region.</p>\n<p>And who knows, you or someone you know will be the next advocate recognized for exceptional contributions to the cybersecurity community.</p>\n<p>So, keep working hard, stay dedicated, and never give up on your passion for cybersecurity!</p>\n<h2 style=\"text-align: center;\"><a href=\"https://app.smartsheet.com/b/form/7c5725f9e0a74edb84cf3eaf23516a24\" target=\"_blank\" rel=\"noopener\"><strong>To participate in the next Cybersecurity Defender of the Year award, fill out this form now!</strong></a></h2>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/the-nominees-to-the-cybersecurity-defender-of-2023-for-the-asia-pacific-region/feed","slash:comments":"0"},{"title":"ESG Survey results reinforce the multi-faceted benefits of SSE","link":"https://blogs.cisco.com/security/esg-survey-results-reinforce-the-multi-faceted-benefits-of-sse/","comments":"https://blogs.cisco.com/security/esg-survey-results-reinforce-the-multi-faceted-benefits-of-sse/#respond","dc:creator":{"#cdata-section":"John Gudmundson"},"pubDate":"Tue, 14 Nov 2023 12:59:54 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Featured"},{"#cdata-section":"secure access"},{"#cdata-section":"trusted access"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=444948"},"description":{"#cdata-section":"Analyst survey by Enterprise Strategy Group (ESG) reveals how Security Service Edge (SSE) solutions protect the hybrid workforce and internal resources while simplifying IT complexity and enhancing the user experience."},"content:encoded":{"#cdata-section":"<p>When it comes to protecting a hybrid workforce, while simultaneously safeguarding internal resources from external threats, cloud-delivered security with <a href=\"https://www.cisco.com/site/us/en/solutions/security-service-edge-sse/index.html#tabs-9e2187ae1d-item-8d800bd1e7-tab\" target=\"_blank\" rel=\"noopener\">Security Service Edge</a> (SSE) is seen as the preferred method.</p>\n<p>Enterprise Strategy Group (ESG) recently conducted a study of IT and security practitioners, evaluating their views on a number of topics regarding SSE solutions. Respondents were asked for their views on security complexity, user frustration, remote/hybrid work challenges, and their take on the expectations vs. reality when it came to the benefits of SSE. The results provide critical insights into how to protect a hybrid workforce, streamline security procedures, and enhance end-user satisfaction. Some of the highlights from their report include:</p>\n<ul>\n<li>Remote/hybrid workers were found to be the biggest source of cyber-attacks with 44% coming from them.</li>\n<li>Organizations are moving towards cloud-delivered security, as 75% indicated a preference for cloud-delivered cybersecurity products vs. on-premises security tools.</li>\n<li>SSE is delivering value, with over 70% of respondents stating they achieved at least 10 key benefits involving operational simplicity, improved security, and better user experience.</li>\n<li>SecOps teams report significantly fewer attacks, with 56% stating they observed over a 20% reduction in security incidences using SSE.</li>\n</ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-444952\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-stats64-1024x352.png\" alt=\"\" width=\"640\" height=\"220\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-stats64-1024x352.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-stats64-300x103.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-stats64-768x264.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-stats64.png 1200w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Delving further into the report, ESG provides details explaining why organizations have gravitated towards SSE and achieved significant success. SSE simplifies the security stack, substantially improving protection for remote users, while enhancing hybrid worker satisfaction with easier logins and better performance. It helps avert numerous challenges, from stopping malware spread to shrinking the attack surface.</p>\n<p>Here’s some of the added benefits that SSE users see.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Overcome cybersecurity complexity</strong></span></h2>\n<p>Among the respondents, more than two-thirds describe their current cybersecurity environment as complex or extremely complex. The top cited source (83%) involved the accelerated use of cloud-based resources and the need to secure access, protect data, and prevent threats. The second most common source of complexity was the number of security point products required (78%) with an average of 63 cybersecurity tools in use. Number three on the hit parade was the need for more granular access policies to support zero trust principles (77%) and the need to apply least privilege policies with user, application, and device controls. Other factors mentioned by wide margins include an expanded attack surface from work-from-home employees, use of unsanctioned applications and a growing number of more sophisticated attacks.</p>\n<p>Organizations can offset these challenges by deploying SSE. These protective services reside in the cloud, between the end-user and the cloud-based resources they utilize as opposed to on-premises methods that are ‘out of the loop’. SSE consolidates many security features including Zero Trust Network Access (ZTNA), Secure Web Gateway (SWG), Firewall as a Service (FWaaS) and Cloud Access Security Broker (CASB) with one dashboard to simply operations. With advanced ZTNA with zero trust access (ZTA) authorized users can only connect to specific, approved apps. Discovery and lateral movement by compromised devices or unauthorized users are prevented.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Enhance end-user experience</strong></span></h2>\n<p>The report found current application access processes often result in user frustration. Respondents reported their workforce uses a collective average of 1,533 distinct business applications. As these apps typically reside in the cloud, secure usage is no longer straightforward. To support zero trust, many organizations have shifted to more stringent authentication and verification tasks. While good from a security perspective, 52% of respondents indicated their users were frustrated with this practice. Similarly, 50% mentioned user frustration at the number of steps to get to the application they need and 45% at having to choose the method of connection based on the application.</p>\n<p>Performance was also cited as an issue, with 43% indicating user frustration. More than one-third (35%) indicated that latency impacting the end-user experience. In some cases, this leads to users circumventing the VPN, which was cited by 38% of respondents. Such user noncompliance can introduce additional risk and the potential for malicious actors to view traffic flows.</p>\n<p>VPNs were found to be poorly suited to supporting zero trust principles. They do not allow for granular access policies to be applied (mentioned by 31% of respondents) and are visible on the public internet, allowing attackers a clear entry point to the network and corporate applications (cited by 22%).</p>\n<p>By implementing SSE with ZTA administrators can give remote users the same type of straightforward, performant experience as when they are in the office, without IT teams being forced to make a trade-off between security and user satisfaction. ZTA allows users to access all, not some, of the potentially thousands of apps needed. ZTA provides a transparent and seamless ‘one-click’ process to login. Backed by advanced protocols, users can obtain HTTP3 level speeds with reduced latency and more resilient connections. Ultra-granular access with one user to one app ‘micro tunnels’ ensure security while providing resource obfuscation and preventing lateral movement.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Solve hybrid work security challenges</strong></span></h2>\n<p>It’s challenging to secure hybrid workforces that include remote workers, contractors, and partners. This new hyper-distributed landscape results in an expanded attack surface, as well as an increase in device types and inconsistent performance. Respondents cited the need to ensure malware does not spread from remote devices to corporate locations and resources (55%) as their most critical concern. The second biggest issue mentioned is the need to check device posture (51%) consistently and continuously. In third place, IT listed defending an expanding attack surface due to users directly accessing cloud-based apps (50%). Other items of note include the lack of visibility into unsanctioned apps (45%) and protecting users as they access cloud apps (40%).</p>\n<p>SSE is tailor-made to address these roadblocks to security. Multiple defense-in-depth features from the cloud ensure malware and other malicious activity is routed out and prevents infection before it starts. Continuous, rich posture checks with contextual insights ensure device compliance. Thorough user identification and authentication procedures combined with granular access control policies prevent unauthorized resource access. CASB provides visibility into what applications are being requested and controls access. Remote Browser Isolation (RBI), DNS-filtering, FWaaS and other features protect end users as they use Internet or public cloud services.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Benefits derived through SSE</strong></span></h2>\n<p>The survey clearly demonstrates that many organizations who are utilizing SSE solutions are reaping a broad set of benefits. These can be categorized in three pillars: increased user and resource security, simplified operations, and enhanced user experience. When respondents were asked if they felt their initial expected benefits were subsequently realized once SSE was deployed, over 73% reported achieving at least ten critical advantages. A partial list of these factors include:</p>\n<ul>\n<li>Simplified security operations/increased efficiency with ease of configuration and management</li>\n<li>Improved security specifically for remote/hybrid workforce</li>\n<li>Enacting principles of least privilege by allowing remote access only to approved resources</li>\n<li>Superior end-user access experience</li>\n<li>Prevention of malware spread from remote users to corporate resources</li>\n<li>Increased visibility into remote device posture assessment</li>\n</ul>\n<h2><span style=\"color: #6abf4b;\"><strong>Cisco leads the way in SSE</strong></span></h2>\n<p>Cisco’s SSE solution goes way beyond standard protection. In addition to the four principal features previously listed (ZTNA, SWG, FWaaS, CASB), our <a href=\"https://www.cisco.com/site/us/en/products/security/secure-access/index.html?_gl=1*1ovo18z*_gcl_au*MTExODc0MzI1LjE2OTUzMjcwMjk.&amp;_ga=2.3314224.1413401180.1695405946-165400248.1695326762#tabs-9cfa4a460b-item-b8ba101fed-tab\" target=\"_blank\" rel=\"noopener\">Cisco Secure Access</a> includes RBI, DNS filtering, advanced malware protection, Intrusion Prevention System (IPS), VPN as a Service (VPNaaS), multimode Data Loss Prevention (DLP), sandboxing and digital experience monitoring (DEM). This feature rich array is backed by the industry-leading threat intelligence group, Cisco Talos, giving security teams a distinct advantage in detecting and preventing threats.</p>\n<ul>\n<li><img loading=\"lazy\" class=\"aligncenter size-full wp-image-444953\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/Cisco_SSE_Core_Infographic_Light15.png\" alt=\"\" width=\"703\" height=\"703\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/Cisco_SSE_Core_Infographic_Light15.png 703w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/Cisco_SSE_Core_Infographic_Light15-300x300.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/Cisco_SSE_Core_Infographic_Light15-150x150.png 150w\" sizes=\"(max-width: 703px) 100vw, 703px\" /></li>\n</ul>\n<p>With Secure Access:</p>\n<ul>\n<li>Authorized users can access <em>any</em> app, including non-standard or custom, regardless of the underlying protocols involved.</li>\n<li>Security teams can employ a safer, layered approach to security, with multiple techniques to ensure granular access control.</li>\n<li>Confidential resources remain hidden from public view with discovery and lateral movement prevented.</li>\n<li>Performance is optimized with the use of next-gen protocols, MASQUE and QUIC, to realize HTTP3 speeds</li>\n<li>Administrators can quickly deploy and manage with a unified console, single agent and one policy engine.</li>\n<li>Compliance is maintained via continuous in-depth user authentication and posture checks.</li>\n</ul>\n<p>To learn more about the survey results and how SSE provides superior cloud-delivered security, read ESG’s findings in the eBook, <a href=\"https://www.cisco.com/c/en/us/products/security/secure-access/keys-to-successful-sse.html\">Keys to Successful SSE</a>.</p>\n<p><a href=\"https://www.cisco.com/c/en/us/products/security/secure-access/keys-to-successful-sse.html\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\"aligncenter wp-image-444959 size-large\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-header-1-1024x536.jpg\" alt=\"eBook: Keys to Successful SSE\" width=\"640\" height=\"335\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-header-1-1024x536.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-header-1-300x157.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-header-1-768x402.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/ESG-survey-blog-header-1.jpg 1200w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></a></p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/esg-survey-results-reinforce-the-multi-faceted-benefits-of-sse/feed","slash:comments":"0"},{"title":"The Definitive Guide to Cloud Office Security","link":"https://blogs.cisco.com/security/bec-and-cloud-office-security/","comments":"https://blogs.cisco.com/security/bec-and-cloud-office-security/#respond","dc:creator":{"#cdata-section":"Anand Raghavan"},"pubDate":"Tue, 14 Nov 2023 04:22:48 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"BEC"},{"#cdata-section":"Business Email Compromise"},{"#cdata-section":"Email Threat Defense"},{"#cdata-section":"secure email"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=445205"},"description":{"#cdata-section":"Fake invoice email or Invoice fraud is a form of BEC business email compromise. Learn the warning signs and how to identify them."},"content:encoded":{"#cdata-section":"<p>Everything you need to know about securing communications across email, messaging, file-sharing and other cloud office applications.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Introduction</span></strong></h2>\n<p>We live in a world dominated by remote work, cloud adoption, and digital workflows. This evolution in the way we live and work has resulted in improved organizational agility and a happier (not to mention more efficient) workforce. We send important communications over email, collaborate on Slack, store files in Box, and are able to complete business-critical processes much faster than ever before. However, chinks in this cloud-first armor have begun to appear.</p>\n<p>While security technologies have focused on protecting every imaginable layer within cloud security, the most targeted layer is also the most overlooked &#8211; the human layer. Humans sit at the center of this collaboration sprawl, talking and writing and performing critical actions that keep businesses running. While all of this context lies unanalyzed, targeted attacks and data loss rear their heads.</p>\n<p>Email attacks today are laser focused and evade traditional detection by targeting human nature. Moving beyond mass-phishing and malicious payloads, attackers are now researching their targets before sending socially engineered emails. Attackers impersonate trusted parties or take over legitimate email accounts to induce actions that cause financial and data loss. Over $26 billion has been lost to <a href=\"https://blogs.cisco.com/security/understanding-business-email-compromise-to-better-protect-against-it?dtid=osscdc000283\">business email compromise (BEC) </a>attacks over the last three years <a href=\"https://www.ic3.gov/Media/PDF/AnnualReport/2022_IC3Report.pdf\">according to the FBI</a><a href=\"https://www.google.com/\">.</a></p>\n<p>Even after deploying a bevy of DLP tools, both direct and lateral data loss are prevalent across organizations today. The desire for speed and productivity usually comes at the expense of data privacy and compliance. Whether inadvertently or maliciously, employees share Personally Identifiable Information (PII), Payment Card Information (PCI), passwords, and confidential data &#8211; either with outside parties or laterally across email, messaging, and file-sharing services.</p>\n<p>“Over $26 billion has been lost to business email compromise (BEC) attacks over the last three years according to the FBI.”</p>\n<p>A new layer of security controls has emerged to protect the human layer across office applications. Enough stage-setting: Let’s introduce <strong>cloud office security</strong>.</p>\n<hr />\n<h2><strong><span style=\"color: #6abf4b;\">What is Cloud Office Security?</span></strong></h2>\n<p>Let’s start off simple:</p>\n<p>Cloud office security refers to processes and technologies that protect people and data across any channel used for communication and collaboration. These channels include but are not limited to email, messaging, file-sharing, and video communications.</p>\n<figure id=\"attachment_445206\" aria-describedby=\"caption-attachment-445206\" style=\"width: 640px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-large wp-image-445206\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dfcgvhbjnkjknhg-1024x538.png\" alt=\"\" width=\"640\" height=\"336\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dfcgvhbjnkjknhg-1024x538.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dfcgvhbjnkjknhg-300x158.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dfcgvhbjnkjknhg-768x403.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dfcgvhbjnkjknhg.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /><figcaption id=\"caption-attachment-445206\" class=\"wp-caption-text\">Fig 1: A visual overview of Cloud Office Security</figcaption></figure>\n<p>If we study this definition closely, three terms stand out:</p>\n<h3><strong>Process and technologies</strong></h3>\n<p>Cybersecurity often tends to revert to a silver bullet mentality, but this should tell you that there’s no all-healing panacea for cloud office security. Similar to <a href=\"https://community.cisco.com/t5/security-knowledge-base/devsecops-defined/ta-p/4712801\">DevSecOps</a> or <a href=\"https://www.cisco.com/c/en/us/products/security/zero-trust-network-access.html\">Zero Trust</a>, adopting cloud office security requires more than just implementing the relevant technology. It requires strategizing and deploying organizational practices that protect your business workers from losing money or data to socially engineered attacks.</p>\n<p>It requires embracing API-first implementation of security controls that are best suited to safeguarding a distributed workforce using distributed cloud apps. It requires democratizing threat triage across employees, enabling workers to mark threats as safe or suspicious to increase alert relevance and reduce alert fatigue for your security team. It also requires empowering end users to classify confidential data and institute universal security controls that recognize the confidentiality of that data across channels.</p>\n<p>Simply put, cloud office security is a journey requiring organizational flexibility and organizational discipline in equal measure.</p>\n<h3><strong>Protect people and data</strong></h3>\n<p>Traditionally, security products that detect and respond to inbound threats (like phishing and BEC attacks) lie separate from security products that prevent outbound data loss. But if we put people at the center of this security equation, it’s necessary for security controls to tackle both the inbound and outbound halves of this coin.</p>\n<p>On the inbound front, cloud office security technologies protect against the entire spectrum of targeted attacks including BEC, account takeover, and impersonation. Cloud office security solutions are built to augment the traditional security controls that your email provider might already have such as <a href=\"https://www.cisco.com/c/en/us/products/security/advanced-malware-protection/index.html\">Advanced Malware Protection </a></p>\n<p>On the outbound front, cloud office security technologies prevent the loss of sensitive and confidential data both within and across cloud application channels. Cloud office security solutions are built to augment and improve upon traditional Data Loss Prevention (DLP) rules through contextual understanding of data and the people sharing that data.</p>\n<h3><strong>Across any channel</strong></h3>\n<p>We’ve left the most pertinent point for last. Cloud office security technologies are purpose-built to work across channels including email, messaging, file-sharing, and other cloud application channels.</p>\n<p>“Cloud office security refers to processes and technologies that protect people and data across any channel used for communication and collaboration. These channels include but are not limited to email, messaging, file-sharing, and video communications.”</p>\n<p>The cross-channel nature of cloud office security is necessary because the elements they’re protecting &#8211; people and data &#8211; don’t reside on any one channel today. Analyzing signals across channels lends cloud office security technologies universal context of enterprise communications. This context is vital in addressing concerns where siloed security solutions fall short (e.g., an employee downloading a sensitive document from Slack and sharing it with an outside contractor over email).</p>\n<hr />\n<h2><strong><span style=\"color: #6abf4b;\">Cloud Office Security vs. Cloud Security: What’s the difference?</span></strong></h2>\n<p>Now that we’ve defined cloud office security, you’re probably wondering how it all fits in with other layers of cloud security. Protecting cloud environments is certainly not a new development, so how is cloud office security different?</p>\n<p><a href=\"https://www.cisco.com/c/en/us/products/security/cloud-security/what-is-cloud-security.html\">Cloud security</a> constitutes many layers, each with its own set of technologies and controls that protect the integrity of virtualized IP, data, applications, and infrastructure. Cloud office security protects the human (or contextual) layer that sits atop all other cloud security layers.</p>\n<ul>\n<li><strong>Cloud Infrastructure Security:</strong> Products that detect anomalies, stop vulnerabilities and ensure continuous security on the cloud infrastructure layer.</li>\n<li><strong>Hypervisor/Container Security: </strong>Products that detect anomalies, stop vulnerabilities and ensure continuous security on the hypervisor/container layers.</li>\n<li><strong>Cloud Application Security:</strong> Products that detect anomalies, enforce compliance and prevent the loss of structured sensitive data on cloud applications.</li>\n<li><strong>Cloud Office Security:</strong> Products that protect people and data through a shared understanding of organizational context across cloud office applications.</li>\n</ul>\n<p>Let’s take an example of a security attack to broadly define the roles of different cloud security layers. Adversaries get hold of an employee’s Box login credentials through a zero-day credential phishing email. Upon infiltrating the employee’s Box account, the adversaries host the same zero-day URL on a Box file and share it with other employees and customers for follow-on compromise. The adversaries also find a sensitive Box file that lists the AWS account credentials of a few engineering team members. After gaining access to AWS, the attackers set up a cryptojacking environment by diverting some EC2 processing power.</p>\n<p>Every cloud security layer does its part while detecting and responding to this multi-part attack, but the entire attack was possible because adversaries were able to phish an employee’s credentials and move laterally to their Box account. Cloud office security solutions are built to detect and respond to the attack entry point in this example.</p>\n<p>While all the other cloud security layers undoubtedly have their merits, it’s usually a human being targeted (or making a mistake) that acts as the entry point for all the other security layers being negatively affected. Improving your cloud office security posture can lead to better ROI for the entire cloud security stack.</p>\n<p>“Cloud security constitutes many layers, each with its own set of technologies and controls that protect the integrity of virtualized IP, data, applications, and infrastructure. Cloud office security protects the human (or contextual) layer that sits atop all other cloud security layers.”</p>\n<h2><strong><span style=\"color: #6abf4b;\">Why is Cloud Office Security needed?</span></strong></h2>\n<p>So you’re clear on what cloud office security means and where it falls within the cloud security umbrella. The obvious next question is &#8211; so what? Why is cloud office security needed?</p>\n<p>In some ways, decades-long technological trends have led us to this point where cloud office security should be a key part of every organization’s security stack.</p>\n<h3><strong>Rapid (and unsecure) cloud adoption</strong></h3>\n<p>Most business applications have moved to the cloud, and the ones that haven’t are in the process of being moved. The worldwide public cloud services market is forecast to <a href=\"https://www.gartner.com/en/newsroom/press-releases/2023-04-19-gartner-forecasts-worldwide-public-cloud-end-user-spending-to-reach-nearly-600-billion-in-2023#:~:text=Worldwide%20end%2Duser%20spending%20on,latest%20forecast%20from%20Gartner%2C%20Inc.\">grow 21.7% to total $597.3 billion in 2023</a>, up from $491 billion in 2022, according to the latest forecast from Gartner, Inc. This is unquestionably a positive trend &#8211; cloud adoption improves organizational agility, minimizes the burden of capex investments, and results in a more efficient outlay of resources across the board. However, privileging speed of adoption often comes at the expense of securing these cloud environments and apps.</p>\n<h3><strong>Communication sprawl</strong></h3>\n<p>Over the course of reading this guide, you will probably get five different-sounding notifications from your phone informing you of a Slack message, some emails, an upcoming Zoom meeting, and a Box file someone shared with you.</p>\n<p>This is the double-edged sword most organizations have to deal with. Employees access a sprawling ecosystem of third-party apps, resulting in productivity gains and efficient business processes. But this same sprawl has created a large threat surface where any cloud application &#8211; and the humans using the application &#8211; are potential entry points for targeted attacks as well as potential sources of data leakage.</p>\n<h3><strong>Distributed workforce</strong></h3>\n<p>If you’re reading this guide in 2020, you’re probably reading it from home. But even if we keep force majeure events aside, the nature of work has become increasingly distributed over the years. <a href=\"https://www.upwork.com/press/releases/upwork-study-finds-22-of-american-workforce-will-be-remote-by-2025\"><strong>Upwork</strong></a><strong> estimates that 22% of the workforce (36.2 million Americans) will work remotely by 2025</strong>.</p>\n<p>This rise in remote work will lead to happier, more productive employees. But it also means the security threat surface just exploded. Organizations that could earlier apply stringent perimeter security measures and protect workplace assets now have to deal with people and data spread across the globe.</p>\n<h3><strong>Socially engineered attacks</strong></h3>\n<p>While all the aforementioned trends &#8211; cloud adoption, cross-channel communication, and telecommuting &#8211; have gathered pace, security adversaries have unfortunately not been standing still. Spray-and-pray phishing attacks have given way to the surgical precision of social engineering.</p>\n<p>Email attacks today are laser focused and evade traditional detection by targeting human nature. Moving beyond mass-phishing and malicious payloads, attackers are now researching their targets before sending emails that trigger authority, urgency, or fear in the targets’ minds. Attackers impersonate trusted parties or take over legitimate email accounts to induce actions that cause financial and data loss.</p>\n<figure id=\"attachment_445207\" aria-describedby=\"caption-attachment-445207\" style=\"width: 936px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-full wp-image-445207\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxcfgvhbgfcdxrfcgvftdxrzsdxtfyg.png\" alt=\"\" width=\"936\" height=\"514\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxcfgvhbgfcdxrfcgvftdxrzsdxtfyg.png 936w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxcfgvhbgfcdxrfcgvftdxrzsdxtfyg-300x165.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxcfgvhbgfcdxrfcgvftdxrzsdxtfyg-768x422.png 768w\" sizes=\"(max-width: 936px) 100vw, 936px\" /><figcaption id=\"caption-attachment-445207\" class=\"wp-caption-text\">Fig 2: BEC Market Size, by Offering</figcaption></figure>\n<p><a href=\"https://www.armorblox.com/blog/not-all-business-email-compromise-attacks-are-the-same\">BEC attacks are not just a singular entity either.</a> Multiple attack types exist within the BEC umbrella, each utilizing a different combination of techniques to get past traditional defenses. Some attack types include:</p>\n<ul>\n<li><strong><a href=\"https://www.armorblox.com/blog/payroll-fraud-when-direct-deposits-go-rogue\">Payroll Diversion Fraud</a>:</strong> Targeted emails that fraudulently request a change in direct deposit information to steal from an employee.</li>\n<li><a href=\"https://blogs.cisco.com/security/securing-the-1-threat-vector-is-a-key-part-of-an-effective-xdr-strategy\"><strong>Email Account Compromise</strong></a><strong>:</strong> Attackers take over a legitimate email account through credential phishing. Attackers then use that account for further compromising customers, third-party vendors and internal employees.</li>\n<li><strong><a href=\"https://www.armorblox.com/blog/identity-theft-invoices-and-impersonation\">Vendor Email Compromise</a>:</strong> A ‘long con’ business email compromise attack that exploits legitimate third-party email accounts to further compromise the vendor’s clients.</li>\n<li><a href=\"https://blogs.cisco.com/security/how-can-i-help-protect-my-company-from-phishing-attacks\"><strong>Advanced Credential Phishing</strong></a><strong>:</strong> Attackers send emails with malicious zero-day URLs, often masking the final credential phishing site behind multiple redirects and lookalike pages.</li>\n</ul>\n<p>“Moving beyond mass-phishing and malicious payloads, attackers are now researching their targets before sending emails that trigger authority, urgency, or fear in the targets’ minds. Attackers impersonate trusted parties or take over legitimate email accounts to induce actions that cause financial and data loss.”</p>\n<h2><strong><span style=\"color: #6abf4b;\">Compliance concerns</span></strong></h2>\n<p>We live in a post <a href=\"https://www.armorblox.com/blog/data-privacy-in-the-age-of-gdpr\">GDPR</a> and <a href=\"https://www.armorblox.com/blog/ccpa-compliance-how-contextual-understanding-can-help\">CCPA</a> world where organizations are liable for mishandling of private or sensitive user information &#8211; and that’s undoubtedly a good thing. However, even unintentional data violations can result in fines if it’s determined that the offending organization did not provide reasonable data security measures to protect its customers’ personal information.</p>\n<p>Keeping in mind the challenges already discussed above &#8211; the communication sprawl, a distributed workforce, and cloud apps galore &#8211; it becomes very difficult for organizations to avoid accidental data loss. With no one person or application really ‘knowing’ where all the sensitive and confidential information resides, data loss concerns are probably not a surprise.</p>\n<hr />\n<h2><strong><span style=\"color: #6abf4b;\">Why current security measures are not enough</span></strong></h2>\n<p>You’ve been introduced to cloud office security and agree that it’s needed today. Before we move onto cloud office security capabilities, however, there’s one important question to address &#8211; why are current security measures not enough?</p>\n<p>Cybersecurity has overengineered complex solutions to simple problems in the past, so it’s worth highlighting the gaps in current security controls to truly underscore why cloud office security applications are purpose-built to solve the human layer challenge.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Metadata-based detection is limited</span></strong></h2>\n<p>Since BEC attacks are more sniper than sledgehammer in their technique, metadata and binary rules are not enough to flag these emails. Heavy-handed protection techniques that are solely based on identity or metadata either lead to a flood of false positives or let finely crafted BEC attacks escape their grasp.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Email authentication checks are limited</span></strong></h2>\n<p>Email authentication checks like SPF, DKIM, and <a href=\"https://dmarc.org/\">DMARC</a> definitely have their uses. In fact, they often provide important signals for email attack analysis. But authentication checks like DMARC require widespread adoption to be truly effective. Moreover, if email attacks are sent from reputed domains like Gmail or Yahoo, they seamlessly pass all authentication checks and the burden of detection is placed on busy end users instead.</p>\n<figure id=\"attachment_445208\" aria-describedby=\"caption-attachment-445208\" style=\"width: 936px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-full wp-image-445208\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxfgchvjbjkhjvgcfxdfcgvuhuvgycfxtdzre.png\" alt=\"\" width=\"936\" height=\"432\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxfgchvjbjkhjvgcfxdfcgvuhuvgycfxtdzre.png 936w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxfgchvjbjkhjvgcfxdfcgvuhuvgycfxtdzre-300x138.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/dxfgchvjbjkhjvgcfxdfcgvuhuvgycfxtdzre-768x354.png 768w\" sizes=\"(max-width: 936px) 100vw, 936px\" /><figcaption id=\"caption-attachment-445208\" class=\"wp-caption-text\">Fig 3: Targeted email attacks get past authentication checks and metadata-based detection</figcaption></figure>\n<h2><strong><span style=\"color: #6abf4b;\">Cumbersome (and duplicative) email security stack</span></strong></h2>\n<p>Native email security controls such as Exchange Online Protection and Advanced Threat Protection have taken great strides in protecting users against spam, known malware, and mass phishing campaigns. Unfortunately, enterprises now end up double-paying for many of these capabilities while investing in a Secure Email Gateway (SEG).</p>\n<p>A SEG sitting in front of native cloud email security not only duplicates protection capabilities, but it also reduces the effectiveness of native connection filtering and detection features. Some SEG vendors actually recommend disabling EOP features to realize full value from their solutions.</p>\n<figure id=\"attachment_445209\" aria-describedby=\"caption-attachment-445209\" style=\"width: 936px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" class=\"size-full wp-image-445209\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/xdrcftvghbjbhvgyctxrrcyvutcrt.png\" alt=\"\" width=\"936\" height=\"422\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/xdrcftvghbjbhvgyctxrrcyvutcrt.png 936w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/xdrcftvghbjbhvgyctxrrcyvutcrt-300x135.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/11/xdrcftvghbjbhvgyctxrrcyvutcrt-768x346.png 768w\" sizes=\"(max-width: 936px) 100vw, 936px\" /><figcaption id=\"caption-attachment-445209\" class=\"wp-caption-text\">Fig 4: A comparative look at the email security capabilities of native controls, SEGs and cloud office security applications</figcaption></figure>\n<h2><strong><span style=\"color: #6abf4b;\">Siloed data loss prevention solutions</span></strong></h2>\n<p>Protecting unauthorized access to sensitive data in the cloud is not a new thing. Data Loss Prevention (DLP) solutions have introduced and iterated on granular rules that govern access to data and applications. However, these controls are usually restricted to specific environments and don’t protect against lateral movement of sensitive data across applications. For instance, <a href=\"https://www.box.com/shield\">Box Shield</a> might prevent data loss on Box, but it won’t stop someone from downloading a confidential Box file and sending it to external parties over email.</p>\n<p>It’s also important to note that investing in integrated DLP solutions for every cloud application will strain even the most healthy security budget. This is especially true in a SaaS-first world where a few dollars per user per month can quickly add up across applications and result in an unwieldy security spend.</p>\n<h2><strong><span style=\"color: #6abf4b;\">The precision-recall conundrum with confidential content protection</span></strong></h2>\n<p>There are two major approaches that DLP tools take to protect confidential information today: a keyword-based approach or a signature-based approach. Both approaches have their own struggles. Here’s an example that studies the merits and fallbacks of both approaches. Let’s say some members of your organization are working on a skunkworks project called ‘Operation Schrute Farms’ and have compiled all the confidential information about the project in a collection of documents and spreadsheets.</p>\n<p>In a <strong>keyword-based protection approach</strong>, you will enter ‘Operation Schrute Farms’ as a keyword in your DLP products. Anytime an email, document, or spreadsheet goes out with the keyword ‘Operation Schrute Farms’, a DLP violation will be triggered. This approach has <u>good recall</u> (i.e. it will catch any instance of confidential data about ‘Operation Schrute Farms’ being sent out to unauthorized recipients). On the flipside, a keyword-based approach has <u>poor precision</u> (i.e. it will also generate a lot of noise by flagging innocuous mentions of the keyword. If you send an email to a colleague about an upcoming meeting about ‘Operation Schrute Farms’, that email will be flagged as well). A keyword-based approach results in security teams getting buried under a mountain of false positives, lacking the time or energy to properly investigate and remediate genuine DLP violations that get flagged.</p>\n<p>In a <strong>signature-based protection approach</strong>, you take signatures (hashes) of every confidential document and spreadsheet about ‘Operation Schrute Farms’ and enter them into your DLP products. This approach has <u>good precision</u> (i.e. you can be sure that whenever a confidential document or spreadsheet about ‘Operation Schrute Farms’ is shared with unauthorized recipients, it will get flagged as a violation). On the other hand, a signature-based approach has <u>poor recall</u> (i.e. if you open a confidential document, change a few sentences, and save it again, the hash changes and this protection approach is rendered moot).</p>\n<p>“When organizations have to choose between a keyword-based DLP approach that has high recall but poor precision, or a signature-based DLP approach that has high precision but poor recall, the choice ends up hinging on minimizing the downsides rather than leveraging the upsides of each approach.”</p>\n<h2><strong><span style=\"color: #6abf4b;\">No unified context and learning</span></strong></h2>\n<p>Since security products (both inbound threat protection and outbound DLP) are largely application-specific today, organizations lack a universal layer of context. This context might include what constitutes sensitive/confidential data, user behavior including login and access patterns, and the nature of external/internal interactions.</p>\n<p>At the outset of this guide, we mentioned that people are at the center of the most attacked and least protected security layer. Since people communicate across email, messaging, and file-sharing applications, it’s vital for security controls to capture behavioral baselines that span these environments as well as learn from them.</p>\n<hr />\n<h2><strong><span style=\"color: #6abf4b;\">The components of Cloud Office Security: A capability checklist</span></strong></h2>\n<p>Implementing cloud office security within an organization is usually not a simple “I don’t have it” to “Okay, now I have it” process. When evaluating cloud office security technologies, organizations need to evaluate the breadth and depth of capabilities, method of deployment, and flexibility to fit into (and improve) existing security controls. In this section, let’s take a look at all the moving parts within cloud office security to (hopefully) make wise technology choices.</p>\n<h3><strong>Inbound email protection</strong></h3>\n<p>Inbound email protection is the proverbial bread and butter of cloud office security technologies. Your chosen solution should protect against the entire spectrum of socially engineered email attacks while not heavily duplicating existing features present in your cloud email provider or SEG (if you use a SEG).</p>\n<p>Here is a feature checklist for inbound email protection:</p>\n<h3><strong>Outbound email protection</strong></h3>\n<p>Stopping advanced threats from reaching inboxes goes hand in hand with preventing sensitive data from leaving inboxes. Your chosen cloud office security technology should prevent sensitive data (PII, PCI, passwords) as well as user-marked confidential data from being accessed by noncompliant recipients.</p>\n<p>Here is a feature checklist for outbound email protection:</p>\n<h3><strong>Messaging and file-sharing protection</strong></h3>\n<p>A core facet of cloud office security technologies is the ability to protect communications across cloud channels. Your chosen solution should protect against malicious URLs, direct data loss, and lateral data loss across messaging and file-sharing services in addition to email.</p>\n<p>Here is a feature checklist for messaging and file-sharing protection:</p>\n<h3><strong>Detection capabilities</strong></h3>\n<p>Due to the socially engineered nature of today’s attacks as well as the contextual nature of data traveling across cloud apps, cloud office security technologies should possess a breadth and depth of detection capabilities. Importantly, your chosen solution should not focus too heavily on any one technique, since such binary techniques can be bypassed by motivated attackers or edge cases of data loss.</p>\n<p>Here is a feature checklist for cloud office security detection capabilities:</p>\n<h3><strong>Remediation capabilities</strong></h3>\n<p>Even best-in-class detection won’t be of much use if your security team is drowning in a flood of alerts without any remediation measures in place. Your chosen cloud office security solution should automatically remediate all known threats, give security teams visibility into threat analysis, and enable admins to configure customizable remediation whenever required.</p>\n<p>Here is a feature checklist for cloud office security remediation capabilities:</p>\n<h3><strong>Deployment</strong></h3>\n<p>However powerful a product looks during a demo, the real proof is in the pudding of deployment and ongoing operations. Your chosen cloud office security solution should be an API-based cloud-native offering that is still flexible enough to support a variety of infrastructural environments.</p>\n<p>Here is a feature checklist for cloud office security deployment capabilities:</p>\n<h3><strong>Enterprise grade capabilities</strong></h3>\n<p>Given that cloud office security solutions are meant for enterprise security teams, a few basic prerequisites must be met. Enterprise grade capabilities should enable organizations to stay compliant, have complete visibility into user activity, and prevent compromise of the cloud office security solution itself.</p>\n<p>Here is a feature checklist for cloud office security enterprise grade capabilities:</p>\n<h3><strong>Granular attack categories</strong></h3>\n<p>While all the buzz around BEC is definitely warranted, it can lead to an oversimplification of the many attack categories that constitute BEC. <a href=\"http://www.cisco.com/go/etd\">Secure Email Threat Defense</a> leverages unique Artificial Intelligence and machine learning models, including Natural Language Processing, to identify malicious techniques used in attacks targeting your organization, derive unparalleled context for specific business risks, provide searchable threat telemetry, and categorize threats to understand which parts of your organization are most vulnerable to attack.</p>\n<h3><strong>Automated (but flexible) remediation</strong></h3>\n<p>Remediating email attacks is tricky, with security teams needing to walk the tightrope between safety and productivity. Security teams shouldn’t have to manually remediate the vast majority of their email alerts, but they should still have the option of defining custom remediation actions when required. Secure Email Threat Defense provides  remediation options for every attack category, enabling security teams to respond to email alerts with minimal manual effort while upholding organizational productivity.</p>\n<p>Take a <a href=\"https://learn-cloudsecurity.cisco.com/etd-click-demo\">self-guided tour</a> of Secure Email Threat Defense to see these threat detection features in action.</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/bec-and-cloud-office-security/feed","slash:comments":"0"},{"title":"Cisco Vulnerability Management Named a Leader in Omdia Universe: RBVM Solutions, 2023","link":"https://blogs.cisco.com/security/cisco-vulnerability-management-named-a-leader-in-omdia-universe-rbvm-solutions-2023/","comments":"https://blogs.cisco.com/security/cisco-vulnerability-management-named-a-leader-in-omdia-universe-rbvm-solutions-2023/#respond","dc:creator":{"#cdata-section":"Tori Burinskiy"},"pubDate":"Mon, 13 Nov 2023 13:00:16 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Vulnerability Management"},{"#cdata-section":"Kenna"},{"#cdata-section":"Omdia"},{"#cdata-section":"Omdia Universe"},{"#cdata-section":"RBVM"},{"#cdata-section":"vulnerability management"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=443883"},"description":{"#cdata-section":"Cisco Vulnerability Management is recognized is a Leader in the 2023 Omdia Universe: Risk-Based Vulnerability Management Solutions report."},"content:encoded":{"#cdata-section":"<p>Omdia released its 2023 Omdia Universe: Risk-Based Vulnerability Management Solutions report, and we’re excited to say that Cisco Vulnerability Management (formerly Kenna.VM) is recognized as a Leader!</p>\n<p>Risk-based Vulnerability Management (RBVM) builds upon the legacy vulnerability management market with stronger vulnerability prioritization and response. RBVM tackles the problem of determining which vulnerabilities pose a real risk in your environment and need to be patched versus which vulnerabilities you can safely de-prioritize. Improving the efficiency and effectiveness of traditional vulnerability management tasks to proactively and continuously reduce risk is the focus of RBVM solutions.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Omdia Universe Evaluation Capabilities and Vendor Groupings</strong></span></h2>\n<p>With its Omdia Universe: RBVM Solutions report, Omdia, a global unbiased research firm, assesses key vendors in the RBVM market to evaluate and make recommendations based on each vendor’s capability and customer experience.</p>\n<p>Analysis of the following RBVM capabilities for each vendor is included in the report: Data collection, threat intelligence, telemetry and storage, risk analytics, vulnerability resolution, deployment and management, and pricing and packaging.</p>\n<p>Vendors are grouped into one of three categories:</p>\n<ul>\n<li><strong>Market leaders </strong>understand the current threat landscape and the criticality of assets within each customer’s digital domain.</li>\n<li><strong>Market challengers </strong>show good breadth in their solutions, but not always a depth of features in every area.</li>\n<li><strong>Market prospects </strong>tend to be newer to the market and typically show strength in only a few of Omdia’s solution capability categories.</li>\n</ul>\n<p><em>The Omdia Universe for RBVM</em></p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-443884\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/drctfvgybh.png\" alt=\"\" width=\"720\" height=\"612\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/drctfvgybh.png 720w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/drctfvgybh-300x255.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></p>\n<h2><strong><span style=\"color: #6abf4b;\">Omdia’s Analysis of Cisco Vulnerability Management</span></strong></h2>\n<p>Cisco Vulnerability Management is recognized as a Leader by Omdia with one of the most mature RBVM products in the market.</p>\n<p>Omdia highlights the strength of Cisco Vulnerability Management capabilities, including:</p>\n<ul>\n<li><strong>Threat Intelligence: </strong>Cisco Vulnerability Management collects an impressive level of threat landscape information to build vulnerability risk models, which includes data pulled from 19+ threat intel feeds, of which one is Cisco Talos, and OEMs.</li>\n<li><strong>Risk analytics: </strong>Cisco Vulnerability Management uses AI/ML for RBVM modeling, employing four distinct machine learning models for core risk scoring and innovative analytics for exploit prediction.</li>\n<li><strong>Vulnerability resolution: </strong>Cisco Vulnerability Management creates service tickets directly from the user interface or via API and creates risk-based SLAs tailored to the risk tolerance of an organization.</li>\n</ul>\n<p><em>Omdia Universe ratings – Cisco Vulnerability Management</em></p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-443885\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/xdcfvgbvftdrsexdrctfvgy.png\" alt=\"\" width=\"712\" height=\"720\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/xdcfvgbvftdrsexdrctfvgy.png 712w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/10/xdcfvgbvftdrsexdrctfvgy-297x300.png 297w\" sizes=\"(max-width: 712px) 100vw, 712px\" /></p>\n<p>As stated in the report:</p>\n<p><em>“</em><em>Overall, Cisco Vulnerability Management is a strong RBVM option, particularly for large organizations. The product supports some of the most advanced analytics in the space, and it leverages leading threat intelligence feeds to provide near-real-time assessments of the threat landscape. Cisco’s focus on enterprise customers is also driving it to develop very sophisticated tools for measuring and managing remediation success. The sum total of its capabilities and their quality more than justifies its Leader position.”</em></p>\n<p>Cisco Vulnerability Management is a great option to consider for your future RBVM solution, especially if:</p>\n<ul>\n<li>Your most important determinant of risk associated with vulnerabilities is an understanding of the current and predicted future landscape of software exploits</li>\n<li>Your key requirements include flexibility in the customization of analytics and reporting, as well as in the presentation of findings and recommendations</li>\n<li>You are currently a Cisco security customer and already using Cisco Talos</li>\n</ul>\n<p><a href=\"https://www.cisco.com/c/en/us/products/security/vulnerability-management/omdia-universe-rbvm.html\" target=\"_blank\" rel=\"noopener\">Read the full report</a> now for Omdia’s in-depth analysis of Cisco and other vendors in the RBVM market, as well as details on market dynamics, market outlook, opportunities, and threats.</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Secure on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Secure Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/cisco-vulnerability-management-named-a-leader-in-omdia-universe-rbvm-solutions-2023/feed","slash:comments":"0"},{"title":"Introducing Cisco Cloud Protection – Complete Protection, from Ground to Cloud","link":"https://blogs.cisco.com/security/cisco-cloud-protection-suite-protect-apps-simplify-multicloud-operations/","comments":"https://blogs.cisco.com/security/cisco-cloud-protection-suite-protect-apps-simplify-multicloud-operations/#respond","dc:creator":{"#cdata-section":"Rick Miles"},"pubDate":"Thu, 09 Nov 2023 13:00:25 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Cloud Protection"},{"#cdata-section":"cloud security"},{"#cdata-section":"multicloud"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=444377"},"description":{"#cdata-section":"Learn how the Cisco Cloud Protection Suite protects applications, simplifies multicloud security operations, and supports business growth"},"content:encoded":{"#cdata-section":"<p>A few weeks ago, I was speaking with a CISO who said, “Our team is coming to the conclusion right now that we need to hire experts for every cloud – GCP, Azure, AWS &#8211; just to <em>maintain</em> our existing security. We don’t have the headcount for that.”</p>\n<p>This wasn’t the first time I’ve heard this. In fact, it’s become a common theme in my conversations with customers and partners. That’s because today, most organizations have two or three public clouds on top of their private cloud. As the number of clouds in their environment rose, so did the number of tools, vendors, and licensing agreements needed to protect those environments. Not only have all these disparate point solutions increased the need for specialized training and expertise, but they also create headaches for network and security teams due to all the gaps, blind spots, and inconsistent – or even competing – information from siloed products.</p>\n<p>Solving for these multicloud problems – the expanded attack surface, loss of visibility, and strained resources, while supporting rapid application development and deployment – calls for a new approach. One that addresses today’s challenges holistically, not piecemeal, building security in from the start and providing a framework that enables organizations to grow securely with confidence.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Designed for a hybrid and multicloud world</strong></span></h2>\n<p>The Cisco Cloud Protection Suite is a flexible framework designed for hybrid and multicloud environments. It is a multifaceted approach to security that combines complementary solutions to address three critical areas:</p>\n<ul>\n<li>Reduce the attack surface and protect applications wherever they live,</li>\n<li>Simplify the operational complexity of protecting hybrid and multicloud environments, and</li>\n<li>Enable the business to grow while empowering security teams to achieve their objectives with the right resources.</li>\n</ul>\n<p>Alessio, Chief Digital Solution Officer for Leroy Merlin Italy, stated it best: <em>“</em>We can consider cybersecurity a puzzle: each piece must stay in the right place to create the image and I think Cisco’s Cloud Protection Suite is the complete puzzle for cloud protection, ensuring solutions are in the right ecosystem and communicating. In cybersecurity, we have in fact an enormous portfolio of solutions, and the important thing is that those solutions stay in the correct position, in the right ecosystem, and they must communicate with each other. Today, the protection cannot be concentrated only in one specific point or vertical silos.”<strong> </strong></p>\n<h2><span style=\"color: #6abf4b;\"><strong>A holistic approach</strong></span></h2>\n<p>Applications live everywhere and are part of an interconnected ecosystem. So, when we look at protecting applications across distributed environments, we find that there are five fundamental areas that need to be addressed to secure the application and reduce the attack surface:</p>\n<ol>\n<li>Secure the traffic to and from the clouds (ingress/egress) and use macro-segmentation to prevent unauthorized movement between virtual private clouds (VPCs).</li>\n<li>Prioritize the vulnerabilities that matter most to effectively reduce risk to the business.</li>\n<li>Prevent unauthorized lateral movement, on-premises and in the cloud, by applying microsegmentation to the application workloads.</li>\n<li>Ensure cloud-native applications maintain their integrity across their entire lifecycle from development to run-time, as well as every resource that connects them.</li>\n<li>And continuously monitor the attack surface of the cloud environment including assets, configurations, and policies to proactively identify vulnerabilities and respond to threats.</li>\n</ol>\n<p>The Cloud Protection Suite capabilities cover all five of these areas providing pervasive visibility and security for any application regardless of where they reside.</p>\n<p style=\"text-align: center;\"><iframe src=\"//players.brightcove.net/1384193102001/41XYD7gTx_default/index.html?videoId=6336982855112\" allowfullscreen webkitallowfullscreen mozallowfullscreen width=\"640\" height=\"360\"></iframe></p>\n<h2><span style=\"color: #6abf4b;\"><strong>Simplifying multicloud security</strong></span></h2>\n<p>This is all well and good but what about the expertise and resources to manage these tools and environments? The answer is that the Cloud Protection Suite dramatically simplifies security operations for multicloud environments. It provides one interface to manage and deploy security controls across all your clouds. In practical terms this means you can write a policy once and using built-in automation and orchestration deploy it on AWS, Azure, GCP, and OCI. This is a game changer as it massively reduces the overhead and training required to manage security for cloud networks.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Empowering security to support business growth</strong></span></h2>\n<p>Organizations grow organically and through acquisitions, resulting in a host of different environments, applications, and tools. The average organization has upwards of 76 security tools<sup>1</sup> deployed on their security stack. Tool spawl not only costs resources in terms of maintenance and training, but when a breach does occur complex security stacks increase the costs by approximately 31%<sup>2</sup>.</p>\n<p>The Cloud Protection Suite is cloud agnostic and reduces tool sprawl, providing a flexible framework to protect any application running on any workload in any environment. It enables customers to rapidly onboard new cloud accounts for acquisitions or new lines of business and ensure compliance with InfoSec requirements. It integrates with the application development and deployment process, so security is built in from the beginning. And it has over 100 pre-built APIs and integrations to easily integrate existing or new systems and assets for deep visibility into vulnerabilities and the attack surface.</p>\n<p>The complexity of hybrid and multicloud environments are outpacing human scale and skills, and the security challenges can often feel overwhelming. The Cloud Protection Suite was designed specifically to address these issues by combining Multicloud Defense, Secure Workload, Vulnerability Management, Cloud Application Security, and Attack Surface Management into one framework. The result, is a modern approach to security that delivers:</p>\n<ul>\n<li><strong>Better Efficacy</strong>: Reduces your attack surfaces by stopping lateral movement of attacks and reducing risk across the data center and clouds.</li>\n<li><strong>Better Experience</strong>: Simplifies your multicloud operations by consolidating security tools, unifying controls, and leveraging automation to achieve greater efficiencies.</li>\n<li><strong>Better Economics</strong>: Scales on your terms with a flexible security framework that supports all stages of cloud maturity.</li>\n</ul>\n<p>Learn more about <a href=\"https://www.cisco.com/site/us/en/products/security/cloud-protection/index.html\" target=\"_blank\" rel=\"noopener\">Cisco Cloud Protection Suite</a></p>\n<h2 class=\"p1\"><strong><span style=\"color: #6abf4b;\">Explore more blogs on Cisco Security Suites here:</span></strong></h2>\n<p class=\"p1\"><a href=\"https://blogs.cisco.com/security/introducing-cisco-user-protection-suite\" target=\"_blank\" rel=\"noopener\">The User Protection Suite</a><br />\n<a href=\"https://blogs.cisco.com/security/introducing-cisco-breach-protection-delivering-detection-response\" target=\"_blank\" rel=\"noopener\">The Cisco Breach Protection Suite</a></p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n<p>&nbsp;</p>\n<h6>Source: <sup>1</sup><a href=\"https://panaseer.com/reports-papers/report/2022-security-leaders-peer-report/\">Panaseer 2022 Security Leaders Peer Report</a> <em> </em><sup>2</sup><a href=\"https://www.ibm.com/reports/data-breach\">Ponemon Institute/IBM, Cost of a Data Breach Report 2023</a></h6>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/cisco-cloud-protection-suite-protect-apps-simplify-multicloud-operations/feed","slash:comments":"0"},{"title":"Introducing Cisco Breach Protection, Delivering Complete Detection and Response of MITRE ATT&CK TTP’s","link":"https://blogs.cisco.com/security/introducing-cisco-breach-protection-delivering-detection-response/","comments":"https://blogs.cisco.com/security/introducing-cisco-breach-protection-delivering-detection-response/#respond","dc:creator":{"#cdata-section":"AJ Shipley"},"pubDate":"Wed, 08 Nov 2023 13:00:49 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Breach Protection"},{"#cdata-section":"Cisco User Protection Suite"},{"#cdata-section":"Cisco XDR"},{"#cdata-section":"endpoint"},{"#cdata-section":"Secure Network Analytics"},{"#cdata-section":"threat detection"},{"#cdata-section":"threat intelligence"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=444379"},"description":{"#cdata-section":"With the increasing complexity of cyberattacks, it's important for SOC teams to have comprehensive coverage of MITRE ATT&#038;CK tactics, techniques, and procedures. Here's how Cisco technology can help you achieve this goal."},"content:encoded":{"#cdata-section":"<p>Security Operations Centers (SOC) are responsible for detecting and responding to potential cyber threats in real-time. With the increasing complexity of cyberattacks, it&#8217;s important for SOC teams to have comprehensive coverage of MITRE ATT&amp;CK (Adversarial Tactics, Techniques, and Common Knowledge) tactics, techniques, and procedures (TTPs). Today we’re discussing the importance of having comprehensive coverage of MITRE ATT&amp;CK TTPs in security operations, and how Cisco technology can help to achieve this goal.</p>\n<p style=\"text-align: center;\"><iframe src=\"//players.brightcove.net/1384193102001/41XYD7gTx_default/index.html?videoId=6336678949112\" allowfullscreen webkitallowfullscreen mozallowfullscreen width=\"640\" height=\"360\"></iframe></p>\n<h2><strong><span style=\"color: #6abf4b;\">Why MITRE ATT&amp;CK TTPs are relevant to security operations?</span></strong></h2>\n<p>MITRE ATT&amp;CK is a globally recognized framework that outlines various tactics, techniques, and procedures based on observed behaviors and used by threat actors during a cyberattack. The framework is divided into two main categories: tactics and techniques. Tactics represent the overall goal of an adversary, while techniques represent the specific methods used to achieve that goal. Procedures are the specific steps taken to execute the technique.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Why is comprehensive coverage important?</span></strong></h2>\n<p>The cyberthreat landscape is constantly evolving, and new TTPs are being developed every day.</p>\n<p class=\"p1\">One type of attack that has been gaining popularity is living-off-the-land binary (LOLBin) exploitation. This type of attack has been leveraged by nefarious threat groups such as Volt Typhoon, BlackTech in addition to Jaguar Tooth malware, using legitimate tools and software already present on a victim&#8217;s system to carry out malicious activities. These attacks are difficult to detect because they do not involve the use of malware or other malicious software that would be flagged by traditional endpoint security solutions. Instead, attackers use tools such as PowerShell, WMI, and other built-in Windows utilities to achieve their objectives.</p>\n<p>One way to protect against living off the land attacks recommended by this is to monitor system processes and network activity looking for suspicious behavior. This defense can be done using the combination of endpoint and network security controls and an extended detection and response solution on top to detect and correlate anomalies found in system activities and network traffic patterns, so security teams are timely alerted on potential attacks.</p>\n<p>By having a comprehensive understanding of the various tactics, techniques, and procedures used by attackers, SOC teams can quickly identify and mitigate any potential threats before they cause significant damage.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Cisco Breach Protection</span></strong></h2>\n<p>Cisco is announcing the launch of Breach Protection to protect against the constantly evolving techniques used by threat actors. Cisco Breach Protection provides a comprehensive understanding of attacks by mapping observed adversary behaviors to MITRE ATT&amp;CK tactics, techniques, and procedures (TTPs) in real-time.</p>\n<p>Cisco Breach Protection is available in three tiers &#8211; Essentials, Advantage and Premier. Each tier is designed to cater to specific organization needs and delivers a range of outcomes to ensure complete coverage:</p>\n<p><strong>Breach Protection Essentials</strong> covers most attacks that an organization will encounter by combining email, endpoint (EDR), and XDR into a turnkey offer.  Most attacks today still leverage a phishing email to deliver malware exploiting an endpoint vulnerability or use an endpoint application (termed living off the land attack) to escalate privileges, establish persistence or traverse laterally.  Cisco Breach Protection provides detection and response to these types of attacks and adversaries like Wizard Spider and Sandworm.</p>\n<p><strong>Breach Protection Advantage</strong> covers all the attacks an organization is likely to encounter, especially attacks on very complex environments like IT/OT/IIoT or from very sophisticated nation-state threat actors like BlackTech, Volt Typhoon, or Jaguar Tooth.  By combing network telemetry and network-based detections from cloud and traditional on-premises infrastructure, only Cisco can cover the full range of attacks seen in the wild today.</p>\n<p><strong>Breach Protection Premier</strong> delivers all the above capabilities to an organization that doesn’t have enough human resources to manage their Security Operations or is looking to fully outsource their SOC operation by wrapping the offer with managed services that delivers an Incident Response retainer, penetration testing services, red/blue/purple teaming activities, and managed detection and response.</p>\n<p>All the above is available to customers who also already have 3rd party security products. The technical outcomes are the same regardless of whether customers choose à la carte Cisco products, an EA or the Breach Protection suite.  But for customers who choose the suite they can achieve the outcomes listed above at very attractive financial terms and a superior total cost of ownership without having to deal with the challenges of stitching together multiple 3rd party vendors, dealing with multiple 3rd party purchase orders, or managing multiple different consoles.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Cisco Breach Protection</span></strong></h2>\n<p>In today&#8217;s evolving cyberthreat landscape, having comprehensive coverage of MITRE ATT&amp;CK TTPs is crucial for SOC teams. It ensures that they are equipped to detect and respond to any potential threat quickly. By analyzing the TTPs used in previous attacks like ransomware, SOC teams can develop a better understanding of the tactics used by threat actors and develop more effective strategies to prevent future attacks. So, if you&#8217;re looking to enhance your SOC&#8217;s capabilities, make sure you have complete coverage of MITRE ATT&amp;CK TTPs leveraging Cisco Breach Protection!</p>\n<p>Learn more about <a href=\"https://www.cisco.com/site/us/en/products/security/breach-protection/index.html\">Cisco Breach Protection</a>.</p>\n<h2 class=\"p1\"><strong><span style=\"color: #6abf4b;\">Explore more blogs on Cisco Security Suites:</span></strong></h2>\n<p class=\"p1\"><a href=\"https://blogs.cisco.com/security/introducing-cisco-user-protection-suite\" target=\"_blank\" rel=\"noopener\">The User Protection Suite</a></p>\n<p><a href=\"https://blogs.cisco.com/security/cisco-cloud-protection-suite-protect-apps-simplify-multicloud-operations\" target=\"_blank\" rel=\"noopener\">The Cloud Protection Suite</a></p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Secure on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Secure Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/introducing-cisco-breach-protection-delivering-detection-response/feed","slash:comments":"0"},{"title":"Introducing Cisco User Protection Suite","link":"https://blogs.cisco.com/security/introducing-cisco-user-protection-suite/","comments":"https://blogs.cisco.com/security/introducing-cisco-user-protection-suite/#respond","dc:creator":{"#cdata-section":"Iva Blazina Vukelja"},"pubDate":"Tue, 07 Nov 2023 13:00:37 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"cisco duo"},{"#cdata-section":"Cisco Secure Access"},{"#cdata-section":"Cisco Secure Email Threat Defense"},{"#cdata-section":"Cisco Secure Endpoint"},{"#cdata-section":"Cisco User Protection Suite"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=444375"},"description":{"#cdata-section":"Learn how the Cisco User Protection Suite provides end-to-end protection, so you can see and manage user access no matter where and how they work."},"content:encoded":{"#cdata-section":"<p>While at work, people have a simple goal. They want to easily access the resources they need to do their job. They are not always security experts, and we shouldn&#8217;t expect them to be security experts. Unfortunately, users continue to be the primary target of cyberattacks, with <a href=\"https://www.verizon.com/business/resources/reports/dbir/?cmp=knc:ggl:ac:ent:ea:na:8888855284&amp;utm_term=2023%20verizon%20dbir&amp;utm_medium=cpc&amp;utm_source=google&amp;utm_campaign=GGL_BND_Security_Exact&amp;utm_content=DBIR2023&amp;ds_cid=71700000082347933&amp;ds_cid=&amp;gclid=CjwKCAjwo9unBhBTEiwAipC11_4ixTQCZI4HizoJsbCnODk5XB_KSI-iSIYuUPOTQuDHl69vqT1GhBoCCwoQAvD_BwE&amp;gclsrc=aw.ds\" target=\"_blank\" rel=\"noopener\">74% of all breaches</a> involving the human element. This means that we need to find better ways to protect users and safeguard organizations.</p>\n<p style=\"text-align: center;\"><iframe src=\"//players.brightcove.net/1384193102001/41XYD7gTx_default/index.html?videoId=6336838801112\" allowfullscreen webkitallowfullscreen mozallowfullscreen width=\"640\" height=\"360\"></iframe></p>\n<p>However, there are three main challenges organizations face when protecting users:</p>\n<ol>\n<li><strong>Security/Productivity Tradeoff: </strong>Traditional solutions put roadblocks in front of sensitive resources to increase protection. However, that also has the unintended consequence of adding friction for trusted users to do their jobs and creating confusion on what protocols they must follow to gain access. You need a solution that can provide a unified end user experience and respond, in real time, to changes in risk.</li>\n<li><strong>Evolving Threat Landscape: </strong>Bad actors are constantly finding new ways to gain unauthorized access, from phishing and social engineering to malicious website attacks and more. At the same time, organizations are enabling hybrid work across a multi-cloud, BYOD environment, and this means an expanding attack surface. Incomplete data and point-solutions limit visibility and make it difficult to determine real threats from false positives. You need a solution that protects all users, accurately identifies and prioritizes threats, and proactively prevents attacks.</li>\n<li><strong>Complex portfolio of point solutions</strong>: Each time a new threat vector emerges, a new solution emerges to combat that threat. That has led to a vast portfolio of solutions, with enterprises managing, on average, <a href=\"https://panaseer.com/reports-papers/report/2022-security-leaders-peer-report/\" target=\"_blank\" rel=\"noopener\">76 security tools</a>. This patchwork makes it difficult for IT and security teams to manage and can lead to undetected risks. You need a solution that is easy to buy, easy to manage, and simplifies administration to reduce risk.</li>\n</ol>\n<p>This is where Cisco’s <a href=\"https://www.cisco.com/site/us/en/products/security/user-protection/index.html\" target=\"_blank\" rel=\"noopener\">User Protection Suite</a> comes in. The Suite brings together <a href=\"https://www.cisco.com/c/en/us/products/security/duo/index.html\" target=\"_blank\" rel=\"noopener\">Duo</a>, <a href=\"https://www.cisco.com/site/us/en/products/security/secure-access/index.html#tabs-9e2187ae1d-item-8d800bd1e7-tab\" target=\"_blank\" rel=\"noopener\">Secure Access</a>, <a href=\"https://www.cisco.com/site/us/en/products/security/secure-email/index.html#tabs-9e2187ae1d-item-8d800bd1e7-tab\" target=\"_blank\" rel=\"noopener\">Email Threat Defense</a>, and <a href=\"https://www.cisco.com/site/us/en/products/security/endpoint-security/secure-endpoint/index.html#tabs-9e2187ae1d-item-8d800bd1e7-tab\" target=\"_blank\" rel=\"noopener\">Secure Endpoint</a> to protect users from the point of authentication, to accessing applications and checking email on secure devices. The solution provides end-to-end protection, so your users get the freedom they want, and you get the visibility and security you need.</p>\n<ol>\n<li><strong>Seamless, Secure Access: </strong>Cisco provides secure and seamless experience for your employees accessing applications or internet &#8211; from any device, managed or unmanaged, and from anywhere, campus, branch, home or elsewhere. We manage everything: secure connectivity to the application, authentication to it, and actionable insights into user experience around it, or in a cloud delivered easy to consume form factor.</li>\n<li><strong>Frustrate Attackers, Not Users: </strong>To make it frictionless, we seamlessly handle secure connectivity across different technologies, VPN, ZTNA for remote access and SSO across remote, in network and cloud apps. Furthermore, our Risk Based Authentication AI engine can recognize trusted circumstances, and significantly reduce the number of explicit authentications your workforce must endure. When explicit authentication is warranted, our Passwordless authentication can make it as easy as touching the biometric reader or a roaming authenticator such as YubiKey.</li>\n<li><strong>Complete Coverage: </strong>All the while we make sure to cover a wide range of use cases. Employees work from managed and unmanaged devices, contractors and partners need to access managed applications. Cisco User Protection Suite helps you verify whether devices are corporate managed, BYOD and securely registered, or third party and securely registered. We do this in a way which cryptographically ties the user to their trusted devices. This helps organizations progress on their zero-trust strategy and do so at their own pace, all while delivering a zero-friction access experience.</li>\n<li><strong>Minimize Attack Surface: </strong>No one knows the network, or has end-to-end visibility, like Cisco does. With over 300,000 security customers, Cisco’s Talos Intelligence sees 550 billion security events and 2.8 million malware samples per day. That telemetry is harnessed to continuously identify risk and improve your security posture. Regardless of type of user, application, or device, Cisco can integrate with your environment to reduce gaps, increase protection, and cover all the use cases, including traditional applications or unmanaged devices to minimize the attack surface.</li>\n<li><strong>Enhanced Visibility: </strong>Cisco provides a comprehensive suite that enables organizations to reduce silos, while improving visibility and control. This approach allows organizations to leverage a common platform that helps resolve problems end to end, limiting tool proliferation and lowering the complexity and overhead of administration<em>.</em> Additionally, this simplifies both the purchase and management of these tools, streamlines operations with fewer dashboards, and supports IT and security teams that are already stretched thin. Not only does the suite decrease operational costs, but it also makes your teams more efficient and strategic.</li>\n</ol>\n<p>The cyber challenges facing organizations today can be overwhelming. There are too many solutions that don’t talk to each other and make it more difficult for security teams to do their jobs and employees to do theirs. Cisco is changing that dynamic. Our security solutions will help minimize the burden on humans and automate it with AI and machine learning that operates behind the scenes, simplifying security to let your organization, and its employees, get to work.</p>\n<p>Visit Cisco’s <a href=\"https://www.cisco.com/site/us/en/products/security/user-protection/index.html\" target=\"_blank\" rel=\"noopener\">User Protection Suite homepage</a> to learn more.</p>\n<h2 class=\"p1\"><strong><span style=\"color: #6abf4b;\">Explore more blogs on Cisco Security Suites:</span></strong></h2>\n<p class=\"p1\"><a href=\"https://blogs.cisco.com/security/introducing-cisco-breach-protection-delivering-detection-response\" target=\"_blank\" rel=\"noopener\">The Breach Protection Suite</a></p>\n<p><a href=\"https://blogs.cisco.com/security/cisco-cloud-protection-suite-protect-apps-simplify-multicloud-operations\" target=\"_blank\" rel=\"noopener\">The Cloud Protection Suite</a></p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Secure on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Secure Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/introducing-cisco-user-protection-suite/feed","slash:comments":"0"},{"title":"Intuition and Curiosity Mix Well with Technology","link":"https://blogs.cisco.com/security/intuition-and-curiosity-mix-well-with-technology/","comments":"https://blogs.cisco.com/security/intuition-and-curiosity-mix-well-with-technology/#respond","dc:creator":{"#cdata-section":"Gergana Karadzhova-Dangela"},"pubDate":"Fri, 03 Nov 2023 12:00:57 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"thought leadership"},{"#cdata-section":"Women in Cybersecurity"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=444332"},"description":{"#cdata-section":"Read this interview with Valeria Scribanti, a Technical Solutions Specialist with focus on cybersecurity, where she shares about her career story."},"content:encoded":{"#cdata-section":"<p><em>An interview with Valeria Scribanti, a Technical Solutions Specialist with focus on cybersecurity.</em></p>\n<p><em>Welcome to the </em><a href=\"https://blogs.cisco.com/tag/women-in-cybersecurity\"><em>Cisco Women in Cybersecurity’s blog series</em></a><em>, where we highlight the stories of the mentors who have inspired and advocated for the careers of those in our community. This series seeks to show the importance of allyship, connection, and how different the journeys can be into a career in cybersecurity.</em></p>\n<hr />\n<h2><strong><span style=\"color: #6abf4b;\">Interviewer Intro:</span></strong></h2>\n<p>Valeria and I met soon after I joined Cisco in 2021. We are both part of the “Swiss Cybersecurity Women” group, which is an internal online group for women in cybersecurity based in Switzerland. Over the years, Valeria and I stayed in touch, scheduling a virtual coffee or sending each other interesting articles. Last year we even got a chance to meet in person at Cisco Live in Amsterdam. The thing that strikes me about Valeria is her upbeat attitude, energy and tenacity. This interview is a chance for me to find out more about Valeria’s path into cybersecurity and her secret to staying positive in an industry with a tendency to focus on the dark side of affairs.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Questions:</span></strong></h2>\n<h3><strong>What inspired you to pursue a career in cybersecurity? </strong></h3>\n<p>I&#8217;ve always been very interested in technology from a curiosity perspective, even though growing up I did not see myself as a very nerdy person. I’m a millennial, so I grew up in an environment where technology was not all that present. I still remember the first time I saw an iPod; it really fascinated me as a device, and I instantaneously wanted to find out all about its workings. Later, when my father bought his first laptop and he was programming in Visual Studio at home one day, I caught my first glimpse of code and that got me hooked. From there I understood that technology is what I wanted to do, and I decided to enroll first in a bachelors engineering program at Politecnico di Torino and then continue with the double degree master&#8217;s program between the Politecnico di Torino and the Hamburg University of Technology (TUHH).</p>\n<p>So, it was really about intuition and curiosity which led me to choose technology as a profession. Well, that and the fact that I was playing a lot of Nintendo with my brother.</p>\n<h3><strong>What was your first foot in the door – where did you start? </strong></h3>\n<p>My studies in Italy laid the foundation for my later work in cybersecurity. As a student in the Computers and Communication Network Engineering program, I got to play with a lot of Cisco technology, learning switching and routing. Yet, as a whole, the university program was rather theoretical and research oriented. It was not until I went to Germany for the exchange program that I took a great course on cybersecurity with a professor from the industry. I was fascinated with the topics he covered in this class – buffer overflow, SQL injections, cross-site scripting. Times have changed nowadays, but back then this type of course was not a standard part of the university curriculum. The topic felt so new and super exciting to me that I decided to consider cybersecurity as a possible direction after graduation.</p>\n<p>I landed my first job soon after finishing my master&#8217;s degree. The university helped us find a position so for me it was a really smooth transition. The job market back then offered crazy number of opportunities, unlike the current situation.</p>\n<h3><strong>How did you know what role exactly you want to go for?</strong></h3>\n<p>By doing the interviews I actually got to know more about the different roles, what day-to-day activities they involve and what trajectory I could follow if I were to join.</p>\n<h3><strong>How has your career evolved since your initial start? </strong></h3>\n<p>My first role was a Network and Security Engineer at a system integrator company in Italy. I still remember the interview with them. We started off with some easy to answer questions, such as “what is a firewall?”. The next questions, however, were topics which were totally new to me back then, such as what an IPS (intrusion prevention system) and defense-in-depth etc. Looking back, I think that the interviewers posed those questions to hone my appetite for the topic and demonstrate that they were dealing with cutting-edge technology. During the interview they explained the principles of those security products and showed me what the role would entail.</p>\n<p>As a customer-facing engineer there, I got to work with a lot of Cisco technology, as well as other vendors. The best part of this role was the opportunity to do hands-on work with real projects and real responsibility. As a junior engineer, I felt both scared and motivated to be on site with customers and do things live, but this is how I learned tons about security architecture design, implementation and configuration of different security products such as firewalls, IPS, WAF, anti-virus, etc.</p>\n<p>At some point I got to work with the Cisco Secure Network Analytics (formerly Stealthwatch) team on a project. By talking with them I discovered other types of roles within cybersecurity. The work of a security sales engineer, who is responsible for creating and designing proof of value (POV) for security products, really clicked with me and I joined Cisco in 2018. That is how I moved from the more technically oriented operations into a role with a mix of hard and soft skills.</p>\n<p>One of the things that I truly love about the TSS role is that I get to work with global customers and as part of a global team, interact with different cultures and put into practice the multiple languages that I speak. I realized the fact that I also enjoy working closely with customers, listening to their needs and being a trusted advisor, someone that customers can rely on throughout the whole process.</p>\n<h3><strong>What is the one thing you wish you had known at the start of your cybersecurity career? </strong></h3>\n<p>I made a lot of choices for my career based on a gut feeling. My intuition served me well but looking back, I could have used some more guidance and data to decide which direction I should take. There are so many different paths that exist out there and it is worth exploring them before deciding on a particular career.</p>\n<p>How to do that? One way is to join cybersecurity communities that are near you and find out more about those different roles. Talk to professionals who are already in the field and listen to their perspective.</p>\n<h3><strong>What’s your single most important piece of advice to people considering a career in cybersecurity? </strong></h3>\n<p>Hang out with people who like cybersecurity – you will learn a lot!</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Secure on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Secure Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/intuition-and-curiosity-mix-well-with-technology/feed","slash:comments":"0"}]}}}