{
    "?xml": {
        "@version": "1.0",
        "@encoding": "utf-8"
    },
    "rss": {
        "@xmlns:dc": "http://purl.org/dc/elements/1.1/",
        "@version": "2.0",
        "@xml:base": "https://www.tripwire.com/",
        "channel": {
            "title": "Blog RSS Feed",
            "link": "https://www.tripwire.com/",
            "description": "HelpSystems Blog",
            "language": "en",
            "item": [
                {
                    "title": "The Six Pillars of Cybersecurity",
                    "link": "https://www.tripwire.com/state-of-security/six-pillars-cybersecurity",
                    "description": "  Winter is coming In the ever-evolving landscape of cloud computing, ensuring robust security measures has never been more important. In the new ISO 27001:2022 standard, there is a new requirement for organisations to establish control of their Cloud services, which includes every flavor of cloud from Software as a Service (SaaS) to Platform as a Service (PaaS). Amazon Web Services (AWS) is a leading cloud services provider. As you might expect, it has introduced the \" AWS Well-Architected Framework \", which comprises six key pillars to help organisations build high-performing, resilient...\n\n",
                    "pubDate": "Thu, 16 Nov 2023 02:58:34 -0600",
                    "dc:creator": "Gary Hibberd",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/six-pillars-cybersecurity"
                    }
                },
                {
                    "title": "Secure Access Control in 2024: 6 Trends to Watch Out For ",
                    "link": "https://www.tripwire.com/state-of-security/secure-access-control-trends-watch-out",
                    "description": "  What Is Secure Access Control? Secure access control, part of the broader field of user management , is a key concept in the realm of information security, particularly in the business environment. It refers to the process of selectively restricting and allowing access to a place or resource. In the context of information technology, it is a vital element of data protection, dictating who or what can view or use specific resources in a computing environment. Secure access control protocols are essential in protecting sensitive business information from unauthorized access. They vary in...\n\n",
                    "pubDate": "Wed, 15 Nov 2023 03:12:55 -0600",
                    "dc:creator": "Gilad David Maayan",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/secure-access-control-trends-watch-out"
                    }
                },
                {
                    "title": "Financial Institutions in New York Face Stricter Cybersecurity Rules",
                    "link": "https://www.tripwire.com/state-of-security/financial-institutions-new-york-face-stricter-cybersecurity-rules",
                    "description": "  Boards of directors need to maintain an appropriate level of cyber expertise, incidents must be reported within 72 hours after determination, and all ransom payments made must be reported within a day. Those are just some of the changes made by The New York State Department of Financial Services to its Cybersecurity Requirements for Financial Services (23 NYCRR 500) , effective November 1, 2023. This tightening of the reigns will hold businesses to higher security scrutiny and make technical and non-technical stakeholders alike more accountable. While this may seem benign, the move is more...\n\n",
                    "pubDate": "Wed, 15 Nov 2023 03:12:53 -0600",
                    "dc:creator": "Katrina Thompson",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/financial-institutions-new-york-face-stricter-cybersecurity-rules"
                    }
                },
                {
                    "title": "VERT Threat Alert: November 2023 Patch Tuesday Analysis",
                    "link": "https://www.tripwire.com/state-of-security/vert-threat-alert-november-2023-patch-tuesday-analysis",
                    "description": "  Today’s VERT Alert addresses Microsoft’s November 2023 Security Updates . VERT is actively working on coverage for these vulnerabilities and expects to ship ASPL-1082 on Wednesday, November 15th. In-The-Wild & Disclosed CVEs CVE-2023-36033 A vulnerability in the Microsoft Desktop Window Manager (DWM) could allow an attacker to gain SYSTEM level privileges. This vulnerability has been publicly disclosed and seen active exploitation. Microsoft has reported this vulnerability as Exploitation Detected . CVE-2023-36025 Windows SmartScreen is the technology that pops up when running a file...\n\n",
                    "pubDate": "Tue, 14 Nov 2023 15:12:07 -0600",
                    "dc:creator": "Tyler Reguly",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/vert-threat-alert-november-2023-patch-tuesday-analysis"
                    }
                },
                {
                    "title": "How Does IoT Contribute to Real-Time Grid Monitoring for Enhanced Stability and Fault Detection? ",
                    "link": "https://www.tripwire.com/state-of-security/how-does-iot-contribute-real-time-grid-monitoring-enhanced-stability-and-fault",
                    "description": "  More decision-makers are investing in grid modernization efforts, knowing that doing so is necessary for keeping pace with modern demands. For example, smart grid fault-detection sensors could warn utility company providers of problems in real time, preventing costly and inconvenient outages. Technologies like the Internet of Things (IoT) can also improve stability. An IoT grid-monitoring approach allows authorized parties to oversee electrical infrastructure from anywhere. As people become more interested in electric cars and renewable energy, better reliability will be essential. Here are...\n\n",
                    "pubDate": "Tue, 14 Nov 2023 03:23:40 -0600",
                    "dc:creator": "Emily Newton",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/how-does-iot-contribute-real-time-grid-monitoring-enhanced-stability-and-fault"
                    }
                },
                {
                    "title": "Cloud Watching Report: Key Takeaways",
                    "link": "https://www.tripwire.com/state-of-security/cloud-watching-report-key-takeaways",
                    "description": "  The capabilities of cloud computing have changed the digital landscape significantly, and the popularity of cloud solutions only continues to increase. According to Gartner , the market for public cloud services is expected to surpass 700 billion USD by the end of 2024. The growth of cloud technologies presents a wealth of new opportunities for IT teams but also brings a host of security challenges. Fortra published a report, “Cloud Watching: Implementing Strategic Cloud Security,” in an effort to break down some of the challenges to cloud security and important practices for establishing and...\n\n",
                    "pubDate": "Mon, 13 Nov 2023 03:05:23 -0600",
                    "dc:creator": "Anirudh Chand",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/cloud-watching-report-key-takeaways"
                    }
                },
                {
                    "title": "A Simplified Overview of the MITRE ATT&CK Framework",
                    "link": "https://www.tripwire.com/state-of-security/simplified-overview-mitre-attck-framework",
                    "description": "  In the world of cybersecurity, have you ever wondered about the inner workings of threat actors as they attempt to breach systems, their methods, tactics, and strategies, and how they seamlessly converge to execute a successful attack? It's not merely about initiating an attack but also the strategies they utilize to remain concealed within the system, allowing them to persistently operate and ultimately achieve their goals. These seemingly perplexing procedures of malicious actors become more accessible to understand with the MITRE ATT&CK Framework . The MITRE ATT&CK Framework MITRE ATT&CK...\n\n",
                    "pubDate": "Mon, 13 Nov 2023 03:04:29 -0600",
                    "dc:creator": "Dilki Rathnayake",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/simplified-overview-mitre-attck-framework"
                    }
                },
                {
                    "title": "CherryBlos, the malware that steals cryptocurrency via your photos - what you need to know",
                    "link": "https://www.tripwire.com/state-of-security/cherryblos-malware-steals-cryptocurrency-your-photos-what-you-need-know",
                    "description": "  What's the deal with CherryBlos? CherryBlos is a rather interesting family of Android malware that can plunder your cryptocurrency accounts - with a little help from your photos. Wait. I've heard of hackers stealing photos before, but what do you mean by malware stealing cryptocurrency via my photos? How does it do that? Well, imagine you have sensitive information - such as details related to your cryptocurrency wallet - in your Android phone's photo gallery. Hang on. Why would I have photos related to my cryptocurrency wallet stored on my smartphone? Good question! It doesn't sound entirely...\n\n",
                    "pubDate": "Fri, 10 Nov 2023 03:58:49 -0600",
                    "dc:creator": "Graham Cluley",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/cherryblos-malware-steals-cryptocurrency-your-photos-what-you-need-know"
                    }
                },
                {
                    "title": "Some Financial Institutions Must Report Breaches in 30 Days",
                    "link": "https://www.tripwire.com/state-of-security/some-financial-institutions-must-report-breaches-30-days",
                    "description": "  The heat has just been turned up for companies hoping to “hide out” a data breach. Announced October 27th, all non-banking financial institutions are now required to report data breach incidents within 30 days. The amendment to the Safeguards Rule was made by the U.S. Federal Trade Commission (FTC). It will go into effect 180 days after publication of the law in the Federal Register, or around April of next year. What is the Safeguards Rule? Designed to ensure that covered entities implement processes to keep customer information secure, the Standards for Safeguarding Customer Information , or...\n\n",
                    "pubDate": "Wed, 08 Nov 2023 04:27:29 -0600",
                    "dc:creator": "Katrina Thompson",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/some-financial-institutions-must-report-breaches-30-days"
                    }
                },
                {
                    "title": "Key Highlights from the 2023 UK Cyber Crime Landscape",
                    "link": "https://www.tripwire.com/state-of-security/key-highlights-uk-cyber-crime-landscape",
                    "description": "  It’s 2023, and the landscape of cybercrime in the United Kingdom is evolving unprecedentedly. This year's cyber threat landscape is shaped by many factors, from the continuing effects of the global pandemic to the ever-expanding digital footprint of individuals and organizations. In this article, we delve into the key cybercrime statistics for 2023, providing you with valuable insights into the state of cybersecurity in the UK . The surge in cyberattacks has been relentless, with ransomware, data breaches, and phishing incidents making headlines and causing substantial disruptions. This...\n\n",
                    "pubDate": "Wed, 08 Nov 2023 04:27:26 -0600",
                    "dc:creator": "Stefanie Shank",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/key-highlights-uk-cyber-crime-landscape"
                    }
                }
            ]
        }
    }
}