{
    "?xml": {
        "@version": "1.0",
        "@encoding": "UTF-8"
    },
    "rss": {
        "@version": "2.0",
        "@xmlns:content": "http://purl.org/rss/1.0/modules/content/",
        "@xmlns:wfw": "http://wellformedweb.org/CommentAPI/",
        "@xmlns:dc": "http://purl.org/dc/elements/1.1/",
        "@xmlns:atom": "http://www.w3.org/2005/Atom",
        "@xmlns:sy": "http://purl.org/rss/1.0/modules/syndication/",
        "@xmlns:slash": "http://purl.org/rss/1.0/modules/slash/",
        "channel": {
            "title": "CRYPTOID",
            "atom:link": {
                "@href": "https://cryptoid.com.br/feed/",
                "@rel": "self",
                "@type": "application/rss+xml"
            },
            "link": "https://cryptoid.com.br/",
            "description": "Tudo sobre o universo da identificação digital",
            "lastBuildDate": "Fri, 17 Nov 2023 20:36:40 +0000",
            "language": "pt-BR",
            "sy:updatePeriod": "\n\thourly\t",
            "sy:updateFrequency": "\n\t1\t",
            "item": [
                {
                    "title": "Ataques cibernéticos em ascensão: prejuízo anual pode chegar a USD$10,5 trilhões previsto até 2025",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/ataques-ciberneticos-em-ascensao-prejuizo-anual-pode-chegar-a-usd105-trilhoes-previsto-ate-2025/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Sat, 18 Nov 2023 18:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "Pesquisas e Estudos"
                        },
                        {
                            "#cdata-section": "ciberataque"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123979"
                    },
                    "description": {
                        "#cdata-section": "<p>Como a inteligência artificial está transformando a proteção de empresas em um mundo de ataques cada vez mais rápidos</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/ataques-ciberneticos-em-ascensao-prejuizo-anual-pode-chegar-a-usd105-trilhoes-previsto-ate-2025/\">Ataques cibernéticos em ascensão: prejuízo anual pode chegar a USD$10,5 trilhões previsto até 2025</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>Como a inteligência artificial está transformando a proteção de empresas em um mundo de ataques cada vez mais rápidos</em></p>\n\n\n\n<p>Segundo dados do relatório da Cybersecurity Ventures, no Brasil, em 2022, ocorreram 33 milhões de tentativas de ataques de ransomware, evidenciando os enormes riscos associados à segurança cibernética e à necessidade de aprimorar as medidas de prevenção. </p>\n\n\n\n<p>O cibercrime custará para as empresas de todo o mundo US$ 10,5 trilhões, anualmente, até 2025. Isso, sem falar nas vulnerabilidades que a IoT (Internet das Coisas) está abrindo, com a conexão de aparelhos domésticos à internet. Segundo relatório da IoT Analytics, o número desses dispositivos na web será de 30 bilhões até 2025.</p>\n\n\n\n<p>Ainda de acordo com o estudo, a frequência de ataques cibernéticos contra empresas aumentou significativamente nos últimos anos. </p>\n\n\n\n<p>Enquanto anteriormente ocorria um ataque a cada 40 segundos, conforme registrado no ano passado, esse intervalo foi reduzido para apenas 11 segundos em 2023. </p>\n\n\n\n<p>Uma empresa que leva um mês para detectar uma violação de dados cibernéticos está sujeita a perdas financeiras significativas, muitas vezes na casa dos milhões. Isso destaca a importância e a urgência  da cibersegurança, em que o tempo é verdadeiramente equivalente a dinheiro. </p>\n\n\n\n<p>Em meio a esse cenário, Marcos Oliveira, Country Manager da Palo Alto Networks no Brasil, ressalta que a rapidez com que os invasores extraem dados e a demora das empresas em conter incidentes de segurança tornam evidente a ineficácia das soluções de segurança convencionais.&nbsp;</p>\n\n\n\n<p><em>&#8220;O relatório de Ameaças à Nuvem da Unit 42, unidade de pesquisa da Palo Alto Networks, aponta que equipes de TI demoram em média 145 horas para resolver alertas, com 60% das organizações levando mais de quatro dias. 90% não conseguem lidar com ameaças cibernéticas em uma hora, e 75% têm dificuldades em escolher ferramentas de segurança. Com o emprego de algoritmos avançados, aliado aos contínuos avanços em inteligência artificial (IA) e machine learning, é possível a detecção proativa de atividades suspeitas reduzindo o tempo de resposta a uma invasão, que, com essa abordagem, pode cair para apenas algumas horas”</em>, afirma</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ia-diminui-o-tempo-de-exposicao\"><strong>IA diminui o tempo de exposição</strong></h3>\n\n\n\n<p>A crescente velocidade das atividades dos cibercriminosos torna praticamente inviável abordar as ameaças cibernéticas por meio de métodos tradicionais manuais. </p>\n\n\n\n<p>Isso é agravado pelos novos requisitos regulatórios, como o da SEC (Comissão de Valores Mobiliários e Câmbio) nos Estados Unidos, que exige que empresas públicas relatem incidentes de cibersegurança relevantes no prazo de quatro dias após sua descoberta, e o da CVM (Comissão de Valores Mobiliários) no Brasil, órgão responsável por supervisionar, regulamentar e disciplinar o mercado de valores mobiliários no país.</p>\n\n\n\n<p>Diante dos desafios atuais, é essencial adotar tecnologias inovadoras, como inteligência artificial e machine learning, para fortalecer as defesas cibernéticas e mitigar riscos de ameaças. </p>\n\n\n\n<p>Essa transição para uma abordagem mais tecnologicamente orientada não apenas se alinha com as demandas do ambiente digital contemporâneo, mas também oferece uma resposta mais ágil e eficaz diante da sofisticação crescente das ameaças.</p>\n\n\n\n<p>Para abordar esse desafio em constante evolução, a Palo Alto Networks, líder global em cibersegurança, lançou a versão 2.0 do XSIAM, uma atualização da sua plataforma de operações de segurança baseada em IA, conhecida como Cortex XSIAM. Essa nova versão apresenta um framework &#8220;Traga seu Próprio Aprendizado de Máquina&#8221; (BYOML &#8211; Bring your Own Machine Learning, em inglês) para aprimorar a eficiência do Centro de Operações de Segurança (SOC). </p>\n\n\n\n<p>A ferramenta oferece recursos, como visibilidade abrangente permitindo que as organizações melhorem o monitoramento de segurança e a identificação de incidentes. </p>\n\n\n\n<p>Além disso, a plataforma prioriza a automação, para que combatam ameaças com maior velocidade, precisão e flexibilidade, automatizando tarefas e aprendendo com ações de analistas para aprimorar a resolução automática de incidentes futuros.</p>\n\n\n\n<p>Empresas que já utilizam a versão 2.0 do XSIAM no dia a dia observaram melhorias significativas na resposta para ataques cibernéticos. </p>\n\n\n\n<p>No setor de serviços, uma das empresas conseguiu reduzir o tempo médio de resolução de incidentes de segurança, passando de dias para apenas minutos após a implementação da plataforma. No ramo petrolífero e de gás, foi observada uma redução em 75% dos incidentes que exigem investigação.</p>\n\n\n\n<p>Para Paul Alexander, Diretor de Operações de TI do Imagination Technologies Group, a sobrecarga de informações é um dos principais problemas que enfrentam. </p>\n\n\n\n<p><em>“O crescimento dos negócios é ótimo, mas significa que temos mais operações comerciais para gerenciar e, enquanto isso, os atores da ameaça estão ficando mais sofisticados. O XSIAM está ajudando porque efetivamente nos permite ir direto ao ponto incidentes reais e sérios nos quais precisamos nos concentrar e não estamos perdendo tempo com dados que não precisam de nossa atenção”</em>, afirmou.</p>\n\n\n\n<p>De acordo com Oliveira, a melhor solução para otimização da cibersegurança é que organizações tenham uma única plataforma para otimizar operações de segurança.</p>\n\n\n\n<p><em> “O XSIAM 2.0 integra várias capacidades de um Centro de Operações de Segurança (SOC), como XDR, SOAR e SIEM. e tem a capacidade de coletar, conectar e normalizar continuamente dados brutos por meio de uma abordagem unificada”</em>, reforça o executivo. </p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/os-tres-ciberataques-mais-comuns-a-industria-de-jogos/\" target=\"_blank\" rel=\"noreferrer noopener\">Os três ciberataques mais comuns à indústria de jogos</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/pesquisa-da-sophos-aponta-que-varejo-teve-menor-taxa-de-interrupcao-de-ciberataques-nos-ultimos-3-anos/\" target=\"_blank\" rel=\"noreferrer noopener\">Pesquisa da Sophos aponta que varejo teve menor taxa de interrupção de ciberataques nos últimos 3 anos</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/seguranca-tecnologica-os-tipos-de-ciberataques-e-como-evita-los-nas-empresas/\" target=\"_blank\" rel=\"noreferrer noopener\">Segurança tecnológica: os tipos de ciberataques e como evitá-los nas empresas</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" fetchpriority=\"high\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/ataques-ciberneticos-em-ascensao-prejuizo-anual-pode-chegar-a-usd105-trilhoes-previsto-ate-2025/\">Ataques cibernéticos em ascensão: prejuízo anual pode chegar a USD$10,5 trilhões previsto até 2025</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "IA em nuvem é investimento estratégico a longo prazo para impulsionar a inovação nas empresas",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/ia-em-nuvem-e-investimento-estrategico-a-longo-prazo-para-impulsionar-a-inovacao-nas-empresas/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Sat, 18 Nov 2023 13:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Cloud"
                        },
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "IA"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "empresas"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123973"
                    },
                    "description": {
                        "#cdata-section": "<p>A inteligência artificial está transformando diversos setores da sociedade, desde a medicina até as finanças</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/ia-em-nuvem-e-investimento-estrategico-a-longo-prazo-para-impulsionar-a-inovacao-nas-empresas/\">IA em nuvem é investimento estratégico a longo prazo para impulsionar a inovação nas empresas</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>A inteligência artificial está transformando diversos setores da sociedade, desde a medicina até as finanças</em></p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img decoding=\"async\" width=\"445\" height=\"445\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/11/image-20.png\" alt=\"\" class=\"wp-image-123977\" style=\"width:310px\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/11/image-20.png 445w, https://cryptoid.com.br/wp-content/uploads/2023/11/image-20-310x310.png 310w, https://cryptoid.com.br/wp-content/uploads/2023/11/image-20-80x80.png 80w\" sizes=\"(max-width: 445px) 100vw, 445px\" /><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.linkedin.com/in/jefferson-antonio-camargo-7729801b/\" target=\"_blank\" rel=\"noreferrer noopener\">Jefferson Camargo</a></strong>, co-fundador e CEO da Kumulus</figcaption></figure></div>\n\n\n<p>A inteligência artificial está transformando diversos setores da sociedade, desde a medicina até as finanças, proporcionando avanços significativos em várias indústrias. </p>\n\n\n\n<p>À medida que a tecnologia continua avançando e os fornecedores de nuvem oferecem soluções cada vez mais sofisticadas, é importante acompanhar as oportunidades e abraçar a IA na nuvem para alcançar o sucesso em um mundo cada vez mais digital. </p>\n\n\n\n<p>No entanto, a implementação de projetos baseados em inteligência artificial pode apresentar desafios, especialmente quando se trata dos custos envolvidos. </p>\n\n\n\n<p>A implementação da IA na nuvem pode parecer um desafio financeiro inicial, mas ao analisar suas vantagens, fica claro que é um investimento estratégico com benefícios significativos a longo prazo. </p>\n\n\n\n<p>As possibilidades de economia, acesso à tecnologia avançada, flexibilidade, redução de custos operacionais e a democratização da IA são razões que mostram por que os custos não devem ser um impedimento para aproveitar os benefícios da inteligência artificial na nuvem, mas encarados como um investimento estratégico para impulsionar a inovação, aprimorar a competitividade e obter vantagens significativas no mercado atual. </p>\n\n\n\n<p>Segundo o relatório 2023 AI Index Report do Stanford Institute for Human-Centered Artificial Intelligence (HAI), em 2022, o investimento privado global em IA não passou dos US$ 91,9 bilhões, representando uma queda de 26,7% em relação a 2021.</p>\n\n\n\n<p>O aumento significativo das demandas por soluções tecnológicas avançadas tem levado as empresas a reconhecerem a necessidade de aprimorar a eficiência, excelência dos processos e a produtividade, pois temem ficar para trás no mercado. </p>\n\n\n\n<p>A fim de reduzir os custos, algumas empresas estão considerando a possibilidade de migrar para soluções locais para construir recursos de inteligência artificial/<em>machine learning</em>. </p>\n\n\n\n<p>No entanto, elas estão cautelosas em relação a essa decisão, como mostra o estudo já mencionado, pois não querem perder competitividade em termos de capacidades de IA/ML em comparação com seus concorrentes.</p>\n\n\n\n<p>Nesse cenário, as soluções em nuvem surgem como uma opção atraente para as empresas que precisam fortalecer sua infraestrutura para a integração de IA/ML. </p>\n\n\n\n<p>Essas soluções oferecem benefícios de escalabilidade, agilidade e acesso a tecnologias de ponta, ao mesmo tempo em que ajudam a controlar os custos de forma mais eficiente. </p>\n\n\n\n<p>Dessa forma, as empresas podem aproveitar os recursos da nuvem para impulsionar suas iniciativas de IA/ML sem comprometer sua competitividade no mercado.</p>\n\n\n\n<p>Por natureza, a IA requer recursos computacionais significativos para executar algoritmos complexos e lidar com grandes volumes de dados. </p>\n\n\n\n<p>No passado, essa infraestrutura de hardware estava restrita a grandes corporações com orçamentos substanciais. Mas tudo mudou com o surgimento da computação em nuvem. </p>\n\n\n\n<p>Agora, até mesmo pequenas startups e empreendedores têm a chance de aproveitar o poder da IA sem precisar investir em equipamentos caros e servidores de última geração.</p>\n\n\n\n<p>Embora algumas pessoas possam se preocupar com os custos associados à implementação da IA na nuvem, é essencial ver esse investimento como uma estratégia de longo prazo, uma vez que as vantagens superam os desafios financeiros iniciais. </p>\n\n\n\n<p>A computação em nuvem apresenta várias razões para não se deixar intimidar pelos custos. Entre elas, destaca-se a economia de escala, no qual você paga somente pelo que realmente usa, o que gera uma economia significativa em comparação com a aquisição e manutenção de infraestruturas locais que muitas vezes acabam ociosas. </p>\n\n\n\n<p>Além disso, ao optar pela nuvem, você tem acesso à tecnologia de ponta, pois os provedores estão em constante competição para oferecer as melhores soluções de IA, mesmo que seu orçamento seja limitado.</p>\n\n\n\n<p>A agilidade e escalabilidade são outras vantagens da nuvem, permitindo ajustar os recursos conforme a demanda, o que possibilita uma rápida escalabilidade à medida que seu projeto de IA cresce. </p>\n\n\n\n<p>Além disso, ao migrar para a nuvem, você elimina gastos com manutenção de infraestrutura, energia elétrica e refrigeração de servidores, reduzindo os custos operacionais.</p>\n\n\n\n<p>Outro ponto relevante, é que ela permite que sua equipe se concentre no <em>core business</em>, desenvolvendo e aprimorando a própria IA e otimizando o desenvolvimento do seu produto ou serviço, sem se preocupar com a infraestrutura de TI. </p>\n\n\n\n<p>De certa forma, a democratização da IA é uma realidade com a nuvem, tornando-a mais acessível a uma variedade de setores e empresas, independentemente do tamanho ou dos recursos financeiros.</p>\n\n\n\n<p>Essa mudança para a IA generativa pode ser um momento crítico para as empresas que ignoram o potencial valor dessa tecnologia para o seu setor e seus negócios. </p>\n\n\n\n<p>Por exemplo, fabricantes com cadeias de suprimentos alcançando 90% de eficiência devido à IA generativa terão uma vantagem significativa sobre aqueles que operam com apenas 60% de eficiência. </p>\n\n\n\n<p>Eles poderão oferecer cronogramas de produção mais rápidos, proporcionar melhores experiências aos clientes e funcionários, além de garantir maior qualidade a custos e preços mais baixos.</p>\n\n\n\n<p>Entretanto, a realidade é que a IA generativa será um investimento significativamente elevado. Pois será necessário adquirir CPUs, GPUs e sistemas de armazenamento, e provavelmente mais do que se imagina inicialmente. </p>\n\n\n\n<p>Isso marcará um ponto de inflexão em inovação e gastos para aquelas empresas que estão totalmente comprometidas com a IA generativa e acreditam na história que mencionei antes.</p>\n\n\n\n<p>Muitas empresas cometeram muitos erros que prejudicaram o valor que poderiam ter obtido da computação em nuvem. Elas dependiam excessivamente de simples migrações, ignorando melhores caminhos para uma infraestrutura em nuvem mais econômica. </p>\n\n\n\n<p>Pensavam que a computação em nuvem era apenas uma medida para economizar custos, e não uma forma de investimento. Agora, as empresas estão pagando o preço por isso, pois precisam voltar atrás e corrigir problemas que deveriam ter sido tratados desde o início. Em outras palavras, estão migrando as mesmas cargas de trabalho para a nuvem duas vezes.</p>\n\n\n\n<p>Por isso, meu conselho é encarar a IA pelo que ela realmente é: um investimento estratégico que pode definir o valor da empresa em algum momento. Não economize nesse investimento. Faça as coisas da maneira certa desde o início. Tenho certeza de que não haverá uma segunda chance para corrigir esse assunto.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/uso-da-computacao-em-nuvem-deve-crescer-10-nos-proximos-dois-anos/\" target=\"_blank\" rel=\"noreferrer noopener\">Uso da computação em nuvem deve crescer 10% nos próximos dois anos</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/check-point-software-aponta-diferencas-criticas-na-seguranca-da-rede-convencional-e-da-rede-em-nuvem/\" target=\"_blank\" rel=\"noreferrer noopener\">Check Point Software aponta diferenças críticas na segurança da rede convencional e da rede em nuvem</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/cinco-acoes-para-consolidar-a-seguranca-na-nuvem-e-reduzir-custos/\" target=\"_blank\" rel=\"noreferrer noopener\">Cinco ações para consolidar a segurança na nuvem e reduzir custos</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/ia-em-nuvem-e-investimento-estrategico-a-longo-prazo-para-impulsionar-a-inovacao-nas-empresas/\">IA em nuvem é investimento estratégico a longo prazo para impulsionar a inovação nas empresas</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "SEK alerta para ataques com uso de inteligência artificial e deepfake durante a Black Friday",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/sek-alerta-para-ataques-com-uso-de-inteligencia-artificial-e-deepfake-durante-a-black-friday/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Sat, 18 Nov 2023 12:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Cibersegurança"
                        },
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "Black Friday"
                        },
                        {
                            "#cdata-section": "ciberataque"
                        },
                        {
                            "#cdata-section": "deepfake"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123970"
                    },
                    "description": {
                        "#cdata-section": "<p>Ataques são capazes de simular o remetente legítimo das mensagens, adicionando até dados do banco da vítima ou empresa para parecer autêntico</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/sek-alerta-para-ataques-com-uso-de-inteligencia-artificial-e-deepfake-durante-a-black-friday/\">SEK alerta para ataques com uso de inteligência artificial e deepfake durante a Black Friday</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>Ataques são capazes de simular o remetente legítimo das mensagens, adicionando até dados do banco da vítima ou empresa para parecer autêntico</em></p>\n\n\n\n<p>Consumidores e varejistas deverão sofrer ataques com uso de tecnologias como inteligência artificial e deepfake durante a Black Friday. </p>\n\n\n\n<p>O alerta é da Security Ecosystem Knowledge (SEK), provedora de soluções e serviços de cibersegurança voltados a apoiar as empresas a lidar com ameaças digitais complexas, que aponta que estas tecnologias passaram a ser utilizadas para dar mais credibilidade aos chamados ataques de engenharia social.</p>\n\n\n\n<p>O alerta da SEK aponta que o período da Black Friday é um dos mais propícios para este tipo de ataque, que usam uma abordagem que foca estudar os indivíduos e alvos de forma comportamental. </p>\n\n\n\n<p>Entre os principais meios de contato com as vítimas estão e-mails, WhatsApp, SMS e redes sociais. Os ataques usando inteligência artificial e deepfake são capazes de simular de maneira realista o remetente legítimo das mensagens, adicionando até dados do banco da vítima ou empresa para parecer ainda mais autêntico. </p>\n\n\n\n<p><em>“A Black Friday acaba sendo um momento de fragilidade para empresas e consumidores. Isso porque os clientes vivem a emoção de encontrar os produtos que desejam a um preço mais baixo e aproveitar oportunidades de compra, mas acabam, por muitas vezes, se descuidando e caindo em golpes”</em>, afirma Fernando Galdino, Diretor de Portfólio e Estratégia da SEK. </p>\n\n\n\n<p><em>“Já as redes varejistas precisam redobrar os seus cuidados para não sofrer ataques neste período. É o momento de se preparar, de buscar ajuda, priorizar o tema, tomar cuidado com o processo completo de sua empresa e até de terceiros que podem resultar em fragilidades”</em>, completa Galdino.</p>\n\n\n\n<p>Além disso, há ainda o crescimento de ataques utilizando sites falsos de redes varejistas, que apresentam ofertas a preços muito abaixo da média e induzem os clientes a fazer pagamentos a criminosos. </p>\n\n\n\n<p><em>“Outro alerta que estamos dando aos consumidores é de, ao fazer pagamentos na modalidade PIX, que chequem bem o destinatário da conta antes do pagamento. Existem muitos casos deste código estar comprometido, o ator malicioso já injetou um código e você pode estar fazendo um PIX para uma conta de terceiro”</em>, alerta Galdino.</p>\n\n\n\n<p>Nos últimos anos, a Black Friday e a Cyber Monday tornaram-se o maior evento combinado de vendas e compras do ano, estendendo-se por quase uma semana em muitos países (Cyber Five, Cyber Week, entre outros). O crescimento explosivo do comércio online tem tido um grande impacto nos resultados deste evento ao longo da última década.</p>\n\n\n\n<p>De acordo com o Relatório de Investigações sobre Violação de Dados (DBIR) da Verizon, do total de ataques identificados em 2022, 83% deles foram provenientes de atores externos, com mais de 65% dos ciberataques sendo atribuídos a atores ligados ao crime organizado, e cerca de 13% ocorrem devido a erros ou má utilização de recursos por parte dos próprios colaboradores da organização, superando as organizações relacionadas a estados ou ativismo hacker.</p>\n\n\n\n<p><em>“Os varejos de todos os portes precisam se proteger de forma redobrada neste período, investindo em camadas de segurança de disponibilidade, procurando ajuda, redobrando cuidados. Além de proteger o próprio negócio, oferecer segurança aos clientes também é um diferencial competitivo”</em>, conclui Galdino.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-sobre-a-sek-security-ecosystem-knowledge\"><strong>Sobre a SEK (Security Ecosystem Knowledge)</strong></h3>\n\n\n\n<p>Com sede no Brasil e operações no Chile, Argentina, Colômbia e Peru, a SEK (Security Ecosystem Knowledge) oferece Soluções Tecnológicas e Serviços Gerenciados, Profissionais e Consultoria na área de cibersegurança voltados a ajudar as empresas a lidar com ameaças digitais complexas e proteger os ativos e as operações.   Criada a partir da fusão da Proteus e Neosecure, a SEK já nasce com mais de 20 anos de experiência, faturamento superior a US$ 100 milhões, mais de 650 clientes ativos e uma equipe de 750 profissionais localizados nos cinco escritórios e quatro centros de Serviços Gerenciados na América Latina, além dos Centros de Pesquisa e Desenvolvimento nos Estados Unidos e Portugal. </p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/id-rd/id-rd-e-anonybit-analisam-a-ameaca-deepfake-a-biometria-e-como-mitiga-la/\" target=\"_blank\" rel=\"noreferrer noopener\">ID R&amp;D e Anonybit analisam a ameaça deepfake à biometria e como mitigá-la</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/deepfakes-e-ataques-de-injecao/\" target=\"_blank\" rel=\"noreferrer noopener\">Deepfakes e ataques de injeção</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/especialista-orienta-como-se-proteger-de-golpes-durante-a-black-friday/\" target=\"_blank\" rel=\"noreferrer noopener\">Especialista orienta como se proteger de golpes durante a Black Friday</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/sek-alerta-para-ataques-com-uso-de-inteligencia-artificial-e-deepfake-durante-a-black-friday/\">SEK alerta para ataques com uso de inteligência artificial e deepfake durante a Black Friday</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "Webinar aborda soluções de Radar Antidrone Gamekeeper e Remote ID para proteção de aeroportos",
                    "link": "https://cryptoid.com.br/thales/webinar-aborda-solucoes-de-radar-antidrone-gamekeeper-e-remote-id-para-protecao-de-aeroportos/",
                    "dc:creator": {
                        "#cdata-section": "Regina Tupinambá"
                    },
                    "pubDate": "Fri, 17 Nov 2023 20:13:09 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "Thales"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=124044"
                    },
                    "description": {
                        "#cdata-section": "<p>A Thales e o portal MundoGeo um webinar focado na importância do controle e gestão de drones em ambientes aeroportuários. </p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/thales/webinar-aborda-solucoes-de-radar-antidrone-gamekeeper-e-remote-id-para-protecao-de-aeroportos/\">Webinar aborda soluções de Radar Antidrone Gamekeeper e Remote ID para proteção de aeroportos</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<div class=\"wp-block-columns is-layout-flex wp-container-2 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\"><div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><a href=\"https://mundogeo.com/thales21nov/\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"419\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/11/webinat-Thales-800x419.png\" alt=\"\" class=\"wp-image-124048\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/11/webinat-Thales-800x419.png 800w, https://cryptoid.com.br/wp-content/uploads/2023/11/webinat-Thales-310x162.png 310w, https://cryptoid.com.br/wp-content/uploads/2023/11/webinat-Thales-768x402.png 768w, https://cryptoid.com.br/wp-content/uploads/2023/11/webinat-Thales.png 1200w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></figure></div></div>\n</div>\n\n\n\n<p class=\"caps\"></p>\n\n\n\n<p></p>\n\n\n\n<p>A Thales, empresa líder no desenvolvimento de tecnologias de segurança aeroespacial, apresentará em conjunto com o portal MundoGeo um webinar focado na importância do controle e gestão de drones em ambientes aeroportuários. </p>\n\n\n\n<p>Com o título &#8220;<strong>Radar Antidrone Gamekeeper e Remote ID para Proteção de Aeroportos&#8221;</strong>, o evento trará insights cruciais sobre a detecção, identificação e contenção de drones, fundamentais para garantir a segurança das operações nos aeroportos.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"800\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/11/Alvaro-Cuccolo.jpeg\" alt=\"\" class=\"wp-image-124045\" style=\"aspect-ratio:1;width:259px;height:auto\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/11/Alvaro-Cuccolo.jpeg 800w, https://cryptoid.com.br/wp-content/uploads/2023/11/Alvaro-Cuccolo-310x310.jpeg 310w, https://cryptoid.com.br/wp-content/uploads/2023/11/Alvaro-Cuccolo-80x80.jpeg 80w, https://cryptoid.com.br/wp-content/uploads/2023/11/Alvaro-Cuccolo-768x768.jpeg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" /><figcaption class=\"wp-element-caption\">Segundo <a href=\"http://linkedin.com/in/alvaro-cuccolo-543a8b59\" target=\"_blank\" rel=\"noreferrer noopener\">Alvaro Cuccolo</a>, gerente de contas da Thales</figcaption></figure></div>\n\n\n<p>Segundo <a href=\"http://linkedin.com/in/alvaro-cuccolo-543a8b59\" target=\"_blank\" rel=\"noreferrer noopener\">Alvaro Cuccolo</a>, gerente de contas da Thales, o crescente uso de drones em diversas áreas tem gerado uma nova dinâmica no espaço aéreo, especialmente nos aeroportos, demandando um controle rigoroso para coexistir harmoniosamente com as operações aéreas convencionais. “Este webinar se propõe a discutir as soluções oferecidas pela empresa para lidar com esse desafio crescente, abordando não apenas a detecção e identificação de drones, mas também os métodos de contenção para garantir a segurança das operações aeroportuárias”, explica.</p>\n\n\n\n<p>Alvaro Cuccolo é formado em Engenharia Aeroespacial pela UFABC e tem pós-graduação em Gestão de Projetos e Gestão Empresarial pela FGV. Ele trará sua expertise no mercado brasileiro, detalhando as soluções de radares de tráfego aéreo, identificação e contenção de drones, além das estratégias para o gerenciamento de aeronaves não tripuladas. O webinar será realizado no dia 21 de novembro, às 16h. </p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button is-style-outline\" style=\"text-transform:uppercase\"><a class=\"wp-block-button__link has-vivid-cyan-blue-color has-text-color wp-element-button\">O link de inscrição já está disponível aqui!</a></div>\n</div>\n\n\n\n<p></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/tendencias-de-seguranca-fortalecem-a-evolucao-dos-aeroportos/\" target=\"_blank\" rel=\"noreferrer noopener\">Tendências de segurança fortalecem a evolução dos aeroportos</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/aeroportos-tendem-a-ampliar-uso-de-ciberseguranca/\" target=\"_blank\" rel=\"noreferrer noopener\">Aeroportos tendem a ampliar uso de cibersegurança, gerenciamento de ocupação e biometria</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/biometria/21742/\" target=\"_blank\" rel=\"noreferrer noopener\">Paris utilizará identificação digital para segurança e agilidade em seus aeroportos</a></p>\n\n\n\n<p></p>\n\n\n\n<p><strong>Sobre a Thales</strong></p>\n\n\n<div class=\"wp-block-image is-style-default\">\n<figure class=\"alignleft size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"94\" src=\"https://cryptoid.com.br/wp-content/uploads/2021/10/Thales_Logo.svg-1-800x94.png\" alt=\"\" class=\"wp-image-84553\" style=\"width:206px;height:24px\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2021/10/Thales_Logo.svg-1-800x94.png 800w, https://cryptoid.com.br/wp-content/uploads/2021/10/Thales_Logo.svg-1-310x36.png 310w, https://cryptoid.com.br/wp-content/uploads/2021/10/Thales_Logo.svg-1-768x90.png 768w, https://cryptoid.com.br/wp-content/uploads/2021/10/Thales_Logo.svg-1.png 1200w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></figure></div>\n\n\n<p>A Thales (Euronext Paris: HO) é líder global em tecnologias avançadas em três domínios: Defesa e Segurança, Aeronáutica e Espaço e Identidade Digital e Segurança.&nbsp;Desenvolve produtos e soluções que ajudam a tornar o mundo mais seguro.</p>\n\n\n\n<p>O Grupo investe perto de 4 mil milhões de euros por ano em Investigação e Desenvolvimento, particularmente em áreas-chave como tecnologias quânticas, Edge computing, 6G e cibersegurança.</p>\n\n\n\n<p>A Thales tem 77 mil funcionários em 68 países.&nbsp;Em 2022, o Grupo gerou vendas de 17,6 mil milhões de euros.</p>\n\n\n\n<p>Leia outros artigos da Thales <a href=\"https://cryptoid.com.br/categoria/thales/\" target=\"_blank\" rel=\"noreferrer noopener\">aqui </a>no Crypto ID!</p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n\n\n\n<p></p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/thales/webinar-aborda-solucoes-de-radar-antidrone-gamekeeper-e-remote-id-para-protecao-de-aeroportos/\">Webinar aborda soluções de Radar Antidrone Gamekeeper e Remote ID para proteção de aeroportos</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "IA e Dados: serviços e operações de próxima geração",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/ia-e-dados-servicos-e-operacoes-de-proxima-geracao/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Fri, 17 Nov 2023 19:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "IA"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "dados"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123963"
                    },
                    "description": {
                        "#cdata-section": "<p>Tecnologias estão transformando a maneira como vivemos, trabalhamos e interagimos com o mundo ao nosso redor </p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/ia-e-dados-servicos-e-operacoes-de-proxima-geracao/\">IA e Dados: serviços e operações de próxima geração</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>Tecnologias estão transformando a maneira como vivemos, trabalhamos e interagimos com o mundo ao nosso redor </em></p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"800\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/11/image-19.png\" alt=\"\" class=\"wp-image-123964\" style=\"aspect-ratio:1;width:286px;height:auto\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/11/image-19.png 800w, https://cryptoid.com.br/wp-content/uploads/2023/11/image-19-310x310.png 310w, https://cryptoid.com.br/wp-content/uploads/2023/11/image-19-80x80.png 80w, https://cryptoid.com.br/wp-content/uploads/2023/11/image-19-768x768.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" /><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.linkedin.com/in/emlima/\" target=\"_blank\" rel=\"noreferrer noopener\">Emerson Lima</a></strong>, fundador e CEO da Sauter Digital</figcaption></figure></div>\n\n\n<p>Nos últimos anos, testemunhamos uma revolução tecnológica sem precedentes, onde a inteligência artificial (IA) e os serviços de dados desempenham papéis centrais. </p>\n\n\n\n<p>Essas tecnologias estão transformando a maneira como vivemos, trabalhamos e interagimos com o mundo ao nosso redor. </p>\n\n\n\n<p>A IA, uma disciplina da ciência da computação que se concentra na criação de sistemas capazes de aprender e tomar decisões, está cada vez mais presente em nossa vida cotidiana. </p>\n\n\n\n<p>Desde chatbots que fornecem suporte ao cliente até assistentes virtuais como Siri e Alexa, essa tecnologia está se tornando uma parte inegável de nossa sociedade digital.</p>\n\n\n\n<p>Já os serviços de dados desempenham um papel fundamental na capacidade da IA de funcionar. Eles fornecem os dados necessários para treinar algoritmos e melhorar seu desempenho. </p>\n\n\n\n<p>E quando os dois lados estão sincronizados, podem entregar experiências que melhoram o fluxo de trabalho entre as equipes e até aumentar a produtividade.</p>\n\n\n\n<p>Como exemplo temos a maneira como os problemas são relatados com uma experiência omnichannel. O uso de um chatbot para automatizar tarefas rotineiras e fornecer serviços em toda a empresa libera as equipes de TI para priorizar seu tempo e recursos com eficiência. </p>\n\n\n\n<p>Isso não apenas permite que eles mudem seu foco para projetos mais criativos para o crescimento da empresa como também cria uma experiência excepcional para os funcionários.</p>\n\n\n\n<p>Essa sincronização ajuda no gerenciamento e na produtividade de projetos, além de aprimorar as experiências dos funcionários, convergindo recursos disponíveis e muitas vezes esquecidos com uma única visão da tecnologia de uma empresa. </p>\n\n\n\n<p>Ao transformar o desconhecido em conhecido, as empresas podem cuidar melhor do hoje para que possam levar o amanhã ao próximo nível. </p>\n\n\n\n<p>De acordo com a Global Tech Trends Survey 2023, da Equinix, a necessidade de educação e colaboração para permitir que as equipes de TI otimizem a implantação dessa infraestrutura, com expertise em computação em nuvem sendo buscada por 51% dos que estão aumentando suas equipes de TI no Brasil.</p>\n\n\n\n<p>Vivemos na era da informação, onde dados são o novo petróleo e a inteligência artificial (IA) é a máquina que os refina em conhecimento valioso. A sincronização entre IA e serviços de dados desempenha um papel crucial na capacidade de tirar o máximo proveito desse recurso tão precioso. </p>\n\n\n\n<p>A IA é faminta por dados, e quanto mais dados de alta qualidade ela recebe, mais precisa e eficaz ela se torna. Isso é onde os serviços de dados entram em jogo. Além disso, é uma ferramenta que transforma dados em insights acionáveis. Quando alimentada com dados de alta qualidade</p>\n\n\n\n<p>A inteligência artificial e os serviços de dados estão mudando radicalmente a maneira como vivemos e trabalhamos. Eles estão impulsionando a automação, a personalização e a inovação em todos os setores. </p>\n\n\n\n<p>À medida que essas tecnologias continuam a se desenvolver, é fundamental que sejam usadas de maneira responsável e ética. O futuro da IA e dos serviços de dados é promissor, e estamos apenas começando a explorar seu potencial pleno. </p>\n\n\n\n<p>Conforme navegamos neste mundo em rápida evolução, é imperativo que abracemos essas tecnologias como ferramentas para melhorar a qualidade de vida e impulsionar o progresso em direção a um futuro mais inteligente e eficiente.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/desvendando-oportunidades-desafios-e-responsabilidades-da-inteligencia-artificial-na-seguranca-patrimonial-e-fisica/\" target=\"_blank\" rel=\"noreferrer noopener\">Desvendando oportunidades, desafios e responsabilidades da Inteligência Artificial na segurança patrimonial e física</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/novo-relatorio-da-zendesk-aponta-que-87-consideram-uso-de-ia-prioridade-na-experiencia-do-cliente/\" target=\"_blank\" rel=\"noreferrer noopener\">Novo relatório da Zendesk aponta que 87% consideram uso de IA prioridade na experiência do cliente</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/na-era-dos-dados-como-processos-de-ti-aceleram-a-construcao-de-valor-nas-empresas/\" target=\"_blank\" rel=\"noreferrer noopener\">Na era dos dados: como processos de TI aceleram  a construção de valor nas empresas</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/ia-e-dados-servicos-e-operacoes-de-proxima-geracao/\">IA e Dados: serviços e operações de próxima geração</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "Da preparação à prosperidade: iStock revela como as PMEs podem se destacar nas vendas do fim de ano",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/da-preparacao-a-prosperidade-istock-revela-como-as-pmes-podem-se-destacar-nas-vendas-do-fim-de-ano/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Fri, 17 Nov 2023 17:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "VAREJO"
                        },
                        {
                            "#cdata-section": "PMEs"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123957"
                    },
                    "description": {
                        "#cdata-section": "<p>Black Friday, Cyber Monday, Natal e Ano Novo disputam a atenção e a intenção de compra dos brasileiros. Veja dicas para destacar seu negócio</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/da-preparacao-a-prosperidade-istock-revela-como-as-pmes-podem-se-destacar-nas-vendas-do-fim-de-ano/\">Da preparação à prosperidade: iStock revela como as PMEs podem se destacar nas vendas do fim de ano</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"has-text-align-left\"><em>Black Friday, Cyber Monday, Natal e Ano Novo disputam a atenção e a intenção de compra dos brasileiros. Veja dicas para destacar seu negócio</em></p>\n\n\n\n<p class=\"has-text-align-left\">Enquanto&nbsp;as empresas&nbsp;brasileiras&nbsp;se&nbsp;preparam&nbsp;para o aumento&nbsp;nas&nbsp;vendas&nbsp;período de festas, a&nbsp;iStock, a plataforma do&nbsp;comércio&nbsp;eletrônico&nbsp;líder que fornece&nbsp;conteúdo&nbsp;premium para&nbsp;PMEs,&nbsp;criativos&nbsp;e&nbsp;estudantes&nbsp;em todo lugar,&nbsp;revelou&nbsp;hoje&nbsp;novas&nbsp;dicas&nbsp;baseadas&nbsp;em dados e&nbsp;orientação&nbsp;sobre como as&nbsp;PMEs&nbsp;podem&nbsp;maximizar o&nbsp;desempenho&nbsp;nessa&nbsp;época festiva&nbsp;e&nbsp;arrasar no mercado&nbsp;com&nbsp;comunicações&nbsp;e&nbsp;imagens&nbsp;impactantes&nbsp;e&nbsp;relevantes nos&nbsp;esforços&nbsp;de marketing e&nbsp;publicidade.&nbsp;&nbsp;</p>\n\n\n\n<p class=\"has-text-align-left\">Inclusive com os impactos econômicos atuais, as últimas pesquisas de VisualGPS da iStock mostram que as pessoas querem apoiar empresas pequenas, com 48% das pessoas afirmando que compram produtos locais e 23% afirmando que fazem as compras em empresas pequenas, ainda mais do que costumavam há um ano. </p>\n\n\n\n<p class=\"has-text-align-left\">Diante disso, os empresários devem se movimentar com intenção de alcançar e falar com esses clientes e se destacar no meio do espaço publicitário transbordante típico das festas de fim de ano.  </p>\n\n\n\n<p class=\"has-text-align-left\"><em>“As empresas estão pensando no período das festas cada ano mais cedo &#8211; considerando esse padrão de gastos e essa mentalidade, as empresas pequenas precisam considerar diferentes elementos de marketing ao tentar atrair clientes tanto no ambiente online como no físico, em suas lojas”</em> afirmou Grant Farhall, o diretor de produtos da iStock. </p>\n\n\n\n<p class=\"has-text-align-left\"><em>“As nossas últimas pesquisas revelaram que, tanto como híbrido continua sendo o futuro do trabalho de escritório, o futuro das compras e do varejo continua sendo uma mistura dos dois, com os consumidores ainda gostando muito da interação pessoal ao fazerem compras na loja. É importante avaliar como o storytelling visual de sua empresa reflete isso, bem como outros comportamentos atuais do consumidor, para causar um impacto durante as festas natalinas e de fim de ano.”  </em></p>\n\n\n\n<p class=\"has-text-align-left\">Para ajudar nessa tarefa, a&nbsp;iStock&nbsp;reuniu&nbsp;dicas&nbsp;práticas&nbsp;apoiadas&nbsp;em dados e&nbsp;percepções&nbsp;do mundo real para&nbsp;ajudar&nbsp;empresas de todos os&nbsp;tamanhos&nbsp;a entender o que&nbsp;ressoa&nbsp;com&nbsp;os consumidores e a levar&nbsp;com&nbsp;eficácia&nbsp;os clientes a&nbsp;agirem.&nbsp;&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading has-text-align-left\" id=\"h-crie-nbsp-uma-nbsp-vibe-nbsp-de-nbsp-ferias-nbsp-misturando-nbsp-imagens-nbsp-classicas-nbsp-com-nbsp-nuance-nbsp-contemporanea-nbsp-nbsp\"><strong>Crie&nbsp;uma&nbsp;vibe&nbsp;de&nbsp;férias&nbsp;misturando&nbsp;imagens&nbsp;clássicas&nbsp;com&nbsp;nuance&nbsp;contemporânea:&nbsp;</strong><strong>&nbsp;</strong></h3>\n\n\n\n<p class=\"has-text-align-left\">Ao longo dos anos, os símbolos de espírito festivo do final do ano (como, por exemplo, luzes decorativas, gorros de Papai Noel, temporada de compras, bonecos de neve, etc.) permaneceram os mesmos, mas os impactos da pandemia provocaram uma mudança definitiva no sentimento e nas prioridades dos consumidores, especialmente quando se trata das festividades natalinas. </p>\n\n\n\n<p class=\"has-text-align-left\">Coisas como a saúde mental, as relações pessoais, o equilíbrio entre a vida pessoal e profissional e a sustentabilidade são valores importantes para consumidores hoje em dia e são cruciais na hora de agradar os seus clientes.  </p>\n\n\n\n<p class=\"has-text-align-left\">Enquanto os símbolos natalinos dos pinheiros seguem ressoando entre os clientes, considere mostrar momentos que o dinheiro não pode comprar, oferecendo imagens detalhadas que da casa e da vida pessoal das pessoas &#8211; sejam os alimentos que estão comendo, os presentes e as sacolas de compras que estão usando ou as decorações que estão sendo exibidas. Busque uma estética que pareça rica, detalhada e feliz e opte por imagens e vídeos que enfatizem temas de proximidade.  </p>\n\n\n\n<h3 class=\"wp-block-heading has-text-align-left\" id=\"h-aproveite-nbsp-o-poder-do-video-para-criar-nbsp-conexoes-nbsp-nbsp\"><strong>Aproveite&nbsp;o poder do vídeo para criar&nbsp;conexões:&nbsp;</strong><strong>&nbsp;</strong></h3>\n\n\n\n<p class=\"has-text-align-left\">Uma análise dos vídeos mais vendidos pela Getty Images e da iStock mostra que os vídeos em um estilo mais lento ajudam a criar uma conexão mais forte com as audiências-chave. </p>\n\n\n\n<p class=\"has-text-align-left\">Além disso, 76% das pessoas preferem vídeos mais curtos, reels e stories para conteúdo destinado a inspirar e fornecer novas perspectivas.  </p>\n\n\n\n<p class=\"has-text-align-left\">Em vez de as empresas promoverem diretamente um produto ou um serviço em todos os materiais de marketing, aproveitar a oportunidade para exibir imagens que se alinhem com a empolgação das pessoas para estar em família, com amigos e entes queridos no final do ano. </p>\n\n\n\n<p class=\"has-text-align-left\">Escolha vídeos que mostrem famílias brindando antes de saborear um jantar de Natal, crianças olhando com deslumbramento para as decorações, ou cenas festivas de entes queridos celebrando o ano novo, para assim explorar outro lado da psique dos consumidores. </p>\n\n\n\n<h3 class=\"wp-block-heading has-text-align-left\" id=\"h-pense-nbsp-em-como-nbsp-voce-nbsp-pode-nbsp-fazer-nbsp-diferente-nbsp-nas-nbsp-redes-nbsp-sociais-nbsp-nbsp\"><strong>Pense&nbsp;em como&nbsp;você&nbsp;pode&nbsp;fazer&nbsp;diferente&nbsp;nas&nbsp;redes&nbsp;sociais:&nbsp;</strong><strong>&nbsp;</strong></h3>\n\n\n\n<p class=\"has-text-align-left\">As redes sociais são uma ferramenta eficaz para atingir várias gerações de uma vez só. De fato, 56% das pessoas de todas as idades dizem que essas as ajudam para se manterem informadas sobre as suas marcas prediletas. </p>\n\n\n\n<p class=\"has-text-align-left\">Essa porcentagem é ainda maior para a Geração Z/millenials (76%). Aliás, 77% das pessoas de todas as idades concordam que as redes sociais são uma oportunidade para assistir conteúdo que as fazem rir ou sorrir.  </p>\n\n\n\n<p class=\"has-text-align-left\">As empresas podem se tornar ainda mais eficazes ao atrair cada geração durante a época festiva, especialmente nas redes. </p>\n\n\n\n<p class=\"has-text-align-left\">Utilize criativos que mostrem pessoas e personalidades, em vez de ilustrações ou animações para se inclinar mais para o lado mais divertido, humorístico e emocional dessa época do ano. </p>\n\n\n\n<p class=\"has-text-align-left\">Para atrair as gerações mais jovens, use tutoriais e padrões culturais que são tendências online como uma forma de se conectar e se relacionar com o momento atual e com as necessidades cotidianas das pessoas.  </p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-sobre-a-istock\"><strong>Sobre a iStock</strong></h3>\n\n\n\n<p class=\"caps\">A oferta de valor da Getty Images, iStock by Getty Images, é uma fonte global líder de conteúdo visual que oferece às pequenas e médias empresas e indivíduos uma maneira poderosa de fazer sua mensagem se destacar para os consumidores. A iStock oferece mais de 145 milhões de fotos, ilustrações, vetores e vídeos de qualidade premium disponíveis por meio de preços simples e acessíveis. Combinando a comunidade exclusiva de colaboradores globais da iStock com os extensos recursos e experiência em tendências criativas da Getty Images, a iStock oferece ainda mais a renomada qualidade da empresa, selecionando conteúdo de estoque criativo distinto e autêntico.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/pesquisa-da-gmo-globalsign-com-corporacoes-e-pmes-mostra-que-muitas-nao-estao-preparadas-para-a-automacao-de-pki/\" target=\"_blank\" rel=\"noreferrer noopener\">Pesquisa da GMO GlobalSign com Corporações e PMEs Mostra que Muitas Não Estão Preparadas para a Automação de PKI</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/mercado/transformacao-digital-nas-mpmes-e-o-impacto-positivoda-tecnologia-nos-negocios/\" target=\"_blank\" rel=\"noreferrer noopener\">Transformação digital nas MPMEs e o impacto positivo da tecnologia nos negócios</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/implementacao-de-fatores-de-seguranca-deve-ser-prioridade-de-pmes/\">Implementação de fatores de segurança deve ser prioridade de PMEs</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/da-preparacao-a-prosperidade-istock-revela-como-as-pmes-podem-se-destacar-nas-vendas-do-fim-de-ano/\">Da preparação à prosperidade: iStock revela como as PMEs podem se destacar nas vendas do fim de ano</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "Black Friday mais promissora exige gestão antifraude de varejistas, diz Nuvei",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/black-friday-mais-promissora-exige-gestao-antifraude-de-varejistas-diz-nuvei/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Fri, 17 Nov 2023 17:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "VAREJO"
                        },
                        {
                            "#cdata-section": "Black Friday"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123960"
                    },
                    "description": {
                        "#cdata-section": "<p>Empresas precisam se planejar com antecedência e definir estratégias de prevenção para lidar com fraudes cada vez mais sofisticadas</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/black-friday-mais-promissora-exige-gestao-antifraude-de-varejistas-diz-nuvei/\">Black Friday mais promissora exige gestão antifraude de varejistas, diz Nuvei</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>Empresas precisam se planejar com antecedência e definir estratégias de prevenção para lidar com fraudes cada vez mais sofisticadas</em></p>\n\n\n\n<p>Assim como consumidores aproveitam a Black Friday para fazer compras mais expressivas, fraudadores também aguardam o momento certo para aplicar golpes cada vez mais sofisticados nos clientes de plataformas de e-commerce. </p>\n\n\n\n<p>Por esta razão, na avaliação da Nuvei, uma das maiores fintechs de meios de pagamentos do mundo, lojistas de todos os portes que comercializam produtos e soluções por meio do e-commerce precisam, cada vez mais, fortalecer sua infraestrutura com diferentes camadas de proteção contra-ataques cibernéticos que coloquem à prova suas ferramentas de gestão antifraude e, com isso, evitem ameaças à reputação e até à sobrevivência do negócio.</p>\n\n\n\n<p>Um dos esquemas fraudadores mais populares nos últimos anos e que deve ganhar força durante a Black Friday deste ano, segundo a Nuvei, é o do uso de sites do varejo por hackers para testar cartões de crédito adquiridos pelos criminosos na dark web. </p>\n\n\n\n<p>A estratégia dos golpistas é fazer transações de valores mais baixos, evitando que os titulares dos cartões percebam as movimentações. A prática gera compras ilícitas e pedidos de chargeback, comprometendo a receita dos lojistas.</p>\n\n\n\n<p><em>“Sites de ticket baixo são os principais alvos, mas ninguém está isento do risco”</em>, alerta Rafael Lavezzo, vice-presidente sênior da Nuvei na América Latina. </p>\n\n\n\n<p><em>“É fundamental que as empresas se cerquem de provedores de pagamento capazes de monitorar o padrão de comportamento dos clientes, identificando picos de vendas incomuns ou pequenas compras feitas de última hora”</em>, aconselha o executivo.</p>\n\n\n\n<p>Lavezzo argumenta que ferramentas modernas de gestão de fraude vêm ajudando varejistas a cruzar o perfil do cliente com os meios de pagamento utilizados, antevendo possíveis fraudes. </p>\n\n\n\n<p><em>“É importante ter regras de negócios que garantam mais segurança no e-commerce, o que vai desde exigir o CPF e o endereço do consumidor até apostar em métodos mais sofisticados, como o uso de impressão digital”</em>, defende o vice-presidente.</p>\n\n\n\n<p>Segundo o executivo Rafael Lopes, diretor de expansão da Nuvei, as empresas devem se preparar com antecedência para a temporada de promoções, sobretudo de final de ano, marcada por ações como Black Friday, Cyber Monday e o Natal, <em>“O mês de novembro não é um momento de ajustes. Os lojistas que querem evitar prejuízos e ataques à reputação já devem ter tomado as previdências ao longo dos últimos dois meses pelo menos”</em>, diz Lopes.</p>\n\n\n\n<p><em>“Não adianta o lojista investir pesado em campanha de marketing se a tecnologia não estiver preparada para esse período de pico de vendas”</em>, explica o executivo.</p>\n\n\n\n<p>Para o executivo, a preparação contínua e cuidadosa com parceiros, assim como a implementação de estratégias para lidar com os riscos são essenciais para garantir uma experiência de compra tranquila para os clientes.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-sobre-a-nuvei\"><strong>Sobre a Nuvei</strong> </h3>\n\n\n\n<p>A Nuvei (Nasdaq: NVEI) (TSX: NVEI) é uma fintech canadense que acelera os negócios de clientes no mundo todo.  Nossa tecnologia modular, flexível e escalável permite que as maiores empresas ofereçam todas as opções de pagamentos e se beneficiem de serviços bancários, de gestão de fraudes e riscos. A Nuvei conecta empresas aos seus clientes em mais de 200 mercados, com adquirência local em mais de 47 mercados, contando com 150 moedas e mais de 600 métodos de pagamento alternativos, fornecendo tecnologias e insights para clientes e parceiros para ter sucesso local e global com uma só integração.  </p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/especialista-orienta-como-se-proteger-de-golpes-durante-a-black-friday/\" target=\"_blank\" rel=\"noreferrer noopener\">Especialista orienta como se proteger de golpes durante a Black Friday</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/black-friday-saiba-como-reforcar-a-seguranca-digital-em-um-dos-periodos-mais-quentes-de-vendas-do-ano/\" target=\"_blank\" rel=\"noreferrer noopener\">Black Friday: saiba como reforçar a segurança digital em um dos períodos mais quentes de vendas do ano</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/como-cibercriminosos-estao-utilizando-ia-para-aplicar-golpes-em-consumidores-na-black-friday/\" target=\"_blank\" rel=\"noreferrer noopener\">Como cibercriminosos estão utilizando IA para aplicar golpes em consumidores na Black Friday</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/black-friday-mais-promissora-exige-gestao-antifraude-de-varejistas-diz-nuvei/\">Black Friday mais promissora exige gestão antifraude de varejistas, diz Nuvei</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "Data Health: garantindo a integridade dos dados para uma organização data-driven",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/data-health-garantindo-a-integridade-dos-dados-para-uma-organizacao-data-driven/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Fri, 17 Nov 2023 16:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "Proteção de dados"
                        },
                        {
                            "#cdata-section": "dados"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123928"
                    },
                    "description": {
                        "#cdata-section": "<p>Embora quase todo mundo saiba que os dados são importantes, quase ninguém consegue usá-los em todo o seu potencial</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/data-health-garantindo-a-integridade-dos-dados-para-uma-organizacao-data-driven/\">Data Health: garantindo a integridade dos dados para uma organização data-driven</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>Embora quase todo mundo saiba que os dados são importantes, quase ninguém consegue usá-los em todo o seu potencial</em></p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" width=\"797\" height=\"800\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/11/Cesar-Ripari-1-797x800.jpg\" alt=\"\" class=\"wp-image-123942\" style=\"width:310px\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/11/Cesar-Ripari-1-797x800.jpg 797w, https://cryptoid.com.br/wp-content/uploads/2023/11/Cesar-Ripari-1-310x310.jpg 310w, https://cryptoid.com.br/wp-content/uploads/2023/11/Cesar-Ripari-1-80x80.jpg 80w, https://cryptoid.com.br/wp-content/uploads/2023/11/Cesar-Ripari-1-768x771.jpg 768w, https://cryptoid.com.br/wp-content/uploads/2023/11/Cesar-Ripari-1-1531x1536.jpg 1531w, https://cryptoid.com.br/wp-content/uploads/2023/11/Cesar-Ripari-1-scaled.jpg 2041w\" sizes=\"(max-width: 797px) 100vw, 797px\" /><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.linkedin.com/in/riparic/\" target=\"_blank\" rel=\"noreferrer noopener\">Cesar Ripari</a></strong>, diretor de pré-vendas da QLIK para a América Latina </figcaption></figure></div>\n\n\n<p>Se estar rodeado de dados fosse o único movimento necessário para garantir as melhores decisões de negócios, as empresas já teriam feito isso. </p>\n\n\n\n<p>Como aprendemos todos os dias, a coleta de dados por si só não é suficiente para transformar uma companhia rica em dados em uma orientada por eles. A ironia é que quanto mais dados uma organização gerencia, mais difícil se torna manter esse controle. </p>\n\n\n\n<p>Portanto, pode-se concluir que a única maneira de atingir as metas fundamentais de negócios é agir com base em dados confiáveis ​​e de alta qualidade. Para isso, precisamos garantir a “saúde dos dados”, ou<em> Data Health</em>.&nbsp;</p>\n\n\n\n<p>Pergunte a qualquer empresa sobre como ela mede a integridade de seus negócios. Sem dúvida, a resposta será uma lista de métricas com base em dados, com os quais ela administra seus negócios. </p>\n\n\n\n<p>A maioria das pessoas sabe intuitivamente que dados saudáveis ​​devem ser limpos, completos e em conformidade com os requisitos legais e regulamentares. </p>\n\n\n\n<p>Infelizmente, esses fatores por si só não garantem que as informações estejam prontas para uso em operações comerciais. </p>\n\n\n\n<p>A maioria das companhias não consegue medir a integridade das informações que utiliza e é perigoso confiar em dados nos quais esse fator não possa ser medido.&nbsp;</p>\n\n\n\n<p>Parte do problema é que, embora muitos executivos pensem que entendem o que significa ter dados saudáveis, existe uma luta árdua para definir ou avaliar a integridade dos dados. Não há dúvida de que a maior arma contra a incerteza é a informação. </p>\n\n\n\n<p>Embora quase todo mundo saiba que os dados são importantes, quase ninguém consegue usá-los em todo o seu potencial. Há muito trabalho pela frente para fazer uso eficaz de dados.&nbsp;&nbsp;</p>\n\n\n\n<p>Defendo a ideia de que os dados deveriam sempre suportar os objetivos de negócios. Os dados são íntegros quando é possível provar que são válidos, completos e de qualidade suficiente para produzir análises nas quais os executivos podem se sentir à vontade para tomar decisões de negócios. </p>\n\n\n\n<p>Além dos níveis executivos, empresas com dados saudáveis permitem que todos acessem as informações de que precisam e quando precisam, sem questionar sua validade.&nbsp;&nbsp;</p>\n\n\n\n<p>Garantir a integridade dos dados envolve monitoramento e intervenção em todo o ciclo de vida, e só é possível quando combina três elementos principais: agilidade para entregar dados rapidamente em um ambiente flexível e escalável; cultura de dados compartilhada em todos os níveis; e confiança entre diversos departamentos para manter as informações unificadas e atualizadas. </p>\n\n\n\n<p>Vale destacar que a confiança aumenta quando existem dados que são visíveis e verificáveis por todas as unidades de negócios e que ajudam nas ações e nas decisões corporativas.&nbsp;</p>\n\n\n\n<p>Com os dados no centro das empresas, estamos vendo cada vez mais pessoas com níveis variados de habilidades se preocupando com a qualidade dos dados, principalmente em garantir um “golden record” – aquele dado mais completo, preciso, atualizado, limpo e, principalmente, governado. </p>\n\n\n\n<p>Em paralelo, as equipes de TI acabam sendo altamente demandadas para conseguir criar soluções com rapidez suficiente e manter os dados “dourados” para atender ao negócio. A saída encontrada por muitas empresas passa pela mudança para ambientes híbridos e MultiCloud. </p>\n\n\n\n<p>Graças à flexibilidade dos serviços em Nuvem, a produtividade pode ser aumentada, assim como os custos podem ser otimizados. </p>\n\n\n\n<p>Já vemos uma grande quantidade de bancos de dados armazenados em Nuvem e a tendência é de crescimento para manter estruturas complexas e adaptáveis, assim como uma estratégia de gerenciamento de dados flexível e muito bem definida.&nbsp;</p>\n\n\n\n<p>Quando as organizações falam sobre dados, elas geralmente têm um objetivo ou uma iniciativa específica em mente. Cada iniciativa tem um resultado de negócios associado: aumento da receita, redução de custos, mitigação de riscos ou melhoria da eficiência operacional, por exemplo. </p>\n\n\n\n<p>Cada vez mais, iniciativas de Data Health se enquadram em algumas categorias comuns que já são familiares para a maioria dos profissionais que trabalham com dados e buscam insights mais rápidos para suas decisões. </p>\n\n\n\n<p>A tendência é termos cada vez mais esforços colaborativos para a criação de uma maior conscientização sobre a importância da qualidade dos dados. Nessa jornada, aqueles que melhor cuidarem de seus dados e garantirem que estejam saudáveis terão todas as condições de brilhar.&nbsp;</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/governanca-de-dados-qualidade-e-disponibilidade-sao-desafios-para-organizacoes-data-driven/\" target=\"_blank\" rel=\"noreferrer noopener\">Governança de dados: qualidade e disponibilidade são desafios para organizações Data Driven</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/inteligencia-artificial/alfabetizacao-em-dados-para-uma-sociedade-data-driven/\" target=\"_blank\" rel=\"noreferrer noopener\">Alfabetização em dados para uma sociedade data driven</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/data-driven-a-importancia-dos-dados-na-saude/\" target=\"_blank\" rel=\"noreferrer noopener\">Data-driven: a importância dos dados na saúde</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/data-health-garantindo-a-integridade-dos-dados-para-uma-organizacao-data-driven/\">Data Health: garantindo a integridade dos dados para uma organização data-driven</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "Gartner anuncia previsões para empresas e usuários de TI",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/gartner-anuncia-previsoes-para-empresas-e-usuarios-de-ti/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Fri, 17 Nov 2023 14:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "Pesquisas e Estudos"
                        },
                        {
                            "#cdata-section": "empresas"
                        },
                        {
                            "#cdata-section": "Gartner"
                        },
                        {
                            "#cdata-section": "Tecnologia da Informação"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123921"
                    },
                    "description": {
                        "#cdata-section": "<p>Estimativas e previsões do líder em pesquisa sobre empresas Gartner, são para o ano de 2024 e para os próximos anos </p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/gartner-anuncia-previsoes-para-empresas-e-usuarios-de-ti/\">Gartner anuncia previsões para empresas e usuários de TI</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>Estimativas e previsões do líder em pesquisa sobre empresas Gartner, são para o ano de 2024 e para os próximos anos</em></p>\n\n\n\n<p>O Gartner, líder mundial em pesquisa e aconselhamento para empresas, anuncia&nbsp;suas principais previsões estratégicas para 2024 e para os próximos anos. </p>\n\n\n\n<p>Os analistas destacam&nbsp;que&nbsp;a Inteligência Artificial Generativa (GenAI) mudou a forma de pensar dos líderes sobre todos os assuntos e sobre como criar uma empresa&nbsp;mais flexível e preparada para o futuro.&nbsp;</p>\n\n\n\n<p><em>&#8220;A Inteligência Artificial Generativa apresenta uma oportunidade para realizar coisas que nunca eram&nbsp;possíveis no âmbito da existência humana&#8221;, diz Daryl Plummer, Vice-presidente e analista do Gartner. &#8220;Os CIOs (Chief&nbsp;Information&nbsp;Officers) e os executivos de alto escalão irão abraçar os riscos de usar a Inteligência Artificial Generativa&nbsp;para conseguirem colher benefícios sem precedentes”</em>, diz ele.&nbsp;</p>\n\n\n\n<p><em>&#8220;Este é o primeiro ano completo no qual a Inteligência Artificial Generativa está no centro de todas as decisões estratégicas, liderando&nbsp;todas as outras inovações tecnológicas. A Inteligência Artificial Generativa quebrou barreiras e continua&nbsp;criando&nbsp;entusiasmo&#8221;</em>, afirma o analista.&nbsp;</p>\n\n\n\n<p>As principais previsões do Gartner são: &nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2027-o-valor-da-produtividade-da-inteligencia-artificial-ia-sera-reconhecido-como-um-indicador-economico-fundamental\"><strong>Até 2027, o valor da produtividade da Inteligência Artificial (IA) será reconhecido como um indicador econômico fundamental&nbsp;</strong></h3>\n\n\n\n<p>Os governos&nbsp;têm um forte compromisso com Inteligência Artificial e estão priorizando estratégias e planos que reconhecem a IA como uma tecnologia essencial nos setores público e privado. </p>\n\n\n\n<p>A incorporação da IA no planejamento de longo prazo de diversas nações está sendo reforçada por meio da implementação de atos e regulamentações correspondentes para apoiar as iniciativas relacionadas a esta tecnologia. </p>\n\n\n\n<p><em>&#8220;O uso pelos diversos países&nbsp;irá solidificar a IA como um catalisador para aumentar a produtividade e impulsionar a economia digital&#8221;</em>, diz o analista do Gartner. <em>&#8220;A implementação bem-sucedida de iniciativas de IA em larga escala requer o apoio e a colaboração de diversas partes interessadas, demonstrando a capacidade de mobilização e convocação de recursos nacionais.&#8221;</em>&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2027-as-ferramentas-de-inteligencia-artificial-generativa-serao-usadas-para-explicar-os-sistemas-legados-e-criar-substituicoes-adequadas-reduzindo-os-custos-de-modernizacao-em-70\"><strong>Até 2027, as ferramentas de Inteligência Artificial Generativa serão usadas para explicar os sistemas legados e criar substituições adequadas, reduzindo os custos de modernização em 70%&nbsp;</strong></h3>\n\n\n\n<p>Para o analista do Gartner,<em> “a&nbsp;maturidade dos modelos de linguagem ampla (LLMs) oferece uma oportunidade para que os CIOs&nbsp;encontrem um mecanismo confiável,&nbsp;e há muito esperado,&nbsp;para modernizar de maneira econômica&nbsp;as aplicações de legado&#8221;</em>, afirma&nbsp;Plummer. </p>\n\n\n\n<p><em>&#8220;Os CIOs&nbsp;podem criar unidades de teste dedicadas para avaliar&nbsp;os resultados gerados pelos LLMs&nbsp;de&nbsp;GenAI&nbsp;e, ao mesmo tempo, estabelecer processos de gerenciamento de mudanças e aprimoramento de habilidades para permitir que a força de trabalho maximize a produtividade durante todo o ciclo de modernização.&#8221;</em>&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2028-os-gastos-das-empresas-no-combate-a-desinformacao-ultrapassarao-us-30-bilhoes-canibalizando-cerca-de-10-dos-orcamentos-de-marketing-e-de-seguranca-cibernetica-para-combater-uma-ameaca-multifacetada\"><strong>Até 2028, os gastos das empresas no combate à&nbsp;desinformação&nbsp;ultrapassarão US$ 30 bilhões, canibalizando cerca de 10% dos orçamentos de marketing e de segurança cibernética para combater uma ameaça multifacetada&nbsp;</strong>&nbsp;</h3>\n\n\n\n<p>Informações falsas e a desinformação&nbsp;influenciam&nbsp;os mecanismos de tomada de decisão dos humanos e das máquinas, tornando o trabalho extremamente difícil de ser realizado, detectado&nbsp;e desativado. </p>\n\n\n\n<p>A desinformação de forma geral apresenta ameaças em três áreas funcionais distintas: segurança cibernética, marketing e Inteligência Artificial. &nbsp;</p>\n\n\n\n<p><em>&#8220;O rápido crescimento da GenAI&nbsp;fez com que os reguladores se preocupassem em analisar como informações falsas podem ser&nbsp;um dos&nbsp;riscos associados para a disponibilidade da GenAI&nbsp;e para agentes mal-intencionados&#8221;</em>, afirma Plummer. <em>&#8220;As empresas que se mantiverem&nbsp;atentas aos agentes mal-intencionados, aos órgãos reguladores e aos fornecedores de ferramentas e&nbsp;de tecnologias provavelmente obterão uma vantagem significativa sobre os concorrentes.&#8221;</em>&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2027-45-dos-diretores-de-seguranca-da-informacao-cisos-ampliarao-suas-atribuicoes-para-alem-da-seguranca-cibernetica-devido-a-crescente-pressao-regulatoria-e-a-expansao-das-areas-de-ataque\"><strong>Até 2027, 45% dos diretores de segurança da informação (CISOs) ampliarão suas atribuições para além da segurança cibernética, devido à crescente pressão regulatória e à expansão das áreas&nbsp;de ataque&nbsp;</strong></h3>\n\n\n\n<p>O CISO&nbsp;(<em>Chief&nbsp;Information&nbsp;Security Officer</em>) supervisiona o portfólio geral de ativos digitais, mas as responsabilidades pelo gerenciamento de segurança e pelos ativos digitais estão fragmentadas em várias equipes&nbsp;e áreas.&nbsp;</p>\n\n\n\n<p>O Gartner alerta que isso cria inconsistências no suporte a divulgações regulatórias,&nbsp;na&nbsp;segurança digital e no gerenciamento eficaz de incidentes de segurança, reduzindo o desempenho geral das empresas.&nbsp;</p>\n\n\n\n<p>A expansão do portfólio do CISO permitirá a unificação da gestão de&nbsp;segurança, fornecendo supervisão do processo consolidado de gerenciamento de incidentes de segurança em toda a empresas.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2028-a-taxa-de-sindicalizacao-entre-os-trabalhadores-do-conhecimento-aumentara-em-1-000-motivada-pela-adocao-da-genai\"><strong>Até 2028, a taxa de sindicalização entre os trabalhadores do conhecimento aumentará em 1.000%, motivada pela adoção da GenAI&nbsp;</strong></h3>\n\n\n\n<p>Os executivos são rápidos em apontar a Inteligência Artificial como a causa da eliminação de cargos. Portanto, é importante que os líderes comuniquem claramente aos seus funcionários a intenção de usar&nbsp;IA. </p>\n\n\n\n<p>Isso evitará consequências não intencionais como&nbsp;aumento da ansiedade dos profissionais&nbsp;com a tecnologia. As empresas&nbsp;que adotarem a GenAI&nbsp;e não conseguirem lidar claramente com a ansiedade&nbsp;de&nbsp;seus trabalhadores do conhecimento&nbsp;terão taxas de rotatividade de pelo menos 20%.&nbsp;</p>\n\n\n\n<p><em>&#8220;As organizações devem concentrar seus esforços de IA para melhorar a produtividade e a qualidade do trabalho, em vez de apenas automatizar&nbsp;funções&#8221;</em>, afirma&nbsp;Plummer. <em>&#8220;Mantenha-se firme no que a tecnologia pode e não pode oferecer porque ainda há uma quantidade substancial de hype&nbsp;influenciando as expectativas.&#8221;&nbsp;</em></p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-em-2026-30-dos-profissionais-aproveitarao-os-filtros-de-carisma-digital-para-alcancar-avancos-anteriormente-inatingiveis-em-suas-carreiras\"><strong>Em 2026, 30% dos profissionais&nbsp;aproveitarão os filtros de carisma digital para alcançar avanços anteriormente inatingíveis em suas carreiras&nbsp;</strong></h3>\n\n\n\n<p>Um filtro de carisma digital solicita e analisa as comunicações para torná-las mais eficazes socialmente em várias situações. Ele estimula&nbsp;antes, durante e depois as interações para tornar os líderes e seus colegas de trabalho mais eficazes nas circunstâncias sociais nas quais desejam se destacar. </p>\n\n\n\n<p>Os filtros digitais de carisma&nbsp;irão&nbsp;melhorar&nbsp;a capacidade das empresas&nbsp;de expandirem suas contratações para incluir profissionais com experiencias mais diversificadas.&nbsp;</p>\n\n\n\n<p><em>&#8220;As companhias podem expandir seu pool de talentos incorporando o uso de assistentes de filtro de carisma digital para melhorar a congruência das interações em todas as fases do&nbsp;recrutamento e,&nbsp;também,&nbsp;da&nbsp;contratação&#8221;</em>, diz Plummer. </p>\n\n\n\n<p><em>&#8220;Acelere o acesso aos assistentes com carisma digital pressionando os fornecedores de aplicações e produtividade empresarial sobre como eles estão incorporando esses recursos em suas soluções&#8221;</em>, acrescenta o analista.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2027-25-das-empresas-listadas-na-fortune-500-irao-recrutar-ativamente-talentos-neurodivergentes-em-condicoes-como-autismo-tdah-e-dislexia-para-melhorar-o-desempenho-dos-negocios\"><strong>Até 2027, 25% das empresas listadas na&nbsp;Fortune 500 irão recrutar ativamente talentos neurodivergentes&nbsp;em condições como autismo, TDAH e dislexia para melhorar o desempenho dos negócios&nbsp;</strong></h3>\n\n\n\n<p>Para o Gartner, as companhias&nbsp;que contratarem e mantiverem talentos neurodivergentes&nbsp;terão maior envolvimento dos funcionários, produtividade e inovação em toda a força de trabalho. </p>\n\n\n\n<p>Diversas&nbsp;empresas da Fortune 500 já estão investindo em programas de contratação de neurodiversidade e estão observando impactos no envolvimento e nos resultados dos negócios. As companhias&nbsp;precisam estabelecer um programa de divulgação para aumentar a capacidade de descoberta de talentos neurodiversos. </p>\n\n\n\n<p>O Gartner recomenda que as empresas acelerem&nbsp;os esforços aproveitando as práticas recomendadas por seus&nbsp;especialistas e as lições de&nbsp;outras organizações&nbsp;que já estão trabalhando com a neurodiversidade. </p>\n\n\n\n<p><em>&#8220;Inclua pessoas neurodivergentes&nbsp;nos cargos de liderança da empresa&#8221;</em>, recomenda&nbsp;Plummer. <em>&#8220;Ter uma liderança abertamente neurodivergente&nbsp;promove uma cultura de inclusão e pode ser a iniciativa mais valiosa a ser tomada do ponto de vista dos funcionários neurodivergentes.&#8221;&nbsp;</em></p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2026-30-das-grandes-empresas-terao-canais-ou-uma-unidade-de-negocios-dedicada-para-acessar-mercados-de-machine-customer\"><strong>Até 2026, 30% das grandes empresas terão canais ou uma unidade de negócios dedicada para acessar mercados de <em>machine&nbsp;customer</em>&nbsp;</strong></h3>\n\n\n\n<p>Os<em>&nbsp;machine customers</em>&nbsp;irão forçar uma reformulação das principais funções, como cadeia de suprimentos, vendas, marketing, atendimento a clientes, comércio digital e experiência dos usuários. </p>\n\n\n\n<p>De fato, até 2025, mais de 25% dos centros de vendas e de serviços de grandes empresa&nbsp;irão receber&nbsp;chamadas de <em>machine&nbsp;customers</em>.&nbsp;</p>\n\n\n\n<p><em>&#8220;Os machine&nbsp;customers&nbsp;precisarão de seus próprios canais de vendas porque são capazes de fazer&nbsp;transações em alta velocidade e o volume de variáveis de decisão que usam excede,&nbsp;em muito,&nbsp;a capacidade humana&#8221;</em>, afirma&nbsp;Plummer. <em>&#8220;Os machine customers&nbsp;exigirão talentos, habilidades e processos diferentes que talvez não existam em empresas&nbsp;focadas&nbsp;no cliente humano.&#8221;&nbsp;</em></p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2028-havera-mais-robos-inteligentes-do-que-trabalhadores-na-linha-de-frente-nos-setores-de-manufatura-varejo-e-logistica-devido-a-escassez-de-mao-de-obra\"><strong>Até 2028, haverá mais robôs inteligentes do que trabalhadores na linha de frente nos setores de manufatura, varejo e logística devido à escassez de mão de obra&nbsp;</strong></h3>\n\n\n\n<p>A maioria das empresas de manufatura, varejo e logística não conseguirá&nbsp;encontrar ou reter profissionais&nbsp;suficientes para apoiar suas operações. </p>\n\n\n\n<p>Isso irá gerar dificuldades para encontrar trabalhadores suficientes para atuarem na&nbsp;linha de frente das companhias&nbsp;na próxima década. </p>\n\n\n\n<p>Os robôs ajudarão a preencher essa lacuna. Uma recente pesquisa do Gartner mostra&nbsp;que 96% dos funcionários de tecnologia da cadeia de suprimentos implementaram ou planejam implementar a automação ciberfísica&nbsp;e 35% já adoram robôs, sendo que 61% já estão em fase-piloto&nbsp;ou no meio da&nbsp;primeira&nbsp;implementação.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-ate-2026-50-dos-membros-do-g20-sofrerao-racionamento-de-eletricidade-transformando-as-operacoes-com-consciencia-energetica-em-uma-vantagem-competitiva-ou-em-um-grande-risco-de-falha\"><strong>Até 2026, 50% dos membros do G20 sofrerão racionamento de eletricidade, transformando as operações com consciência energética em uma vantagem competitiva ou em um grande risco de falha&nbsp;</strong></h3>\n\n\n\n<p>As infraestruturas de rede envelhecidas estão limitando a capacidade de adicionar novas formas de geração de eletricidade, mas a demanda por energia continuará&nbsp;aumentando. </p>\n\n\n\n<p>As empresas estão avaliando o preço e a acessibilidade da energia como uma competitividade, o que significa que o acesso estável à eletricidade se tornará uma vantagem competitiva. Por isso, muitos líderes já estão criando operações com consciência energética por meio da otimização e do investimento direto na geração de energia. </p>\n\n\n\n<p>O Gartner recomenda que as empresas aproveitem a eficiência energética para estabelecerem&nbsp;uma vantagem competitiva de longo prazo, reduzindo estruturalmente o consumo de energia. <em>&#8220;Avalie o investimento de sua empresa incluindo os custos atuais e futuros previstos de energia&#8221;</em>, diz Plummer.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-sobre-o-gartner-nbsp\"><strong>Sobre o Gartner</strong>&nbsp;</h3>\n\n\n\n<p>O Gartner, Inc. (NYSE: IT) fornece insights objetivos e acionáveis que impulsionam decisões mais inteligentes e um melhor desempenho para as prioridades de missão crítica das empresas. </p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/na-era-dos-dados-como-processos-de-ti-aceleram-a-construcao-de-valor-nas-empresas/\" target=\"_blank\" rel=\"noreferrer noopener\">Na era dos dados: como processos de TI aceleram&nbsp; a construção de valor nas empresas</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/gartner-preve-que-os-gastos-mundiais-com-ti-crescerao-8-em-2024/\" target=\"_blank\" rel=\"noreferrer noopener\">Gartner prevê que os gastos mundiais com TI crescerão 8% em 2024</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/inteligencia-artificial/gartner-preve-que-mais-de-80-das-empresas-usarao-apis-de-inteligencia-artificial-generativa-ou-implementarao-aplicacoes-habilitadas-para-essa-tecnologia-ate-2026/\" target=\"_blank\" rel=\"noreferrer noopener\">Gartner prevê que mais de 80% das empresas usarão APIs de Inteligência Artificial Generativa ou implementarão aplicações habilitadas para essa tecnologia até 2026</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/gartner-anuncia-previsoes-para-empresas-e-usuarios-de-ti/\">Gartner anuncia previsões para empresas e usuários de TI</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                },
                {
                    "title": "Recursos do WhatsApp para potencializar negócio na Black Friday",
                    "link": "https://cryptoid.com.br/identidade-digital-destaques/recursos-do-whatsapp-para-potencializar-negocio-na-black-friday/",
                    "dc:creator": {
                        "#cdata-section": "ISADORA LAVIOLA"
                    },
                    "pubDate": "Fri, 17 Nov 2023 13:00:00 +0000",
                    "category": [
                        {
                            "#cdata-section": "Destaques"
                        },
                        {
                            "#cdata-section": "Notícias"
                        },
                        {
                            "#cdata-section": "VAREJO"
                        },
                        {
                            "#cdata-section": "Black Friday"
                        },
                        {
                            "#cdata-section": "Whatsapp"
                        }
                    ],
                    "guid": {
                        "@isPermaLink": "false",
                        "#text": "https://cryptoid.com.br/?p=123915"
                    },
                    "description": {
                        "#cdata-section": "<p>De compartilhamento de catálogos a criação de Comunidades, o app da Meta se tornou uma ferramenta de negócios</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/recursos-do-whatsapp-para-potencializar-negocio-na-black-friday/\">Recursos do WhatsApp para potencializar negócio na Black Friday</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    },
                    "content:encoded": {
                        "#cdata-section": "\n<p class=\"caps\"><em>De compartilhamento de catálogos a criação de Comunidades, o app da Meta se tornou uma ferramenta de negócios</em></p>\n\n\n\n<p>A Black Friday se aproxima e, com ela, os comércios de todo o Brasil estão se preparando para um dos períodos de maior volume de vendas do ano. </p>\n\n\n\n<p>Diversas empresas já estão se movimentando para oferecer promoções irresistíveis e ainda garantir a melhor experiência de compra.</p>\n\n\n\n<p>E é nesse contexto que o WhatsApp se destaca como uma ferramenta fundamental para vendas e atendimento ao cliente.&nbsp;</p>\n\n\n\n<p>De acordo com o CX Trends 2023, um estudo realizado pela Octadesk e Opinion Box, fica evidente o quanto os consumidores confiam no WhatsApp para suas interações com as marcas. </p>\n\n\n\n<p>61% dos compradores preferem utilizar esse aplicativo para conversar com uma empresa, enquanto 67% confiam ou têm plena confiança no canal quando o assunto é realizar uma compra pelo app.&nbsp;</p>\n\n\n\n<p>Rodrigo Ricco, fundador da Octadesk, plataforma de atendimento da Locaweb Company, conta que o uso do WhatsApp vai além das abordagens tradicionais e afirma que deixou de ser apenas um canal de mensagens e, graças às inovações introduzidas pela Meta, se tornou uma plataforma de negócios. </p>\n\n\n\n<p><em>“Presente em 99% dos celulares em operação no Brasil, o WhatsApp se tornou um forte aliado para as empresas, já que o consumidor se mostrou muito satisfeito com as conveniências em conversar com as empresas pelo canal. No entanto, para aproveitar ao máximo o potencial da plataforma, é essencial conhecer todas as possibilidades e recursos disponíveis para alavancar as vendas e proporcionar uma experiência de compra envolvente, especialmente em temporadas de altas vendas, como a Black Friday, que acontece no dia 24 de novembro”,</em> afirma.</p>\n\n\n\n<p>E para ajudar as empresas a potencializarem seus negócios durante a Black Friday, Ricco separou cinco recursos para quem quer apostar na venda via WhatsApp:</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-respostas-rapidas\"><strong>Respostas Rápidas</strong></h3>\n\n\n\n<p>O CX Trends 2023 ainda mostra que 35% dos consumidores online fazem suas compras à noite ou durante a madrugada, sendo o horário mais popular. </p>\n\n\n\n<p>Com essa realidade, utilizar chatbots com mensagens automáticas para responder rapidamente às perguntas frequentes dos clientes, faz com com que você economize tempo e forneça informações relevantes.</p>\n\n\n\n<p><em> “Mesmo que o cliente saiba que está conversando com um bot, se o processo de comunicação for inteligente, ele não se importará. O que conta é que o cliente está sendo atendido, tendo suas dúvidas esclarecidas e os seus problemas resolvidos. E é exatamente essa proatividade que gera encantamento e engajamento, e que pode levar este usuário a efetuar mais compras”</em>, destaca o especialista.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-click-to-whatsapp\"><strong>Click to WhatsApp</strong></h3>\n\n\n\n<p>Outro recurso muito interessante e que contribui para alavancar os resultados na Black Friday, são os anúncios nas redes sociais, como Facebook e Instagram, no formato “click-to-chat” (clique para conversar). </p>\n\n\n\n<p>O grande diferencial desse tipo de anúncio do Grupo Meta é direcionar o usuário direto para uma conversa do WhatsApp, ao invés de levá-lo a um site ou página de captura. </p>\n\n\n\n<p><em>“O Click to WhatsApp é uma forma de anunciar que permite a conexão direta do usuário que foi impactado pelo anúncio com a empresa anunciante. Se traduz em uma oportunidade para comunicar as ofertas que atraem a atenção dos consumidores e incentivá-los a aproveitar as ofertas da Black Friday diretamente no canal preferido pelos brasileiros. Essa iniciativa pode ser a diferença entre perder ou concretizar uma venda”</em>, alerta Rodrigo.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-catalogos\"><strong>Catálogos</strong></h3>\n\n\n\n<p>Outra facilidade do WhatsApp é a capacidade de criar uma loja completa dentro do aplicativo, proporcionando facilidade, conveniência e disponibilidade 24 horas por dia. </p>\n\n\n\n<p><em>“É possível compartilhar o catálogo de produtos e disponibilizar um carrinho de compras para que o usuário finalize a compra em um só lugar, de forma automatizada. A função de catálogos é excelente para compartilhar informações detalhadas sobre produtos com imagens, descrições e preços, facilitando a compra para o usuário. Além disso, com a tecnologia certa, ainda permite que toda a jornada de compra &#8211; desde a pesquisa até o pagamento &#8211; seja feita toda dentro da plataforma”</em>, destaca Rodrigo.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-disparo-em-massa\"><strong>Disparo em massa</strong></h3>\n\n\n\n<p>Para quem deseja enviar uma mesma comunicação para um grande número de pessoas ao mesmo tempo, de forma automatizada, o uso da função de Disparo em Massa no WhatsApp pode ser uma estratégia válida. </p>\n\n\n\n<p>Na Black Friday, o recurso ajuda a distribuir de maneira eficiente as promoções e oferecer vendas proativas. Ricco recomenda planejar as campanhas com antecedência, criando mensagens que usem recursos diversos como imagens, vídeos e links para suas ofertas. </p>\n\n\n\n<p><em>“Garanta que tudo esteja pronto e testado antes do grande dia da Black Friday. Aproveite a funcionalidade para segmentar sua lista de contatos, personalizando a comunicação para diferentes grupos com base no histórico de compras, preferências e comportamento passado. Essa atividade pode ser uma forte aliada no pós-venda também. Após a Black Friday, continue se comunicando com os clientes que fizeram compras, fornecendo informações sobre o status do pedido, prazos de entrega e suporte contínuo”,</em> ressalta.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-comunidades-para-empresas\"><strong>Comunidades para empresas</strong></h3>\n\n\n\n<p>Com o recurso de Comunidades, é possível criar grupos de discussões exclusivos para direcionar as ofertas para determinados grupos e se aproximar ainda mais do público. </p>\n\n\n\n<p><em>“Reunir membros com interesses semelhantes pode ser uma ótima escolha para criar comunicações personalizadas e assertivas. Dentro das Comunidades, os administradores podem controlar os envios de mensagens para todos os membros da comunidade, inserção ou remoção de participantes e até mesmo criar subgrupos ou autorização para deletar mensagens de terceiros quando necessário, tudo isso para manter o relacionamento com o público bem aquecido e potencializar as chances de compra e recompra”</em>, explica Ricco.</p>\n\n\n\n<p>Por fim, o especialista enfatiza que a divulgação no WhatsApp deve ser feita de forma responsável, evitando o envio excessivo de mensagens e respeitando as políticas de privacidade dos usuários. </p>\n\n\n\n<p><em>“O ponto é que a transformação digital não se trata apenas de estar presente no digital. No final das contas, o centro dessa mudança está pautado na experiência do usuário. Os negócios mudaram e a forma de se fazer negócio no mundo mudou, principalmente porque temos um novo perfil de consumidor e é preciso estar preparado para atendê-lo com sucesso”</em>, finaliza.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-sobre-a-octadesk\"><strong>Sobre a Octadesk&nbsp;</strong></h3>\n\n\n\n<p>A Octadesk, uma empresa Locaweb Company, é a plataforma de atendimento para vendas e pós-vendas, que foi reconhecida como uma das 20 empresas mais inovadoras do Brasil pelo Innovative Workplaces 2023, do MIT Technology Review, e como uma das empresas de SaaS (Software como Serviço) que mais crescem no mundo pela revista internacional LATKA. </p>\n\n\n\n<p>Fundada em 2015 por Rodrigo Ricco e Leandro Ueda, a empresa foi incorporada à Locaweb Company em 2021 e é a única plataforma 100% nacional que permite às empresas melhorarem o atendimento ao cliente. Assim, é possível conectar as áreas do negócio e unificar múltiplos canais de atendimento, como WhatsApp, Redes Sociais e chat do site, em um só lugar. </p>\n\n\n\n<p>Essa integração proporciona aos gestores um melhor controle da equipe e aos consumidores uma boa experiência de compra. Atualmente, a plataforma&nbsp; gerencia mais de quatro milhões de mensagens por dia entre empresas e clientes, evidenciando a confiança depositada na Octadesk como solução para atendimento eficiente e de alta qualidade.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/como-evitar-fraudes-nas-compras-pelo-whatsapp/\" target=\"_blank\" rel=\"noreferrer noopener\">Como evitar fraudes nas compras pelo WhatsApp?</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/como-faturar-mais-com-infoprodutos-na-black-friday/\" target=\"_blank\" rel=\"noreferrer noopener\">Como faturar mais com infoprodutos na Black Friday</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/ssl-tls/e-commerce-no-brasil-esta-crescendo-a-passos-largos-voce-esta-preparado-para-esse-mercado-durante-a-black-friday/\" target=\"_blank\" rel=\"noreferrer noopener\">E-commerce no Brasil está crescendo a passos largos. Você está preparado para esse mercado durante a Black Friday?</a></p>\n\n\n\n<p style=\"font-size:18px\">SOBRE O CRYPTO ID</p>\n\n\n\n<p>EMPRESAS QUE APOIAM O CRYPTO ID CONTRIBUEM PARA A CONSTRUÇÃO DE UM MUNDO DIGITAL MAIS SEGURO, CONFIÁVEL E TRANQUILO! </p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile is-vertically-aligned-center\" style=\"grid-template-columns:44% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"724\" height=\"483\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg\" alt=\"\" class=\"wp-image-123155 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1.jpg 724w, https://cryptoid.com.br/wp-content/uploads/2023/10/iStock-1431799883-1-310x207.jpg 310w\" sizes=\"(max-width: 724px) 100vw, 724px\" /></figure><div class=\"wp-block-media-text__content\">\n<p></p>\n\n\n\n<p style=\"font-size:18px\">Fornecemos conteúdo de qualidade desde 2014. </p>\n\n\n\n<p style=\"font-size:18px\">Siga o Crypto ID no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n\n\n\n<p></p>\n</div></div>\n\n\n\n<div class=\"wp-block-group is-layout-flow wp-block-group-is-layout-flow\"><div class=\"wp-block-group__inner-container\">\n<p>Você quer acompanhar nosso conteúdo? Então siga nossa página no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n</div></div>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/identidade-digital-destaques/recursos-do-whatsapp-para-potencializar-negocio-na-black-friday/\">Recursos do WhatsApp para potencializar negócio na Black Friday</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\">CRYPTOID</a>.</p>\n"
                    }
                }
            ]
        }
    } /*
Performance optimized by W3 Total Cache. Learn more: https://www.boldgrid.com/w3-total-cache/

Page Caching using disk: enhanced (Page is feed) 

Served from: cryptoid.com.br @ 2023-11-19 02:19:38 by W3 Total Cache
*/
}