{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@version":"2.0","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:admin":"http://webns.net/mvcb/","@xmlns:rdf":"http://www.w3.org/1999/02/22-rdf-syntax-ns#","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","channel":{"title":"AlienVault Blogs","link":"https://cybersecurity.att.com/blogs","description":"The most recent posts from across the AlienVault blogs.","dc:language":"en","dc:creator":"hello@alienvault.com","dc:rights":"Copyright 2023","dc:date":"2023-11-17T15:00:00+00:00","admin:generatorAgent":{"@rdf:resource":"http://expressionengine.com/"},"item":[{"title":"AT&amp;T announces creation of standalone managed Cybersecurity services business","link":"https://cybersecurity.att.com/blogs/security-essentials/att-announces-formation-of-new-managed-security-services-company","guid":"https://cybersecurity.att.com/blogs/security-essentials/att-announces-formation-of-new-managed-security-services-company#When:15:00:00Z","description":{"#cdata-section":"\n<p>On November 17,&nbsp;2023 AT&amp;T announced the creation of a new managed security services business backed by WillJam Ventures. Press release <a href=\"https://about.att.com/story/2023/standalone-managed-cybersecurity-services-business.html\" target=\"_blank\">here</a>.</p>\n\n<p>Businesses of all types and sizes want to, and need to focus on innovation, growth, and transformation strategies. Meanwhile, the complexity of managing the evolving cybersecurity landscape continues to expand. Adversaries are determined, well-funded, and on a mission to disrupt businesses of all types and sizes.</p>\n\n<p>As this complexity continues to mount, the task of operating internal security operations centers (SOCs) often becomes difficult for a business to manage. Organizations face staffing shortages, professional burnout, rising costs, and struggle to keep ahead of the unrelenting cyber risks.</p>\n\n<p>To help tame complexity, many organizations are engaging with managed security services. This is exactly the venture&rsquo;s mission &ndash; to help simplify security. It will help manage the risk while our clients reap the rewards.</p>\n\n<p>This new venture will help our clients:</p>\n\n<ul>\n\t<li>Secure their business intelligence through experienced advisors.</li>\n\t<li>Predict their security investments by driving efficiency into security operations.</li>\n\t<li>Mitigate risk and focus on innovation as an experienced and vigilant managed security services provider.</li>\n</ul>\n\n<p>Both AT&amp;T and WillJam Ventures<b> </b>are committed to investing in excellence and serving your security needs as our valued clients. I look forward to sharing more information about these exciting changes in the coming months.</p>\n\n<p><b>Sundhar Annamalai, President AT&amp;T Cybersecurity</b></p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-17T15:00:00+00:00"},{"title":"Free proxies and the hidden dangers","link":"https://cybersecurity.att.com/blogs/security-essentials/free-proxies-and-the-hidden-dangers","guid":"https://cybersecurity.att.com/blogs/security-essentials/free-proxies-and-the-hidden-dangers#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>Data privacy continues to be a growing concern for all internet users. While the internet gives us so much more freedom and access to information we might not have otherwise, online privacy continues to be a significant risk. It&rsquo;s not just cybercriminals that invade your privacy, but businesses as well. Data has become more valuable than ever, and companies will do whatever they can to collect your information. Proxies have been a popular option for protecting your online privacy. Now, these proxies offer even more benefits and specific use cases. You might even be looking into getting one and considering a free proxy.</p>\n\n<p>In this article, we&rsquo;ll look at free proxies and why they can be a bigger danger than you might realize. We&rsquo;ll also examine why residential proxies from a reliable provider like <a href=\"https://smartproxy.com/proxies/residential-proxies\" target=\"_blank\">Smartproxy</a> are better if security and privacy are your goals. Keep reading to discover how free proxies work and the dangers they pose.</p>\n\n<h2>What is a proxy?</h2>\n\n<p>A proxy is an intermediary server that accepts and forwards all your requests to the web server. This means that instead of connecting directly to the internet, you first connect to the proxy server. You might be wondering why using an intermediary server like a proxy is effective. Usually, it&rsquo;s better to cut out the middleman, right?</p>\n\n<p>In this case, by connecting to the proxy first, your personal information, such as your IP and other associated data, is replaced by a new IP. This completely hides your information from the websites you visit. By changing your IP address through a proxy, websites or apps cannot track you, and your data is more secure. However, that&rsquo;s not all a proxy does.</p>\n\n<h2>What can you use a proxy for?</h2>\n\n<p>By now, we know that proxies are great tools when it comes to online security and privacy. By hiding your real IP, the websites that you visit won&rsquo;t be able to collect the data associated with your IP. This usually includes your name, location, ISP, devices, operating system, and more. Residential proxies, in particular, are great for anonymity because they use the IPs from real devices. As such, they don&rsquo;t look like proxies and are much less likely to be detected as such.</p>\n\n<p>However, proxies can be used for <a href=\"https://www.fortinet.com/resources/cyberglossary/proxy-server\" target=\"_blank\">many other ways</a> aside from security and privacy. Another use is managing multiple social media accounts. Social media platforms are quick to issue IP bans if they find the same IP address creating multiple accounts. Account limits are usually only a handful per IP address, and the moment you create too many, you might receive an IP ban. This is frustrating if you&rsquo;re a <a href=\"https://cybersecurity.att.com/blogs/security-essentials/5-prevalent-digital-marketing-cybersecurity-concerns-to-watch-out-for\" target=\"_blank\">digital marketer</a> who creates and manages accounts for clients. However, by using a proxy, you can change the IP that creates the accounts and avoid IP bans.</p>\n\n<p>Another use of proxies is related to automation. This can affect a wide range of automated tools, from sneaker bots to data scrapers and even social media automation. Many websites and social media platforms block automation tools as part of their anti-bot protection. However, by linking residential proxies to these tools, you can make them appear like natural users and bypass these limitations. However, to be successful, you&rsquo;ll need to use residential proxies with a real IP.</p>\n\n<p>Finally, proxies can also help improve your connection speed and stabilize it. This is because you&rsquo;re routing all your traffic through larger servers instead of your own device. These servers are much more capable of handling the traffic load without drops in connectivity. This is especially useful if you enjoy online gaming or streaming.</p>\n\n<h2>Why do free proxies seem like a good option?</h2>\n\n<p>If you&rsquo;ve started looking into proxies, you might&rsquo;ve come across free proxies. These might even look like a great option, especially if this is your first time using such tools. Let&rsquo;s look at why free proxies appear to be a good solution.</p>\n\n<ul>\n\t<li>&nbsp;Affordability</li>\n</ul>\n\n<p>Let&rsquo;s face it; proxies aren&rsquo;t exactly cheap. Depending on your unique needs, a premium proxy can become rather expensive. So, a free proxy looks like a great choice if you aren&rsquo;t willing to spend too much money. However, consider this: is your personal data worth nothing? Are you willing to give away your data and personal information for free?</p>\n\n<ul>\n\t<li>&nbsp;Way to test proxies if you&rsquo;re not sure you need them</li>\n</ul>\n\n<p>Another thought you might have when looking at free proxies is that it&rsquo;s a great way to test them out and see how they work. And while it&rsquo;s always a good idea to test out new software before committing, are you really willing to test it out with your personal information? It&rsquo;s much better to use the trial version of a reputable proxy provider to see how these tools work.</p>\n\n<ul>\n\t<li>&nbsp;Think they&rsquo;re easier to use</li>\n</ul>\n\n<p>Another major misconception is that free proxies are easier to use than paid ones. The belief here is that a paid version is more complex because it has to offer more features to justify the price tag. In reality, paid proxies are much easier to start using as they come with support to help guide you when you have a problem.</p>\n\n<h2>Why are free proxies dangerous?</h2>\n\n<p>Free proxies may seem like the solution you&rsquo;re looking for, but they <a href=\"https://techjury.net/blog/are-free-proxies-safe/\" target=\"_blank\">can be extremely dangerous</a>. Free proxies don&rsquo;t offer encryption of your data, and frequently, they still track and monitor your internet usage. After all, they have to make money somehow, and selling data is lucrative.</p>\n\n<p>If they&rsquo;re not collecting your data, they could be riddled with malware. Once your device is infected, hackers can exploit vulnerabilities and gain access to your device. You can also spread the malware to other users or devices you connect to.</p>\n\n<p>Finally, free proxies can also hijack your cookies. This doesn&rsquo;t sound too bad until you realize that your login information and credentials are stored in cookies. So, by hijacking your cookies, these free providers can collect your login data and use it to gain access to your accounts.</p>\n\n<h2>Final thoughts</h2>\n\n<p>Free proxies might look like a good idea, especially if you want to save money and test the tools first. However, these can bring more danger and harm than good. Using a free proxy can leak your personal data, give the provider access to your login details, and even infect your devices with malware. Instead, you should look at a reliable proxy provider and choose a proxy that meets your budget and security needs.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-17T11:00:00+00:00"},{"title":"Stories from the SOC: Proactive steps to protect customers from misconfigured MFA","link":"https://cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-proactive-steps-to-protect-customers-from-misconfigured-mfa","guid":"https://cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-proactive-steps-to-protect-customers-from-misconfigured-mfa#When:11:00:00Z","description":{"#cdata-section":"\n<h2>Executive summary</h2>\n\n<p>Multifactor authentication, or MFA, provides users with an added layer of security when logging into web applications. Surpassing its predecessor, two-factor authentication, in 2023, MFA is a standard option for another layer of security for online accounts. .</p>\n\n<p>In May 2022, the Cybersecurity &amp; Infrastructure Security Agency (CISA) published security advisory <a href=\"https://www.cisa.gov/news-events/cybersecurity-advisories/aa22-074a\" target=\"_blank\">AA22-074A</a>&nbsp;describing how default configurations within MFA applications are considered a vulnerability. The tactic was utilized by Russian state-sponsored cyber actors as early as May 2021 in a successful compromise of a US organization.</p>\n\n<p>Based on this guidance from CISA, the <a href=\"https://cybersecurity.att.com/products/managed-threat-detection-and-response\" target=\"_blank\">AT&amp;T Cybersecurity managed detection and response</a> (MDR) security operations center (SOC) proactively scanned across our customer fleet and discovered a customer that was using the default configuration, which can be exploited. SOC analysts contacted the customer to inform them about the risk and provided recommendations on how to secure their network.</p>\n\n<div>\n<h2>Investigation</h2>\n</div>\n\n<h3>Events search</h3>\n\n<p>Analysts used the open-source tool, Elastic Stack, to search our customers for &ldquo;FailOpen,&rdquo;which is the default configuration within MFA applications that makes unauthorized access possible.</p>\n\n<p><img alt=\"ElasticStack open source\" src=\"blog-content/elastic.jpg\" />&nbsp;&nbsp;</p>\n\n<h3>Event deep-dive</h3>\n\n<p>The search revealed a customer with their MFA application set to FAILOPEN = 1, which is the setting that allows for a malicious actor to bypass authentication when exploited. The &ldquo;FailOpen&rdquo; setting allows for an incorrect attempt at a connection, which would then permit unfettered access to an account with this setting on the customer network.</p>\n\n<p><img alt=\"FailOpen\" src=\"blog-content/failopen.jpg\" /></p>\n\n<h3>Reviewing for additional indicators</h3>\n\n<p>From there, SOC analysts pivoted to searching the customer environment for any information that would identify associated customer assets and accounts and that would indicate outwardly malicious activity. They discovered that the user responsible was listed as an administrator within the customer environment.</p>\n\n<p><img alt=\"user responsible\" src=\"blog-content/user_responsible.jpg\" /></p>\n\n<p><img alt=\"source asset\" src=\"blog-content/source_asset.jpg\" /></p>\n\n<h2>Response</h2>\n\n<h3>Building the investigation</h3>\n\n<p>The analysts opened an investigation to address the misconfiguration in the MFA mobile application as well as to confirm whether or not the activity associated with the identified user was authorized. Included in the investigation was an explanation of the vulnerability as well as a summary of the involved user&rsquo;s activity on the identified assets over the last 30 days.</p>\n\n<p><img alt=\"mfa analysis\" src=\"blog-content/mfa_analysis.jpg\" /></p>\n\n<h2>Customer interaction</h2>\n\n<p>Analysts created a low-severity investigation, which in this case meant that they were not required to contact the customer. (Our MDR customers determine when and how the SOC communicates with them.)</p>\n\n<p>However, to ensure that the issue was addressed in a timely manner, the analysts also notified the customer&rsquo;s assigned threat hunter group, &ldquo;The ForCE,&rdquo; and the investigation was reviewed and addressed by the customer.</p>\n\n<p><img alt=\"mfa customer interaction\" src=\"blog-content/mfa_customer_interaction.jpg\" /></p>\n\n<p>Ultimately, the investigation did not uncover any malicious events relating to the misconfiguration, but it illustrates how the AT&amp;T MDR SOC is not only reactive but also works proactively to protect our customers.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-16T11:00:00+00:00"},{"title":"How prepared is your company for a supply chain attack?","link":"https://cybersecurity.att.com/blogs/security-essentials/how-prepared-is-your-company-for-a-supply-chain-attack","guid":"https://cybersecurity.att.com/blogs/security-essentials/how-prepared-is-your-company-for-a-supply-chain-attack#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>In a <a href=\"https://cybersecurity.att.com/blogs/security-essentials/5-common-blind-spots-that-make-you-vulnerable-to-supply-chain-attacks\" target=\"_blank\">supply chain attack</a>, hackers aim to breach a target&#39;s defenses by exploiting vulnerabilities in third-party companies. These attacks typically follow one of two paths. The first involves targeting a service provider or contractor, often a smaller entity with less robust security. The second path targets software developers, embedding malicious code into their products. This code, masquerading as a legitimate update, may later infiltrate the IT systems of customers.</p>\n\n<p>This article delves into specific instances of supply chain attacks, explores the inherent risks, examines common strategies employed by attackers, as well as effective defense mechanisms, and offers <a href=\"https://www.ssl2buy.com/cybersecurity/cybersecurity-supply-chain-risk-management\" target=\"_blank\">supply chain risk management</a> tips.</p>\n\n<h2>Understanding the scope and danger of supply chain cyberattacks</h2>\n\n<p>In their assaults on supply chains, attackers are driven by various objectives, which can range from espionage and extortion to other malicious intents. These attacks are merely one of many strategies hackers use to infiltrate a victim&#39;s infrastructure.</p>\n\n<p>What makes supply chain attacks particularly dangerous is their unpredictability and extensive reach. Companies can find themselves compromised by mere misfortune. A case in point is <a href=\"https://www.techtarget.com/whatis/feature/SolarWinds-hack-explained-Everything-you-need-to-know\" target=\"_blank\">the 2020 incident involving SolarWinds</a>, a network management software firm. The company fell victim to a hack that resulted in extensive breaches across various government agencies and private corporations. Over 18,000 SolarWinds customers unknowingly installed malicious updates, which led to an undetected, widespread malware infiltration.</p>\n\n<h2>Why do companies fall victim to supply chain attacks?</h2>\n\n<p>Several factors contribute to the susceptibility of companies to supply chain attacks:</p>\n\n<ul>\n\t<li><b>Inadequate security measures</b></li>\n</ul>\n\n<p>A staggering <a href=\"https://www.comparitech.com/blog/information-security/cybersecurity-vulnerability-statistics/\" target=\"_blank\">84% of businesses</a> have high-risk vulnerabilities within their networks. For companies involved in software production and distribution, a supply chain attack represents a significant breach of security protocols.</p>\n\n<ul>\n\t<li><b>Reliance on unsafe components</b></li>\n</ul>\n\n<p>Many firms utilize components from third-party vendors and open-source software (OSS), seeking to cut costs and expedite product development. However, this practice can backfire by introducing severe vulnerabilities into a company&#39;s infrastructure. OSS platforms and repositories frequently contain security loopholes. Cybersecurity professionals have identified over <a href=\"https://www.spiceworks.com/it-security/vulnerability-management/news/github-repojacking-vulnerability\" target=\"_blank\">10,000 GitHub repositories susceptible to RepoJacking</a>, a form of supply chain attack exploiting dependency hijacking. Furthermore, the layered nature of OSS, often integrating third-party components, creates a chain of transitive dependencies and potential security threats.</p>\n\n<ul>\n\t<li><b>Overconfidence in partners</b></li>\n</ul>\n\n<p>Not many companies conduct thorough security evaluations of their service providers, typically relying on superficial questionnaires or legal compliance checks. These measures fall short of providing an accurate picture of a partner&#39;s cybersecurity maturity. In most cases, real audits are an afterthought triggered by a security incident that has already taken place.</p>\n\n<p>Additional risk factors precipitating supply chain attacks encompass insecure development processes, compromised product development and delivery tool chains, software deployment mishaps, and the risks inherent in utilizing various devices and equipment.</p>\n\n<h2>What techniques do hackers use?</h2>\n\n<p>The prevalent forms of supply chain attacks include:</p>\n\n<p>Software attacks: Hackers target the vendor&#39;s software source code. They can covertly disrupt systems by embedding malicious components into a trusted application or hijacking the update server. These breaches are notoriously hard to identify since the perpetrators frequently use stolen, yet valid, certificates to sign the code.</p>\n\n<p>Hardware attacks: Perpetrators target physical devices within the supply chain, like keyboards or webcams, often exploiting backdoors for unauthorized access.</p>\n\n<p>Firmware attacks: Cybercriminals implant malicious software into a computer&#39;s startup code. These attacks are executed the moment the device is powered on, jeopardizing the whole system. Without specific protective measures, these quick, stealthy breaches will likely remain unnoticed.</p>\n\n<p>Initiating a supply chain attack often involves using spyware to steal employee credentials and <a href=\"https://cybersecurity.att.com/blogs/security-essentials/social-engineering-tactics\" target=\"_blank\">social engineering tactics</a>, including phishing, typo-squatting, and fake apps. Additionally, hackers may employ SQL injection, exploit system misconfigurations, hunt for sensitive data using OSINT, launch brute-force attacks, or even engage in physical break-ins.</p>\n\n<p>In attacks via open-source components, hackers may use the following tactics:</p>\n\n<p><b>&bull; Dependency mismatch</b> - Hackers forge internal package names and publish malware to the open-source registry at an abnormally high version level. When an admin or build system accesses an artifact without specifying a specific version, the package manager defaults to loading the latest (infected) version.</p>\n\n<p><b>&bull; Malicious code injection</b> - attackers gain access to popular libraries by compromising (or on behalf of) a developer. Companies implementing malicious OSS become victims of attacks and distributors of infected software.</p>\n\n<p><b>&bull; Typo-squatting</b> - hackers release malicious components under misspelled versions of well-known library names. Developers often inundated with numerous daily routines and pressed for time, may unknowingly use these deceptive alternatives.</p>\n\n<h2>How to protect your company from supply chain attacks?</h2>\n\n<p>To fortify your defenses against supply chain attacks, consider the following strategies:</p>\n\n<ul>\n\t<li>Implement a comprehensive suite of best practices designed to safeguard every phase of your software&#39;s update and patch management.</li>\n\t<li>Deploy automated tools for ongoing network monitoring, identifying and responding to unusual activity promptly.</li>\n\t<li>Implement a <a href=\"https://www.crowdstrike.com/cybersecurity-101/zero-trust-security/\" target=\"_blank\">Zero Trust model</a>, assuming that any device or user could potentially be compromised. This approach requires robust identity verification for anyone trying to access resources in your network.</li>\n\t<li>Regularly assess the security protocols of your suppliers and partners. Do not rely on surface-level evaluations; use in-depth tools to thoroughly audit their security processes.</li>\n\t<li>Divide your network into segments so critical data and services are separated.</li>\n\t<li>In anticipation of potential cyberattacks that could result in data loss or encryption, establish a robust data backup system.</li>\n\t<li>Prepare for worst-case scenarios and create a detailed incident response plan to mitigate and recover from supply chain attacks.</li>\n\t<li>Use threat intelligence to understand potential attack vectors and identify any breaches in third-party systems. Collaborate with other businesses and industry groups for threat intelligence sharing.</li>\n\t<li>If you develop software, ensure secure coding practices are in place. Utilize Software Composition Analysis (<a href=\"https://www.synopsys.com/glossary/what-is-software-composition-analysis.html\" target=\"_blank\">SCA</a>) tools to track and analyze the components you are using in your software for vulnerabilities.</li>\n</ul>\n\n<h2>Conclusion</h2>\n\n<p>Supply chain attacks stand as some of the most pressing and dangerous threats today. These incidents can trigger substantial disruptions in business operations, impede collaborations with vital partners, incur huge financial costs, damage reputation, and potentially lead to legal consequences due to non-compliance. It is impossible to completely protect against a supply chain attack, but adopting fundamental information security practices can help diminish risks and identify breaches early on. It is important to use a holistic approach to protection: combine different tools and methods, thus covering as many vulnerabilities as possible.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-15T11:00:00+00:00"},{"title":"What are the keys to retaining top talent in cybersecurity?","link":"https://cybersecurity.att.com/blogs/security-essentials/what-are-the-keys-to-retaining-top-talent-in-cybersecurity","guid":"https://cybersecurity.att.com/blogs/security-essentials/what-are-the-keys-to-retaining-top-talent-in-cybersecurity#When:11:00:00Z","description":{"#cdata-section":"\n<p>This is part two of a two-part blog. See <a href=\"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-hiring-and-retention-challenges-in-2023\" target=\"_blank\">part one</a> here. This is a continuation of my interview with Scott Scheppers, chief experience officer for AT&amp;T Cybersecurity, on the cybersecurity talent shortage.</p>\n\n<p>Scheppers points out that organizations have to pay attention to compensation when it comes to talent retention. &ldquo;Good pay - don&rsquo;t discount that. You need to be competitive and compensate people well, but that&rsquo;s not the only thing that matters.&rdquo;</p>\n\n<p>To expand on this, he points to other key factors that help retain good workers<strong>. </strong>&ldquo;Having said that, it&rsquo;s not just about the pay. People really care about the culture and work environment. There&rsquo;s often a lot of pressure in the cybersecurity world, but if people enjoy working with their peers and feel supported, they are much more likely to stick around. Cutthroat cultures with &lsquo;zero sum&rsquo; mentalities can only go so far. A culture of teamwork is very important.&rdquo;</p>\n\n<p>Scheppers continues, &ldquo;Everything starts with leadership. As a leader, you must be able to set an example. You can&rsquo;t just promise things- you must deliver as well.&rdquo;</p>\n\n<p>Alongside a supportive and consistent culture, Scheppers emphasizes the importance of providing workers with a path for growth, &ldquo;If you don&rsquo;t have an internal path of growth for people, they&rsquo;re eventually going to go elsewhere. As a leader, you need to take the time to understand where people want to go and help them get there. Of course, you can&rsquo;t retain everyone. Sometimes you may not have the job opening someone is looking for, but that is okay. Growth for anyone often means seeing and doing different things in different companies or organizations.&rdquo;</p>\n\n<p>According to Scheppers, the key to building a strong team in cyber is not different than in other industries. Leaders need to focus on the career aspirations of their people and finding a path to help them achieve their goals. &ldquo;Give your team the tools and training needed to excel at the job&mdash;and then hold them accountable! No one understands the dynamics of a team better than the team itself. Sometimes the leader, especially those higher in the chain of command, don&rsquo;t understand all the group dynamics at play. But, if you as a leader have someone that&rsquo;s not pulling their weight and holding everyone back, know that other team members will see it and it will pull the team down. When people on the team understand that they must keep to a certain standard, it propels them. They know that they will be recognized for good and bad work. This is one key aspect of a strong culture.&rdquo;</p>\n\n<h2>How can we increase diversity in the field?</h2>\n\n<p>According to the&nbsp;<a href=\"https://www.aspeninstitute.org/wp-content/uploads/2021/09/Diversity-Equity-and-Inclusion-in-Cybersecurity_9.921.pdf\" target=\"_blank\">2021 Aspen Digital Tech Policy report</a>, only 9% of cybersecurity professionals were black, 9% were Asian, and 4% were Hispanic. CREST, the global not-for-profit membership body that &lsquo;helps represent the global cyber security industry&rsquo;,&nbsp;<a href=\"https://www.ifsecglobal.com/cyber-security/inclusion-and-diversity-need-to-be-a-priority-in-cyber-security-experts-warn/\" target=\"_blank\">commented</a>&nbsp;that inclusion and diversity need to be a priority in 2023.</p>\n\n<p>&nbsp;&ldquo;Diversity is very important but<strong>&nbsp;</strong>note that it goes deeper than just race or gender,&rdquo; Scheppers begins. &ldquo;You can find two white males, one from a farm in Alabama and one from the big city of Seattle. Both people can bring unique experiences and different viewpoints to the table. But if I looked around the room and saw that everyone on my team was a white male, I might start to ask what&rsquo;s going on. Of course, race and gender can play a large part of your world perspective, but it is a disservice to think this is the true litmus test of diversity. We strive to gain a deeper understanding of the story of each person. This is a challenge.&rdquo;</p>\n\n<p>With the diversity issues in the cybersecurity field today, Scheppers finds that one solution is for companies to start catching a wide range of excellent people at entry-level positions and train them up. He says, &ldquo;If companies want to increase diversity, they will have to make it accessible at an entry-level. Then, they can move these competent people to the upper levels. We&rsquo;ve been successful with this model in our organization. Most of my supervisors have been women,&rdquo; Scott concludes.</p>\n\n<h2>What are some steps to break into the industry?</h2>\n\n<p>Scheppers provides this advice for those interested in cybersecurity,<strong>&nbsp;</strong>&ldquo;If I was trying to break into any new industry, I would start with figuring out the fundamentals. That includes finding people in the industry to talk with. If you don&rsquo;t know anyone personally, join public forums and start growing your network. People who are already in the field are the best ones to seek insight from. They might give you tips and suggest places where you can get more information. As they become a part of your network, they may even help by recommending you jobs in the future.&rdquo;</p>\n\n<p>He continues, &ldquo;I would also look into some courseware to get a basic understanding. This is where your network and research can come in handy for suggestions. There are also great community college classes out there that can help point you in a helpful direction as well. Don&rsquo;t underestimate the vast amount of information on-line.&nbsp; I&rsquo;m almost certain you can find fundamentals for any certification or issue for free online.&rdquo;</p>\n\n<p>Some of the organizations that are at the top of most cyber professionals list today include: <a href=\"https://cloudsecurityalliance.org/\" target=\"_blank\">Cloud Security Alliance (CSA)</a>, <a href=\"https://www.sans.org/\" target=\"_blank\">SANS Institute</a>, <a href=\"https://www.isaca.org/credentialing/cism?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=CertBAU&amp;utm_content=sem_CertBAU_certification-cism-na-product-google&amp;cid=sem_2006855&amp;Appeal=sem&amp;gad=1&amp;gclid=EAIaIQobChMIg7330LyOgAMVGynUAR2dYwlFEAAYASAAEgL2BfD_BwE\" target=\"_blank\">ISACA</a>, and <a href=\"https://www.wicys.org/\" target=\"_blank\">Women in Cybersecurity (WiCys)</a>. In addition, the two major cybersecurity conferences, <a href=\"https://www.rsaconference.com/\" target=\"_blank\">RSA</a> (held annually each spring in San Francisco) and <a href=\"https://www.blackhat.com/us-23/?_mc=sem_bhus_sem_bhus_le_tspr_google_pmbrd_galepmaudpaidlive_2023&amp;gclid=EAIaIQobChMI-v389LyOgAMVdi3UAR1R0Ag_EAAYASAAEgIZmPD_BwE\">Black Hat</a> (held every August) have traditionally provided free conference passes to students and recent graduates who want to attend. Both shows highlight the industry&rsquo;s latest innovations, offer presentations and classes for learning about cybersecurity, and provide networking with industry professionals.&nbsp;</p>\n\n<p>From a hiring perspective, Scott says he looks for people who simply show initiative to learn. &ldquo;At the core, I want to see someone who has a hunger. They may have demonstrated that hunger by taking courseware and getting a certificate. But that&rsquo;s not the only way. I&rsquo;ve seen a resume of someone who was a server in the food industry and demonstrated amazing customer care. At the end of the day, the key is to show initiative at some level. How badly do you want it?&rdquo;</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-14T11:00:00+00:00"},{"title":"Securely disposing of old electronics and data: A forensic guide to protecting your information","link":"https://cybersecurity.att.com/blogs/security-essentials/securely-disposing-of-old-electronics-and-data-a-forensic-guide-to-protecting-your-information","guid":"https://cybersecurity.att.com/blogs/security-essentials/securely-disposing-of-old-electronics-and-data-a-forensic-guide-to-protecting-your-information#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>In our rapidly evolving digital landscape, the accumulation of old electronic devices is a common occurrence. Laptops, smartphones, external hard drives, and USB flash drives quickly become outdated and obsolete, yet they often contain a wealth of sensitive information. Safeguarding your personal and confidential data during the disposal process is of utmost importance. This article presents an in-depth guide on how to forensically dispose of old electronics and data, ensuring that your privacy and security are maintained at every step.</p>\n\n<h2>Back up and transfer data</h2>\n\n<p>Before you embark on the journey of disposing of an electronic device, it&#39;s essential to initiate a thorough backup process. This backup serves two crucial purposes: preserving valuable data and enabling its transfer to a new device or storage medium. Here&#39;s how to proceed:</p>\n\n<p><b>Identify valuable data:</b> Start by identifying and categorizing the data that you want to preserve. This includes documents, photos, music, and any other information that holds personal or professional significance.</p>\n\n<p><b>Backup methods:</b> Utilize a variety of backup methods to safeguard your data. These include external hard drives, cloud storage services, or network-attached storage (NAS) systems. Ensure that all data, including files stored in the cloud, is included in your backup.</p>\n\n<h2>Wipe your data</h2>\n\n<p>Once your data is securely backed up, the next step is to thoroughly wipe your electronic device to make any data unrecoverable by standard means. Depending on the type of device, follow these procedures:</p>\n\n<p><b>A. Use data-wiping software:</b></p>\n\n<p><b>Software options:</b> Employ reputable data-wiping software such as DBAN (Darik&#39;s Boot and Nuke), Eraser, or CCleaner.</p>\n\n<p><b>Follow instructions:</b> Carefully follow the instructions provided by the software to ensure your data is erased securely and unrecoverably.</p>\n\n<p><b>B. Factory reset:</b></p>\n\n<p><b>For mobile devices:</b> Perform a factory reset on smartphones and tablets to erase all data and return the device to its original settings. Remember to remove any SIM cards or memory cards before initiating the reset.</p>\n\n<p><b>C. Securely erase hard drives:</b></p>\n\n<p><b>For computers and external hard drives:</b> Use the Secure Erase feature for solid-state drives (SSDs) or employ the \"shred\" command on Linux systems for hard disk drives (HDDs).</p>\n\n<h2>Physical destruction</h2>\n\n<p>When dealing with devices that may still contain sensitive data or those that are too damaged or outdated to be wiped effectively, physical destruction is the most secure method to guarantee the protection of your data. Consider these approaches:</p>\n\n<p><b>a. Smash or shred: </b>Utilize a hammer, drill, or engage a professional shredding service to physically destroy hard drives, SSDs, and other storage devices. Ensure that the platters or chips are shattered beyond recovery.</p>\n\n<p><b>b. Degaussing: </b>Some companies offer degaussing services that employ strong magnets to erase data on magnetic media, such as tapes or older hard drives.</p>\n\n<h2>Dispose of electronics responsibly</h2>\n\n<p>After your data is securely wiped or destroyed, the final step is to dispose of your electronic devices in a responsible and environmentally friendly manner. To ensure responsible disposal, consider the following actions:</p>\n\n<p><b>a. Recycle:</b></p>\n\n<p>Many electronics retailers and recycling centers accept old devices for recycling. Look for e-waste recycling programs in your local area to ensure your old electronics do not end up in a landfill.</p>\n\n<p><b>b. Trade-in or donate:</b></p>\n\n<p>If your device is still in working condition, consider trading it in or donating it to a charitable organization. This practice promotes sustainability by extending the useful life of your electronics.</p>\n\n<h2>Best practices for secure data disposal</h2>\n\n<p>To maximize data security during the disposal process, consider implementing these best practices:</p>\n\n<p><b>Use full disk encryption: </b>Enable encryption on your devices to add an extra layer of security, making it more challenging for unauthorized parties to recover data even if the device is not securely wiped.</p>\n\n<p><b>Keep records:</b> Maintain detailed records of the devices you have disposed of, including serial numbers, date of disposal, and specifics about the data-wiping or destruction methods employed. These records serve as an audit trail for your data disposal process.</p>\n\n<p><b>Physical locks and storage:</b> Store old devices in a locked and secure location until they can be securely disposed of. This extra layer of physical security minimizes the risk of unauthorized access to your data.</p>\n\n<p><b>Regular data audits:</b> Perform periodic data audits to identify and remove data that is no longer needed. This practice reduces the risk of data exposure during the disposal of old electronics.</p>\n\n<h2>Resources</h2>\n\n<p>To assist you in your journey of securely disposing of old electronics and data, the following resources are available:</p>\n\n<p><b>Data-Wiping Tools:</b></p>\n\n<p><b>Darik&#39;s Boot and Nuke (DBAN):</b> https://dban.org/</p>\n\n<p><b>Eraser:</b> https://eraser.heidi.ie/</p>\n\n<p><b>CCleaner:</b> https://www.ccleaner.com/</p>\n\n<p><b>E-Waste Recycling Programs:</b></p>\n\n<p><b>Earth911:</b> https://earth911.com/</p>\n\n<p><b>Call2Recycle:</b> https://www.call2recycle.org/</p>\n\n<p><b>E-Stewards Certified Recyclers:</b> https://e-stewards.org/find-a-recycler/</p>\n\n<p><b>Professional data destruction services:</b></p>\n\n<p><b>Shredding services:</b> Seek out local shredding companies for secure data destruction.</p>\n\n<p><b>Degaussing services:</b> Explore data destruction companies that offer degaussing services.</p>\n\n<h2>Conclusion</h2>\n\n<p>The secure disposal of old electronics and data is an imperative task in a world where data privacy is so critical. By following the outlined steps in this article, which encompass data backup, secure data wiping, physical destruction, and responsible disposal, you can confidently eliminate the risk of data breaches when parting ways with your old electronic devices. It is essential to adhere to best practices and make use of the available resources to ensure that your data remains inaccessible to unauthorized individuals, ultimately safeguarding your privacy and security.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-13T11:00:00+00:00"},{"title":"Don’t check out! – Credit card skimming activity observed","link":"https://cybersecurity.att.com/blogs/security-essentials/dont-check-out-credit-card-skimming-activity-observed","guid":"https://cybersecurity.att.com/blogs/security-essentials/dont-check-out-credit-card-skimming-activity-observed#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>Our friends at BlackBerry recently released an in-depth blog post on a campaign by threat actors targeting online payment businesses that discusses what happens from initial compromise to the skimmer scripts themselves. You can read their blog </i><a href=\"https://blogs.blackberry.com/en/2023/09/silent-skimmer-online-payment-scraping-campaign-shifts-targets-from-apac-to-nala\" target=\"_blank\"><i>here</i></a><i>. This blog is focused on what we found across the AT&amp;T Cybersecurity customer base as we looked for the indicators of compromise (IOCs) identified in the BlackBerry blog and on the quick-follow up analysis we performed and provided to our customers. </i></p>\n\n<p>As a part of the AT&amp;T Managed Threat Detection and Response (MTDR) threat hunter team, we have the unique opportunity to perform threat hunting across our fleet of customers in a very fast and efficient manner. Leveraging the logs across hundreds of data sources, we can come up with our own hunt hypotheses and develop extremely complex searches to find potential prior incidents and compromises.</p>\n\n<p>We can also work with the <a href=\"https://cybersecurity.att.com/alien-labs\" target=\"_blank\">AT&amp;T Alien Labs</a> team to turn that search syntax into a correlation rule. The Alien Labs team uses this backend data that we gather to create thousands of rules and signatures within the USM Anywhere platform. Threat hunters can also search for specific known tactics, techniques, and procedures (TTPs) and indicators of compromise (IOCs) as we ingest and process cyber threat intelligence from both open sources (i.e., publicly available data) and closed sources (i.e., government or private data that is not publicly available).</p>\n\n<p>When we looked for the TTPs that the attackers were using to deploy the credit card skimming scripts, our searches yielded no results, but when we searched for IOCs related to where the credit card data was exfiltrated during this campaign, we observed one domain come up across a few customers. Armed with key information such as time frames and which customers and users were impacted, we could now go deeper into USM Anywhere to investigate.</p>\n\n<p><img alt=\"allowed request\" src=\"blog-content/allowed_request.png\" /></p>\n\n<p><i>Figure 1 &ndash; Web request for credit card skimming exfiltration domain</i></p>\n\n<p>Figure 1 shows that the request for the credit card skimming site referred from another website for a well-known food company with an online purchasing option. We observed this to be the case for all the other customers too, with the food site being either the direct referer or being the HTTP request right before the connection to the cdn[.]nightboxcdn[.]com site. One of the other observed impacted customers had a user&rsquo;s credit information skimmed from a different compromised site (see Figure 2).</p>\n\n<p><img alt=\"destination asset\" src=\"blog-content/destination_asset.png\" /></p>\n\n<p><i>Figure 2 &ndash; Traffic going to shopping site (redacted) followed by traffic to the skim exfiltration and then a legitimate payment site</i></p>\n\n<p>We can see that the user is on an online shopping site (redacted) followed by traffic to the exfiltration domain as well as to a legitimate payment portal service. We can conclude from the traffic flow that the user went to checkout and that after they input their payment details, this information went to both the exfiltration site and the legitimate payment service, ProPay.</p>\n\n<p>By using the website scanning tool urlscan.io and by looking at a scan of the shopping site from May 23, 2023, we could see the skimming script appended to the jquery.hoverIntent.js file (legitimate script ends after });).</p>\n\n<p><img alt=\"get skim\" src=\"blog-content/get_skim.png\" /><br />\n<br />\n<img alt=\"skimming script appended\" src=\"blog-content/skimming_script_appended.png\" /></p>\n\n<p><i>Figure 3 &ndash; Skimming script appended to legitimate script</i></p>\n\n<p>Once we decode the attacker-added code snippet and simplify it down to its most basic parts, we can see that it extracts the field values of first name, last name, phone number, email address, address, city, state, zip, card holder name, card number, expiration month and year, and CVV. The data will then be sent to the exfiltration domain via a XMLHttpRequest:<br />\n<img alt=\"decoded skimming script\" src=\"blog-content/decoded_skimming_script.png\" /></p>\n\n<p><i>Figure 4 &ndash; Decoded and simplified skimmer script</i></p>\n\n<p>After we uncovered what was happening, we quickly notified our impacted customers so they could advise their employees to request new credit card numbers from their banks. While it was good to know that our customers were not directly compromised by the threat actor deploying these card skimmer scripts, the attacks demonstrate the need to be to be constantly aware of the potential for other organizations to be compromised and the impact this could have for your end users.</p>\n\n<p>Leveraging a defense-in-depth strategy that includes endpoint detection and response tools, network controls and defense, security monitoring, and employee education programs is critical to protect against threat actors that can cause your business financial and reputational loss.</p>\n\n<p>AT&amp;T Cybersecurity has a broad portfolio of managed security services to help you protect across your attack surface. <a href=\"https://cybersecurity.att.com/contact\" target=\"_blank\">Contact us</a> if you&rsquo;d like to learn more.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-10T11:00:00+00:00"},{"title":"Mitigating deepfake threats in the corporate world: A forensic approach","link":"https://cybersecurity.att.com/blogs/security-essentials/mitigating-deepfake-threats-in-the-corporate-world-a-forensic-approach","guid":"https://cybersecurity.att.com/blogs/security-essentials/mitigating-deepfake-threats-in-the-corporate-world-a-forensic-approach#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>In an era where technology advances at breakneck speed, the corporate world finds itself facing an evolving and insidious threat: deepfakes. These synthetic media creations, powered by artificial intelligence (AI) algorithms, can convincingly manipulate audio, video, and even text - posing significant risks to businesses, their reputation, and their security. To safeguard against this emerging menace, a forensic approach is essential.</p>\n\n<h2>Understanding deepfakes</h2>\n\n<p>&ldquo;Deepfake&rdquo; is a term used to describe a type of synthetic media that is created or manipulated using artificial intelligence (AI) and deep learning algorithms. The term \"deepfake\" is a combination of \"deep learning\" and \"fake.\" Deep learning is a subset of machine learning that involves training artificial neural networks to perform specific tasks, such as image or speech recognition.</p>\n\n<p>Deepfake technology is primarily associated with the manipulation of audio and video content, although it can also be applied to text. It allows for the creation of highly convincing and often indistinguishable fake content by superimposing one person&#39;s likeness and voice onto another person&#39;s image or video. Deepfake technology has been used in various real-world scenarios, raising concerns about its potential for misinformation and deception.</p>\n\n<p>For instance, a deepfake video of former President Barack Obama was manipulated to make it seem like he was delivering a speech using synthetic audio and video. In the entertainment industry, deepfake technology has been used to recreate deceased actors for film or commercial purposes. For example, a deepfake version of actor James Dean was used in a Vietnamese commercial. Deepfake content has been circulated on social media and news platforms, contributing to the spread of fake news and disinformation. This can include fabricated speeches, interviews, or events involving public figures. Deepfake technology has been exploited to create explicit content featuring individuals without their consent. This content is often used for harassment, revenge, or extortion.</p>\n\n<p>These examples illustrate the versatility of deepfake technology and the potential risks associated with its misuse. As a result, there is growing concern about the need for effective detection and countermeasures to address the potential negative consequences of deepfake manipulation in various contexts.</p>\n\n<p>Here are some key aspects of deepfake technology:</p>\n\n<p><b>Face swapping:</b> Deepfake algorithms can replace the face of a person in a video with the face of another individual, making it appear as though the second person is speaking or acting in the video.</p>\n\n<p><b>Voice cloning:</b> Deepfake technology can replicate a person&#39;s voice by analyzing their speech patterns and using AI to generate new audio recordings in that person&#39;s voice.</p>\n\n<p><b>Realistic visuals:</b> Deepfake videos are known for their high degree of realism, with facial expressions, movements, and lip-syncing that closely resemble the original subject.</p>\n\n<p><b>Manipulated text:</b> While less common, deepfake technology can also be used to generate fake text content that mimics an individual&#39;s writing style or produces fictional narratives.</p>\n\n<p><b>Misinformation and deception: </b>Deepfakes have the potential to spread misinformation, deceive people, and create convincing fake content for various purposes, both benign and malicious.</p>\n\n<h2>Implications for corporations</h2>\n\n<p><b>Reputation damage:</b> Corporations invest years in building their brand and reputation. Deepfake videos or audio recordings featuring corporate leaders making controversial statements can have devastating consequences.</p>\n\n<p><b>Financial fraud:</b> Deepfakes can be used to impersonate executives, leading to fraudulent requests for funds, confidential information, or financial transactions.</p>\n\n<p><b>Misleading stakeholders:</b> Shareholders, employees, and customers can be misled by deepfake communications, potentially affecting stock prices and trust in the organization.</p>\n\n<p><b>Industrial espionage:</b> Competitors or malicious actors may use deepfakes to obtain confidential information or trade secrets.</p>\n\n<h2>Mitigating deepfake threats: A forensic approach</h2>\n\n<p><b>Awareness and education:</b> The first line of defense against deepfakes is to educate employees, executives, and stakeholders about the existence and potential risks associated with deepfake technology. Training programs should include guidance on recognizing deepfake content.</p>\n\n<p><b>Digital forensics expertise:</b> Corporations should invest in digital forensics experts who specialize in deepfake detection and investigation. These professionals can conduct in-depth analyses of suspicious media to identify inconsistencies, artifacts, or signs of manipulation.</p>\n\n<p><b>Advanced detection tools:</b> Employ state-of-the-art deepfake detection tools and software. These solutions utilize machine learning algorithms to identify patterns and anomalies indicative of deepfake content.</p>\n\n<p><b>Metadata analysis:</b> Digital forensics experts can examine metadata and file properties to trace the origin of deepfake content. This can help identify potential sources of threats.</p>\n\n<p><b>Secure communication channels:</b> Encourage the use of secure communication channels, such as encrypted video conferencing and messaging platforms, to reduce the risk of deepfake attacks during virtual meetings.</p>\n\n<p><b>Authentication protocols:</b> Implement strong authentication protocols for sensitive financial transactions and communications, ensuring that only authorized personnel can initiate such actions.</p>\n\n<p><b>Incident response plan:</b> Develop a comprehensive incident response plan that outlines steps to take in case of a deepfake incident. Timely action can minimize damage.</p>\n\n<p><b>Legal recourse:</b> Be prepared to pursue legal action against those responsible for creating and disseminating deepfake content with malicious intent. Consult with legal experts experienced in cybercrimes.</p>\n\n<h2>Conclusion</h2>\n\n<p>Deepfake threats in the corporate world are a reality that cannot be ignored. As AI technology continues to advance, so too will the sophistication of deepfake attacks. A proactive and forensic approach to mitigating these threats is essential for corporations to protect their reputation, assets, and stakeholders.</p>\n\n<p>By raising awareness, investing in digital forensics expertise, utilizing advanced detection tools, and implementing security measures, corporations can significantly reduce their vulnerability to deepfake attacks. Furthermore, a robust incident response plan and the ability to pursue legal action when necessary, can serve as a deterrent to potential threat actors. In this digital age, corporate resilience against deepfake threats is a vital component of modern cybersecurity.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-08T11:00:00+00:00"},{"title":"Cybersecurity hiring and retention challenges in 2023","link":"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-hiring-and-retention-challenges-in-2023","guid":"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-hiring-and-retention-challenges-in-2023#When:11:00:00Z","description":{"#cdata-section":"\n<p><em>Scott Scheppers, chief experience officer for AT&amp;T Cybersecurity, weighs on how his team is addressing the cybersecurity talent shortage. This is part one of a two-part blog.</em></p>\n\n<p>The boundaries between the physical and digital worlds are decreasing. The Internet of things (IoT), artificial intelligence, blockchain technology, and virtual reality are buzzwords that have already made their way into everyday language. Services that were traditionally hardwired, such as copper landlines and traditional PBX systems, are being brought online through cloud computing and Voice over Internet Protocol services. For many businesses, the chosen catchphrase to describe this movement is &#39;digital transformation&#39;. According to Forbes, this transformation is not only growing at an exponential pace but is also&nbsp;<a href=\"https://www.forbes.com/sites/forbestechcouncil/2023/01/27/businesses-need-to-watch-these-digital-transformation-trends-in-2023/?sh=3f51adaf185d\" target=\"_blank\">one of the most impactful business trends in 2023.&nbsp;</a></p>\n\n<p>While this shift promises increased efficiency and growth, it also opens more opportunities for cybersecurity attacks and,<strong>&nbsp;</strong>consequently, an accelerated need for cybersecurity experts. Unfortunately, the latter part is where the industry is facing a challenge.</p>\n\n<p><a href=\"https://www.isc2.org/Research/Workforce-Study\" target=\"_blank\">The (ISC)2 2022 workforce study</a>&nbsp;revealed there is a shortage of 3.4 million<strong>&nbsp;</strong>cybersecurity specialists, an increase of 26% from the previous year. On the other hand, the Bureau of Labor Statistics reported that the field is expected to&nbsp;<a href=\"https://www.bls.gov/ooh/computer-and-information-technology/information-security-analysts.htm\" target=\"_blank\">expand by more than 33%</a>&nbsp;from 2020 to 2030. The industry&rsquo;s need for skilled cybersecurity practitioners is, in fact, growing faster than the number of people entering the field.</p>\n\n<p>To address some of these pressing issues, Scott Scheppers, chief experience officer (CXO) at AT&amp;T Cybersecurity, lends insight on how his team is meeting the challenge of hiring and retention. &nbsp;Scheppers has more than 30 years of experience in security, and his team staffs nine global network and security operations centers that run 24/7/365. Throughout his career, Scheppers has witnessed the industry&rsquo;s explosive growth firsthand. He was on the front lines of National Defense before Cybersecurity was even a fully developed concept.</p>\n\n<p>&ldquo;When the cyber domain began growing in the late &rsquo;90s,&rdquo; says Scheppers, &ldquo;it wasn&rsquo;t even called cybersecurity. There was just a bunch of IT professionals worried about keeping the IT department running. They didn&rsquo;t think operationally. They just had to service desks, close tickets, and make emails work. Then, in the late &#39;90s and early 2000s, we had demonstrations of how easy it was to hack someone&rsquo;s email. That was just the beginning.&rdquo;</p>\n\n<p>He continues, &ldquo;When I first started in the air force, I was an intelligence offer. In intelligence, you focus on what the adversary is doing, collect information, and analyze it. This is different from the IT department, that is mainly focused on keeping things running.&rdquo;</p>\n\n<p>&ldquo;In the intelligence team, our focus is the adversary. We needed to be constantly thinking strategically about how to combat the rise in cybercrime. And so, our team was perfectly positioned to transition into cybersecurity. I entered the Air Force as an intelligence officer and was the head of cybersecurity by the time I left. During this time, I watched the transformation of cyber into a critical warfighting domain. It was a crazy time of sick or swim. I am grateful to have been part of teams that led our national response to key cybersecurity events.&rdquo;</p>\n\n<p>After Scheppers&rsquo; time of service in the government, he accepted a position in AT&amp;T&rsquo;s Cybersecurity department. Today, he oversees the operations team that runs all of AT&amp;T&rsquo;s managed security services. AT&amp;T is, in fact, among the top cybersecurity services companies in the world, providing cybersecurity consulting and managed network and security operations for small to large enterprises, as well as mid-size business and government organizations.</p>\n\n<p>Scheppers saw a difference in leadership style in his transition from government to civilian organizations. &ldquo;In the Air Force, leaders essentially &lsquo;own&rsquo; every aspect of their airmen&rsquo;s lives; when you want to move someone for vitality or the betterment of the unit, they don&rsquo;t get a vote.&nbsp; In civilian organizations, people do get a vote on who their boss is.&nbsp; In fact, people often follow a boss from job to job.&nbsp; This adds a wrinkle to leading the organization.&nbsp; You must win the hearts and minds of your team daily by growing and delivering for them.&rdquo;</p>\n\n<p>He describes his current position of leadership. &ldquo;Today, I have great people that are doing great things in my organization. If I set the table correctly, I hope for a relatively boring day where I can focus on touchpoints or strategize on higher levels to plan the next steps of the organization.&rdquo;</p>\n\n<h2>What are the biggest misconceptions about hiring in Cybersecurity?</h2>\n\n<p>According to Scheppers, one of the biggest misconceptions in entry-level Cybersecurity recruitment is that certifications equate to potential and capability. &ldquo;People often think they need to hire someone with a bunch of certifications to be successful,&rdquo; Scheppers states, &ldquo;But I don&rsquo;t think entry-level workers need to come in with piles of certifications. If they have them, that&rsquo;s great, but these certifications alone don&rsquo;t translate to a great hire.&rdquo;</p>\n\n<p>&ldquo;In my organization, we look for people with inquisitive mindsets who like to solve problems &ndash; like the detectives in CSI,&rdquo; Scheppers adds with a chuckle. &ldquo;Of course, you can&rsquo;t loathe IT-related things, but the truth is, you don&rsquo;t need a cybersecurity degree to get started. If you have basic computer skills and an inquisitive mindset, you are off to a great start.&rdquo;</p>\n\n<p>Scheppers believes this common misconception is one of the reasons companies struggle with hiring cyber professionals. &ldquo;Right now, there is a shortage of people in the field and it&rsquo;s highly competitive to hire existing professionals. If companies only accept entry-level people with all the right certifications, they&rsquo;re going to end up paying a high price. The key is to train your people. Then, you can also build your own culture in the process.&rdquo;</p>\n\n<p>&ldquo;A few of the characteristics I look for are from Patrick Lencioni&rsquo;s definition of an &lsquo;ideal team player&rsquo;,&rdquo; Scheppers adds. &ldquo;Ideal team players are people who are hungry to learn, humble, and people smart. These qualities are foundational to healthy organizational cultures.&rdquo;</p>\n\n<p>When recounting previously successful hires, he shares that they have hired people who came from selling entertainment packages door-to-door or pulling fiber lines in the attics. &ldquo;Although they weren&rsquo;t your typical cybersecurity hires, they had the qualities we look for. So, you bet we brought them onboard. Not only have they been outstanding performers, but they have also grown into key leaders of our operation.&rdquo;</p>\n\n<p>While this hiring mindset may apply to entry-level hires, Scheppers clarifies that this is not a rule across the board. &ldquo;If I need someone with specific experience who can hit the ground running from day one, I&rsquo;ll have to find someone more experienced.&rdquo; In such cases, those specialized, verifiable skills and training are important.</p>\n\n<p>He adds, &ldquo;Certifications and courses are valuable, and they matter in this industry. They help provide credibility and sharpen skills. For those who come in and don&rsquo;t have the education needed to succeed, we provide them with opportunities to grow here! Just note that certifications are not the only metric for bringing an entry-level hire onto the team.&rdquo;</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-07T11:00:00+00:00"},{"title":"Applying an intelligence-based approach to Cybersecurity; SIEM and dark web monitoring","link":"https://cybersecurity.att.com/blogs/security-essentials/applying-an-intelligence-based-approach-to-cybersecurity-siem-and-dark-web-monitoring","guid":"https://cybersecurity.att.com/blogs/security-essentials/applying-an-intelligence-based-approach-to-cybersecurity-siem-and-dark-web-monitoring#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>&ldquo;History repeatedly has demonstrated that inferior forces can win when leaders are armed with accurate intelligence.&rdquo;</i> &ndash; Central Intelligence Agency; <a href=\"https://www.cia.gov/static/6109010d9e609f8c637cb7c8cd299077/Intel-in-War-Decisive.pdf\" target=\"_blank\">Intelligence in War</a></p>\n\n<p>In the ever-changing landscape of global cybersecurity, the boundaries between traditional military intelligence and cybersecurity are increasingly blurred. At the heart of this convergence lies the science of intelligence analysis&mdash;a process fundamental to both realms. Equally important is the recognition of target indicators, which serve as harbingers of impending activities, whether on a battlefield or within the complex circuits of cyberspace.</p>\n\n<p>For the modern organization, <a href=\"https://cybersecurity.att.com/solutions/siem-platform-solutions\" target=\"_blank\">Security Information and Event Management (SIEM)</a> systems serve as the nexus where the ancient art of intelligence gathering meets the contemporary needs of cybersecurity. This fusion is further enriched by dark web monitoring, a relatively new frontier in information gathering that equips analysts with a fuller understanding of the threat landscape in the darker recesses of the Internet where cybercriminals do their bidding.</p>\n\n<p>Traditionally, military intelligence has been the linchpin of strategic and tactical decision-making. It involves complex processes for data collection, analysis, and interpretation.&nbsp; In short, it turns ubiquitous data into actionable intelligence. The types of data used in intelligence analysis range from intercepted radio communications, satellite images, and even information gathered from troops on the ground. Analysts and applications sift through this plethora of information to extract actionable insights, scrutinizing for <a href=\"https://cybersecurity.att.com/blogs/security-essentials/intelligent-cyber-defense-using-threat-analysis\">target indicators</a>&mdash;clues that signal the enemy&#39;s intent or location. For instance, an unusual accumulation of vehicles in a remote area could indicate the staging of troops, thereby serving as a target indicator. Recognizing such cues is crucial for informed decision-making.</p>\n\n<p>Likewise, in cybersecurity, intelligence analysis serves as the backbone of protective strategies. Here, data collection is continuous and automated, thanks to SIEM systems and security correlation engines. These systems aggregate logs from various network endpoints, generating alerts based on defined rules that flag anomalies or known indicators of compromise. Just as military analysts look for signs like troop movement or weapons stockpiling, cybersecurity analysts review SIEM logs for target indicators such as repeated failed login attempts or abnormal data transfers, which might indicate a cyber-attack.</p>\n\n<p>The enrichment of SIEM data sets through dark web monitoring brings a novel depth to cybersecurity. For the uninitiated, the dark web serves as a <a href=\"https://www.tandfonline.com/doi/pdf/10.1080/00396338.2016.1142085\">haven for cybercriminals</a>, offering a marketplace for anything from hacking tools to stolen data. This space is often the first point of compromise, where stolen data may appear for sale or where impending cyber-attacks might be discussed.</p>\n\n<p>Dark web monitoring involves the tracking of these criminal forums and marketplaces for specific keywords, threats, or data sets related to an organization. Information gleaned from the dark web provides that extra layer of intelligence, allowing for a more proactive cybersecurity posture. For example, a company might discover on the dark web that its stolen user credentials or company client lists are being sold. This type of information is a specific target indication that a company has experienced a data breach at some level.</p>\n\n<p>The parallels between military intelligence and cybersecurity are not merely conceptual; they have practical implications. Military operations often employ real-time data analytics to generate quick situational reports, enabling <a href=\"https://www.amazon.com/Intelligence-Secrets-Mark-M-Lowenthal/dp/1544325061\">rapid decision-making</a>. In a similar vein, a well-configured SIEM system can offer real-time analysis of security alerts generated by hardware and software infrastructures. In both contexts, the speed and accuracy of the intelligence analysis are crucial for successful outcomes.&nbsp;</p>\n\n<p>Organizations that successfully implement both <a href=\"https://cybersecurity.att.com/blogs/security-essentials/what-is-dark-web-monitoring-and-scanning\">dark web monitoring</a> and SIEM solutions stand to benefit in manifold ways. Apart from augmenting the data pool for analysis, it adds a proactive element to the generally reactive field of cybersecurity. It allows for the anticipation of attacks rather than just preparation for them, thereby offering the strategic advantage of time&mdash;often the most crucial factor in both <a href=\"https://vdoc.pub/documents/cyberterrorism-understanding-assessment-and-response-6e3i6mhbaoc0\">military and cybersecurity operations.</a></p>\n\n<p>In summary, the art of intelligence gathering and analysis, forged and refined through centuries of military strategy, finds a new battleground in the domain of cybersecurity. SIEM systems serve as the operational hubs where these time-tested strategies meet the unique challenges posed by the digital age. Further enriched by the advent of dark web monitoring, the modern SIEM system is a testament to the synergetic power of combining the old with the new. As we continue to navigate the evolving landscape of threats, both physical and digital, the integration of these diverse yet interrelated fields will be key to devising more robust, resilient defense mechanisms for the future.</p>\n\n<p>AT&amp;T provides a number of advanced cybersecurity products and solutions designed to help companies navigate the challenging landscape of today&rsquo;s cyber threats.&nbsp; <a href=\"https://cybersecurity.att.com/app/spycloud\">AT&amp;T&rsquo;s Dark Web Monitoring</a> provides an industry leading dark web monitoring solution to identify credentials, and other target indicators of a breach. Additionally, AT&amp;T&rsquo;s <a href=\"https://cybersecurity.att.com/products/usm-anywhere\">USM Anywhere</a>, a centralized security monitoring solution, is essentially a SIEM on steroids.&nbsp; By providing security events and alerts in a single pain of glass, USM Anywhere enables decision makers to make decisions based upon actionable intelligence.&nbsp;</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2023-11-06T11:00:00+00:00"}]}}}