{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@version":"2.0","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:media":"http://search.yahoo.com/mrss/","channel":{"title":"Raw Story - Celebrating 19 Years of Independent Journalism","link":"https://www.rawstory.com/","description":"Raw Story - Celebrating 19 Years of Independent Journalism","atom:link":{"@href":"https://www.rawstory.com/feeds/world.rss","@rel":"self"},"language":"en-us","lastBuildDate":"Sun, 19 Nov 2023 03:42:33 -0000","image":{"url":"https://www.rawstory.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNDk4MDQwMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwODk2ODc0NH0.CAuDKCrYnLogkIrRCoHwZj7vOQ_5oq7DyFBijbdG0dE/image.jpg?width=210","link":"https://www.rawstory.com/","title":"Raw Story - Celebrating 19 Years of Independent Journalism"},"item":[{"title":"Israel and Hamas close to deal that would free 50 women and children hostages: report","link":"https://www.rawstory.com/israel-hamas-deal-hostages/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/washington-dc-november-14-people-attend-the-march-for-israel-on-the-national-mall-on-november-14-2023-in-washington-dc-th.jpg?id=50504034&width=1200&height=600&coordinates=0%2C456%2C0%2C457\"/><br/><br/><p>About 50 women and children being held against their will by Hamas could be freed under a deal that is near completion, according to the Washington Post's report.</p><p>The Post <a href=\"https://www.washingtonpost.com/national-security/2023/11/18/us-israel-hamas-reach-tentative-deal-pause-conflict-free-dozens-hostages/\" target=\"_blank\">reported</a> Saturday evening that the agreement \"would free dozens of women and children held hostage in Gaza, in exchange for a five-day pause in fighting.\"</p><p>\"The release, which could begin within the next several days — barring last-minute hitches — could lead to the first sustained pause in conflict in Gaza, according to people familiar with its provisions,\" the Post has reported. \"Under the terms of a detailed, six-page agreement, all parties to the conflict would freeze combat operations for at least five days while an initial 50 or more of what are believed to be a total 239 hostages are released in batches every 24 hours. Overhead surveillance would monitor movement on the ground to police the pause.\"</p><p><strong>ALSO READ: </strong><a href=\"https://www.rawstory.com/chip-roy-texas-campaign-money\" rel=\"noopener noreferrer\" target=\"_self\">Far-right Texas congressman's ex-staffer paid back nearly $40K in ‘unauthorized charges'</a></p><p>The report continues:</p><p>\"The stop in fighting is also intended to allow a significant increase in the amount of humanitarian assistance, including fuel, to enter the besieged enclave from Egypt.\"</p><p><a href=\"https://www.washingtonpost.com/national-security/2023/11/18/us-israel-hamas-reach-tentative-deal-pause-conflict-free-dozens-hostages/\" target=\"_blank\">You can read the full report right here.</a></p>"},"pubDate":"Sun, 19 Nov 2023 01:49:10 +0000","guid":"https://www.rawstory.com/israel-hamas-deal-hostages/","category":["Hamas","Hostage","Hostages","Israel"],"dc:creator":"David McAfee","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/washington-dc-november-14-people-attend-the-march-for-israel-on-the-national-mall-on-november-14-2023-in-washington-dc-th.jpg?id=50504034&width=980"}},{"title":"Taylor Swift postpones second night in Rio, 2 hours before show, following death of fan","link":"https://www.rawstory.com/taylor-swift-eras-tour-brazil/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=25638711&width=1200&height=600&coordinates=0%2C67%2C0%2C67\"/><br/><br/><p>Taylor Swift on Saturday postponed the second night of her Eras Tour in Brazil citing the scorching heat that has stifled most of the South American country in the past few days. </p><p>Swift’s decision — which was announced approximately two hours before her show was scheduled to begin — came less than 24 hours after the death of a 23-year-old fan, who fell ill during Swift’s second song Friday night and was taken to a nearby hospital, where she later died.</p>"},"pubDate":"Sun, 19 Nov 2023 00:57:18 +0000","guid":"https://www.rawstory.com/taylor-swift-eras-tour-brazil/","category":["Culture","Entertainmentandthearts","Lifeandsociety","Race","Socialissues","En","Pub_us","Brazil","Eras tour","Taylor swift"],"dc:creator":"New York Daily News","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=25638711&width=980"}},{"title":"Biggest protest in Spain against Catalan amnesty law draws 170,000","link":"https://www.rawstory.com/catalonia-spain/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50512221&width=980\"/><br/><br/><p>MADRID — About 170,000 people marched through Madrid on Saturday in the largest protest yet against an amnesty law which Spain's Socialists agreed over Catalonia's 2017 separatist bid in order to form a government. </p><p>The demonstration, the latest in a series of protests in cities across the country against the amnesty, took place two days after Spain's Socialist Prime Minister Pedro Sanchez won a four-year term with the backing of Catalan and Basque nationalist parties in return for agreeing to the law.</p>"},"pubDate":"Sat, 18 Nov 2023 23:12:52 +0000","guid":"https://www.rawstory.com/catalonia-spain/","category":["Catalonia","Catalan","Pedro sanchez","Spain"],"dc:creator":"Reuters","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50512221&width=980"}},{"title":"Turkish President Erdogan calls Israel 'terror state' following Germany visit","link":"https://www.rawstory.com/erdogan-turkey-israel-gaza/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50511938&width=980\"/><br/><br/><p>Turkish President Recep Tayyip Erdoğan reiterated his harsh rhetoric on Israel to call it a \"terror state\" on Saturday, hours after his return from a visit to Berlin. </p><p>\"The person in charge of this terror state has at the moment made the the Israeli people cry out and revolt against himself. That is why his end is near,\" said Erdoğan, referring to Israeli Prime Minister Benjamin Netanyahu. </p><p>Erdoğan further associated Western governments, including Germany, to what he called \"the crusader imperialist structure,\" without further elaborating.</p>"},"pubDate":"Sat, 18 Nov 2023 20:37:45 +0000","guid":"https://www.rawstory.com/erdogan-turkey-israel-gaza/","category":["En","Turkey","Gaza","Israel","Hamas","Palestine","Germany","Benjamin netanyahu","Recep tayyip erdoğan"],"dc:creator":"Deutsche Presse-Agentur","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50511938&width=980"}},{"title":"Taylor Swift fan dies at show in sweltering Rio de Janeiro","link":"https://www.rawstory.com/taylor-swift-fan-dies-at-show-in-sweltering-rio-de-janeiro/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50510149&width=980\"/><br/><br/><p>RIO DE JANEIRO (Reuters) — A young Brazilian fan of U.S. singer Taylor Swift died in Rio de Janeiro on Friday night after falling ill inside the superstar's sweltering concert venue, leading the government to order drinking water is provided and made easily accessible at shows. </p><p>Ana Clara Benevides, 23, became unwell at the Nilton Santos stadium, event organizer T4F wrote on Instagram. </p><p>It said she was promptly attended to by medical staff, and then taken to an on-site medical station, before being transferred to the Salgado Filho Hospital, where she died.</p>"},"pubDate":"Sat, 18 Nov 2023 16:32:12 +0000","guid":"https://www.rawstory.com/taylor-swift-fan-dies-at-show-in-sweltering-rio-de-janeiro/","category":["Brazil","Salgado filho hospital","Ana clara benevides","Taylor swift"],"dc:creator":"Reuters UK","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50510149&width=980"}},{"title":"Hungary needs to change the EU, not leave it: Orban","link":"https://www.rawstory.com/hungary-needs-to-change-the-eu-not-leave-it-pm-orban/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50510101&width=980\"/><br/><br/><p>BUDAPEST — Hungary must say no to the current Europe model built in Brussels, Prime Minister Viktor Orban told a congress of his Fidesz party on Saturday, adding that the European Union needs to be changed rather than ditched. </p><p>Orban again reiterated his government's opposition to starting talks with Ukraine about its accession to the EU. </p><p>\"Correcting the mistaken promise (by Brussels) to start talks (with Ukraine about EU membership) will also be our task, as Ukraine is light years away from the EU now,\" Orban said.</p>"},"pubDate":"Sat, 18 Nov 2023 16:16:15 +0000","guid":"https://www.rawstory.com/hungary-needs-to-change-the-eu-not-leave-it-pm-orban/","category":["Viktor orban","Eu","European union","Hungary"],"dc:creator":"Reuters UK","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50510101&width=980"}},{"title":"Germany's Scholz backs two-state solution, criticizes Israeli settlements","link":"https://www.rawstory.com/israel-gaza-palestine-two-state/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50509903&width=980\"/><br/><br/><p>Germany's Chancellor Olaf Scholz reiterated support for a two-state solution to the Middle East conflict and called for an immediate halt to Israeli settlement on the West Bank during a town hall meeting in his constituency on Saturday. </p><p>\"Our view is that there has to be a two-state solution,\" Scholz said in Nuthetal near Berlin. \"There has to be the prospect of peaceful coexistence between Israel as state and a Palestinian state,\" he said.</p><p>This is in Israel's own best interest, he added. </p>"},"pubDate":"Sat, 18 Nov 2023 15:07:43 +0000","guid":"https://www.rawstory.com/israel-gaza-palestine-two-state/","category":["En","Israel","Middle east","Germany","Olaf scholz","Gaza"],"dc:creator":"Deutsche Presse-Agentur","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50509903&width=980"}},{"title":"Doctors without Borders reports staff and families trapped in Gaza","link":"https://www.rawstory.com/doctors-without-borders-reports-staff-and-families-trapped-in-gaza/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50509628&width=980\"/><br/><br/><p>Staff employed by Doctors without Borders and their families are trapped in the vicinity of Gaza's al-Shifa Hospital, the medical aid organization said in Berlin. </p><p>The organization said that 137 people linked to it, including 65 children, were unable to leave and that attempts to evacuate them had failed. </p><p>Doctors without Borders called for an immediate ceasefire to allow civilians to evacuate, warning that a lack of food and drinking water could lead to deaths \"in the days, or even hours ahead.\"</p>"},"pubDate":"Sat, 18 Nov 2023 12:54:17 +0000","guid":"https://www.rawstory.com/doctors-without-borders-reports-staff-and-families-trapped-in-gaza/","category":["En","Gaza","Israel","Hamas","Palestine","Al-shifa hospital","Doctors without borders"],"dc:creator":"Deutsche Presse-Agentur","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50509628&width=980"}},{"title":"Paris booksellers flay call to remove them for Olympics","link":"https://www.rawstory.com/paris-booksellers-flay-call-to-remove-them-for-olympics/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/paris-france.png?id=34883960&width=1200&height=600&coordinates=0%2C98%2C0%2C99\"/><br/><br/><p>Paris booksellers, who have operated from little dark green kiosks on the banks of the Seine for some 150 years, are incensed by plans to remove them for the opening ceremony of the 2024 Olympics.</p><p>In a test run on Friday, four of the stands were lifted by a crane three metres above the ground -- drawing consternation and anger from a small group of booksellers gathered nearby.</p><p>Paris city hall official Pierre Rabadan told a news conference on Saturday that the exercise went off without a hitch.</p><p>\"Today we are sure we can move -- that is to say remove and then put back -- boxes in good conditions in a reasonable time,\" he said.</p><p>Paris police chief Laurent Nunez, in a bid to calm outraged booksellers or \"bouquinistes\", stressed that the stands would \"only be removed when strictly necessary, notably for security reasons.\"</p><p>\"I am aware of the importance of bouquinistes as an attraction of the capital,\" he said.</p><p>Already struggling to bounce back from shutdowns during the Covid pandemic and a longer-run loss of interest from locals, the booksellers are refusing to miss out on the 16 million tourists expected for the Games.</p><p>\"It's like a tooth extraction!\" Michel Bouetard, general secretary of the Cultural Association of Booksellers of Paris, told AFP.</p><p>\"All this for a four-hour ceremony! The Olympic Games have achieved what the wars (World Wars I and II) have not been able to do -- to make us disappear,\" he fumed.</p><p>Paris's city hall is planning a spectacular opening ceremony on July 26 next year -- the first time the event is being held outdoors -- on a stretch of the Seine river along the city's most touristy parts.</p><p>The Paris police has ordered the removal of some 600 of the 900 kiosks before the ceremony over security concerns with fears they could be used to conceal explosive devices during the grand opening with a parade of nearly 11,000 athletes along the river.</p><p>The booksellers use the green boxes to house some 300,000 old books and a great number of journals, stamps and trading cards.</p><p>They are part of the Paris landscape and a huge tourist attraction.</p><p>\"All this is over the top, we aren't sure that they will return,\" said Jerome Callais, the president of the booksellers' association.</p><p>- 'It's a historic moment' -</p><p>It is the sole livelihood for many of the 230-odd booksellers whose stalls flank the city's famous Left and Right banks.</p><p>\"What will they do if they cannot work for several weeks?\" said Callais.</p><p>Some elected officials have backed them.</p><p>\"We are against this, all this has been decided to make space for advertising along the banks,\" said Corine Faugeron, head of the Greens group in the Paris City Council.</p><p>Others have appealed to President Emmanuel Macron to halt the initiative.</p><p>Francis Robert, a bookseller for 43 years, said he had met with Macron in October, when the French leader passed by the riverbank.</p><p>\"He told us 'I am aware, I will defend you, you are part of Paris',\" Robert said.</p><p>\"But he is above the prefect of Paris, he can just tell them to let us remain.\"</p><p>Another bookseller added: \"Why do we need to remove when the security barriers will be put up one-and-a-half metres from the quays?\"</p><p>Friday's test run ended shortly after midnight, with the four boxes being planted back to where they have stood for decades.</p><p>\"It's a historic moment,\" said a teary-eyed bookseller.</p>"},"pubDate":"Sat, 18 Nov 2023 12:51:19 +0000","guid":"https://www.rawstory.com/paris-booksellers-flay-call-to-remove-them-for-olympics/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/png","@url":"https://www.rawstory.com/media-library/paris-france.png?id=34883960&width=980"}},{"title":"Advertisers drop X after Musk backs anti-Semitic post","link":"https://www.rawstory.com/advertisers-drop-x-after-musk-backs-anti-semitic-post/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/winkin-blinken-and-musk-america-china-and-the-decoupling-myth.jpg?id=34178110&width=1200&height=600&coordinates=0%2C61%2C0%2C61\"/><br/><br/><p>An exodus of big-name advertisers appeared under way at X, formerly Twitter, on Friday in the wake of Elon Musk endorsing an anti-Semitic conspiracy theory.</p><p>Nonprofit group Media Matters added Apple, Disney, Comcast, Lionsgate Entertainment, and Paramount Global to its list of companies pausing advertising on X.</p><p>\"Lionsgate has suspended advertising on X because of Elon Musk's recent antisemitic tweets,\" a spokesperson for the motion picture production and distribution company told AFP.</p><p>IBM on Thursday said it stopped advertising on X due to a report its ads were shown next to pro-Nazi posts at X.</p><p>Apple and Disney did not reply to requests for comment.</p><p>\"Major blue-chip companies are announcing they will suspend all advertising,\" the group said on a web page featuring a running list.</p><p><strong>- White House rebuke -</strong></p><p>The White House on Friday condemned Musk, the world's richest person, for \"abhorrent promotion\" of anti-Semitism.</p><p>The White House was reacting to a post by Musk in which the controversial Tesla and SpaceX tycoon replied to an anti-Semitic post on X with the words: \"You have said the actual truth.\"</p><p>The original post has been perceived by the White House and the US media as a reference to a longtime conspiracy theory among White supremacists that Jews have a secret plan to bring in illegal immigrants to weaken white majorities.</p><p>Most notoriously, the idea was promoted by the man who carried out a mass shooting at a synagogue in Pittsburgh in 2018, killing 11 people.</p><p>Referring to Musk's post, White House spokesman Andrew Bates said it was \"unacceptable\" to repeat such a \"hideous lie.\"</p><p>\"We condemn this abhorrent promotion of anti-Semitic and racist hate in the strongest terms, which runs against our core values as Americans,\" Bates said.</p><p><strong>- 'Musk-induced chaos' -</strong></p><p>In the year since taking over Twitter, now rebranded as X, Musk has gutted content moderation, restored accounts of previously banned extremists, and allowed users to purchase account verification, helping them profit from viral -- but often inaccurate -- posts.</p><p>A recent study by the disinformation monitoring group NewsGuard found that paying subscribers at X were the big spreaders of misinformation about the Israel-Hamas war.</p><p>\"During all of this Musk-induced chaos, corporate advertisements have also been appearing on pro-Hitler, Holocaust denial, white nationalist, pro-violence, and neo-Nazi accounts,\" Media Matters said in a post displaying samples of what it found at X.</p><p>Media Matters reported that it found Apple, Oracle and IBM ads displayed next to posts touting Hitler and the Nazi Party on X.</p><p>\"IBM has zero tolerance for hate speech and discrimination and we have immediately suspended all advertising on X while we investigate this entirely unacceptable situation,\" the New York-based tech firm said in response to an AFP inquiry.</p><p>An X executive told AFP that it did a \"sweep\" of accounts pointed out by Media Matters and they will no longer be able to make money from ads.</p><p>The posts themselves will be labeled \"sensitive media,\" according to the executive.</p><p>\"Ads follow the people on X, in this case the Media Matter's researcher that was going to actively look for this content - that's how user targeting works,\" the executive said in an emailed reply.</p>"},"pubDate":"Sat, 18 Nov 2023 12:40:00 +0000","guid":"https://www.rawstory.com/advertisers-drop-x-after-musk-backs-anti-semitic-post/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/winkin-blinken-and-musk-america-china-and-the-decoupling-myth.jpg?id=34178110&width=980"}},{"title":"Confusion over Gaza supplies as Israel allows limited fuel delivery","link":"https://www.rawstory.com/confusion-over-gaza-supplies-as-israel-allows-limited-fuel-delivery-2666302140/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50506971&width=980\"/><br/><br/><p>There were contradictory statements on Friday regarding the delivery of urgently needed aid supplies for the civilian population in the Gaza Strip. </p><p>According to Israel, 144 lorries were authorized to travel from Egypt to the Gaza Strip. </p><p>However, according to the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) on Friday afternoon, no aid had arrived. </p><p>The United Nations Office for the Coordination of Humanitarian Affairs (OCHA) also stated that no aid deliveries reached the Gaza Strip on Wednesday and Thursday.</p>"},"pubDate":"Fri, 17 Nov 2023 22:22:38 +0000","guid":"https://www.rawstory.com/confusion-over-gaza-supplies-as-israel-allows-limited-fuel-delivery-2666302140/","category":["En","Israel","Hamas","Egypt","Un","United nations","Gaza"],"dc:creator":"Deutsche Presse-Agentur","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50506971&width=980"}},{"title":"Finland closes Russia border posts after days of asylum inflows","link":"https://www.rawstory.com/finland-russia-border-crossings/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50506939&width=980\"/><br/><br/><p>HELSINKI/NUIJAMAA, Finland — Finland early on Saturday closed four crossings on its border with Russia as Helsinki seeks to halt a flow of asylum seekers it says was instigated by Moscow. </p><p>The Finnish Border Guard on Friday announced it would erect barriers from midnight local time at the Vaalimaa, Nuijamaa, Imatra and Niirala border posts in southeast Finland, which account for much of the travel between the two countries.</p>"},"pubDate":"Fri, 17 Nov 2023 22:03:59 +0000","guid":"https://www.rawstory.com/finland-russia-border-crossings/","category":["Russia","Finland"],"dc:creator":"Reuters UK","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50506939&width=980"}},{"title":"Pope to meet relatives of hostages, Palestinians with family in Gaza","link":"https://www.rawstory.com/pope-to-meet-relatives-of-hostages-palestinians-with-family-in-gaza/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50506472&width=980\"/><br/><br/><p>By Philip Pullella VATICAN CITY (Reuters) -Pope Francis will meet separately next week with relatives of hostages held by Hamas militants and with a group of Palestinians with family members in Gaza, the Vatican said on Friday, confirming a Reuters report. \"With these meetings, which are of an exclusively humanitarian character, Pope Francis wants to show his spiritual closeness to the sufferings of both,\" Vatican spokesman Matteo Bruni said in a statement. The meetings will be held on Wednesday in the Vatican. \"Every human being, whether Christian, Jew or Muslim, of any people or religion, ev...</p>"},"pubDate":"Fri, 17 Nov 2023 20:17:25 +0000","guid":"https://www.rawstory.com/pope-to-meet-relatives-of-hostages-palestinians-with-family-in-gaza/","dc:creator":"Reuters UK","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50506472&width=980"}},{"title":"Years of uncertainty ahead for Iceland volcano town","link":"https://www.rawstory.com/years-of-uncertainty-ahead-for-iceland-volcano-town/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/cracks-in-the-road-cross-the-icelandic-town-of-grindavik-whose-4000-residents-wonder-when-or-if-they-will-ever-return-c-kjart.png?id=50503868&width=1200&height=600&coordinates=0%2C30%2C0%2C31\"/><br/><br/><p>After a barrage of earthquakes that herald an impending volcanic eruption, some evacuated residents of the Icelandic town of Grindavik wonder if they will ever return.</p><p>\"There are going to be a lot of people who don't want to go there. My mother said 'I never want to go there again',\" Eythor Reynisson, who was born and raised in Grindavik, told AFP.</p><p>The fishing port of 4,000 people on Iceland's south coast was evacuated on November 11 after magma shifting under the Earth's crust caused hundreds of earthquakes -- a warning of a likely volcanic eruption.</p><p>Thousands of smaller tremors have shaken the region since.</p><p>With massive crevices ripping roads apart and buildings' concrete foundations shattered, the once picturesque Grindavik now resembles a warzone.</p><p>The damage to the town hall will take months to repair.</p><h2>Long term threat</h2><p>Even if the magma flow stops and no eruption occurs, \"there is the issue of whether one should live in a town like this,\" Freysteinn Sigmundsson, a geophysicist at the University of Iceland, told AFP.</p><p>The Reykjanes peninsula had not experienced an eruption for eight centuries until 2021.</p><p>Since then, three eruptions have struck -- all in remote uninhabited areas -- and volcanologists believe this may be the start of a new era of activity in the region.</p><p>Sigmundsson warned that \"a difficult period of uncertainty\" lies ahead, as eruptions could happen in coming years.</p><p><img alt=\"Inhabitants of Grindavik carry out belongings from their homes after a series of tremors have set off a volcano alert\" src=\"https://s.france24.com/media/display/cb9f23c6-8562-11ee-85bf-005056bfb2b6/53628e19e4272dbd6cac3e043c0a0824ccf4c6e3.jpg\"/>Inhabitants of Grindavik carry out belongings from their homes after a series of tremors have set off a volcano alert © Kjartan TORBJOERNSSON / AFP</p><p>That has left residents wondering whether it is worth rebuilding their homes.</p><p>Sigmundsson said that for the region to be deemed safe, the current activity would first need to cease.</p><p>\"There is a possibility that the activity will move to another area. And then it could be acceptable to go back to Grindavik,\" he said.</p><h2>'Strong community'</h2><p>Despite the conditions, a resilient community spirit was evident as residents this week queued to enter Grindavik to collect belongings they left in their hurried evacuation.</p><p>Residents embraced each other and shared moments of laughter.</p><p>\"I am really emotional. That's basically how I am feeling right now,\" Johannes Johannesson told AFP.</p><p>For some, living around volcanoes comes with the territory.</p><p>\"We are a strong community, so I think it's possible to build it up again,\" Reynisson said.</p><p>Iceland is home to 33 active volcano systems, the highest number in Europe. Towns have been hit before.</p><p>In 1973, a fissure erupted just 150 metres (yards) from the town centre on the island of Heimaey, surprising locals at dawn.</p><p>A third of homes were destroyed and the 5,300 residents were evacuated. One person died.</p><p>In Grindavik, steam fills the air from burst hot water pipes and the electricity grid struggles to keep operating at night becuase of the infrastructure damage.</p><p>Locals are now seeking accommodation in hotels, with friends and family, and at emergency shelters while they wait for life to return to normal.</p><p>Authorities have organised occasional trips into the port town, escorting those with homes in the most perilous parts to rescue everything from cherished pets to photo albums, furniture and clothing.</p><p><img alt=\"A crack cutting through the front of a house in Grindavik, southwestern Iceland, where earthquakes have heightened fears of a volcano\" src=\"https://s.france24.com/media/display/cc5cd1b4-8562-11ee-b40f-005056bfb2b6/f9da46d2e25dc33ff9f414eda46019548899c7c4.jpg\"/>A crack cutting through the front of a house in Grindavik, southwestern Iceland, where earthquakes have heightened fears of a volcano © Kjartan TORBJOERNSSON / AFP</p><p>But the operations proceed with utmost caution: on Tuesday the village was quickly emptied as sulfur dioxide measurements indicated the magma was moving closer to the surface.</p><p>\"There was panic,\" Reynisson acknowledged.</p><h2>Today or in a month</h2><p>For almost a week, Iceland has been on tenterhooks, prepared for an eruption at any moment.</p><p>\"There is still a flow of new magma into this crack and it is widening,\" Sigmundsson explained.</p><p>As long as there is an inflow of magma into the crack, the likelihood of an eruption remains high.</p><p>\"We need to be prepared for an eruption happening today or within the coming week or even up to a month,\" the researcher added.</p><p>The most likely place for an eruption \"is from the town of Grindavik northwards,\" Sigmundsson said.</p><p>For residents, this means an extended and anxiety-filled time over the weeks to come.</p><p>\"Plans now are to try to manage. Try to just get the family into a routine and keep on going,\" Johannesson said.</p><p>© 2023 AFP</p>"},"pubDate":"Fri, 17 Nov 2023 16:14:29 +0000","guid":"https://www.rawstory.com/years-of-uncertainty-ahead-for-iceland-volcano-town/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/png","@url":"https://www.rawstory.com/media-library/cracks-in-the-road-cross-the-icelandic-town-of-grindavik-whose-4000-residents-wonder-when-or-if-they-will-ever-return-c-kjart.png?id=50503868&width=980"}},{"title":"Russia moves to ban 'international LGBT movement' for 'extremism'","link":"https://www.rawstory.com/russia-moves-to-ban-international-lgbt-movement-for-extremism/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/out-of-49-european-nations-the-rainbow-europe-organisation-ranked-russia-third-from-bottom-in-terms-of-tolerance-of-lgbtq-peopl.jpg?id=50503691&width=1200&height=600&coordinates=0%2C0%2C0%2C129\"/><br/><br/><p>Russian officials said Friday they are seeking a ban on the \"international LGBT public movement,\" building on a crackdown against liberal-leaning groups that has intensified since Moscow deployed troops to Ukraine.</p><p>Russia's justice ministry said it had \"lodged an administrative legal claim with the Supreme Court to recognise the International LGBT public movement as extremist and ban its activity in Russia.\"</p><p>The ministry did not specify whether it was seeking the closure of any specific groups or organisations, or if the designation would apply more broadly to the LGBTQ community, causes and individuals.</p><p>The proposed ban is the latest in a long-standing crackdown against LGBTQ people in Russia, which has escalated since Russia launched its offensive on Ukraine last February.</p><p>Russia has used the extremist label against swathes of rights organisations and opposition groups, opening up their members to criminal prosecution.</p><p>The justice ministry accused the \"LGBT movement operating on the territory of the Russian Federation\" of \"various signs and manifestations of extremism, including incitement to social and religious hatred\".</p><p>It did not specify what exactly it meant by that movement, but said a court hearing was scheduled for November 30.</p><p>The head of the Sphere human rights group, which advocates for the Russian LGBTQ community, criticised the announcement.</p><p>\"Russian authorities are once again forgetting that the LGBT+ community are human beings,\" said Sphere head Dilya Gafurova, who has left Russia.</p><p>Authorities \"don't just want to erase us from the public field: they want to ban us as a social group,\" Gafurova added.</p><p>- 'Continue our fight' -</p><p>\"It's a pretty typical move for repressive non-democratic regimes -- the persecution of the most vulnerable,\" Gafurova said.</p><p>\"We will continue our fight,\" Gafurova added.</p><p>Since launching the Ukraine offensive -- often portrayed as an existential fight against Western liberal values -- Russia has accelerated its campaign against LGBTQ groups.</p><p>In July lawmakers banned medical intervention and administrative procedures that allowed people to change gender.</p><p>Lawmaker Pyotr Tolstoy then said the bill was about \"erecting a barrier to the penetration of Western anti-family ideology\".</p><p>Activists said they feared for the safety and well-being of transgender people in Russia.</p><p>Last November, Russian lawmakers also approved a bill banning all forms of LGBTQ \"propaganda\", a move with far-reaching consequences for book publishing and film distribution.</p><p>Russia has for years been an inhospitable environment for anyone whose views differ from the hardline interpretation of \"traditional values\" promoted by the Kremlin and the Orthodox church.</p><p>The country passed a notorious ban on so-called \"gay propaganda\" in 2013. Initially only applying to content available to children, it has since been expanded.</p><p>Same-sex marriage was also effectively outlawed in 2020 by a constitutional amendment stipulating marriage is a union between a man and a woman.</p><p>Out of 49 European countries, the Rainbow Europe organisation ranked Russia third from bottom in terms of tolerance of LGBTQ people.</p><p>bur/bp</p>"},"pubDate":"Fri, 17 Nov 2023 15:44:25 +0000","guid":"https://www.rawstory.com/russia-moves-to-ban-international-lgbt-movement-for-extremism/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/out-of-49-european-nations-the-rainbow-europe-organisation-ranked-russia-third-from-bottom-in-terms-of-tolerance-of-lgbtq-peopl.jpg?id=50503691&width=980"}},{"title":"Scottish government outlines post-independence plans to rejoin EU","link":"https://www.rawstory.com/scottish-government-outlines-post-independence-plans-to-rejoin-eu/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/the-scottish-government-wants-to-rejoin-the-eu-as-soon-as-possible-after-gaining-independence-c-andy-buchanan-afp.jpg?id=50502877&width=1200&height=600&coordinates=0%2C20%2C0%2C21\"/><br/><br/><p>An independent Scotland would move quickly to rejoin the European Union, the Scottish government said on Friday as it laid out its plans for getting back into the bloc.</p><p>The administration led by the Scottish National Party (SNP) said that Scotland would \"apply to re-join the EU as soon as possible\" after independence, although that is not currently on the horizon.</p><p>The pro-independence government of the devolved parliament in Edinburgh made the comments in a paper that sought to lay out the benefits of EU membership.</p><p>\"Given the position of the main parties at Westminster (the UK parliament in London), the only route back to the EU for Scotland is by becoming an independent country,\" it said.</p><p>None of Britain's other main parties -- the Conservatives, Labour, and the Liberal Democrats -- currently argues that the United Kingdom should rejoin the EU.</p><p>Scotland left the EU with the rest of the UK after the Brexit referendum of 2016.</p><p>Although the UK as a whole narrowly voted to leave, Scotland overwhelmingly voted to remain part of the bloc.</p><p>The Scottish government said an independent Scotland would pursue the normal accession process, known as Article 49, which typically takes several years.</p><p>\"This government believes that membership of the EU is fundamental to Scotland's economic, social and political future and that we should seek to re-join the EU as soon as possible after independence,\" the paper said.</p><p>It did not commit Scotland to joining the euro currency, instead saying that an independent Scotland would, \"as soon as practicable move from sterling to having its own currency, a new Scottish pound\".</p><p>\"We're clear that Scotland's best future is as an independent state in the EU and this document is a solid piece of work that shows who we are and where we want to be,\" Alyn Smith, the SNP's Europe spokesperson at Westminster, told AFP.</p><p>Scotland rejected independence in a 2014 referendum that the UK government insists has settled the question.</p><p>But the SNP has said it will claim it has \"a mandate for independence negotiations\" with London if it wins a majority of Scottish seats at the next UK election, expected in 2024.</p><p>© 2023 AFP</p>"},"pubDate":"Fri, 17 Nov 2023 13:38:09 +0000","guid":"https://www.rawstory.com/scottish-government-outlines-post-independence-plans-to-rejoin-eu/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/the-scottish-government-wants-to-rejoin-the-eu-as-soon-as-possible-after-gaining-independence-c-andy-buchanan-afp.jpg?id=50502877&width=980"}},{"title":"Italian workers strike over hard-right government budget","link":"https://www.rawstory.com/italian-workers-strike-over-hard-right-government-budget/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/giorgia-meloni-s-brothers-of-italy-party-is-leading-opinion-polls-ahead-of-september-25-elections-riccardo-dalle-luche-ansa-afp.jpg?id=30817062&width=1200&height=600&coordinates=0%2C46%2C0%2C47\"/><br/><br/><p>Public sector employees and transport workers across Italy went on strike Friday in an action pitting trade unions against the hard-right government in Rome over its 2024 budget.</p><p>Prime Minister <a href=\"https://search.yahoo.com/search?p=Giorgia%20Meloni\" target=\"_blank\">Giorgia Meloni</a>'s government has been accused of using the budget to chase votes ahead of next year's European Parliament elections at the expense of workers and pensioners.</p><p>\"Meloni, the people are hungry\", read one banner held aloft by protesters gathered in Rome's historic Piazza del Popolo, while thousands of demonstrators marched through the streets in Genoa and Milan.</p><p>The walkout was called by two of the country's largest unions, the CGIL and UIL, which say the tax-cutting budget woefully underfunds key sectors such as health, education and industry.</p><p>Teachers, healthcare workers, taxi drivers and postal workers were called to strike for eight hours nationwide, while some in the private sector, from steelworkers to shopkeepers, could join in central Italy.</p><p>Deputy Prime Minister Matteo Salvini, who is also transport minister, imposed restrictions on the strike to reduce the disruption, to the outrage of union leaders.</p><p>In what he described as a compromise based on \"common sense\", he halved the duration of the transport workers and firefighters strike to four hours during the morning, while air travel is not included at all.</p><p>CGIL general secretary Maurizio Landini accused him of an \"attack on the right to strike\".</p><p>The unions had sought to have their walkout defined as a general strike, which would have been allowed to last 24 hours.</p><p>But the watchdog that arbitrates strikes in Italy said it did not meet the criteria, as several sectors were excluded from the action, which is also being spread out over five days.</p>"},"pubDate":"Fri, 17 Nov 2023 12:38:14 +0000","guid":"https://www.rawstory.com/italian-workers-strike-over-hard-right-government-budget/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/giorgia-meloni-s-brothers-of-italy-party-is-leading-opinion-polls-ahead-of-september-25-elections-riccardo-dalle-luche-ansa-afp.jpg?id=30817062&width=980"}},{"title":"French senator held in custody on suspicion of spiking MP’s drink","link":"https://www.rawstory.com/french-senator-held-in-custody-on-suspicion-of-spiking-mps-drink/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/senators-attend-a-debate-and-vote-session-on-the-government-s-pension-reform-at-the-french-senate-in-paris-on-march-6-2023-c-a.jpg?id=33241469&width=1200&height=600&coordinates=0%2C44%2C0%2C45\"/><br/><br/><p>A French senator was in custody Friday on suspicion of drugging an MP with a view to assaulting her, prosecutors and sources familiar with the case told AFP.</p><p>Joel Guerriau, a centrist senator from western <a href=\"https://www.france24.com/en/tag/france/\" rel=\"noopener noreferrer\" target=\"_blank\">France</a>, was being held for \"administering to a person without their knowledge a substance likely to diminish their judgement or self-control to commit a rape or sexual assault,\" prosecutors said on Thursday.</p><p>While the prosecutors named the victim only as \"a woman, who filed a complaint\", several sources familiar with the case told AFP she was an MP.</p><p>She allegedly felt strange after accepting a drink on Tuesday night at the 66-year-old senator's <a href=\"https://www.france24.com/en/tag/paris/\" rel=\"noopener noreferrer\" target=\"_blank\">Paris</a> home.</p><p>Prosecutors said the two were not in an intimate relationship.</p><p>Tests revealed that she had ecstasy in her system, investigators added, prompting her to file a criminal complaint.</p><p>Guerriau was arrested and held in custody under caught-in-the-act rules allowing police to override his parliamentary immunity, prosecutors said.</p><p>Broadcaster RMC, which first reported the story, said that police had searched his office and home, where prosecutors confirmed they found ecstasy.</p><p>Originally a banker, Guerriau has been a member of the senate since 2011 and is deputy head of the foreign and military affairs committee.</p><p>His lawyer, Remi-Pierre Drai, said he was \"outraged to see information from the investigation in the press\".</p><p>\"I'm amazed that the victim's name has not been leaked, unlike my client's,\" he added.</p><p><em>(AFP)</em></p>"},"pubDate":"Fri, 17 Nov 2023 12:29:57 +0000","guid":"https://www.rawstory.com/french-senator-held-in-custody-on-suspicion-of-spiking-mps-drink/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/senators-attend-a-debate-and-vote-session-on-the-government-s-pension-reform-at-the-french-senate-in-paris-on-march-6-2023-c-a.jpg?id=33241469&width=980"}},{"title":"India warns freeing workers trapped for six days will 'take time'","link":"https://www.rawstory.com/india-warns-freeing-workers-trapped-for-six-days-will-take-time/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/indian-tunnel-collapse.jpg?id=50466501&width=1200&height=600&coordinates=0%2C80%2C0%2C81\"/><br/><br/><p>Indian rescuers said Friday they had drilled less than halfway through the debris to reach 40 men trapped in a collapsed tunnel for nearly a week.</p><p>A second heavy drill is to be airlifted into the northern state of Uttarakhand after the existing giant machine -- itself flown in as a replacement by the air force on Wednesday -- hit a boulder, officials said.</p><p>Excavators have been removing debris since Sunday morning to create an escape route for the workers after a portion of the tunnel they were building collapsed in the Himalayan state of Uttarakhand.</p><p>Rescue efforts have been slowed by debris that has continued to fall.</p><p>Engineers are trying to drive a steel pipe about 90 centimetres (nearly three feet) wide through the debris -- wide enough for the trapped men to squeeze through.</p><p>\"Drilling has been done up to 24 metres (78 feet) for safe extraction,\" Anshu Manish Khalko, director of the government's highways and infrastructure corporation told reporters on Friday afternoon.</p><p>But he said around 36 meters (118 feet) of pipe still needed to be laid to reach the workers.</p><p>\"That may take time\", he said, without giving further details.</p><p>After the first earth-boring drill developed problems, the air force on Wednesday flew in a second machine on a C-130 Hercules military plane. The giant drill bit stretched much of the length of the aircraft's cargo hold.</p><p>- Field hospital -</p><p>As rescuers race to save the men, India has sought advice from the Thai company that rescued children from a flooded cave in 2018, as well as engineering experts in soil and rock mechanics at the Norwegian Geotechnical Institute.</p><p>Rescuers have been communicating with the trapped men using radios.</p><p>Food, water, oxygen and medicine have also been sent to the trapped workers via a six-inch-wide (15-centimetre) pipe.</p><p>No official details have been given about the condition of the men, but local media reported that some were suffering from vomiting, headaches, anxiety and stomach problems.</p><p>A six-bed field hospital has also been set up outside the site with ambulances on standby to transfer serious cases to a proper hospital.</p><p>The 4.5-kilometre (2.7-mile) tunnel was being constructed between the towns of Silkyara and Dandalgaon to connect Uttarkashi and Yamunotri, two of the holiest Hindu sites.</p><p>The tunnel is part of Prime Minister Narendra Modi's road project aimed at improving travel conditions between some of the most popular Hindu shrines in the country as well as in areas bordering China.</p><p>Experts have warned about the impact of extensive construction in Uttarakhand, where large parts of the state are prone to landslides.</p><p>Accidents on big infrastructure projects are common in India.</p><p>In January, at least 200 people were killed in flash floods in ecologically fragile Uttarakhand in a disaster that experts partly blamed on excessive development.</p>"},"pubDate":"Fri, 17 Nov 2023 12:01:14 +0000","guid":"https://www.rawstory.com/india-warns-freeing-workers-trapped-for-six-days-will-take-time/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/indian-tunnel-collapse.jpg?id=50466501&width=980"}},{"title":"Russian artist sentenced to seven years in prison over supermarket protest","link":"https://www.rawstory.com/russian-artist-sentenced-to-seven-years-in-prison-over-supermarket-protest/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/russian-artist-alexandra-skochilenko-smiles-as-she-is-escorted-by-police-officers-prior-to-her-verdict-hearing-at-a-court-in-sai.jpg?id=50502274&width=1200&height=600&coordinates=0%2C7%2C0%2C90\"/><br/><br/><p>A Russian court on Thursday sentenced artist Alexandra Skochilenko to seven years in prison for spreading \"false information\" about the army after she swapped supermarket price tags with slogans criticizing Russia's offensive in Ukraine.</p><p>The 33-year-old, known as Sasha, is the latest among thousands of Russians to be detained, jailed or fined for speaking out against <a href=\"https://www.france24.com/en/tag/moscow/\" rel=\"noopener noreferrer\" target=\"_blank\">Moscow</a>'s military intervention.</p><p>Supporters shouted \"shame\" and \"we're with you Sasha\" after the judge, Oksana Demiasheva, read out the verdict, an AFP journalist in court reported.</p><p>Some, mainly young people, pulled out banners saying \"she should not go to prison\", while her lawyers left without giving any comment.</p><p>Skochilenko wore a colorful T-shirt with a large red heart printed on it. She made a heart shape with her hands and smiled to supporters during the hearing.</p><p>\"Every person in this room wants only one thing: Peace. Why fight?\" she said in a closing statement.</p><p>Skochilenko had said in an earlier hearing that she \"just wanted to stop the war. That was my motivation\".</p><h2>'They give less for murder'</h2><p>\"It's not Sasha who should go to prison, but the people who convicted her,\" 20-year-old Anton, who declined to give his full name, citing security concerns, told AFP after the verdict was announced.</p><p>One of the messages included claims about a Russian strike on a theatre in Mariupol that was reported to have left hundreds dead.</p><p>\"The cost of this war is the life of our children\" and \"Putin has been lying to us from television screens for 20 years\" were written on other tags.</p><p>An elderly shopper reported the swapped tags to police.</p><p><em>(AFP)</em></p>"},"pubDate":"Fri, 17 Nov 2023 11:53:56 +0000","guid":"https://www.rawstory.com/russian-artist-sentenced-to-seven-years-in-prison-over-supermarket-protest/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/russian-artist-alexandra-skochilenko-smiles-as-she-is-escorted-by-police-officers-prior-to-her-verdict-hearing-at-a-court-in-sai.jpg?id=50502274&width=980"}},{"title":"'Child soldiers' and blood feuds: Sweden's out-of-control gang wars","link":"https://www.rawstory.com/child-soldiers-and-blood-feuds-sweden-s-out-of-control-gang-wars/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/fear-a-parent-oversees-children-training-at-rinkeby-united-football-club-near-stockholm-jonathan-nackstrand.jpg?id=50502225&width=1200&height=600&coordinates=0%2C74%2C0%2C75\"/><br/><br/><p>One night in September, teacher Thomas Cervin was woken by gunshots in his apartment building in Uppsala. His neighbour had just become the latest target in Sweden's terrifying gang wars.</p><p>Execution-style shootings carried out by \"child soldiers\", apartment buildings rocked by bombings, innocent relatives targeted in vendettas, and the morning news summarising the night's death toll -- all have become disturbingly routine in the normally quiet country.</p><p>\"No other country in Europe is seeing anything like this,\" said Prime Minister <a href=\"https://search.yahoo.com/search?p=Ulf%20Kristersson\" target=\"_blank\">Ulf Kristersson</a> as he vowed to defeat the gangs.</p><p>\"Swedish legislation was not designed for gang wars and child soldiers. But we're changing that now,\" he said.</p><p>Sweden's gang wars have smouldered for a decade over control of the drugs market.</p><p>But they took a drastic turn early this year when an internal feud led to gang members' families and loved ones also becoming targets.</p><p>The September 13 shooting in Cervin's building in Uppsala, 70 kilometres (45 miles) north of Stockholm, was aimed at the mother-in-law of Rawa Majid, the \"Kurdish Fox\", and head of the notorious Foxtrot gang.</p><p>She escaped unharmed.</p><p>- 'Ruthless' -</p><p>\"I had no idea she was related to him,\" Cervin said. \"That's what makes so many people scared -- the people involved have friends and relatives all over the place.\"</p><p>\"This new generation (of criminals) is ruthless,\" said Garip Gunes, who started a youth football team to keep kids in the disadvantaged Stockholm suburb of Rinkeby out of trouble.</p><p>\"Many parents are worried about their kids and don't let them go out except to go to school or football practice. They're worried they'll end up in the line of fire,\" he told AFP.</p><p>Criminology professor Felipe Estrada Dorner of Stockholm University told AFP the situation \"has gotten totally out of control: they've started attacking loved ones and those who have nothing to do with these conflicts.\"</p><p>\"This is a big change from the violence that has prevailed until now.\"</p><p>Forty-seven people have been killed in 314 shootings so far this year, police said, compared to only seven deaths in 2016.</p><p>- 'Failed integration' -</p><p>The victims and the perpetrators are increasingly young.</p><p>Police last year investigated 336 15- to 17-year-olds for having illegal firearms, eight times more than a decade ago, the National Council for Crime Prevention said this month.</p><p>Gangs now recruit kids to carry out contract killings -- some younger than 15 -- knowing they can't be jailed.</p><p>\"Children are contacting criminal gangs\" offering to commit murders, Sweden's police chief Anders Thornberg said.</p><p>These children \"just don't know how to handle these weapons\", Estrada Dorner said, often leading to innocent bystanders being wounded or killed.</p><p>In Gottsunda, a suburb near Uppsala, Ebtesam Abowarrad agreed, and said people were scared.</p><p>\"The difference nowadays is that they shoot all over the place.\"</p><p>\"I never see anyone out in the streets anymore,\" the 40-year-old mother told AFP.</p><p>Most young gang members have been on social services' radar for years, said Evin Cetin, a former lawyer who has written a book of interviews with young gang members, \"Mitt ibland oss\" (In Our Midst).</p><p>\"These kids have been trained by criminals -- they live, eat and breathe a culture of violence,\" she said.</p><p>\"Most of those I've met have an empty look in their eyes, they don't value their own lives.\"</p><p>Prime Minister Kristersson has blamed the rise in organised crime on \"naivety\" over immigration.</p><p>\"An irresponsible immigration policy and failed integration led us here,\" the conservative leader said.</p><p>- 'Lost count' -</p><p>But Cetin argued that the integration problem has a lot to do with the segregation immigrant communities face.</p><p>\"How is it possible that young Swedes in one of the richest countries in the world have gotten to the point where they're willing to kill, and kill their best friend to boot?\" she asked.</p><p>\"It says a lot about segregation, the conditions in which they grow up and the exclusion they experience.\"</p><p>Sakariya Hirsi, 26, who hails from Tensta, a heavily-immigrant suburb north of Stockholm, has seen several of his friends die in the violence.</p><p>In 2020, he founded the Kollektiv Sorg group (Collective Grief) to help families cope with their loss and lobby for change.</p><p>At a recent meeting of the group at a church in the suburb of Botkyrka, Alexander Zadruzny, 23, said he's \"lost count\" of how many of his friends have died.</p><p>\"I used to say that our kids grow up too fast, but... our kids don't even live long enough to become adults.\"</p>"},"pubDate":"Fri, 17 Nov 2023 11:53:48 +0000","guid":"https://www.rawstory.com/child-soldiers-and-blood-feuds-sweden-s-out-of-control-gang-wars/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/fear-a-parent-oversees-children-training-at-rinkeby-united-football-club-near-stockholm-jonathan-nackstrand.jpg?id=50502225&width=980"}},{"title":"Israeli defense minister says army has control of western Gaza City","link":"https://www.rawstory.com/israel-gaza-hospital/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=50497015&width=980\"/><br/><br/><p>The Israeli army has gained control of the western part of Gaza City, Israeli Defense Minister Yoav Gallant said. </p><p>\"The next phase has begun,\" Gallant said on Thursday. The defence minister did not specify what this phase of the Gaza war would look like. \"The armed forces are proceeding with precision and determination.\" </p><p>Meanwhile, the army had made \"significant finds\" in the largest hospital in the Gaza Strip, Gallant continued. The operation in the al-Shifa hospital is ongoing, he said.</p>"},"pubDate":"Thu, 16 Nov 2023 19:56:06 +0000","guid":"https://www.rawstory.com/israel-gaza-hospital/","category":["En","Gaza","Hamas","Israel"],"dc:creator":"Deutsche Presse-Agentur","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=50497015&width=980"}},{"title":"UK newspaper removes viral bin Laden letter","link":"https://www.rawstory.com/uk-newspaper-removes-viral-bin-laden-letter/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/prime-minister-imran-khan-claims-pakistani-intelligence-led-cia-to-bin-laden.jpg?id=24726995&width=1200&height=600&coordinates=0%2C87%2C0%2C88\"/><br/><br/><p>British newspaper The Guardian has removed from its website a 21-year-old message written by Al-Qaeda leader Osama bin Laden, after it was shared several million times on social media.</p><p>Bin Laden's \"Letter to America\" began being shared on TikTok on Tuesday, sparking a fierce debate about US backing for Israel in its current war against Hamas.</p><p>The transcript includes bin Laden's assertion that the United States was attacked on September 11, 2001 due to its support of Israel.</p><p>Links to the original were replaced on the Guardian website with a statement saying it had been shared \"without the full context\".</p><p>\"This page previously displayed a document containing, in translation, the full text of Osama bin Laden's 'letter to the American people', which was reported on in the Observer on Sunday 24 November 2002,\" it wrote.</p><p>\"The transcript published on our website had been widely shared on social media without the full context. Therefore we decided to take it down and direct readers instead to the news article that originally contextualised it.\"</p><p>Bin Laden's message, released a year after 9/11, outlined his objections to Western activities in Muslim nations, condemning the United States for its backing of Israel and its approach towards the Palestinian regions.</p><p>It also denounces what he described as Western \"lies, immorality and debauchery\" and argued that attacks against civilians and the United States were justified as a result.</p><p>\"They threw hundreds of thousands of soldiers against us and have formed an alliance with the Israelis to oppress us and occupy our land -- that was the reason for our response on the eleventh,\" it said.</p><p>The origin of the trend has been pinned by various media outlets on a video posted on Tuesday by a TikTok influencer with 12 million likes on her profile.</p><p>\"I need everyone to stop what they're doing right now and go read -- it's literally two pages -- go read 'A Letter to America',\" the influencer wrote.</p><p>\"Come back here and let me know what you think. Because I feel like I'm going through like an existential crisis right now, and a lot of people are. So I just need someone else to be feeling this too.\"</p><p>The letter has been received with widely positive comments by social media users with trending searches on TikTok including \"Osama letter to America summary,\" \"a letter to America full text\" and \"a letter to America explained\".</p><p>After nearly 10 years as the world's most wanted man, Bin Laden was tracked down and killed by US special forces at his compound in the Pakistani city of Abbottabad in May 2011.</p>"},"pubDate":"Thu, 16 Nov 2023 19:25:06 +0000","guid":"https://www.rawstory.com/uk-newspaper-removes-viral-bin-laden-letter/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/prime-minister-imran-khan-claims-pakistani-intelligence-led-cia-to-bin-laden.jpg?id=24726995&width=980"}},{"title":"Pandas could return to U.S. after Xi-Biden summit","link":"https://www.rawstory.com/pandas-united-states-china/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/giant-panda-xiao-qi-ji-hangs-upside-down-from-a-tree-in-its-enclosure-at-the-smithsonian-s-national-zoo-in-washington-on-novembe.jpg?id=50496260&width=1200&height=600&coordinates=0%2C58%2C0%2C59\"/><br/><br/><p>Chinese President Xi Jinping appears ready to deploy his country's soft power after his summit with U.S .President Joe Biden -- in the form of cuddly pandas.</p><p>Tensions between Washington and Beijing mean that only a handful of the black and white bears remain in the United States, with three having left the national zoo in Washington earlier this month.</p><p>But Xi told a dinner after meeting Biden in California on Wednesday that China could send new pandas as \"envoys of friendship between the Chinese and American people.\"</p><p>The White House said it would be happy to have more bamboo-chewing bears.</p><p>\"Should the decision be made by the PRC (People's Republic of China) to restore some of the pandas to the United States, we would absolutely welcome them back,\" National Security Council spokesman John Kirby told reporters.</p><p>\"That's got to be a decision that obviously President Xi makes.\"</p><p>China has been using so-called \"panda diplomacy\" since 1972, when the first animals were sent to the United States in 1972 as a gift, following then-president Richard Nixon's historic visit to the Communist nation.</p><p>Strained relations between the rival superpowers in recent years have however led Beijing to call some of the pandas back home.</p><p>All three giant pandas at the Smithsonian National Zoo in Washington -- Mei Xiang and Tian Tian, who arrived in 2000, and their three-year-old cub Xiao Qi Ji (\"Little Miracle\" in English) -- flew back on a cargo plane to China earlier this month.</p><p>\"I was told that many American people, especially children, were really reluctant to say goodbye to the pandas, and went to the zoo to see them off,\" Xi said after a dinner with CEOs in San Francisco on Wednesday.</p><p>Xi then hinted that new pandas could be coming back to the U.S. west coast.</p><p>\"I also learned that the San Diego Zoo and people of California are very much looking forward to welcoming the pandas back,\" he said.</p><p>\"We are ready to continue our cooperation with the United States on panda conservation, and do our best to meet the wishes of the Californians so as to deepen the friendly ties between our two peoples.\"</p><p>The last remaining pandas currently in the United States, at a zoo in the southern city of Atlanta, are due to return to China by late 2024.</p><p>© 2023 AFP</p>"},"pubDate":"Thu, 16 Nov 2023 19:10:24 +0000","guid":"https://www.rawstory.com/pandas-united-states-china/","category":["Xi jinping","Joe biden","China","Pandas"],"dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/giant-panda-xiao-qi-ji-hangs-upside-down-from-a-tree-in-its-enclosure-at-the-smithsonian-s-national-zoo-in-washington-on-novembe.jpg?id=50496260&width=980"}},{"title":"Flash floods kill 100 in Horn of Africa: charity","link":"https://www.rawstory.com/flash-floods-100-in-horn-of-africa-charity/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/kenya-somalia-and-ethiopia-have-been-lashed-by-unrelenting-downpours-since-the-beginning-of-the-month-due-to-the-el-nino-weathe.png?id=50493816&width=1200&height=600&coordinates=0%2C0%2C0%2C46\"/><br/><br/><p>More than 100 people, including 16 children, have died and over 700,000 been forced out of their homes in the Horn of Africa due to flash flooding, the British charity Save the Children said Thursday.</p><p>The region, particularly Kenya, Somalia and Ethiopia, has been lashed by unrelenting downpours since the beginning of the month due to the El Nino weather phenomenon, inundating homes and farmland.</p><p>About 46 people had died in Kenya, 32 in Somalia and another 33 in Ethiopia, Save the Children said, warning the rains were \"showing no signs of slowing down\".</p><p>The Horn of Africa is one of the regions most vulnerable to climate change and extreme weather events are occurring with increased frequency and intensity.</p><p>The region is emerging from the worst drought in four decades after multiple failed rainy seasons that left millions of people in need and devastated crops and livestock.</p><p>\"Heavy flooding and displacement have cut off families and children from basic services including access to food, healthcare, water and hygiene services,\" said Xavier Joubert, Ethiopia director for Save the Children.</p><p>\"With that comes the real risk of waterborne diseases including cholera and measles.\"</p><p>Humanitarian groups have warned that the situation is only likely to worsen and called for urgent global intervention as El Nino is expected to last until at least April 2024.</p><p>El Nino is typically associated with increased heat worldwide, as well as drought in some parts of the world and heavy rains elsewhere.</p><p>Between October 1997 and January 1998, devastating floods caused by El Nino led to more than 6,000 deaths in five Horn of Africa countries.</p><p>At least 1,800 people died in Somalia where the Juba River burst its banks.</p><p>At the end of 2019, 265 people died and tens of thousands were displaced during two months of relentless rainfall in several countries in East Africa.</p><p>© 2023 AFP</p>"},"pubDate":"Thu, 16 Nov 2023 16:26:31 +0000","guid":"https://www.rawstory.com/flash-floods-100-in-horn-of-africa-charity/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/png","@url":"https://www.rawstory.com/media-library/kenya-somalia-and-ethiopia-have-been-lashed-by-unrelenting-downpours-since-the-beginning-of-the-month-due-to-the-el-nino-weathe.png?id=50493816&width=980"}},{"title":"Charles de Gaulle's pro-Kremlin grandson says he wants Russian citizenship","link":"https://www.rawstory.com/charles-de-gaulle-s-pro-kremlin-grandson-says-he-wants-russian-citizenship/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/charles-de-gaulle.jpg?id=50493091&width=1200&height=600&coordinates=0%2C0%2C0%2C99\"/><br/><br/><p>A grandson of French war hero and former president Charles de Gaulle said Thursday he wanted Russian citizenship, saying Russia offered “great possibilities”.</p><p>Pierre de Gaulle is little known in <a href=\"https://www.france24.com/en/tag/france/\" rel=\"noopener noreferrer\" target=\"_blank\">France</a>, but Russian state media have heralded his pro-<a href=\"https://www.france24.com/en/tag/kremlin/\" rel=\"noopener noreferrer\" target=\"_blank\">Kremlin</a> statements as proof that leading Western voices support <a href=\"https://www.france24.com/en/tag/moscow/\" rel=\"noopener noreferrer\" target=\"_blank\">Moscow</a>’s assault in <a href=\"https://www.france24.com/en/tag/ukraine/\" rel=\"noopener noreferrer\" target=\"_blank\">Ukraine</a>.</p><p>“It would be an honour for me to acquire Russian citizenship,” he told a journalist at the Saint Petersburg Cultural Forum, Russian agencies said.</p><p>He also said that Russia was “fighting for traditional values, the family and spirituality” in Ukraine and that “NATO had lost”.</p><p>This is not the first time the previously obscure scion of France’s most famous political family has made waves.</p><p>Yves de Gaulle, his eldest brother, told Le Parisien daily in January that his sibling’s views “concern no one else other than himself – not me, not our family and even less the general.”</p><p><a href=\"https://www.france24.com/en/tag/charles-de-gaulle/\" rel=\"noopener noreferrer\" target=\"_blank\">Charles de Gaulle</a> headed the French resistance movement from London during <a href=\"https://www.france24.com/en/tag/world-war-ii/\" rel=\"noopener noreferrer\" target=\"_blank\">World War II</a>, before returning triumphantly to France.</p><p><img alt=\"General de Gaulle during the parade on the Champs Elysées the day after the liberation of France in Paris on August 26, 1944.\" src=\"https://s.france24.com/media/display/dc666668-c6eb-11e9-b802-005056a98db9/paris15.jpg\"/>General de Gaulle during the parade on the Champs Elysées the day after the liberation of France in Paris on August 26, 1944. © Ville de Paris</p><p>As president, he positioned France as a hinge between the US-dominated Western bloc and the <a href=\"https://www.france24.com/en/tag/soviet-union/\" target=\"_blank\">Soviet Union</a> during the Cold War – a position that his grandson claims to represent. </p><p>But historians agree de Gaulle also kept France firmly anchored in the Western alliance. His views are a source of debate in France, particularly when applied to contemporary events.</p><p><em>(AFP)</em></p>"},"pubDate":"Thu, 16 Nov 2023 15:00:41 +0000","guid":"https://www.rawstory.com/charles-de-gaulle-s-pro-kremlin-grandson-says-he-wants-russian-citizenship/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/charles-de-gaulle.jpg?id=50493091&width=980"}},{"title":"Dutch to vote in seismic election thriller","link":"https://www.rawstory.com/dutch-to-vote-in-seismic-election-thriller/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/the-race-is-too-close-to-call-ramon-van-flymen.jpg?id=50491930&width=1200&height=600&coordinates=0%2C152%2C0%2C0\"/><br/><br/><p>Dutch voters head to the polls next week for a knife-edge election that will transform the country's political landscape, with surveys showing the race is too close to call.</p><p>After <a href=\"https://search.yahoo.com/search?p=Mark%20Rutte\" target=\"_blank\">Mark Rutte</a>'s record 13 years at the helm, the Dutch appear poised to elect either their first woman PM or a crusading anti-corruption campaigner who only formed a party a few months ago.</p><p>\"Anyone who says they know who is going to win this election is lying through their teeth,\" political analyst Julia Wouters told AFP.</p><p>What does seem sure however is that a new face will be leading the Netherlands, the EU's fifth-largest economy that punches above its weight in Europe and the world stage.</p><p>Replacing Rutte as head of the centre-right VVD party is Dilan Yesilgoz, a 46-year-old born in Turkey who arrived in the Netherlands as a young asylum seeker and who now wants to drive down immigration.</p><p>\"I came as an eight-year-old refugee to this country and I know what it means to seek freedom and to seek safety and security,\" Yesilgoz told AFP at a recent rally.</p><p>She said the influx of asylum seekers, plus international workers and students, was now \"way too high\".</p><p>\"We need to lower that number in order to also have a safe space for true refugees,\" she added.</p><p>A media-savvy campaigner who keeps her Instagram followers entertained with pictures of her dogs, Yesilgoz is a constant presence on Dutch political talk shows.</p><p>But critics say she has struggled to articulate clear policies and explain how she would govern differently from the scandal-hit Rutte.</p><p>\"The main challenge... is the perception that the party's campaign is devoid of any substance,\" Sarah de Lange, professor of politics at the University of Amsterdam, told AFP.</p><p>\"Yesilgoz emphasizes that they will do things differently, without going into detail what the key measures will be.\"</p><p>- 'Messiah' -</p><p>Neck and neck with Yesilgoz's VVD is a completely new party, the New Social Contract (NSC) founded by charismatic whistle-blower and political iconoclast Pieter Omtzigt.</p><p>The 49-year-old polyglot, educated in Britain and Italy, has sparked a political earthquake with his drive to clean up Dutch politics.</p><p>\"We've had many political failures over the last few years in the Netherlands,\" he told AFP in an interview.</p><p>\"Our oversight has been sloppy... and in order to fix this we need reforms, including a partial reform of the Dutch state,\" added Omtzigt, who also takes a hardline stance on immigration.</p><p>Omtzigt is known for fighting corruption at home and in Europe, but voters face a huge question mark: he has said he does not want to be PM if his party wins.</p><p>\"To me it's secondary who becomes prime minister or even a minister,\" he said, not ruling out appointing someone as PM not even on the NSC voting list.</p><p>Political analyst Wouters said that for many Dutch, Omtzigt was \"a sort of Messiah\" on a mission to reform the Netherlands.</p><p>\"He's basically a national hero, but a lot of people don't know what he actually stands for,\" she said.</p><p>- Is the government honest? -</p><p>Polling just behind those main two is former European Commissioner Frans Timmermans, who championed the EU's Green Deal and heads a joint Green/Labour coalition.</p><p>The far-right PVV of Geert Wilders is also in the mix. Support for his anti-immigrant, anti-EU message has been steady and crucially, he has won Yesilgoz's agreement for a potential coalition.</p><p>A farmers' party (BBB) that emerged from protests against measures to curb nitrogen emissions and which scored an impressive victory in Senate elections earlier this year appears to have run out of steam, polls suggest.</p><p>Voters say the main issues are immigration, a housing crisis, healthcare, and living standards.</p><p>But political reform is also key, playing into Omtzigt's hands.</p><p>\"The most important issue for many Dutch voters at the moment is how we are governed,\" said Wouters.</p><p>The November 22 election will usher in a long period of negotiations between parties to form a workable coalition, with every one of the parliament's 150 seats crucial.</p><p>The final days will be critical, said Tom Louwerse, political science professor at Leiden University.</p><p>\"Ten to 15 percent of voters only decide on election day. Some 30 percent make their minds up a few days before.\"</p>"},"pubDate":"Thu, 16 Nov 2023 12:03:26 +0000","guid":"https://www.rawstory.com/dutch-to-vote-in-seismic-election-thriller/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/the-race-is-too-close-to-call-ramon-van-flymen.jpg?id=50491930&width=980"}},{"title":"Canadian Jewish community shocked over anti-Semitic school, synagogue attacks","link":"https://www.rawstory.com/canadian-jewish-community-shocked-over-anti-semitic-school-synagogue/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/police-cars-sit-in-front-of-talmud-torah-elementary-school-as-parents-pick-up-their-children-in-the-cote-des-neiges-neighborhood.png?id=50491881&width=1200&height=600&coordinates=0%2C54%2C0%2C54\"/><br/><br/><p>Many in the majority-Jewish Canadian town of Hampstead worried about the potential for unrest tied to the Israel-Hamas war, but residents of the small Quebec community have been startled by the scale of the outbreak of anti-Semitic incidents in recent weeks.</p><p>Lorne W., who preferred not to give his last name, told AFP he is \"very, very, very much\" concerned about the sudden uptick in hate directed at the province's Jewish community, which is one of the oldest and most populous in Canada.</p><p>\"Myself and my neighbors, we're very cautious and we're very hyperaware of what's going on in the streets. It makes us nervous,\" he said.</p><p>The Middle East is nearly 9,000 kilometers (5,600 miles) away from Hampstead, a Montreal suburb, but the war raging in Gaza has been ever-present on minds here since Hamas's shock October 7 attack and Israel's furious response.</p><p>And the dismay has been even harder to escape since a surge of anti-Semitic attacks that last week saw two Jewish schools in Montreal's Cote-des-Neiges neighborhood targeted at night by gunfire -- twice in one case -- and a synagogue firebombed a few days earlier in the suburb of Dollard-des-Ormeaux.</p><p>Prime Minister Justin Trudeau on Tuesday called such assaults \"absolutely unacceptable.\"</p><p>\"The terrifying acts of anti-Semitic violence in Montreal need to stop. No parent should ever have to tell their child that their school was shot at. No rabbi should have to explain to their congregation that their synagogue was attacked,\" he said.</p><p>For Diana Singal, a Hampstead resident out walking her dog, \"it is scary. I might think of avoiding some Jewish institutions, because there might be some people that will just lash out.\"</p><p>She said members of her family had perished in Nazi death camps during World War II. \"I thought we lived in a different world today.\"</p><p>The tumult has come as Israel vows to destroy Hamas in response to its attacks last month, which Israel has said killed 1,200 people, mostly civilians.</p><p>Gaza's Hamas-run territory's health ministry says Israel's ensuing aerial bombardment and ground offensive have killed 11,500 people, mostly civilians and including thousands of children.</p><p>- Flag at half-mast -</p><p>The streets of Hampstead, an upscale English-speaking municipality of 8,000 -- 75 percent of whom identified as Jewish in the last census, which was in 2021 -- are plastered with posters of the 240 hostages kidnapped by Hamas.</p><p>The town hall is flying the Israeli flag at half-mast.</p><p>\"We had requests from various organizations and residents in general, to put up posters of the Israeli hostages. And we definitely wanted to comply with these requests,\" Hampstead mayor Jeremy Levi told AFP.</p><p>Tuesday evening, Hampstead also voted to introduce a fine of 1,000 Canadian dollars for anyone tearing down posters, particularly those of Hamas hostages. The fine is doubled for repeat offenses.</p><p>Many locals have found comfort in gathering together, and the town's three synagogues have overflowed on recent Saturdays.</p><p>\"It is surprising\" to see such aggressive acts in Canada, local rabbi Moishe New said. \"We didn't expect it.\"</p><p>Montreal police counted more anti-Semitic acts in the past month than in all of 2022. The same trend has been observed elsewhere in the world, including in several European countries.</p><p>\"We haven't seen this level of anti-Semitism in Montreal, ever,\" said Levi.</p><p>\"It's unfortunate,\" he said, \"And, there's nothing being done about it.\"</p><p>\"The time for words is over. We need to see action before things get out of control,\" he added, decrying weak statements against anti-Semitism by politicians and a stepped-up police presence that Levi said has fallen short of expectations.</p><p>\"There is a conflict in the Middle East,\" commented Yair Szlak, head of the Federation CJA, one of Canada's oldest Jewish organizations.</p><p>\"We're all mourning. We're all hurt by it. We're all suffering from it. But it doesn't belong in the streets of Montreal.\"</p><p>maw-tib/amc/caw/md</p>"},"pubDate":"Thu, 16 Nov 2023 11:59:19 +0000","guid":"https://www.rawstory.com/canadian-jewish-community-shocked-over-anti-semitic-school-synagogue/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/png","@url":"https://www.rawstory.com/media-library/police-cars-sit-in-front-of-talmud-torah-elementary-school-as-parents-pick-up-their-children-in-the-cote-des-neiges-neighborhood.png?id=50491881&width=980"}},{"title":"Oil, gas giants could pay climate damage and still profit: research","link":"https://www.rawstory.com/oil-gas-giants-could-pay-climate-damage-and-still-profit-research/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/oil-field-operations-likely-triggered-earthquakes-in-california-a-few-miles-from-the-san-andreas-fault.jpg?id=24834921&width=1200&height=600&coordinates=0%2C15%2C0%2C15\"/><br/><br/><p>Major oil and gas companies such as Aramco, ExxonMobil and Shell could have paid for their share of the damage caused by climate change and still earned trillions of dollars in profit, researchers said on Thursday.</p><p>Their conclusions were released ahead of the UN's COP28 climate negotiations later this month in Dubai, where developing countries not responsible for most carbon emissions are expected to push for governments and firms to pay more for their role in global warming.</p><p>If the top 25 oil and gas companies had been held accountable for their role in global warming in recent decades, they would still have made $10 trillion dollars in profit, according to the report published by think tank Climate Analytics.</p><p>The estimated damage caused by carbon emissions from the 25 companies cost $20 trillion from 1985 to 2018 -- but during that time they earned $30 trillion, the report said.</p><p>The research looked at private oil and gas giants as well as state-owned companies. State-owned firms contribute to huge sovereign wealth funds in countries such as the United Arab Emirates, the host of this year's COP28 talks.</p><p>\"This fossil wealth is here to stay while the world suffers from the devastating consequences of climate change for centuries to come,\" the report's lead author Carl-Friedrich Schleussner told journalists.</p><p>The contrast was particularly striking last year, the authors of the report said.</p><p>As energy prices sky rocketed due to Russia's war in Ukraine, major oil and gas companies posted record profits.</p><p>The $161 billion profit of Saudi Arabia's state-owned Aramco in 2022 was \"probably the highest net income ever reported in the corporate world,\" its CEO Amin Nasser has said.</p><p>Aramco was one of seven companies that posted profits almost twice the amount of the estimated damage caused by their emissions, according to the report.</p><p>- 'Flaunting their profits' -</p><p>The researchers calculated damages for the world's biggest emitters by using estimates for the social cost of carbon from 1985-2018, which amounted to $185 per tonne of carbon dioxide.</p><p>They compared this number with company profits from the same period.</p><p>The researchers then split the damages in three to account for the responsibility of governments and consumers.</p><p>State-owned oil companies in Saudi Arabia, Russia, Iran, China and the UAE showed both the most damaged caused -- and the largest financial gain.</p><p>ExxonMobil topped the list for private companies, followed by Shell, BP and Chevron.</p><p>Half of the sovereign wealth fund of COP28 host the UAE could cover the climate damage from its fossil fuel industries and still have $700 billion left over, the report said.</p><p>At last year's COP27 talks in Egypt, nations agreed to set up a dedicated fund to help vulnerable countries cope with \"loss and damage\" from climate disasters such as extreme weather.</p><p>The details have yet to be worked out, however, and the fund will be a key point of negotiation at this year's COP28 talks.</p><p>Barbados Prime Minister Mia Mottley, whose Caribbean island nation is threatened by rising sea levels, has called for a 10 percent tax on the profits of oil and gas companies to go into such a fund.</p><p>The UN estimates that developing countries will need over $300 billion per year by 2030 to combat the impacts of climate change.</p><p>The COP28 talks will be held during what is widely expected to be the hottest year on record.</p><p>\"Oil and gas companies are meanwhile unabashedly flaunting their profits, some even walking back on their climate commitments,\" said report co-author Marina Andrijevic.</p>"},"pubDate":"Thu, 16 Nov 2023 11:53:35 +0000","guid":"https://www.rawstory.com/oil-gas-giants-could-pay-climate-damage-and-still-profit-research/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/oil-field-operations-likely-triggered-earthquakes-in-california-a-few-miles-from-the-san-andreas-fault.jpg?id=24834921&width=980"}},{"title":"China ready to be 'partner and friend' of U.S.: Xi","link":"https://www.rawstory.com/china-ready-to-be-partner-and-friend-of-us-xi/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/china-s-president-xi-jinping.png?id=50491741&width=1200&height=600&coordinates=0%2C32%2C0%2C95\"/><br/><br/><p>China is \"ready to be a partner and friend of the United States,\" President Xi Jinping told US business leaders on Wednesday, as concerns mount over the country's slowing economy.</p><p>If one country sees the other as a main competitor and most consequential geopolitical challenge, \"this will only lead to wrong policymaking, misguided actions and unwanted results,\" he told a dinner on the sidelines of the Asia-Pacific Economic Cooperation (APEC) summit.</p><p>Xi's remarks in San Francisco came hours after his highly anticipated talks with US President Joe Biden, where both men pledged to reduce tensions as they met for the first time in a year.</p><p>The two sides announced a host of agreements after talks at the luxury Filoli Estate, starting with the reactivation of a high-level military hotline.</p><p>\"We should build more bridges and pave more roads for people-to-people interactions,\" Xi told an audience of around 400 business leaders, government officials and academics.</p><p>\"We must not create various obstacles or create a chilling effect,\" he added.</p><p>Among those on a guest list seen by AFP were Apple CEO Tim Cook, Laurence Fink of BlackRock and Pfizer CEO Albert Bourla.</p><p>Xi's comments at the event organized by the US-China Business Council and National Committee on US-China Relations were being closely watched, given worries about China's tighter business oversight and bilateral tensions.</p><p>Foreign business confidence in China hit its lowest point in years according to US and European enterprise lobbies in September, with US firms increasingly looking to shift investment away.</p><h1>'Open for business'</h1><p>\"Xi is interested in signaling that despite geopolitical tensions -- especially around the high tech industries -- China remains open for business,\" said Lindsay Gorman, senior fellow at the German Marshall Fund of the United States.</p><p>But, she told AFP, \"there is a lot more skepticism\" from US firms than 10 years ago, even if some may be eager to overcome tensions.</p><p>Thibault Denamiel, associate fellow at the Center for Strategic and International Studies (CSIS), noted that Chinese tech giant Huawei unexpectedly unveiled a new smartphone -- involving advanced 7 nanometer technology -- during US Commerce Secretary Gina Raimondo's visit to China this year.</p><p>It appears that Chinese authorities are sending a dual message, that they can weather geopolitical headwinds such as US chip controls, while encouraging foreign businesses to keep coming, he added.</p><p>Xi said on Wednesday that China wants to invite 50,000 young Americans to the country on exchange and study programs over the next five years, and that Beijing was ready to further cooperation on panda conservation, though no new animal loans were promised. </p><p>The Chinese leader, who recently met California Governor Gavin Newsom, said he would welcome visits from regional politicians and members of Congress.</p><p>But in a reminder of the still-sticky state of China-US ties, Mike Gallagher, a Wisconsin Republican who chairs the bipartisan House Select Committee on the Chinese Communist Party, lashed out at the attendance at the meeting by senior US business leaders.</p><p>It is \"unconscionable\" for US companies to pay thousands for a welcome dinner hosted by the Communist Party, he wrote in a letter this week, given allegations that they have overseen a \"genocide\" against people in China's northwestern Xinjiang region.</p><p>Gallagher added that executives \"must recognize that the reality of doing business in China today includes the increased risk of arbitrary detentions, exit bans, and raids by the Chinese intelligence services,\" urging firms to reduce the risks they face.</p><p>© Agence France-Presse</p>"},"pubDate":"Thu, 16 Nov 2023 11:36:10 +0000","guid":"https://www.rawstory.com/china-ready-to-be-partner-and-friend-of-us-xi/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/png","@url":"https://www.rawstory.com/media-library/china-s-president-xi-jinping.png?id=50491741&width=980"}}]}}}