{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","@xmlns:georss":"http://www.georss.org/georss","@xmlns:geo":"http://www.w3.org/2003/01/geo/wgs84_pos#","channel":{"title":"MIT Technology Review","atom:link":{"@href":"https://www.technologyreview.com/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://www.technologyreview.com","description":"","lastBuildDate":"Fri, 17 Nov 2023 22:18:56 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.3.2","image":{"url":"https://wp.technologyreview.com/wp-content/uploads/2020/01/20130408-ftweekendmag-mit-0030-final-w0-1.jpg?w=32?crop=0px,33px,1272px,716px&w=32px","title":"MIT Technology Review","link":"https://www.technologyreview.com","width":"32","height":"32"},"item":[{"title":"This company is building AI for African languages","link":"https://www.technologyreview.com/2023/11/17/1083637/lelapa-ai-african-languages-vulavula/","dc:creator":{"#cdata-section":"Abdullahi Tsanni"},"pubDate":"Fri, 17 Nov 2023 22:18:55 +0000","category":[{"#cdata-section":"Artificial intelligence"},{"#cdata-section":"App"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083637"},"description":{"#cdata-section":"Inside a co-working space in the Rosebank neighborhood of Johannesburg, Jade Abbott popped open a tab on her computer and prompted ChatGPT to count from 1 to 10 in isiZulu, a language spoken by more than 10 million people in her native South Africa. The results were “mixed and hilarious,” says Abbott, a computer scientist&#8230;"},"content:encoded":{"#cdata-section":"\n<p>Inside a co-working space in the Rosebank neighborhood of Johannesburg, Jade Abbott popped open a tab on her computer and prompted ChatGPT to count from 1 to 10 in isiZulu, a language spoken by more than 10 million people in her native South Africa. The results were “mixed and hilarious,” says Abbott, a computer scientist and researcher.&nbsp;</p>\n\n\n\n<p>Then she typed in a few sentences in isiZulu and asked the chatbot to translate them into English. Once again, the answers? Not even close. Although there have been efforts to include certain languages in AI models even when there is not much data available for training, to Abbott, these results show that the technology “really still isn’t capturing our languages.”&nbsp;&nbsp;</p>\n\n\n\n<p>Abbott’s experience mirrors the situation faced by Africans who don’t speak English. Many language models like ChatGPT do not perform well for languages with smaller numbers of speakers, especially African ones. But a new venture called Lelapa AI, a collaboration between Abbott and a biomedical engineer named Pelonomi Moiloa, is trying to use machine learning to create tools that specifically work for Africans.</p>\n\n\n\n<p><a href=\"https://beta-vulavula.lelapa.ai/\">Vulavula</a>, a new AI tool that Lelapa released today, converts voice to text and detects names of people and places in written text (which could be useful for summarizing a document or searching for someone online). It can currently identify four languages spoken in South Africa—isiZulu, Afrikaans, Sesotho, and English—and the team is working to include other languages from across Africa.&nbsp;</p>\n\n\n\n\n\n<p>The tool can be used on its own or integrated into existing AI tools like ChatGPT and online conversational chatbots. The hope is that Vulavula, which means “speak” in Xitsonga, will make accessible those tools that don&#8217;t currently support African languages.</p>\n\n\n\n<p>The lack of AI tools that work for African languages and recognize African names and places excludes African people from economic opportunities, says Moiloa, CEO and cofounder of Lelapa AI. For her, working to build Africa-centric AI solutions is a way to help others in Africa harness the immense potential benefits of AI technologies. “We are trying to solve real problems and put power back into the hands of our people,” she says.&nbsp;&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>“We cannot wait for them”&nbsp;&nbsp;&nbsp;</strong></h3>\n\n\n\n<p>There are thousands of languages in the world, 1,000 to 2,000 of them in Africa alone: it’s estimated that the continent accounts for one-third of the world’s languages. But though native speakers of English make up just 5% of the global population, the language dominates the web—and has now come to dominate AI tools, too.&nbsp;&nbsp;</p>\n\n\n\n<p>Some efforts to correct this imbalance already exist. OpenAI’s GPT-4 has included minor languages <a href=\"https://openai.com/customer-stories/government-of-iceland\">like Icelandic</a>. In February 2020, Google Translate <a href=\"https://www.theverge.com/2020/2/26/21154417/google-translate-new-languages-support-odia-tatar-turkmen-uyghur-kinyarwanda\">started supporting five new languages</a> spoken by about 75 million people. But the translations are shallow, the tool often gets African languages wrong, and it’s still a long way from an accurate digital representation of African languages, African AI researchers say.</p>\n\n\n\n<p>Earlier this year, for example, the Ethiopian computer scientist Asmelash Teka Hadgu ran the same experiments that Abbott ran with ChatGPT at a premier African AI conference in Kigali, Rwanda. When he asked the chatbot questions in his mother tongue of Tigrinya, the answers he got were gibberish. “It generated words that don&#8217;t make any sense,” says Hadgu, who cofounded Lesan, a Berlin-based AI startup that is developing translation tools for Ethiopian languages.&nbsp;</p>\n\n\n\n<p>Lelapa AI and Lesan are just two of the startups developing speech recognition tools for African languages. In February, Lelapa AI raised $2.5 million in seed funding, and the company plans for the next funding round in 2025. But African entrepreneurs say they face major hurdles, including lack of funding, limited access to investors, and difficulties in training AI to learn diverse African languages. “AI receives the least funding among African tech startups,” says Abake Adenle, the founder of AJALA, a&nbsp; London-based startup that provides voice automation for African languages.&nbsp;&nbsp;</p>\n\n\n\n<p>The AI startups working to build products that support African languages often get ignored by investors, says Hadgu, owing to the small size of the potential market, a lack of political support, and poor internet infrastructure. However, Hadgu says small African startups including Lesan, GhanaNLP, and Lelapa AI are playing an important role: “Big tech companies do not give focus to our languages,” he says, “but we cannot wait for them.”&nbsp;&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>A model for African AI&nbsp;&nbsp;</strong></h3>\n\n\n\n<p>Lelapa AI is trying to create a new paradigm for AI models in Africa, says Vukosi Marivate, a data scientist on the company’s AI team. Instead of tapping into the internet alone to collect data to train its model, like companies in the West, Lelapa AI works both online and offline with linguists and local communities to gather data, annotate it, and identify use cases where the tool might be problematic.&nbsp;</p>\n\n\n\n<p>Bonaventure Dossou, a researcher at Lelapa AI specializing in natural-language processing (NLP), says that working with linguists enables them to develop a model that’s context-specific and culturally relevant. “Embedding cultural sensitivity and linguistic perspectives makes the technological system better,” says Dossou. For example, the Lelapa AI team built sentiment and tone analysis algorithms tailored to specific languages.&nbsp;</p>\n\n\n\n<p>Marivate and his colleagues at Lelapa AI envision a future in which AI technologies work for and represent Africans. In 2019, Marivate and Abbott established <a href=\"https://www.masakhane.io/\">Masakhane</a>, a grassroots initiative that aims to promote NLP research in African languages. The initiative now has thousands of volunteers, coders, and researchers working together to build Africa-centric NLP models.&nbsp;</p>\n\n\n\n<p>It matters that Vulavula and other AI tools are built by Africans for Africans, says Moiloa: “We’re the custodians of our languages. We should be the builders of technologies that work for our languages.”&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n"}},{"title":"The Download: what is death, and jailbreaking generative AI","link":"https://www.technologyreview.com/2023/11/17/1083602/the-download-what-is-death-and-jailbreaking-generative-ai/","dc:creator":{"#cdata-section":"Rhiannon Williams"},"pubDate":"Fri, 17 Nov 2023 13:10:00 +0000","category":{"#cdata-section":"The Download"},"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083602"},"description":{"#cdata-section":"This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. What is death? Just as birth certificates note the time we enter the world, death certificates mark the moment we exit it. This practice reflects traditional notions about life and death as binaries.&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This is today&#8217;s edition of <a href=\"https://forms.technologyreview.com/newsletters/briefing-the-download/?_ga=2.179569122.736533416.1649661040-405833893.1649413289\">The Download</a></em>,<em> our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology.</em></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What is death?</strong></p>\n\n\n\n<p>Just as birth certificates note the time we enter the world, death certificates mark the moment we exit it. This practice reflects traditional notions about life and death as binaries. We are here until, suddenly, like a light switched off, we are gone.&nbsp;</p>\n\n\n\n<p>But while this idea of death is pervasive, evidence is building that it is an outdated social construct, not really grounded in biology. Dying is in fact a process—one with no clear point demarcating the threshold across which someone cannot come back.</p>\n\n\n\n<p>Scientists and many doctors have already embraced this more nuanced understanding of death. And as society catches up, the implications for the living could be profound. <a href=\"https://www.technologyreview.com/2023/11/17/1082937/what-is-death/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.&nbsp;</p>\n\n\n\n<p><em>—Rachel Nuwer</em></p>\n\n\n\n<p><strong><em>‘What is death?’</em></strong><strong> <em>is part of our mini-series </em></strong><a href=\"https://www.technologyreview.com/supertopic/the-biggest-questions/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong><em>The Biggest Questions</em></strong></a><strong><em>, which explores how technology is helping probe some of the deepest, most mind-bending mysteries of our existence.</em></strong></p>\n\n\n\n<p><strong><em>Read more:&nbsp;</em></strong></p>\n\n\n\n<p><strong>+ Why is the universe so complex and beautiful? </strong>For some reason the universe is full of stars, galaxies, and life. But it didn’t have to be this way. <a href=\"https://www.technologyreview.com/2023/11/16/1083141/why-is-the-universe-so-complex-and-beautiful/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><strong>+ How did life begin? </strong>AI is helping chemists unpick the mysteries around the origins of life and detect signs of it on other worlds. <a href=\"https://www.technologyreview.com/2023/11/14/1082828/how-did-life-begin/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p>+ <strong>Are we alone in the universe?</strong> Scientists are training machine-learning models and designing instruments to hunt for life on other worlds. <a href=\"https://www.technologyreview.com/2023/11/13/1082873/the-biggest-questions-are-we-alone-in-the-universe/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p>+ <strong>Is it possible to really understand someone else’s mind?</strong> How we think, feel and experience the world is a mystery to everyone but us. But technology may be starting to help us understand the minds of others. <a href=\"https://www.technologyreview.com/2023/11/15/1083250/is-it-possible-to-really-understand-someone-elses-mind/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Text-to-image AI models can be tricked into generating disturbing images</strong></p>\n\n\n\n<p><strong>What’s happened: </strong>Popular text-to-image AI models can be prompted to ignore their safety filters and generate disturbing images. A group of researchers managed to get both Stability AI’s Stable Diffusion and OpenAI’s DALL-E 2’s text-to-image models to disregard their policies and create images of naked people, dismembered bodies, and other violent and sexual scenarios.&nbsp;</p>\n\n\n\n<p><strong>How they did it: </strong>This new jailbreaking method, called “SneakyPrompt”, uses reinforcement learning to create written prompts that look like garbled nonsense to us but that AI models learn to recognize as hidden requests for disturbing images. It essentially works by turning the way text-to-image AI models function against them.</p>\n\n\n\n<p><strong>Why it matters:</strong> The research highlights the vulnerability of existing AI safety filters and should serve as a wake-up call for the AI community to bolster security measures across the board, experts say. It also demonstrates how difficult it is to prevent these models from generating such content, as it’s included in the vast troves of data they’ve been trained on. <a href=\"https://www.technologyreview.com/2023/11/17/1083593/text-to-image-ai-models-can-be-tricked-into-generating-disturbing-images/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Rhiannon Williams</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The pain is real. The painkillers are virtual reality.</strong></p>\n\n\n\n<p>Plenty of children—and adults—hate needles. But virtual reality devices like Smileyscope, a device for kids that recently received FDA clearance, could help to make a difference. It helps lessen the pain of a blood draw or IV insertion by sending the user on an underwater adventure. Inside this watery deep-sea reality, the swipe of an alcohol wipe becomes cool waves washing over the arm. The pinch of the needle becomes a gentle fish nibble.&nbsp;&nbsp;</p>\n\n\n\n<p>But how Smileyscope works is not entirely clear. It’s more complex than just distraction, and not all stimuli are equally effective. But the promise of VR has led companies to work on devices to address a much tougher problem: chronic pain. <a href=\"https://www.technologyreview.com/2023/11/17/1083586/the-pain-is-real-the-painkillers-are-virtual-reality/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Cassandra Willyard</em></p>\n\n\n\n<p><strong>This story is from The Checkup, our weekly health and biotech newsletter. </strong><a href=\"https://forms.technologyreview.com/newsletters/biotech-the-checkup/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>Sign up</strong></a><strong> to receive it in your inbox every Thursday.</strong></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The must-reads</strong></p>\n\n\n\n<p><em>I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.</em></p>\n\n\n\n<p><strong>1 Elon Musk endorsed an antisemitic post on X </strong><br>Leaving its executives racing to suppress the damage. (<a href=\"https://www.nytimes.com/2023/11/16/technology/elon-musk-endorses-antisemitic-post-ibm.html\">NYT</a> $)<br>+ <em>IBM has pulled its ads from X after they appeared next to antisemitic posts. </em>(<a href=\"https://www.washingtonpost.com/technology/2023/11/16/elon-musk-antisemitic-advertisers/\">WP</a> $)<br>+ <em>Musk’s comments are resonating with the far-right, unsurprisingly. </em>(<a href=\"https://www.vice.com/en/article/5d9q3k/the-far-right-is-loving-elon-musks-comments-about-jewish-groups-corrupting-the-west\">Motherboard</a>)</p>\n\n\n\n<p><strong>2 Osama bin Laden’s letter to America has exploded on social media</strong><br>Videos of American users endorsing parts of the 9/11 manifesto have gone viral. (<a href=\"https://www.washingtonpost.com/style/2023/11/16/guardian-osama-bin-laden-letter-to-america/\">WP</a> $)<br>+ <em>TikTok says it’s aggressively working to remove the clips. </em>(<a href=\"https://www.nytimes.com/2023/11/16/technology/videos-bin-laden-letter-tiktok.html\">NYT</a> $)<br>+ <em>The Guardian newspaper has deleted its version of the letter from its site. </em>(<a href=\"https://www.404media.co/guardian-deletes-osama-bin-ladens-letter-to-america-after-it-goes-viral-on-tiktok/\">404 Media</a>)</p>\n\n\n\n<p><strong>3 SpaceX has pushed back its giant rocket launch</strong><br>A component in need of replacing has delayed the launch until Saturday. (<a href=\"https://arstechnica.com/space/2023/11/elon-musk-confirms-a-one-day-delay-for-spacexs-starship-test-flight/\">Ars Technica</a>)</p>\n\n\n\n<p><strong>4 The first CRISPR medicine has been approved in the UK</strong><br>The treatment, called Casgevy, edits the cells of people with sickle cell disease before infusing them back in. (<a href=\"https://www.wired.com/story/crispr-gene-therapy-approved-sickle-cell-casgevy/\">Wired</a> $)<br>+ <em>Remarkably, the therapy effectively cures the disease. </em>(<a href=\"https://www.newscientist.com/article/2403426-sickle-cell-crispr-cure-is-the-start-of-a-revolution-in-medicine/\">New Scientist</a> $)<em>+ Here’s how CRISPR is changing lives. </em>(<a href=\"https://www.technologyreview.com/2023/03/07/1069475/forget-designer-babies-heres-how-crispr-is-really-changing-lives/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>5 Data broker LexisNexis sold surveillance tools to US border enforcement</strong><br>Social media oversight, face recognition and geolocation data, among others. (<a href=\"https://theintercept.com/2023/11/16/lexisnexis-cbp-surveillance-border/\">The Intercept</a>)</p>\n\n\n\n<p><strong>6 OpenAI has steamrollered the AI industry</strong><br>And startup founders are struggling to avoid becoming roadkill. (<a href=\"https://www.businessinsider.com/cerebral-valley-ai-summit-openai-dominance-2023-11?r=US&amp;IR=T\">Insider</a> $)<br>+ <em>Google has delayed releasing its OpenAI-challenging Gemini system. </em>(<a href=\"https://www.theinformation.com/articles/google-delays-cloud-release-of-gemini-ai-that-aims-to-compete-with-openai\">The Information</a> $)<br>+ <em>Inside the mind of OpenAI’s chief scientist. </em>(<a href=\"https://www.technologyreview.com/2023/10/26/1082398/exclusive-ilya-sutskever-openais-chief-scientist-on-his-hopes-and-fears-for-the-future-of-ai/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>7 Climate-proofing our homes is a nightmare<br></strong>Extreme weather events are on the rise—and our homes are vulnerable. (<a href=\"https://www.theverge.com/23951223/housing-climate-change-zoning-nimby-sustainable-design\">The Verge</a>)<br>+ <em>The quest to build wildfire-resistant homes. </em>(<a href=\"https://www.technologyreview.com/2023/04/18/1071274/climate-change-building-fire-resistant-homes-adaptation/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>8 Vietnamese immigrants rely on YouTube for their news</strong><br>Even when it’s not always clear if that news is from reliable sources. (<a href=\"https://themarkup.org/languages-of-misinformation/2023/11/16/meet-the-vietnamese-grandmother-fighting-misinformation-one-youtube-video-at-a-time\">The Markup</a>)</p>\n\n\n\n<p><strong>9 Reddit is the best place for product reviews now</strong><br>Fake reviews and SEO-bait lists aren’t helpful. Honest assessments from real people are. (<a href=\"https://www.vox.com/technology/23962999/best-product-reviews-shopping-reddit\">Vox</a>)</p>\n\n\n\n<p><strong>10 Meet the inventor of the lickable TV <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f4fa.png\" alt=\"📺\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></strong><br>Net-licks and chill? (<a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/17/experience-i-invented-the-lickable-tv\">The Guardian</a>)</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Quote of the day</strong></p>\n\n\n\n<p class=\"has-large-font-size\"><strong>“We fly, we break some things, we learn some things, and then we go back and fly again.”&nbsp;</strong></p>\n\n\n\n<p>—William Gerstenmaier, the vice president of build and flight reliability at SpaceX, explains the company’s approach to inevitable rocket launch setbacks to <a href=\"https://www.bloomberg.com/news/articles/2023-11-17/elon-musk-s-spacex-to-launch-starship-rocket-after-april-explosion?srnd=technology-vp&amp;sref=E9Urfma4\">Bloomberg</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The big story</strong></p>\n\n\n\n<p><strong>Responsible AI has a burnout problem</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://www.technologyreview.com/2022/10/28/1062332/responsible-ai-has-a-burnout-problem/?truid=*|LINKID|*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*|SUBCLASS|*&amp;utm_content=*|DATE:m-d-Y|*#:~:text=And%20while%20burnout%20is%20not,to%20day,%E2%80%9D%20Mitchell%20says.\"><img decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/H1yGv7xIy21PtLoeOWUWwmlMuyhu4t_OVZNzHrm7WlKdxv-uuMTrSnSUx0XZsvBMaiv6DH7wz4D7ht1YuHtwPnmxLeot2yZkufRjemVkhgxluZ1-HnvLkkHVh81Q5WbfN7FraLEhimWmUfoqFd2GSAg\" alt=\"\"/></a></figure>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2022/10/28/1062332/responsible-ai-has-a-burnout-problem/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*#:~:text=And%20while%20burnout%20is%20not,to%20day,%E2%80%9D%20Mitchell%20says.\"></a><strong>October 2022</strong></p>\n\n\n\n<p>Margaret Mitchell had been working at Google for two years before she realized she needed a break. Only after she spoke with a therapist did she understand the problem: she was burnt out.</p>\n\n\n\n<p>Mitchell, who now works as chief ethics scientist at the AI startup Hugging Face, is far from alone in her experience. Burnout is becoming increasingly common in responsible AI teams.</p>\n\n\n\n<p>All the practitioners MIT Technology Review interviewed spoke enthusiastically about their work: it is fueled by passion, a sense of urgency, and the satisfaction of building solutions for real problems. But that sense of mission can be overwhelming without the right support. <a href=\"https://www.technologyreview.com/2022/10/28/1062332/responsible-ai-has-a-burnout-problem/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*#:~:text=And%20while%20burnout%20is%20not,to%20day,%E2%80%9D%20Mitchell%20says.\">Read the full story</a>.</p>\n\n\n\n<p><em>—Melissa Heikkilä</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>We can still have nice things</strong></p>\n\n\n\n<p><em>A place for comfort, fun and distraction in these weird times. (Got any ideas? </em><a href=\"mailto:rhiannon.williams@technologyreview.com\"><em>Drop me a line</em></a><em> or </em><a href=\"https://twitter.com/yannon_\"><em>tweet &#8217;em at me</em></a><em>.)</em></p>\n\n\n\n<p>+ The adorable tale of <a href=\"https://www.tiktok.com/@meetcutesnyc/video/7301442854319082798?_r=1&amp;_t=8hPvSzwTr2v\">how this couple met</a> will warm your heart. <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f970.png\" alt=\"🥰\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /><br>+ Why <a href=\"https://mashable.com/article/nasa-space-sex-relationships?\">Sex in space</a> is a such a tricky business.<br>+ Let it go—why <a href=\"https://www.theguardian.com/film/2023/nov/16/how-frozen-changed-generation-girls-boys-hollywood\"><em>Frozen</em></a>’s legacy refuses to die.<br>+ Why not treat yourself to a <a href=\"https://robbreport.com/food-drink/spirits/best-white-toreador-recipe-tequila-cocktail-1235397310/\">White Toreador</a> tequila cocktail this weekend?<br>+ <a href=\"https://lifehacker.com/the-out-of-touch-adults-guide-to-kid-culture-uncanny-1851010555\">Uncanny Valley makeup</a> is the stuff of nightmares, quite frankly.</p>\n"}},{"title":"The pain is real. The painkillers are virtual reality.","link":"https://www.technologyreview.com/2023/11/17/1083586/the-pain-is-real-the-painkillers-are-virtual-reality/","dc:creator":{"#cdata-section":"Cassandra Willyard"},"pubDate":"Fri, 17 Nov 2023 10:00:00 +0000","category":[{"#cdata-section":"Biotechnology and health"},{"#cdata-section":"App"},{"#cdata-section":"The Checkup"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083586"},"description":{"#cdata-section":"This article first appeared in The Checkup, MIT Technology Review&#8217;s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here. I hate needles. I am a grown woman who owns a Buzzy, a vibrating, bee-shaped device you press against your arm to confuse your nerves and&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This article first appeared in The Checkup, MIT Technology Review&#8217;s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, <a href=\"https://forms.technologyreview.com/newsletters/biotech-the-checkup/?_ga=2.241810882.15113993.1664981064-43237434.1647441349\">sign up here</a>.</em></p>\n\n\n\n<p>I hate needles. I am a grown woman who owns a <a href=\"https://www.buzzy4shots.com.au/\">Buzzy</a>, a vibrating, bee-shaped device you press against your arm to confuse your nerves and thus reduce pain during blood draws. I once was so anxious a nurse gave me a n iPad so I could watch <em>Moana </em>while getting blood taken.</p>\n\n\n\n<p>That’s why I was so excited to read about <a href=\"https://www.smileyscope.com.au/\">Smileyscope</a>, a VR device for kids that <a href=\"https://www.prweb.com/releases/smileyscope-therapy-is-the-first-virtual-reality-device-to-receive-fda-class-ii-clearance-for-acute-pain-301978129.html\">recently received FDA clearance</a>. It helps lessen the pain of a blood draw or IV insertion by sending the user on an underwater adventure that begins with a welcome from an animated character called Poggles the Penguin. Inside this watery deep-sea reality, the cool swipe of an alcohol wipe becomes cool waves washing over the arm. The pinch of the needle becomes a gentle fish nibble.&nbsp;&nbsp;</p>\n\n\n\n<p>Studies suggest <a href=\"https://pubmed.ncbi.nlm.nih.gov/31047650/\">the device works</a>. In two clinical trials that included more than 200 children aged 4 to 11, the Smileyscope reduced self-reported pain levels by up to 60% and anxiety levelsby up to 40%.</p>\n\n\n\n<p>But <em>how</em> Smileyscope works is not entirely clear. It’s more complex than just distraction. Back in the 1960s, Ronald Melzack and Patrick Wall posited that pain signals travel through a series of “gates” in the spinal cord that allow some to reach the brain and keep others out. When the brain is occupied by other stimuli, the gates close and fewer pain signals can get through. “And that&#8217;s the mechanism of action for virtual reality,” says Paul Leong, chief medical officer and co-founder of Smileyscope.</p>\n\n\n\n<p>Not all stimuli are equally effective. “[In] traditional virtual reality you put on the headset and you go somewhere like a beach,” Leong says. But that kind of immersive experience has nothing to do with what’s happening in the real world. Smileyscope aims to reframe the stimuli in a positive light. Mood and anxiety can also affect how we process pain. Poggles the Penguin takes kids on a thorough walk-through of a procedure before it begins, which might reduce anxiety. And experiencing an underwater adventure with “surprise visitors” is undoubtedly more of a mood-booster than staring at clinic walls, waiting for a needle prick.</p>\n\n\n\n<p>“There are a lot of ways to distract people,” says Beth Darnall, a psychologist and director of the Stanford Pain Relief Innovations Lab. But the way Smileyscope goes about it, she says, is “really powerful.”</p>\n\n\n\n<p>Researchers have been working on similar technologies for years. Hunter Hoffman and David Patterson at the University of Washington developed a VR game called SnowWorld over two decades ago to help people with severe burns tolerate wound dressing changes and other painful procedures. “We created a world that was the antithesis of fire,” Hoffman told NPR in 2012, “a cool place, snowmen, pleasant images, just about everything to keep them from thinking about fire.” Other groups are exploring VR for postoperative pain, childbirth, pain associated with dental procedures, and more.</p>\n\n\n\n<p>Companies are also working on virtual reality devices that will address a much tougher problem: chronic pain. In 2021 <a href=\"https://www.relievrx.com/\">RelieVRx</a> became the first VR therapy authorized by the FDA for pain. (The FDA keeps <a href=\"https://www.fda.gov/medical-devices/digital-health-center-excellence/augmented-reality-and-virtual-reality-medical-devices#how\">a list</a> of all authorized VR/AR devices.) The tool aims to teach people how to manage chronic pain, which is entirely different from the temporary sting of a needle stick. “It’s vastly more complex on every level,” says Darnall, who helped develop RelieVRx and now serves as ​​chief science advisor for AppliedVR, which markets the device.</p>\n\n\n\n<p>Chronic pain is long term, and often life altering. “You have now literal changes in your nervous system as a consequence of experiencing pain long term,” Darnall says. “You have stored tension, you have maybe persistent anxiety, your activity levels have changed, you have sleep problems.” The alarm bell rings long after the danger has passed, for months, years, or even decades.&nbsp;</p>\n\n\n\n<p>With RelieVRx, the intention isn’t to distract, it’s to teach pain relief strategies that physicians already know work, such as mindfulness, cognitive-behavioral therapy, and relaxation. “We are helping people unlearn some physiologically hardwired pain processes that over time become unhelpful,” Darnell says. “It’s fundamentally skills-based.” Patients use the device six minutes a day for eight weeks, and that seems to be enough for many of them to acquire skills to manage their own pain. At three months, 30% were still experiencing a reduction in pain intensity.&nbsp;&nbsp;</p>\n\n\n\n<p>RelieVRx has another benefit, too: it’s meant for home use. That means people don’t necessarily have to schedule appointments with a therapist to receive behavioral pain treatment, which makes therapy more accessible. “It’s dismantling barriers to this type of effective nonpharmacologic care,” Darnall says. That’s good news for the 50 million people in the US who experience chronic pain that can’t be controlled with medication. It’s one more option for a condition that is notoriously tough to treat.</p>\n\n\n\n<p>VR won’t be a panacea for people with chronic pain or for anxious kids who need shots, and it’s not risk-free. It can cause nausea, headaches, and motion sickness. But the technology could prove exceedingly useful for some people. People like me.&nbsp;&nbsp;</p>\n\n\n\n<p>Providing patients with an escape during painful procedures may not seem like a medical necessity. In most cases, the procedure can be performed successfully either way. But pain is powerful, and a patient’s experience can directly influence future interactions with the medical system. “These experiences in childhood are really sentinel to developing behaviors in later life,” Leong says. “Every time you have a needle, that’s an opportunity for something to go well, or terribly. And if it goes terribly, the next time you go back you’re dreading it.”</p>\n\n\n\n<p>That dread can have serious ramifications. Maybe you stop going to the clinic, or you avoid getting treatment. In fact, Leong founded Smileyscope because he had a patient with cystic fibrosis who had been so traumatized by the medical procedures he received as a child that he had “disengaged with care,” he says. The man wanted Leong to put him under anesthesia just to have a routine blood draw. “And I just thought, there’s got to be a better way,” he says.&nbsp;</p>\n\n\n\n<p>Now, there just might be.&nbsp;</p>\n\n\n\n<p><strong>Read more from Tech Review’s archive</strong></p>\n\n\n\n<p>Long before AppliedVR had a device authorized to address chronic pain, Rachel Metz <a href=\"https://www.technologyreview.com/2016/07/18/70616/better-than-opioids-virtual-reality-could-be-your-next-painkiller/\">covered the company’s efforts</a>.&nbsp;</p>\n\n\n\n<p>Could virtual reality “forest bathing” mimic the health impacts of actually spending time in a forest? Some scientists think so, <a href=\"https://www.technologyreview.com/2023/06/26/1074325/forest-bathing-virtual-reality/\">reports Charlie Metcalfe</a>.&nbsp;</p>\n\n\n\n<p>Using virtual reality to relax during surgery may reduce the need for anesthetic. Rhiannon Williams <a href=\"https://www.technologyreview.com/2022/09/21/1059869/patients-virtual-reality-surgery-anesthetic/\">has the story</a>.&nbsp;</p>\n\n\n\n<p><strong>From around the web</strong></p>\n\n\n\n<p>Big milestone: The UK has approved the world’s first CRISPR gene editing therapy to treat two blood disorders. (<a href=\"https://www.reuters.com/business/healthcare-pharmaceuticals/uk-authorises-gene-therapy-blood-disorders-world-first-2023-11-16/\">Reuters</a>)</p>\n\n\n\n<p>A special gene editing technique called base editing has been used to alter DNA in humans in an attempt to lower cholesterol. Verve Therapeutics presented interim trial results at a meeting of the American Heart Association over the weekend. The data suggest that the therapy holds promise but also raised safety concerns. (<a href=\"https://www.nature.com/articles/d41586-023-03543-z\">Nature</a>)&nbsp;</p>\n\n\n\n<p>Here’s a new worry about ChatGPT: data manipulation. The latest version put together a startlingly accurate fake dataset that made one type of eye surgery appear much more effective than another. (<a href=\"https://www.medpagetoday.com/special-reports/features/107247#\">MedPage Today</a>)&nbsp;</p>\n\n\n\n<p>Why high lead levels have been found in pouches of cinnamon applesauce is still a mystery, but the CDC says 22 children have high lead levels in their blood as a result. (<a href=\"https://www.cnn.com/2023/11/13/health/cinnamon-applesuce-lead-poisoning-cdc/index.html\">CNN</a>)</p>\n"}},{"title":"Text-to-image AI models can be tricked into generating disturbing images","link":"https://www.technologyreview.com/2023/11/17/1083593/text-to-image-ai-models-can-be-tricked-into-generating-disturbing-images/","dc:creator":{"#cdata-section":"Rhiannon Williams"},"pubDate":"Fri, 17 Nov 2023 09:37:04 +0000","category":[{"#cdata-section":"Artificial intelligence"},{"#cdata-section":"App"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083593"},"description":{"#cdata-section":"Popular text-to-image AI models can be prompted to ignore their safety filters and generate disturbing images. A group of researchers managed to get both Stability AI’s Stable Diffusion and OpenAI’s DALL-E 2 text-to-image models to disregard their policies and create images of naked people, dismembered bodies, and other violent and sexual scenarios.&#160; Their work, which&#8230;"},"content:encoded":{"#cdata-section":"\n<p>Popular text-to-image AI models can be prompted to ignore their safety filters and generate disturbing images.</p>\n\n\n\n<p>A group of researchers managed to get both Stability AI’s <a href=\"https://www.technologyreview.com/2022/12/16/1065247/artists-can-now-opt-out-of-the-next-version-of-stable-diffusion/\">Stable Diffusion</a> and OpenAI’s <a href=\"https://www.technologyreview.com/2022/12/16/1065255/sam-altman-openai-lessons-from-dall-e-2/\">DALL-E 2</a> text-to-image models to disregard their policies and create images of naked people, dismembered bodies, and other violent and sexual scenarios.&nbsp;</p>\n\n\n\n<p>Their <a href=\"https://arxiv.org/abs/2305.12082\">work</a>, which they will present at the IEEE Symposium on Security and Privacy in May next year, shines a light on how easy it is to force generative AI models into disregarding their own guardrails and policies, known as “jailbreaking.” It also demonstrates how difficult it is to prevent these models from generating such content, as it’s included in the <a href=\"https://www.technologyreview.com/2023/08/01/1077072/these-new-tools-could-help-protect-our-pictures-from-ai/\">vast troves of data</a> they’ve been trained on, says Zico Kolter, an associate professor at Carnegie Mellon University. He demonstrated a similar form of jailbreaking on <a href=\"https://arxiv.org/pdf/2310.01405.pdf\">ChatGPT</a> earlier this year but was not involved in this research.</p>\n\n\n\n<p>“We have to take into account the potential risks in releasing software and tools that have known security flaws into larger software systems,” he says.</p>\n\n\n\n<p>All major generative AI models have safety filters to prevent users from prompting them to produce pornographic, violent, or otherwise inappropriate images. The models won’t generate images from prompts that contain sensitive terms like “<a href=\"https://www.technologyreview.com/2022/12/12/1064751/the-viral-ai-avatar-app-lensa-undressed-me-without-my-consent/\">naked</a>,” “murder,” or “sexy.”</p>\n\n\n\n<p>But this new jailbreaking method, dubbed “SneakyPrompt” by its creators from Johns Hopkins University and Duke University, uses reinforcement learning to create written prompts that look like garbled nonsense to us but that AI models learn to recognize as hidden requests for disturbing images. It essentially works by turning the way text-to-image AI models function against them.</p>\n\n\n\n<p>These models convert text-based requests into tokens—breaking words up into strings of words or characters—to process the command the prompt has given them. SneakyPrompt repeatedly tweaks a prompt’s tokens to try to force it to generate banned images, adjusting its approach until it is successful. This technique makes it quicker and easier to generate such images than if somebody had to input each entry manually, and it can generate entries that humans wouldn’t imagine trying.</p>\n\n\n\n\n\n<p>SneakyPrompt examines the prompt it has been given, searches for words known to be blocked by the models, and converts them into tokens. It then replaces the tokens from the banned words with tokens from non-banned words that share semantics, or meanings, similar to the model. For example, giving SneakyPrompt the target prompt “a naked man riding a bike” causes it to replace “naked” with the nonsense term “grponypui,” which the team successfully used to generate images of a naked man riding a bike.</p>\n\n\n\n<p>Similarly, when it was told to generate “an anatomcalifwmg couple stand outside the bar,” it recognized “anatomcalifwmg” as meaning nude, and generated an image of exactly what the prompt requested.</p>\n\n\n\n<p>“We’ve used reinforcement learning to treat the text in these models as a black box,” says Yinzhi Cao, an assistant professor at Johns Hopkins University, who co-led the study. “We repeatedly probe the model and observe its feedback. Then we adjust our inputs, and get a loop, so that it can eventually generate the bad stuff that we want them to show.”&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Breaking their own policies</h3>\n\n\n\n<p><a href=\"https://stability.ai/use-policy\">Stability AI</a> and <a href=\"https://labs.openai.com/policies/content-policy\">OpenAI</a> forbid the use of their technology to commit, promote, or incite violence or sexual violence. OpenAI also warns its users against attempting to “create, upload, or share images that are not G-rated or that could cause harm.”</p>\n\n\n\n<p>However, these policies are easily sidestepped using SneakyPrompt.&nbsp;</p>\n\n\n\n<p>“Our work basically shows that these existing guardrails are insufficient,” says Neil Zhenqiang Gong, an assistant professor at Duke University who is also a co-leader of the project. “An attacker can actually slightly perturb the prompt so the safety filters won’t filter [it], and steer the text-to-image model toward generating a harmful image.”</p>\n\n\n\n<p>Bad actors and other people intent on generating these kinds of images could run SneakyPrompt’s code, which is publicly available on GitHub, to trigger a series of automated requests to an AI image model.&nbsp;</p>\n\n\n\n<p>Stability AI and OpenAI were alerted to the group’s findings, and at the time of writing, these prompts no longer generated NSFW images on OpenAI’s DALL-E 2. Stable Diffusion 1.4, the version the researchers tested, remains vulnerable to SneakyPrompt attacks. OpenAI declined to comment on the findings but pointed MIT Technology Review towards resources on its website for improving safety in DALL·E 2, general AI safety and information about DALL·E 3.&nbsp;</p>\n\n\n\n\n\n<p>A Stability AI spokesperson said the firm was working with the SneakyPrompt researchers “to jointly develop better defense mechanisms for its upcoming models. Stability AI is committed to preventing the misuse of AI.”<br><br>Stability AI has taken proactive steps to mitigate the risk of misuse, including implementing filters to remove unsafe content from training data, ​​they added. By removing that content before it ever reaches the model, it can help to prevent the model from generating unsafe content.&nbsp;</p>\n\n\n\n<p>Stability AI says it also has filters to intercept unsafe prompts or unsafe outputs when users interact with its models, and has incorporated content labeling features to help identify images generated on our platform. “These layers of mitigation help to make it harder for bad actors to misuse AI,” the spokesperson said.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Future protection</h3>\n\n\n\n<p>While the research team acknowledges it’s virtually impossible to completely protect AI models from evolving security threats, they hope their study can help AI companies develop and implement more robust safety filters.&nbsp;</p>\n\n\n\n<p>One possible solution would be to deploy new filters designed to catch prompts trying to generate inappropriate images by assessing their tokens instead of the prompt’s entire sentence. Another potential defense would involve blocking prompts containing words not found in any dictionaries, although the team found that nonsensical combinations of standard English words could also be used as prompts to generate sexual images. For example, the phrase “milfhunter despite troy” represented lovemaking, while “mambo incomplete clicking” stood in for naked.<br><br>The research highlights the vulnerability of existing AI safety filters and should serve as a wake-up call for the AI community to bolster security measures across the board, says Alex Polyakov, co-founder and CEO of security company Adversa AI, who was not involved in the study.</p>\n\n\n\n<p>That AI models can be prompted to “break out” of their guardrails is particularly worrying in the context of information warfare, he says. They have already been exploited to produce fake content related to war events, such as the recent <a href=\"https://adversa.ai/blog/aljazeera-fake-news-investigation-burned-babies-and-an-ai-generated-dog-images/\">Israel-Hamas conflict</a>.</p>\n\n\n\n<p>“This poses a significant risk, especially given the limited general awareness of the capabilities of generative AI,” Polyakov adds. “Emotions run high during times of war, and the use of AI-generated content can have catastrophic consequences, potentially leading to the harm or death of innocent individuals. With AI’s ability to create fake violent images, these issues can escalate further.”</p>\n"}},{"title":"The Biggest Questions: What is death?","link":"https://www.technologyreview.com/2023/11/17/1082937/what-is-death/","dc:creator":{"#cdata-section":"Rachel Nuwer"},"pubDate":"Fri, 17 Nov 2023 09:00:00 +0000","category":[{"#cdata-section":"Biotechnology and health"},{"#cdata-section":"App"},{"#cdata-section":"Big Questions"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1082937"},"description":{"#cdata-section":"Just as birth certificates note the time we enter the world, death certificates mark the moment we exit it. This practice reflects traditional notions about life and death as binaries. We are here until, suddenly, like a light switched off, we are gone.&#160; But while this idea of death is pervasive, evidence is building that&#8230;"},"content:encoded":{"#cdata-section":"\n<p>Just as birth certificates note the time we enter the world, death certificates mark the moment we exit it. This practice reflects traditional notions about life and death as binaries. We are here until, suddenly, like a light switched off, we are gone.&nbsp;</p>\n\n\n\n<p>But while this idea of death is pervasive, evidence is building that it is an outdated social construct, not really grounded in biology. Dying is in fact a process—one with no clear point demarcating the threshold across which someone cannot come back.</p>\n\n\n\n<p>Scientists and many doctors have already embraced this more nuanced understanding of death. As society catches up, the implications for the living could be profound. “There is potential for many people to be revived again,” says Sam Parnia, director of critical care and resuscitation research at NYU Langone Health.&nbsp;</p>\n\n\n\n<p>Neuroscientists, for example, are learning that the brain can survive surprising levels of oxygen deprivation. This means the window of time that doctors have to reverse the death process could someday be extended. Other organs likewise seem to be recoverable for much longer than is reflected in current medical practice, opening up possibilities for expanding the availability of organ donations.</p>\n\n\n\n\n\n<p>To do so, though, we need to reconsider how we conceive of and approach life and death. Rather than thinking of death as an event from which one cannot recover, Parnia says, we should instead view it as a transient process of oxygen deprivation that has the potential to become irreversible if enough time passes or medical interventions fail. If we adopt this mindset about death, Parnia says, “then suddenly, everyone will say, ‘Let’s treat it.’”&nbsp;&nbsp;&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Moving goalposts&nbsp;</strong></h3>\n\n\n\n<p>Legal and biological definitions of death typically refer to the “irreversible cessation” of life-sustaining processes supported by the heart, lungs, and brain. The heart is the most common point of failure, and for the vast majority of human history, when it stopped there was generally no coming back.&nbsp;</p>\n\n\n\n<p>That changed around 1960, with the invention of CPR. Until then, resuming a stalled heartbeat had largely been considered the stuff of miracles; now, it was within the grasp of modern medicine. CPR forced the first major rethink of death as a concept. “Cardiac arrest” entered the lexicon, creating a clear semantic separation between the temporary loss of heart function and the permanent cessation of life.&nbsp;</p>\n\n\n\n<p>Around the same time, the advent of positive-pressure mechanical ventilators, which work by delivering breaths of air to the lungs, began allowing people who incurred catastrophic brain injury—for example, from a shot to the head, a massive stroke, or a car accident—to continue breathing. In autopsies after these patients died, however, researchers discovered that in some cases their brains had been so severely damaged that the tissue had begun to liquefy. In such cases, ventilators had essentially created “a beating-heart cadaver,” says Christof Koch, a neuroscientist at the Allen Institute in Seattle.</p>\n\n\n\n<p>These observations led to the concept of brain death and ushered in medical, ethical, and legal debate about the ability to declare such patients dead before their heart stops beating. Many countries did eventually adopt some form of this new definition. Whether we talk about brain death or biological death, though, the scientific intricacies behind these processes are far from established. “The more we characterize the dying brain, the more we have questions,” says Charlotte Martial, a neuroscientist at the University of Liège in Belgium. “It’s a very, very complex phenomenon.”&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Brains on the brink</strong></h3>\n\n\n\n<p>Traditionally, doctors have thought that the brain begins incurring damage minutes after it’s deprived of oxygen. While that’s the conventional wisdom, says Jimo Borjigin, a neuroscientist at the University of Michigan, “you have to wonder, why would our brain be built in such a fragile manner?”&nbsp;</p>\n\n\n\n\n\n<p>Recent research suggests that perhaps it actually isn’t. In 2019, scientists reported in Nature<em> </em>that they were able to <a href=\"https://www.nature.com/articles/s41586-019-1099-1\">restore a suite of functions</a> in the brains of 32 pigs that had been decapitated in a slaughterhouse four hours earlier. The researchers restarted circulation and cellular activity in the brains using an oxygen-rich artificial blood infused with a cocktail of protective pharmaceuticals. They also included drugs that stopped neurons from firing, preventing any chance that the pig brains would regain consciousness. They kept the brains alive for up to 36 hours before ending the experiment. “Our work shows there’s probably a lot more damage from lack of oxygen that’s reversible than people thought before,” says coauthor Stephen Latham, a bioethicist at Yale University.&nbsp;</p>\n\n\n\n<p>In 2022, Latham and colleagues published a second paper in Nature announcing that they’d been able to <a href=\"https://www.nature.com/articles/s41586-022-05016-1\">recover many functions in multiple organs</a>, including the brain and heart, in whole-body pigs that had been killed an hour earlier. They continued the experiment for six hours and confirmed that the anesthetized, previously dead animals had regained circulation and that numerous key cellular functions were active.&nbsp;</p>\n\n\n\n<p>“What these studies have shown is that the line between life and death isn’t as clear as we once thought,” says Nenad Sestan, a neuroscientist at the Yale School of Medicine and senior author of both pig studies. Death “takes longer than we thought, and at least some of the processes can be stopped and reversed.”&nbsp;</p>\n\n\n\n<p>A handful of studies in humans have also suggested that the brain is better than we thought at handling a lack of oxygen after the heart stops beating. “When the brain is deprived of life-sustaining oxygen, in some cases there seems to be this paradoxical electrical surge,” Koch says. “For reasons we don’t understand, it’s hyperactive for at least a few minutes.”&nbsp;</p>\n\n\n\n<p>In a study published in September in Resuscitation, Parnia and his colleagues collected brain oxygen and electrical activity data from 85 patients who experienced cardiac arrest while they were in the hospital. Most of the patients’ brain activity initially flatlined on EEG monitors, but for around 40% of them, near-normal <a href=\"https://pubmed.ncbi.nlm.nih.gov/37423492/\">electrical activity intermittently reemerged</a> in their brains up to 60 minutes into CPR.&nbsp;</p>\n\n\n\n<p>Similarly, in a study published in Proceedings of the National Academy of Sciences in May, Borjigin and her colleagues reported <a href=\"https://www.pnas.org/doi/10.1073/pnas.2216268120\">surges of activity</a> in the brains of two comatose patients after their ventilators had been removed. The EEG signatures occurred just before the patients died and had all the hallmarks of consciousness, Bojigin says. While many questions remain, such findings raise tantalizing questions about the death process and the mechanisms of consciousness.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Life after death</strong></h3>\n\n\n\n<p>The more scientists can learn about the mechanisms behind the dying process, the greater the chances of developing “more systematic rescue efforts,” Borjigin says. In best-case scenarios, she adds, this line of study could have “the potential to rewrite medical practices and save a lot of people.”&nbsp;</p>\n\n\n\n<p>Everyone, of course, does eventually have to die and will someday be beyond saving. But a more exact understanding of the dying process could enable doctors to save some previously healthy people who meet an unexpected early end and whose bodies are still relatively intact. Examples could include people who suffer heart attacks, succumb to a deadly loss of blood, or choke or drown. The fact that many of these people die and stay dead simply reflects “a lack of proper resource allocation, medical knowledge, or sufficient advancement to bring them back,” Parnia says.&nbsp;&nbsp;&nbsp;</p>\n\n\n\n<p>Borjigin’s hope is to eventually understand the dying process “second by second.” Such discoveries could not only contribute to medical advancements, she says, but also “revise and revolutionize our understanding of brain function.”</p>\n\n\n\n<p>Sestan says he and his colleagues are likewise working on follow-up studies that seek to “perfect the technology” they have used to restore metabolic function in pig brains and other organs. This line of research could eventually lead to technologies that are able to reverse damage—up to a point, of course—from oxygen deprivation in the brain and other organs in people whose hearts have stopped. If successful, the method could also expand the pool of available organ donors, Sestan adds, by lengthening the window of time doctors have to recover organs from the permanently deceased.&nbsp;</p>\n\n\n\n<p>If these breakthroughs do come, Sestan emphasizes, they will take years of research. “It’s important that we not overexaggerate and promise too much,” he says, “although that doesn’t mean we don’t have a vision.”&nbsp;</p>\n\n\n\n<p>In the meantime, ongoing investigations into the dying process will no doubt continue to challenge our notions of death, leading to sea changes within science and other realms of society, from the theological to the legal. As Parnia says: “Neuroscience doesn’t own death. We all have a stake in it.”</p>\n\n\n\n<p><em>Rachel Nuwer is a freelance science&nbsp;journalist who regularly contributes to the New York Times, Scientific American, Nature and more. Her latest book is I Feel Love: MDMA and the Quest for Connection in a Fractured&nbsp;World. She lives in&nbsp;Brooklyn.&nbsp;</em></p>\n\n\n\n<p></p>\n"}},{"title":"The Download: defining AGI, and making sense of the complicated universe","link":"https://www.technologyreview.com/2023/11/16/1083526/the-download-defining-agi-and-making-sense-of-the-complicated-universe/","dc:creator":{"#cdata-section":"Rhiannon Williams"},"pubDate":"Thu, 16 Nov 2023 13:10:00 +0000","category":{"#cdata-section":"The Download"},"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083526"},"description":{"#cdata-section":"This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. Google DeepMind wants to define what counts as artificial general intelligence AGI, or artificial general intelligence, is one of the hottest topics in tech today. It’s also one of the most controversial. A&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This is today&#8217;s edition of <a href=\"https://forms.technologyreview.com/newsletters/briefing-the-download/?_ga=2.179569122.736533416.1649661040-405833893.1649413289\">The Download</a></em>,<em> our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology.</em></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Google DeepMind wants to define what counts as artificial general intelligence</strong></p>\n\n\n\n<p>AGI, or artificial general intelligence, is one of the hottest topics in tech today. It’s also one of the most controversial. A big part of the problem is that few people agree on what the term even means.&nbsp;</p>\n\n\n\n<p>AGI typically means artificial intelligence that matches (or outmatches) humans on a range of tasks. But specifics about what counts as human-like, what tasks, and how many all tend to get waved away: AGI is AI, but better.</p>\n\n\n\n<p>Now a team of Google DeepMind researchers has put out a paper that cuts through the cross talk with not just one new definition for AGI — but a whole taxonomy of them.</p>\n\n\n\n<p>We got an exclusive insight into how the Google DeepMind team came up with their definitions—including five ascending levels of AGI—and what they’re hoping to achieve. <a href=\"https://www.technologyreview.com/2023/11/16/1083498/google-deepmind-what-is-artificial-general-intelligence-agi/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Will Douglas Heaven</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Exclusive: Behind Microsoft CEO Satya Nadella’s push to get AI tools in developers’ hands</strong></p>\n\n\n\n<p>Satya Nadella is obsessed with developers. The Microsoft CEO has been doing the rounds at various conferences over the past few weeks, surprising attendees at OpenAI’s DevDay and GitHub Universe with unannounced appearances last week.</p>\n\n\n\n<p>He also took to the stage yesterday speaking to developers at Microsoft Ignite, explaining all the ways in which devs can take advantage of its new AI-based tools to build exciting new systems and experiences. But he also had a message: The way we create software is fundamentally changing.<br><br>Nadella took time out of his busy schedule to sit down with Mat Honan, our editor in chief, to discuss the transition to natural language AI tools, some of which he argues will lower the barrier to entry for software development, and ultimately lead to a new era of creativity. <a href=\"https://www.technologyreview.com/2023/11/15/1083426/behind-microsoft-ceo-satya-nadellas-push-to-get-ai-tools-in-developers-hands/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Why is the universe so complex and beautiful?</strong></p>\n\n\n\n<p>Why isn’t the universe boring? It could be. It could be just a monotonous desert of sameness. Instead, we have a universe filled with stars and planets, canyons and waterfalls, pine trees and people. But why is any of this stuff here?</p>\n\n\n\n<p>Cosmologists have pieced together an answer to this question over the past half-century, using a variety of increasingly complex experiments and observational instruments. But as is nearly always the case in science, that answer is incomplete.&nbsp;</p>\n\n\n\n<p>Now, with new experiments of breathtaking sensitivity, physicists are hoping to spot a never-before-seen event that could explain one of the great remaining mysteries in that story: why there was any matter around to form complicated things in the first place. <a href=\"https://www.technologyreview.com/2023/11/16/1083141/why-is-the-universe-so-complex-and-beautiful/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Adam Becker</em></p>\n\n\n\n<p><strong><em>‘Why is the universe so complex and beautiful?’</em></strong><strong> <em>is part of our new mini-series </em></strong><a href=\"https://www.technologyreview.com/supertopic/the-biggest-questions/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong><em>The Biggest Questions</em></strong></a><strong><em>, which explores how technology is helping probe some of the deepest, most mind-bending mysteries of our existence.</em></strong></p>\n\n\n\n<p><strong><em>Read more:&nbsp;</em></strong></p>\n\n\n\n<p><strong>+ How did life begin? </strong>AI is helping chemists unpick the mysteries around the origins of life and detect signs of it on other worlds. <a href=\"https://www.technologyreview.com/2023/11/14/1082828/how-did-life-begin/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p>+ <strong>Are we alone in the universe?</strong> Scientists are training machine-learning models and designing instruments to hunt for life on other worlds. <a href=\"https://www.technologyreview.com/2023/11/13/1082873/the-biggest-questions-are-we-alone-in-the-universe/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p>+ <strong>Is it possible to really understand someone else’s mind?</strong> How we think, feel and experience the world is a mystery to everyone but us. But technology may be starting to help us understand the minds of others. <a href=\"https://www.technologyreview.com/2023/11/15/1083250/is-it-possible-to-really-understand-someone-elses-mind/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What’s coming next for fusion research</strong></p>\n\n\n\n<p>The concept behind fusion is pretty simple: the power source could provide consistent energy from widely available fuel without producing radioactive waste. But making a fusion power plant a reality will require a huge amount of science and technology progress. Though some milestones have been reached, many are yet to come.</p>\n\n\n\n<p>The Lawrence Livermore National Laboratory made headlines around the world when it achieved what’s called net energy gain, finally demonstrating that fusion reactions can generate more energy than is used to start them up, last year.</p>\n\n\n\n<p>This week at our EmTech MIT event, our climate reporter Casey Crownhart sat down with Kimberly Budil, the lab’s director, to hear more about this moment for fusion research, where the national labs fit in, and where we go from here. <a href=\"https://www.technologyreview.com/2023/11/16/1083491/whats-coming-next-for-fusion-research/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><strong>This story is from The Spark, our weekly newsletter giving you the inside track on all things climate and energy. </strong><a href=\"https://forms.technologyreview.com/newsletters/climate-energy-the-spark/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>Sign up</strong></a><strong> to receive it in your inbox every Wednesday.</strong></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The must-reads</strong></p>\n\n\n\n<p><em>I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.</em></p>\n\n\n\n<p><strong>1 US investigators don’t know how many times Cruise cars have hit people</strong><br>Mainly because its safety incident reporting system isn’t fit for purpose. (<a href=\"https://www.404media.co/feds-have-no-idea-how-many-times-cruise-driverless-cars-hit-pedestrians/\">404 Media</a>)<br>+ <em>Robotaxis are here. It’s time to decide what to do about them. </em>(<a href=\"https://www.technologyreview.com/2023/06/23/1074270/obotaxis-decision-time/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>2 Antisemitic and Islamophobic hate speech is surging online</strong><br>The Israel-Gaza conflict is driving a huge spike in hate speech across both mainstream and more niche social platforms. (<a href=\"https://www.nytimes.com/2023/11/15/technology/hate-speech-israel-gaza-internet.html\">NYT</a> $)<br>+ <em>Google workers are protesting its contract with the Israeli government. </em>(<a href=\"https://theintercept.com/2023/11/15/google-israel-gaza-nimbus-protest/\">The Intercept</a>)<br>+ <em>How scientists are being squeezed to take sides in the conflict between Israel and Palestine. </em>(<a href=\"https://www.technologyreview.com/2023/10/27/1082524/science-biology-israel-hamas-war/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>3 SpaceX is preparing to launch its Starship rocket tomorrow</strong><br>It’s been seven long months since its first launch test exploded mid-air. (<a href=\"https://www.theverge.com/2023/11/15/23873201/spacex-starship-faa-approval-super-heavy-launch-test-date\">The Verge</a>)<br>+ <em>The FFA is confident everything should run smoothly a second time. </em>(<a href=\"https://www.cnbc.com/2023/11/15/faa-clears-spacex-to-launch-second-starship-flight.html\">CNBC</a>)<br>+ <em>Japan’s Ispace startup is planning a second launch, too. </em>(<a href=\"https://www.bloomberg.com/news/articles/2023-11-16/japan-s-ispace-to-launch-second-moon-mission-after-crash-landing?srnd=technology-vp&amp;sref=E9Urfma4\">Bloomberg</a> $)</p>\n\n\n\n<p><strong>4 Nutrition influencers have landed in hot water</strong><br>US regulators are clamping down on health social media stars who fail to disclose their financial backers. (<a href=\"https://www.washingtonpost.com/wellness/2023/11/15/ftc-food-industry-dietitians-tiktok/\">WP</a> $)<br>+ <em>The AI doctor will see you now. </em>(<a href=\"https://www.theinformation.com/articles/healthcare-without-health-workers-a-unicorn-pivots-to-an-ai-doctor-in-a-box?rc=e9y5ks\">The Information</a> $)</p>\n\n\n\n<p><strong>5 Meta is loosening its political advertising rules<br></strong>Including allowing ads critiquing the 2020 US Presidential election’s legitimacy. (<a href=\"https://www.wsj.com/tech/meta-allows-ads-claiming-rigged-2020-election-on-facebook-instagram-309b678d?mod=tech_lead_story\">WSJ</a> $)<br>+ <em>The company is fighting back against the EU’s accusation that it&#8217;s a gatekeeper. </em>(<a href=\"https://www.reuters.com/technology/tiktok-joins-meta-appealing-against-eu-gatekeeper-status-2023-11-16/\">Reuters</a>)</p>\n\n\n\n<p><strong>7 The complicated reality of deepfakes<br></strong>Synthetic media is worrying—but its real, tangible harms have yet to be realized. (<a href=\"https://www.newyorker.com/magazine/2023/11/20/a-history-of-fake-things-on-the-internet-walter-j-scheirer-book-review\">New Yorker</a> $)<br>+ <em>The biggest threat of deepfakes isn’t the deepfakes themselves. </em>(<a href=\"https://www.technologyreview.com/2019/10/10/132667/the-biggest-threat-of-deepfakes-isnt-the-deepfakes-themselves/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>8 Teenagers are being exposed to traumatic content while training AI<br></strong>&nbsp;Underage workers are labeling vast datasets for AI firms, and witnessing the internet’s worst offerings in the process. (<a href=\"https://www.wired.com/story/artificial-intelligence-data-labeling-children/\">Wired</a> $)<br>+ <em>Google is starting to let teens use its Bard chatbot. </em>(<a href=\"https://www.theverge.com/2023/11/15/23963230/google-bard-teens-guardrails\">The Verge</a>)<br>+ <em>We are all AI’s free data workers. </em>(<a href=\"https://www.technologyreview.com/2023/06/13/1074560/we-are-all-ais-free-data-workers/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>9 A new treatment for Alzheimer’s could be on the horizon</strong><br>Harnessing young neurons could help to preserve a person’s memory. (<a href=\"https://www.economist.com/science-and-technology/2023/11/15/some-scientists-think-newborn-neurons-could-reverse-alzheimers\">Economist</a> $)</p>\n\n\n\n<p><strong>10 Cassette tapes refuse to die</strong><br>A full 60 years after the very first compact cassette went on sale. (<a href=\"https://www.theguardian.com/music/2023/nov/15/cassette-tapes-books-mixtape\">The Guardian</a>)</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Quote of the day</strong></p>\n\n\n\n<p class=\"has-large-font-size\"><strong>“Your 2024 glow up starts now!”</strong></p>\n\n\n\n<p>—Jodie Taylor, a lifestyle content creator, urges her TikTok followers to start working towards achieving their new year’s resolutions as early as September, <a href=\"https://www.nytimes.com/2023/11/15/style/new-year-resolutions-tiktok.html\">the New York Times</a> reports.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The big story</strong></p>\n\n\n\n<p><strong>This artist is dominating AI-generated art. And he’s not happy about it.</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://www.technologyreview.com/2022/09/16/1059598/this-artist-is-dominating-ai-generated-art-and-hes-not-happy-about-it/?truid=*|LINKID|*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*|SUBCLASS|*&amp;utm_content=*|DATE:m-d-Y|*\"><img decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/MfkaBZin1zBuFdwk-EtehFV7qvq2K1LrMiwc62dsHzTiO-dHlGdHdrFCkImFbyxmBHV7Wvlbk1XG65IvVmSeR-U2uOV7JqbKuHy87e8meFLbfTZRN6LfVCFondFWU3k4hEkGA_yAzdQy_Q_1CTxn3wU\" alt=\"\"/></a></figure>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2022/09/16/1059598/this-artist-is-dominating-ai-generated-art-and-hes-not-happy-about-it/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"></a><strong>September 2022</strong></p>\n\n\n\n<p>Greg Rutkowski is a Polish digital artist who uses classical styles to create dreamy landscapes. His distinctive style has been used in some of the world’s most popular fantasy games, including Dungeons and Dragons and Magic: The Gathering.</p>\n\n\n\n<p>Now he’s become a hit in the new world of text-to-image AI generation. His name is one of the most commonly used prompts in the open-source AI art generator Stable Diffusion.</p>\n\n\n\n<p>But this and other open-source programs are built by scraping images from the internet, often without permission and proper attribution to artists. As a result, they are raising tricky questions about ethics and copyright. And artists like Rutkowski have had enough. <a href=\"https://www.technologyreview.com/2022/09/16/1059598/this-artist-is-dominating-ai-generated-art-and-hes-not-happy-about-it/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Melissa Heikkilä</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>We can still have nice things</strong></p>\n\n\n\n<p><em>A place for comfort, fun and distraction in these weird times. (Got any ideas? </em><a href=\"mailto:rhiannon.williams@technologyreview.com\"><em>Drop me a line</em></a><em> or </em><a href=\"https://twitter.com/yannon_\"><em>tweet &#8217;em at me</em></a><em>.)</em></p>\n\n\n\n<p>+ As websites go, they don’t get much better than <a href=\"https://www.pimpthatsnack.com/\">Pimp That Snack</a>.<br>+ This <a href=\"https://www.tiktok.com/@synthonylive/video/7294837481399192840?_r=1&amp;_t=8gwtivgsPE9\">saxophonist</a> is having the absolute time of his life.<br>+ Upload a drawing to Meta’s system, and turn it into a clever lil <a href=\"https://sketch.metademolab.com/\">animation</a>.<br>+ <a href=\"https://www.youtube.com/watch?v=JW9UZeTnVhk\">Water</a> is a real challenge to represent in video games—but it’s getting better all the time.<br>+ The only brief history I’m interested in is the brief history of <a href=\"https://dailynexus.com/2022-11-17/how-mashed-potatoes-became-a-smash-hit-a-brief-history/#:~:text=The%20Andes%20people%20were%20thought,restricted%20to%20aristocracy%2C%20made%20it\">mashed potatoes</a>.</p>\n"}},{"title":"2023 Global Cloud Ecosystem","link":"https://www.technologyreview.com/2023/11/16/1078645/2023-global-cloud-ecosystem/","dc:creator":{"#cdata-section":"MIT Technology Review Insights"},"pubDate":"Thu, 16 Nov 2023 12:00:00 +0000","category":[{"#cdata-section":"Computing"},{"#cdata-section":"sponsored"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1078645"},"description":{"#cdata-section":"The cloud, fundamentally a tool for cost and resource efficiency, has long enabled companies and countries to organize around digital-first principles. It is an established capability that improves the bottom line for enterprises. However, maturity lags, and global standards are sorely needed. Cloud capabilities play a crucial role in accelerating the global economy’s next stage&#8230;"},"content:encoded":{"#cdata-section":"\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"Global Cloud Ecosystem Report by MIT Technology Review Insights in partnership with #InfosysCobalt\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Iq_I1-pASDo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>The cloud, fundamentally a tool for cost and resource efficiency, has long enabled companies and countries to organize around digital-first principles. It is an established capability that improves the bottom line for enterprises. However, maturity lags, and global standards are sorely needed.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large\"><img decoding=\"async\" fetchpriority=\"high\" width=\"2480\" height=\"3189\" src=\"https://wp.technologyreview.com/wp-content/uploads/2023/11/MITTR-Infosys_V20C0ver.png?w=1555\" alt=\"\" class=\"wp-image-1082952\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2023/11/MITTR-Infosys_V20C0ver.png 2480w, https://wp.technologyreview.com/wp-content/uploads/2023/11/MITTR-Infosys_V20C0ver.png?resize=233,300 233w, https://wp.technologyreview.com/wp-content/uploads/2023/11/MITTR-Infosys_V20C0ver.png?resize=768,988 768w, https://wp.technologyreview.com/wp-content/uploads/2023/11/MITTR-Infosys_V20C0ver.png?resize=1555,2000 1555w, https://wp.technologyreview.com/wp-content/uploads/2023/11/MITTR-Infosys_V20C0ver.png?resize=1195,1536 1195w, https://wp.technologyreview.com/wp-content/uploads/2023/11/MITTR-Infosys_V20C0ver.png?resize=1593,2048 1593w\" sizes=\"(max-width: 2480px) 100vw, 2480px\" /></figure></div>\n\n\n\n\n\n\n<p>Cloud capabilities play a crucial role in accelerating the global economy’s next stage of digital transformation. Results from our 2023 Global Cloud Ecosystem survey of executives indicate there are two stages of cloud maturity globally: one where firms adopt cloud to achieve essential opex and capex cost reduction, and a second where firms link cloud investments to a positive business value. Respondents indicate the two are converging quickly.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-left is-layout-flex wp-container-1 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button has-custom-font-size is-style-fill\" style=\"font-size:16px\"><a class=\"wp-block-button__link has-black-color has-pale-cyan-blue-background-color has-text-color has-background wp-element-button\" href=\"https://ter.li/2023-global-cloud-ecosystem\" style=\"border-radius:4px\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>DOWNLOAD THE REPORT</strong></a></div>\n</div>\n\n\n\n<p>The key findings are as follows:</p>\n\n\n\n<ul>\n<li>Cloud helps the top and bottom line globally. Cloud computing infrastructure investment will be more than 60% of all IT infrastructure spend worldwide in 2023, according to analyst firm IDC, as flexible cloud resources continue to define efficiency and productivity for technology decision-makers. More than eight out of 10 survey respondents report more cost efficiency due to cloud deployments. While establishing a link between cloud capabilities and top-line profitability is challenging, 82% say they are currently tracking cloud ROI, and 66% report positive ROI from cloud investments.</li>\n</ul>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img decoding=\"async\" width=\"1795\" height=\"815\" src=\"https://wp.technologyreview.com/wp-content/uploads/2023/08/cropped-FIG_Cloudisgoodbusinessculture.png\" alt=\"\" class=\"wp-image-1078657\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2023/08/cropped-FIG_Cloudisgoodbusinessculture.png 1795w, https://wp.technologyreview.com/wp-content/uploads/2023/08/cropped-FIG_Cloudisgoodbusinessculture.png?resize=300,136 300w, https://wp.technologyreview.com/wp-content/uploads/2023/08/cropped-FIG_Cloudisgoodbusinessculture.png?resize=768,349 768w, https://wp.technologyreview.com/wp-content/uploads/2023/08/cropped-FIG_Cloudisgoodbusinessculture.png?resize=1536,697 1536w\" sizes=\"(max-width: 1795px) 100vw, 1795px\" /></figure></div>\n\n\n<ul>\n<li>Cloud-centric organizations expect strong data governance (but don’t always get it). Strong data privacy protection and governance is essential to accelerate cloud adoption. Perceptions of national data sovereignty and privacy frameworks vary, underscoring the lack of global standards. Most respondents decline to say their countries are leaders in the space, but more than two-thirds say they keep pace.</li>\n</ul>\n\n\n\n<ul>\n<li>All in for zero-trust. Public and hybrid cloud assets raise cybersecurity concerns. But cloud is required to grow AI and automation, which help secure digital assets with data cataloging, access, and visibility. Because of the risk associated with AI, the broad surface of the data it draws on, and the way AI generates change, the zero-trust user paradigm has gained wide acceptance across industries. Some 86%of the survey respondents use zero-trust architecture. However, one-third do not routinely identify and classify cloud assets.</li>\n</ul>\n\n\n\n<ul>\n<li>Sustainability in the cloud. The cloud’s primary function—scaling up computing resources—is a key enabler that mitigates compliance issues such as security; privacy; and environment, social, and governance (ESG). More than half (54%) of respondents say they use cloud tools for ESG reporting and compliance, and a large number (51%) use cloud to enhance diversity, equity, and inclusion (DEI) compliance.</li>\n</ul>\n\n\n\n<p><em><a href=\"https://ter.li/2023-global-cloud-ecosystem\" target=\"_blank\" rel=\"noreferrer noopener\">Download the full report.</a></em></p>\n\n\n\n<p><em>This content was produced by Insights, the custom content arm of MIT Technology Review. It was not written by MIT Technology Review’s editorial staff.</em></p>\n"}},{"title":"What’s coming next for fusion research","link":"https://www.technologyreview.com/2023/11/16/1083491/whats-coming-next-for-fusion-research/","dc:creator":{"#cdata-section":"Casey Crownhart"},"pubDate":"Thu, 16 Nov 2023 11:00:00 +0000","category":[{"#cdata-section":"Climate change and energy"},{"#cdata-section":"App"},{"#cdata-section":"The Spark"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083491"},"description":{"#cdata-section":"This article is from The Spark, MIT Technology Review’s weekly climate newsletter. To receive it in your inbox every Wednesday, sign up here. We’ve covered the dream of fusion before in this newsletter: the power source could provide consistent energy from widely available fuel without producing radioactive waste.&#160; But making a fusion power plant a&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This article is from The Spark, MIT Technology Review’s weekly climate newsletter. To receive it in your inbox every Wednesday, </em><a href=\"https://forms.technologyreview.com/newsletters/climate-energy-the-spark/\" target=\"_blank\" rel=\"noreferrer noopener\"><em>sign up here</em></a><em>.</em></p>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2023/09/28/1080352/why-the-dream-of-fusion-power-isnt-going-away/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">We’ve covered the dream of fusion before in this newsletter</a>: the power source could provide consistent energy from widely available fuel without producing radioactive waste.&nbsp;</p>\n\n\n\n<p>But making a fusion power plant a reality will require a huge amount of science and technology progress. Though some milestones have been reached, many are yet to come. At our EmTech MIT event this week, I sat down with <a href=\"https://www.llnl.gov/kim-budil\" target=\"_blank\" rel=\"noreferrer noopener\">Kimberly Budil</a>, director of the Lawrence Livermore National Laboratory (LLNL).&nbsp;</p>\n\n\n\n<p>She was at the center of the science news world last year, when researchers from the national lab achieved what’s called <strong>net energy gain, finally demonstrating that fusion reactions can generate more energy than is used to start them up.&nbsp;</strong></p>\n\n\n\n<p>During our conversation on stage, I asked her about this moment for fusion research, where the national labs fit in, and where we go from here.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The moment</strong></h3>\n\n\n\n<p>In December 2022, a group of scientists sat in a control room that looked like something out of a space mission. They focused 2 million joules of laser energy onto a target about the size of a pea. Hydrogen fuel inside that target began to compress, releasing energy as the atoms inside fused together.&nbsp;</p>\n\n\n\n\n\n<p>And this time, <a href=\"https://www.technologyreview.com/2022/12/13/1064898/what-fusions-breakthrough-means-for-clean-energy/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">more energy came out than what went in</a>—something that had never happened before.</p>\n\n\n\n<p>“This was really just a moment of great joy and vindication for all of the thousands of people who have poured their heart and soul into this pursuit over many decades,” Budil told me on stage at the event.&nbsp;</p>\n\n\n\n<p>Many people thought it would never work, she explained—that the lab would never get to the level of precision needed with the lasers, or get the targets perfect enough to house the reaction. “The laser is a miracle, a modern engineering miracle,” she said during her talk. And “the targets are incredible, precision works of art.”&nbsp;</p>\n\n\n\n<p>It’s “very, very hard to make fusion work,” Budil told me. And the moment researchers achieved net energy didn’t represent the finish line, but one milestone in a series of many still to come.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The aftermath</strong></h3>\n\n\n\n<p>After the first successful demonstration of net energy gain, “the first priority was to repeat it,” Budil said. “But the next five shots were duds. They really did not work.”&nbsp;</p>\n\n\n\n<p>It seemed to be mostly a problem with the targets, those tiny fuel pellets that the lasers shoot at. The targets need to be virtually perfect, with no defects. Making one takes around seven months from start to finish.&nbsp;</p>\n\n\n\n<p>It wound up taking around six months to repeat the initial success, but over the summer, the lab achieved the highest energy gain to date. The team achieved net energy gain twice more in October.&nbsp;</p>\n\n\n\n<p>There’s still a lot to learn about fusion, and researchers are trying to do just that with these repeated attempts. On stage, Budil ticked through some of the questions they still had: Could the scientists make changes to the targets? Alter the laser pulse shape? Turn the energy up?&nbsp;</p>\n\n\n\n<p>There’s been steady progress on the science and engineering behind fusion energy for decades, Budil said, but new questions always come up as progress gets made.&nbsp;</p>\n\n\n\n<p>I asked her when she thought this energy source might be ready for prime time. “My best guess is that you could have a demo power plant in 20 years,” she told me. Some startups are making bolder claims than that, predicting a decade or less, “but I think the challenges are much more significant than people realized at the beginning. Plasmas are really complicated,” she said.&nbsp;</p>\n\n\n\n\n\n<p>Ultimately, researchers at the national lab won’t be the ones to build a power plant: that’s the role of the private sector, Budil says. But the researchers plan to keep working as part of the growing ecosystem of fusion.&nbsp;</p>\n\n\n\n<p>Budil counsels a bit of patience as researchers around the world work to reach the next big fusion milestone: “The fusion community is definitely known for its irrational exuberance. My job for the last year has been half to get people excited about big science and public science, and the other half is to manage expectations for fusion energy, because it’s going to be very hard.”&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Related reading</strong></h3>\n\n\n\n<p>The road to this moment in fusion has been a long one. <a href=\"https://www.technologyreview.com/2022/02/23/1044740/archives-fusion-power/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">Check out some of our old magazine covers on the topic</a>, from as early as 1972.&nbsp;&nbsp;</p>\n\n\n\n<p>The dream of fusion power isn’t going away, <a href=\"https://www.technologyreview.com/2023/09/28/1080352/why-the-dream-of-fusion-power-isnt-going-away/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">as I wrote in a newsletter earlier this fall.</a></p>\n\n\n\n<p>The first net energy gain in a fusion reactor was a huge moment, but the ultimate application for energy is <a href=\"https://www.technologyreview.com/2022/12/13/1064898/what-fusions-breakthrough-means-for-clean-energy/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">still many breakthroughs away.</a></p>\n\n\n\n<p>Helion says its first fusion plant will be online as soon as 2028. Experts are skeptical of this and other ambitious timeline announcements, <a href=\"https://www.technologyreview.com/2023/05/10/1072812/this-startup-says-its-first-fusion-plant-is-five-years-away-experts-doubt-it/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">as my colleague James Temple covered earlier this year.</a></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Keeping up with climate&nbsp;&nbsp;</strong></h3>\n\n\n\n<p><strong>The US and China have agreed to work together to ramp up renewables and cut emissions. </strong>The agreement comes as President Biden and President Xi Jinping meet in person this week.<strong> </strong>(<a href=\"https://www.nytimes.com/2023/11/14/climate/us-china-climate-agreement.html\" target=\"_blank\" rel=\"noreferrer noopener\">New York Times</a>)</p>\n\n\n\n<p><strong>The first planned small-scale nuclear plant in the US is officially no more.</strong> Startup NuScale canceled plans for the project after it failed to line up enough customers willing to pay the rising cost of electricity. (<a href=\"https://www.wired.com/story/first-small-scale-nuclear-plant-us-nuscale-canceled/\" target=\"_blank\" rel=\"noreferrer noopener\">Wired</a>)</p>\n\n\n\n<p>→ We were promised smaller nuclear reactors. Where are they? (<a href=\"https://www.technologyreview.com/2023/02/08/1067992/smaller-nuclear-reactors/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>A German flow-battery company, CMBlu, just pulled in $100 million in funding. </strong>The money is a big boon for a technology that has long struggled to bring the cost savings it’s promised. (<a href=\"https://www.canarymedia.com/articles/energy-storage/will-this-startup-finally-crack-the-code-on-flow-battery-tech\" target=\"_blank\" rel=\"noreferrer noopener\">Canary Media</a>)</p>\n\n\n\n<p><strong>Car dealerships aren’t ready, or in some cases very willing, to sell electric vehicles.</strong> That could undermine progress on cleaning up transportation. (<a href=\"https://www.washingtonpost.com/climate-solutions/2023/11/09/car-dealerships-ev-sales/\" target=\"_blank\" rel=\"noreferrer noopener\">Washington Post</a>)</p>\n\n\n\n<p>Electrifying heating systems and other appliances in homes could be a major part of cleaning up emissions attributed to buildings. <strong>The problem is, renters might have trouble taking advantage of existing incentives for home electrification.</strong> (<a href=\"https://www.theverge.com/2023/11/14/23951104/apartment-rent-electrify-appliance-pollution-incentives\" target=\"_blank\" rel=\"noreferrer noopener\">The Verge</a>)</p>\n\n\n\n<p><strong>Exxon Mobil is setting up a facility to produce lithium, a key material for the batteries that power EVs. </strong>It’s a new foray for the fossil-fuel giant. (<a href=\"https://www.nytimes.com/2023/11/13/business/energy-environment/exxon-mobil-lithium-arkansas.html\" target=\"_blank\" rel=\"noreferrer noopener\">New York Times</a>)</p>\n\n\n\n<p><strong>A new wave of startups is working to address the threat of wildfires. </strong>The field, increasingly termed “firetech,” can help prevent fires, or detect them once they start. (<a href=\"https://www.canarymedia.com/articles/climate-crisis/a-new-wave-of-startups-is-tackling-a-huge-emissions-source-wildfires\" target=\"_blank\" rel=\"noreferrer noopener\">Canary Media</a>)</p>\n\n\n\n<p>Companies are racing to set up massive insect farms. The bugs can provide protein for animal feed, in a method that could help cut emissions from agriculture. (<a href=\"https://www.washingtonpost.com/climate-solutions/2023/11/12/biggest-insect-farm-record/\" target=\"_blank\" rel=\"noreferrer noopener\">Washington Post</a>)</p>\n\n\n\n<p><strong>Floods, heat waves, storms, and fires fueled by climate change are getting worse across the US. </strong>The hazards will increase unless greenhouse-gas emissions are cut quickly, according to a new report from the US government. (<a href=\"https://www.bloomberg.com/news/features/2023-11-14/nowhere-is-safe-from-worsening-climate-change-new-us-report-warns?srnd=green\" target=\"_blank\" rel=\"noreferrer noopener\">Bloomberg</a>)</p>\n"}},{"title":"The Biggest Questions: Why is the universe so complex and beautiful?","link":"https://www.technologyreview.com/2023/11/16/1083141/why-is-the-universe-so-complex-and-beautiful/","dc:creator":{"#cdata-section":"Adam Becker"},"pubDate":"Thu, 16 Nov 2023 10:00:00 +0000","category":[{"#cdata-section":"Space"},{"#cdata-section":"App"},{"#cdata-section":"Big Questions"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083141"},"description":{"#cdata-section":"Why isn’t the universe boring? It could be. The number of subatomic particles in the universe is about 1080, a 1 with 80 zeros after it. Scatter those particles at random, and the universe would just be a monotonous desert of sameness, a thin vacuum without any structure much larger than an atom for billions&#8230;"},"content:encoded":{"#cdata-section":"\n<p>Why isn’t the universe boring? It could be. The number of subatomic particles in the universe is about 10<sup>80</sup>, a 1 with 80 zeros after it. Scatter those particles at random, and the universe would just be a monotonous desert of sameness, a thin vacuum without any structure much larger than an atom for billions of light-years in any direction. Instead, we have a universe filled with stars and planets, canyons and waterfalls, pine trees and people. There is an exuberant plenty to nature. But why is any of this stuff here?</p>\n\n\n\n<p>Cosmologists have pieced together an answer to this question over the past half-century, using a variety of increasingly complex experiments and observational instruments. But as is nearly always the case in science, that answer is incomplete. Now, with new experiments of breathtaking sensitivity, physicists are hoping to spot a never-before-seen event that could explain one of the great remaining mysteries in that story: why there was any matter around to form complicated things in the first place.&nbsp;</p>\n\n\n\n<p>The interestingness of the world around us is all the more puzzling when you look at the universe on the largest scales. You find structured clumpiness for a while. Stars form galaxies, galaxies form galaxy clusters, and those clusters form superclusters and filaments and walls around great cosmic voids nearly empty of matter.&nbsp;</p>\n\n\n\n<p>But when you zoom out even further, looking at chunks of the universe more than 300 million light-years wide, all that structure fades away. Past this point, the light from all the stars in the cosmos merges into an indistinct blur, and the universe does indeed look quite boringly similar in all directions, with no features or differences of note anywhere. Cosmologists call this the “end of greatness.”&nbsp;</p>\n\n\n\n\n\n<p>This tedious cosmic landscape exists because the universe really was boring once. Shortly after the Big Bang, and for hundreds of thousands of years after that, it was relentlessly dull. All that existed was a thick red-hot haze of particles, stretching for trillions upon trillions of kilometers and filling every point in the universe almost evenly, with minuscule differences in the density of matter between one spot and another.</p>\n\n\n\n<p>But as the universe expanded and cooled, gravity amplified those tiny differences. Slowly, over the following millions and billions of years, the places in the universe with slightly more stuff attracted even more stuff. And that’s where we came from—the profusion of things in the universe today eventually arose as more and more material accumulated, making those slightly over-dense regions into radically complicated places packed with enough matter to form stars, galaxies, and us. On the very largest scales, boredom still reigns, as it has since the beginning of time. But down here in the dirt, there’s ample variety.</p>\n\n\n\n<p>This story still has some holes. For one thing, it is not clear where the matter came from in the first place. Particle physics demands that anything that creates matter must also create an equal amount of antimatter, carefully conserving the balance between the two. Every kind of matter particle has an antimatter twin that behaves like matter in nearly every way. But when a matter particle comes into contact with its antimatter counterpart, they annihilate each other, disappearing and leaving behind nothing but radiation.&nbsp;</p>\n\n\n\n<p>That’s exactly what happened right after the Big Bang. Matter and antimatter annihilated, leaving our universe aglow with radiation—and a small amount of leftover matter, which had slightly exceeded the amount of antimatter at the start. This tiny mismatch made the difference between the universe we have today and an eternity of tedium, and we don’t know why it happened. “Somehow there was this little imbalance and it turned into everything—namely, us. I really care about us,” says Lindley Winslow, an experimental particle physicist at MIT. “We have a lot of questions about the universe and how it evolved. But this is a pretty basic kindergarten sort of question of, okay, why are we here?”</p>\n\n\n\n<h3 class=\"wp-block-heading\">Caught in the act</h3>\n\n\n\n<p>To answer this question, Winslow and other physicists around the world have constructed several experiments to catch nature in the act of violating the balance between matter and antimatter. They hope to see that violation in the form of&nbsp;neutrinoless double-beta decay, a type of radioactive decay. At the moment, that process is theoretical—it may not happen at all. But if it does, it would provide a possible explanation for the imbalance between matter and antimatter in the early universe.&nbsp;</p>\n\n\n\n\n\n<p>That explanation would rely on neutrinos, the ghostly oddballs of particle physics. These lightweight specters whiz about the universe, barely interacting with anything. Trillions of neutrinos are constantly streaming through every square centimeter of your body and the entire planet Earth, ignoring you just as completely as they ignore the iron core of our planet. Reliably stopping just one neutrino would take a slab of lead a light-year thick.&nbsp;</p>\n\n\n\n<p>And neutrinos might perform an even more bizarre trick. The neutrino and its antimatter partner could be one and the same, making it different from every other known form of matter and capable of annihilating itself. “If we observed [neutrinoless double-beta decay], it would prove that the neutrino is its own antiparticle,” says Winslow. “It would also provide us a process that makes more matter than antimatter.”</p>\n\n\n\n<p>That process starts in the heart of the atom. When some unstable atomic nuclei decay, they emit an electron along with an antineutrino to counterbalance it: one particle of matter and one of antimatter. This is a very common kind of radioactive decay, known for historical reasons as beta decay. Significantly less common is double-beta decay, when an atomic nucleus emits two electrons at once, along with two antineutrinos to balance them out.&nbsp;</p>\n\n\n\n<p>Double-beta decay is “one of the longest processes that we’ve ever measured,” says Winslow. To see a single atom undergo double-beta decay, she continues, we would typically have to wait a billion times longer than the current age of the universe. But if the neutrino is its own antiparticle, there’s the possibility of something even more rare than that: a double-beta decay where the two neutrinos annihilate each other immediately, leaving only the two electrons without any antimatter to counterbalance them. This is neutrinoless double-beta decay.</p>\n\n\n\n<p>Spotting such a rare process would be difficult—but not impossible, thanks to the phenomenally huge number of atoms in objects of everyday size. There are nearly a trillion trillion atoms in a few grams of material. “So if you just pile up a bunch of stuff, you just have the possibility of seeing something that happens in timelines even longer than the age of the universe,” says Winslow.&nbsp;</p>\n\n\n\n<p>This is the approach taken by the Cryogenic Underground Observatory for Rare Events (CUORE, Italian for “heart”), a detector under a mountain in Italy that is waiting for evidence of neutrinoless double-beta decay. A certain isotope of tellurium is one of the nuclei susceptible to double-beta decay. CUORE watches for it in a set of 988 five-centimeter-wide cubic crystals of tellurium dioxide, each connected to a highly sensitive thermometer. The combined energy of the two electrons emitted in neutrinoless double-beta decay is the same every time, so if the decay occurs anywhere within one of these crystals, that specific amount of energy will be deposited into the crystal as heat, raising its temperature by one ten-thousandth of a degree Celsius.</p>\n\n\n\n<p>But a signal that small is hard to see against all the other things that could change the temperature of a crystal. That’s why CUORE is under a mountain—the bulk of the rock above it shields it from nearly all cosmic rays. And that’s also why CUORE needs to be kept phenomenally cold, just a few thousandths of a degree above absolute zero—it “wins the award for coldest cubic meter in the known universe,” says Winslow. The sensors are so exquisitely sensitive that they can even pick up vibrations from waves crashing on the beach, 60 kilometers away.</p>\n\n\n\n<p>CUORE isn’t alone. There are other experiments looking for neutrinoless double-beta decay, including KamLAND-Zen, an experiment—also under a mountain—in Japan, using gaseous xenon in place of tellurium crystals. But none of the experiments searching for the decay have seen it yet, despite years of waiting. There are plans to upgrade the sensors at CUORE and increase the number of crystals being used; there are also plans to increase the size and sensitivity of KamLAND-Zen. But the future of these experiments is uncertain.&nbsp;</p>\n\n\n\n\n\n<p>“In principle, we could make bigger, better experiments,” says Reina Maruyama, a physicist at Yale who is also part of the CUORE collaboration. “You could make 10 of what we have. And so I think it just becomes a matter of how much resources humankind wants to put into this experiment.” Winslow estimates that a full search would require two more rounds of improvements to existing experiments. If those are done and they come up empty-handed, she says, “then we will have pretty much eliminated the possibility of the neutrino being its own antiparticle.”</p>\n\n\n\n<p>If that happens, it’s the end of a promising theory, but not the end of the search. Physicists have plenty of other ideas about how matter and antimatter could have become imbalanced. But finding evidence for those ideas is hard. Some could be confirmed if the Large Hadron Collider, the largest particle collider in the world, finds something unexpected over the next few years; other theories depend on sensitive searches for dark matter, an invisible and hypothetical substance, strongly suggested by decades of evidence, which is believed to constitute more than 80% of the matter in the universe.</p>\n\n\n\n<p>And some theories exact a high price for explaining the imbalance: they suggest that protons, one of the key components of atomic nuclei, are unstable. These theories say that proton decay takes even longer than neutrinoless double-beta decay, on average about a trillion trillion times longer than the current age of the universe. Super-Kamiokande (aka “Super-K”), in Japan, is the largest experiment watching for proton decay, using an underground vat of 50,220 metric tons of ultra-pure water surrounded by 13,031 light sensors. At the limits of knowledge, Super-K waits for a faint flash in the darkness. It has yet to catch a proton in the act.&nbsp;</p>\n\n\n\n<p>But whatever caused the matter-antimatter imbalance in the early universe, there’s one thing that physicists are sure of: eventually, the show will end. Over time, all interesting structures will fade away as the universe’s matter and energy are scattered about increasingly at random. Eons from now, this will lead once more to a fully featureless void—and this time, it will be far less dense and far more uniform than the primordial haze. This state, known as heat death, is likely to be the final fate of the universe, myriad quadrillions of years in the future.&nbsp;</p>\n\n\n\n<p>So we’re lucky—we live at a time when the universe is filled with complexity and beauty, even if we don’t fully understand why.</p>\n\n\n\n<p><br><a href=\"http://freelanceastrophysicist.com/\"><em>Adam Becker</em></a><em> is a freelance journalist based in Berkeley, California. He has written for the New York Times, the BBC, Scientific American, Quanta, New Scientist, and other outlets. He is also the author of </em><a href=\"https://www.hachettebookgroup.com/titles/adam-becker/what-is-real/9781541698970/?lens=basic-books\">What Is Real?</a><em>, an affable account of the sordid untold history of quantum physics.</em></p>\n"}},{"title":"Google DeepMind wants to define what counts as artificial general intelligence","link":"https://www.technologyreview.com/2023/11/16/1083498/google-deepmind-what-is-artificial-general-intelligence-agi/","dc:creator":{"#cdata-section":"Will Douglas Heaven"},"pubDate":"Thu, 16 Nov 2023 09:02:14 +0000","category":[{"#cdata-section":"Artificial intelligence"},{"#cdata-section":"App"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1083498"},"description":{"#cdata-section":"AGI, or artificial general intelligence, is one of the hottest topics in tech today. It’s also one of the most controversial. A big part of the problem is that few people agree on what the term even means. Now a team of Google DeepMind researchers has put out a paper that cuts through the cross&#8230;"},"content:encoded":{"#cdata-section":"\n<p>AGI, or<a href=\"https://www.technologyreview.com/2020/10/15/1010461/artificial-general-intelligence-robots-ai-agi-deepmind-google-openai/\"> artificial general intelligence</a>, is one of the hottest topics in tech today. It’s also one of the most controversial. A big part of the problem is that few people agree on what the term even means. Now a team of Google DeepMind researchers has put out a paper that cuts through the cross talk with not just one new definition for AGI but a<a href=\"https://arxiv.org/pdf/2311.02462.pdf\"> whole taxonomy of them</a>.</p>\n\n\n\n\n\n<p>In broad terms, AGI typically means artificial intelligence that matches (or outmatches) humans on a range of tasks. But specifics about what counts as human-like, what tasks, and how many all tend to get waved away: AGI is AI, but better.</p>\n\n\n\n<p>To come up with the new definition, the Google DeepMind team started with prominent existing definitions of AGI and drew out what they believe to be their essential common features.&nbsp;</p>\n\n\n\n<p>The team also outlines five ascending levels of AGI: emerging (which in their view includes cutting-edge chatbots like <a href=\"https://www.technologyreview.com/2023/03/03/1069311/inside-story-oral-history-how-chatgpt-built-openai/\">ChatGPT</a> and <a href=\"https://www.technologyreview.com/2023/03/21/1070111/google-bard-chatgpt-openai-microsoft-bing-search/\">Bard</a>), competent, expert, virtuoso, and <a href=\"https://www.technologyreview.com/2023/10/26/1082398/exclusive-ilya-sutskever-openais-chief-scientist-on-his-hopes-and-fears-for-the-future-of-ai/\">superhuman</a> (performing a wide range of tasks better than all humans, including tasks humans cannot do at all, such as decoding other people’s thoughts, predicting future events, and talking to animals). They note that no level beyond emerging AGI has been achieved.</p>\n\n\n\n<p>“This provides some much-needed clarity on the topic,” says Julian Togelius, an AI researcher at New York University, who was not involved in the work. “Too many people sling around the term AGI without having thought much about what they mean.”</p>\n\n\n\n<p>The researchers posted their paper online last week with zero fanfare. In an exclusive conversation with two team members—Shane Legg, one of DeepMind’s co-founders, now billed as the company’s chief AGI scientist, and Meredith Ringel Morris, Google DeepMind’s principal scientist for human and AI interaction—I got the lowdown on why they came up with these definitions and what they wanted to achieve.</p>\n\n\n\n<h3 class=\"wp-block-heading\">A sharper definition</h3>\n\n\n\n<p>“I see so many discussions where people seem to be using the term to mean different things, and that leads to all sorts of confusion,” says Legg, who <a href=\"https://www.technologyreview.com/2020/10/15/1010461/artificial-general-intelligence-robots-ai-agi-deepmind-google-openai/\">came up with the term in the first place</a> around 20 years ago. “Now that AGI is becoming such an important topic—you know, even the UK prime minister is talking about it—we need to sharpen up what we mean.”</p>\n\n\n\n<p>It wasn’t always this way. Talk of AGI was once derided in serious conversation as vague at best and magical thinking at worst. But buoyed by the hype around generative models, buzz about AGI is now everywhere.</p>\n\n\n\n<p>When Legg suggested the term to his former colleague and fellow researcher Ben Goertzel for the title of Goertzel’s 2007<a href=\"https://link.springer.com/book/10.1007/978-3-540-68677-4\"><em> </em>book about future developments in AI</a>, the hand-waviness was kind of the point. “I didn’t have an especially clear definition. I didn’t really feel it was necessary,” says Legg. “I was actually thinking of it more as a field of study, rather than an artifact.”</p>\n\n\n\n\n\n<p>His aim at the time was to distinguish existing AI that could do one task very well, like IBM’s chess-playing program Deep Blue, from hypothetical AI that he and many others imagined would one day do many tasks very well. Human intelligence is not like Deep Blue, says Legg: “It is a very broad thing.”</p>\n\n\n\n<p>But over the years, people started to think of AGI as a potential property that actual computer programs might have. Today it’s normal for top AI companies like Google DeepMind and OpenAI to make bold public statements about their mission to build such programs.</p>\n\n\n\n<p>“If you start having those conversations, you need to be a lot more specific about what you mean,” says Legg.</p>\n\n\n\n<p>For example, the DeepMind researchers state that an AGI must be both general-purpose and high-achieving, not just one or the other. “Separating breadth and depth in this way is very useful,” says Togelius. “It shows why the very accomplished AI systems we’ve seen in the past don’t qualify as AGI.”</p>\n\n\n\n<p>They also state that an AGI must not only be able to do a range of tasks, it must also be able to learn how to do those tasks, assess its performance, and ask for assistance when needed. And they state that what an AGI can do matters more than how it does it.&nbsp;&nbsp;</p>\n\n\n\n<p>It’s not that the way an AGI works doesn’t matter, says Morris. The problem is that we don’t know enough yet about the way cutting-edge models, such as large language models, work under the hood to make this a focus of the definition.</p>\n\n\n\n<p>“As we gain more insights into these underlying processes, it may be important to revisit our definition of AGI,” says Morris. “We need to focus on what we can measure today in a scientifically agreed-upon way.”</p>\n\n\n\n<h3 class=\"wp-block-heading\">Measuring up</h3>\n\n\n\n<p>Measuring the performance of today’s models is <a href=\"https://www.technologyreview.com/2023/08/30/1078670/large-language-models-arent-people-lets-stop-testing-them-like-they-were/\">already controversial</a>, with researchers debating what it really means for a large language model to <a href=\"https://www.technologyreview.com/2023/03/14/1069823/gpt-4-is-bigger-and-better-chatgpt-openai/\">pass dozens of high school tests</a> and more. Is it a sign of intelligence? Or a kind of rote learning?</p>\n\n\n\n<p>Assessing the performance of future models that are even more capable will be more difficult still. The researchers suggest that if AGI is ever developed, its capabilities should be evaluated on an ongoing basis, rather than through a handful of one-off tests.</p>\n\n\n\n<p>The team also points out that AGI does not imply autonomy. “There’s often an implicit assumption that people would want a system to operate completely autonomously,” says Morris. But that’s not always the case. In theory, it’s possible to build super-smart machines that are fully controlled by humans.</p>\n\n\n\n<p>One question the researchers don’t address in their discussion of <em>what</em> AGI is, is <em>why</em> we should build it. Some computer scientists, such as <a href=\"https://www.technologyreview.com/2020/12/16/1014634/google-ai-ethics-lead-timnit-gebru-tells-story/\">Timnit Gebru</a>, founder of the Distributed AI Research Institute, have argued that the whole endeavor is weird. In a talk in April on what she sees as the <a href=\"https://www.youtube.com/watch?v=P7XT4TWLzJw\">false (even dangerous) promise of utopia through AGI</a>, Gebru noted that the hypothetical technology “sounds like an unscoped system with the apparent goal of trying to do everything for everyone under any environment.”&nbsp;</p>\n\n\n\n<p>Most engineering projects have well-scoped goals. The mission to build AGI does not. Even Google DeepMind’s definitions allow for AGI that is indefinitely broad and indefinitely smart. “Don’t attempt to build a god,” Gebru said.</p>\n\n\n\n<p>In the race to build bigger and better systems, few will heed such advice. Either way, some clarity around a long-confused concept is welcome. “Just having silly conversations is kind of uninteresting,” says Legg. “There’s plenty of good stuff to dig into if we can get past these definition issues.”</p>\n"}}]}}}