{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:media":"http://search.yahoo.com/mrss/","channel":{"title":"NDTV News-World-news","link":"https://www.ndtv.com","lastBuildDate":{"#cdata-section":"Sun, 19 Nov 2023 10:11:52 +0530"},"language":"en","image":{"title":"NDTV News-World-news","url":"https://www.ndtv.com/common/header/images/ndtv_logo_black.gif","link":"https://www.ndtv.com"},"description":"NDTV.com provides the latest information from and in-depth coverage of India and the world. Find breaking news, India news, top stories, elections, politics, business, cricket, movies, lifestyle, health, live TV, videos, photos and more.","item":[{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/shakib-al-hasan-bangladesh-awami-league-bangladesh-cricketer-shakib-al-hasan-enters-politics-to-contest-2024-polls-4586438"},"title":{"#cdata-section":"Bangladesh Cricketer Shakib Al Hasan Joins Politics, May Contest 2024 Polls"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/shakib-al-hasan-bangladesh-awami-league-bangladesh-cricketer-shakib-al-hasan-enters-politics-to-contest-2024-polls-4586438"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 10:10:55 +0530"},"description":{"#cdata-section":"Bangladeshi cricket superstar Shakib Al Hasan has formally entered politics, seeking a nomination from the ruling Bangladesh Awami League to run in the upcoming general election on January 7."},"content:encoded":{"#cdata-section":"<p>Bangladeshi cricket superstar Shakib Al Hasan has formally entered politics, seeking a nomination from the ruling Bangladesh Awami League to run in the upcoming general election on January 7. Awami League joint secretary general Bahauddin Nasim told AFP that Shakib took nomination forms on Saturday from the party to contest in three constituencies in the election.</p>\r\n\r\n<p>The polls are set to be boycotted by major opposition parties. &nbsp;&nbsp;</p>\r\n\r\n<p>\"He is a celebrity and has great popularity among the country's youth,\" Nasim said, welcoming the cricket all-rounder.</p>\r\n\r\n<p>Shakib's candidature has to be confirmed by a ruling party parliamentary board headed by Prime Minister Sheikh Hasina.</p>\r\n\r\n<p>He hopes to contest a seat either in his southwestern home district of Magura, or in the capital Dhaka, Nasim said.</p>\r\n\r\n<p>Hasina has led the South Asian country of around 170 million people for the past 15 years and has been accused of ruling with an iron fist.</p>\r\n\r\n<p>She is seen as almost certain to return to power for a fourth time if the opposition boycott goes ahead.</p>\r\n\r\n<p>Hasina has overseen impressive economic growth, but Western nations have sounded the alarm over democratic backsliding and she has been accused by the opposition of vote-rigging at the past two polls.</p>\r\n\r\n<p>Turning to politics is nothing new for cricketers in South Asia, where the sport is massively popular. Doing so during a playing career, however, is rare.</p>\r\n\r\n<p>But former cricket captain Mashrafe Mortaza joined politics in 2018 and was elected as a lawmaker from the ruling party in the same year.</p>\r\n\r\n<p>He led Bangladesh in the 2019 World Cup, before giving up the sport to focus on politics.</p>\r\n\r\n<p>Shakib, Bangladesh's regular captain in all three formats, is currently nursing a finger injury, which has forced him to skip the forthcoming Test series against New Zealand.</p>\r\n\r\n<p>He suffered the injury during a match in the World Cup against Sri Lanka, when he made headlines after an unusual appeal against Angelo Mathews, which resulted in international cricket's first ever timed out.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-09/vv3aqdsg_shakib-al-hasan-afp_625x300_07_September_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Bangladeshi cricket superstar Shakib Al Hasan has formally entered politics"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/sam-altman-openai-chatgpt-greg-brockman-satya-nadella-sam-altman-discussing-his-return-to-openai-with-company-board-report-4586397"},"title":{"#cdata-section":"OpenAI Board In Talks With Sam Altman To Get Him Back As CEO: Report"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/sam-altman-openai-chatgpt-greg-brockman-satya-nadella-sam-altman-discussing-his-return-to-openai-with-company-board-report-4586397"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 09:32:08 +0530"},"description":{"#cdata-section":"The board members of OpenAI, which created ChatGPT, are in discussions with Sam Altman who was fired as the company CEO yesterday, multiple people familiar with the matter said."},"content:encoded":{"#cdata-section":"<p>The board members of OpenAI, the company that created ChatGPT, are in discussions with Sam Altman who was fired as the company CEO yesterday, multiple people familiar with the matter said.</p>\r\n\r\n<p>Sources say OpenAI investors are pressing the company board to reverse the decision to sack Sam Altman.&nbsp;</p>\r\n\r\n<p>Some of the investors are also in talks with Microsoft Corp., the largest shareholder of OpenAI, about reinstating Altman as CEO, sources said.&nbsp;Microsoft has invested billions of dollars in OpenAI and has woven the company's technology into its offerings, including search engine Bing.</p>\r\n\r\n<p>Extending his support to the interim OpenAI CEO Mira Murati, Satya Nadella yesterday said that Microsoft remains committed to OpenAI. Sources, however, claim that he was blindsided by the board's decision and has been in touch with Altman since his abrupt firing.</p>\r\n\r\n<p>A group of OpenAI staff has threatened that they will quit if the entire board doesn't resign and reinstate Sam Altman as the CEO.</p>\r\n\r\n<p>Some reports claimed that Altman is planning to launch his own venture if the talks with OpenAI fail. Former OpenAI president Greg Brockman is expected to join the effort, and the project is still in development.</p>\r\n\r\n<p>Sam Altman was fired yesterday with the company board saying that it has \"lost confidence in his ability to continue leading OpenAI\". The dismissal prompted co-founder Greg Brockman to announce his departure too.</p>\r\n\r\n<p>OpenAI's board said in a statement that Altman's departure \"follows a deliberative review process,\" which concluded \"he was not consistently candid in his communications with the board, hindering its ability to exercise its responsibilities.\"</p>\r\n\r\n<p>OpenAI's decision to fire Altman followed wide-ranging disagreements between the chief executive and his board. The debates included differences of opinion on AI safety, the speed of development of the technology and the commercialization of the company, sources said</p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-05/j72njd6_sam-altman_625x300_17_May_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"OpenAI investors are pressing the company board to reinstate Sam Altman."}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/miss-universe-2023-anntonia-porsild-sheynnis-palacios-moraya-wilson-at-miss-universe-2023-thailand-contestant-anntonia-porsild-vows-audience-with-fina-4586389"},"title":{"#cdata-section":"Thailand Contestant's Answer At Miss Universe 2023 Is Viral. Here's Why"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/miss-universe-2023-anntonia-porsild-sheynnis-palacios-moraya-wilson-at-miss-universe-2023-thailand-contestant-anntonia-porsild-vows-audience-with-fina-4586389"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 09:27:58 +0530"},"description":{"#cdata-section":"Thailand's Anntonia Porsild made it to the top 3 in the Miss Universe 2023 on Sunday along with Nicaraguan model Sheynnis Palacios and Australian Moraya Wilson."},"content:encoded":{"#cdata-section":"<p>Thailand's Anntonia Porsild made it to the top 3 in the Miss Universe 2023 on Sunday along with Nicaraguan model Sheynnis Palacios and Australian Moraya Wilson. During the final round of questions, Ms Porsild was asked who would she choose if she could live one year in another woman's shoes.&nbsp;</p>\r\n\r\n<p>\"I would choose Malala Yousafzai because I know the struggles she had to deal with in order to get to where she is today,\" Ms Porsild answered.</p>\r\n\r\n<p>\"She (Malala) had to fight for women's education and fight for all women to be able to stand strong and be the change and lead by example. If I could choose anyone that would be her,\" the 27-year-old added.</p>\r\n\r\n<blockquote class=\"twitter-tweet\">\r\n<p dir=\"ltr\" lang=\"en\">FINAL Q&amp;A starting with Thailand! <a href=\"https://twitter.com/porxild?ref_src=twsrc%5Etfw\">@porxild</a><a href=\"https://twitter.com/hashtag/72ndMISSUNIVERSE?src=hash&amp;ref_src=twsrc%5Etfw\">#72ndMISSUNIVERSE</a> <a href=\"https://twitter.com/hashtag/MissUniverse2023?src=hash&amp;ref_src=twsrc%5Etfw\">#MissUniverse2023</a> <a href=\"https://twitter.com/TheRokuChannel?ref_src=twsrc%5Etfw\">@TheRokuChannel</a> <a href=\"https://t.co/w71IH4kEvY\">pic.twitter.com/w71IH4kEvY</a></p>\r\n— Miss Universe (@MissUniverse) <a href=\"https://twitter.com/MissUniverse/status/1726080616670626007?ref_src=twsrc%5Etfw\">November 19, 2023</a></blockquote>\r\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\r\n\r\n<p>The other finalists were also asked the same question, to which Ms Palacios said that she would choose Mary Wollstonecraft, a British writer and philosopher.</p>\r\n\r\n<p>\"I would choose Mary Wollstonecraft because she was the first woman who opened the gaps towards women's rights,\" she said.</p>\r\n\r\n<blockquote class=\"twitter-tweet\">\r\n<p dir=\"ltr\" lang=\"en\">Well done Nicaragua! @Sheynnispalacios_of<a href=\"https://twitter.com/hashtag/72ndMISSUNIVERSE?src=hash&amp;ref_src=twsrc%5Etfw\">#72ndMISSUNIVERSE</a> <a href=\"https://twitter.com/hashtag/MissUniverse2023?src=hash&amp;ref_src=twsrc%5Etfw\">#MissUniverse2023</a> <a href=\"https://twitter.com/TheRokuChannel?ref_src=twsrc%5Etfw\">@TheRokuChannel</a> <a href=\"https://t.co/wMgOLM84Px\">pic.twitter.com/wMgOLM84Px</a></p>\r\n— Miss Universe (@MissUniverse) <a href=\"https://twitter.com/MissUniverse/status/1726083693586841692?ref_src=twsrc%5Etfw\">November 19, 2023</a></blockquote>\r\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\r\n\r\n<p>Ms Wilson answered that she would like to live in her mother's shoes as she is a \"very strong\" woman.</p>\r\n\r\n<p>\"She is tough. She has taught me how to work hard. She taught me how to be brave and how to be strong and I'm forever grateful for the lessons she had taught me.</p>\r\n\r\n<blockquote class=\"twitter-tweet\">\r\n<p dir=\"ltr\" lang=\"en\">Excellent answer from Australia! <a href=\"https://twitter.com/Morayawilson?ref_src=twsrc%5Etfw\">@morayawilson</a><a href=\"https://twitter.com/hashtag/72ndMISSUNIVERSE?src=hash&amp;ref_src=twsrc%5Etfw\">#72ndMISSUNIVERSE</a> <a href=\"https://twitter.com/hashtag/MissUniverse2023?src=hash&amp;ref_src=twsrc%5Etfw\">#MissUniverse2023</a> <a href=\"https://twitter.com/TheRokuChannel?ref_src=twsrc%5Etfw\">@TheRokuChannel</a> <a href=\"https://t.co/xYuTRzFT9q\">pic.twitter.com/xYuTRzFT9q</a></p>\r\n— Miss Universe (@MissUniverse) <a href=\"https://twitter.com/MissUniverse/status/1726080796367233404?ref_src=twsrc%5Etfw\">November 19, 2023</a></blockquote>\r\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\r\n\r\n<p>The 72nd <a href=\"https://www.ndtv.com/world-news/miss-universe-jude-says-bankruptcy-due-to-outrage-over-transgender-organiser-4581682\" target=\"_blank\">Miss Universe</a> pageant was hosted in El Salvador, in which contestants from over 90 countries fought to win the coveted crown.</p>\r\n\r\n<p>The Central American country is hosting the Miss Universe competition for the first time since 1975.</p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/bt1tjsno_miss-universe_625x300_19_November_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Thailand's Anntonia Porsild made it to the top 3 in the Miss Universe 2023"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/benjamin-netanyahu-israel-hamas-war-gaza-war-no-ceasfire-deal-yet-to-bring-israeli-hostages-home-benjamin-netanyahu-4586370"},"title":{"#cdata-section":"Deal With Hamas To Free Hostages For Halt In Gaza Strikes? Israel Responds"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/benjamin-netanyahu-israel-hamas-war-gaza-war-no-ceasfire-deal-yet-to-bring-israeli-hostages-home-benjamin-netanyahu-4586370"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 08:53:19 +0530"},"description":{"#cdata-section":"No deal has been reached yet for the release of hostages taken by Hamas during the October 7 war that sparked the ongoing war in Gaza, both Israel and the US have said."},"content:encoded":{"#cdata-section":"<p>No deal has been reached yet for the release of hostages taken by Hamas during the October 7 war that sparked the ongoing war in Gaza, both Israel and the US have said.&nbsp;The remarks come a day after <a href=\"https://www.washingtonpost.com/national-security/2023/11/18/us-israel-hamas-reach-tentative-deal-pause-conflict-free-dozens-hostages/\">The Washington Post reported</a> that Israel, the US and the Hamas were close to an agreement to release 50-odd hostages in exchange for a five-day pause in fighting.</p>\r\n\r\n<p>The report quoted diplomats who said the Qatar-mediated talks had reached a breakthrough according to which Israel and Hamas would cease fire for at least five days while an \"initial 50 or more\" of the hostages \"are released in batches every 24 hours\".</p>\r\n\r\n<p>As many as 240 people, including dozens of women and children, were taken hostage by the Hamas after the attacks on Israeli cities left 1,200 dead. While Israel has launched a brutal offensive on Gaza in retaliation to the attacks, the fate of the hostages hangs in the balance.</p>\r\n\r\n<p>On a question on whether a deal is in the works to secure their release, Prime Minister Benjamin Netanyahu told the media that \"there was no deal on the table\". \"We want to get back all the hostages. We're doing the utmost to bring back the most possible, including in stages, and we are united on this,\" he added, refusing to elaborate further. \"We obviously want to bring [home] whole families together,\" he said, according to a a <a href=\"https://www.timesofisrael.com/no-deal-yet-pm-shoots-down-incorrect-reports-of-imminent-hostage-agreement/\">report in The Times of Israel</a>.&nbsp;</p>\r\n\r\n<p>The White House too has denied any deal so far. \"We have not reached a deal yet, but we continue to work hard to get to a deal,\" White House National Security Council spokeswoman Adrienne Watson said on X, formerly Twitter, in response to The Washington Post report.</p>\r\n\r\n<p>According to a Channel 12 report, Israel has been insisting on keeping families together for any hostage deals. Hamas is being offered a pause in fighting, release of some Palestinian prisoners and the entry of more fuel into Gaza.</p>\r\n\r\n<p>Israel now faces the dual pressure of domestic uproar over the failure to free the hostages so far and international concern over the massive human cost of its war in Gaza. Over 11,000 people have been killed in the Strip since the war broke out.</p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/sugcitt8_gaza-war-pti_625x300_19_November_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Israel has launched a brutal offensive on Gaza in retaliation to the attacks"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/israel-hamas-war-israel-gaza-war-hamas-attack-gazas-al-shifa-hospital-a-death-zone-says-who-urges-full-evacuation-4586344"},"title":{"#cdata-section":"Gaza's Al-Shifa Hospital A \"Death Zone\", Says WHO, Urges Full Evacuation"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/israel-hamas-war-israel-gaza-war-hamas-attack-gazas-al-shifa-hospital-a-death-zone-says-who-urges-full-evacuation-4586344"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 08:28:53 +0530"},"description":{"#cdata-section":"Gaza's largest hospital has become a \"death zone,\" the World Health Organization said Sunday, announcing plans to evacuate the facility"},"content:encoded":{"#cdata-section":"<p>Gaza's largest hospital has become a \"death zone,\" the World Health Organization said Sunday, announcing plans to evacuate the facility, as Israel's army said it was expanding operations to destroy Hamas.</p>\r\n\r\n<p>The assessment came after a visit by WHO and other UN officials to the hospital, which Israeli troops raided earlier this week.</p>\r\n\r\n<p>Elsewhere, a Hamas health official said more than 80 people were killed Saturday in twin strikes on a northern Gaza refugee camp, including on a UN school sheltering displaced people.</p>\r\n\r\n<p>Social media videos verified by AFP showed bodies covered in blood and dust on the floor of a building where mattresses had been wedged under school tables, in Jabalia, the Palestinian territory's biggest refugee camp.</p>\r\n\r\n<p>Philippe Lazzarini, head of the UN agency for Palestinian refugees UNRWA, described \"horrifying images\" from the incident, while Egypt called the bombing a \"war crime\" and \"a deliberate insult to the United Nations\".</p>\r\n\r\n<p>A separate strike Saturday on another building in Jabalia camp killed 32 people from the same family, 19 of them children, Hamas health authorities said.</p>\r\n\r\n<p>Without mentioning the strikes, the Israeli army said \"an incident in the Jabalia region\" was under review.</p>\r\n\r\n<p>Israel has vowed to destroy Hamas in response to the October 7 attacks, which Israeli officials say killed about 1,200 people, most of them civilians, and saw about 240 people taken hostage.</p>\r\n\r\n<p>The army's relentless air and ground campaign has since killed 12,300 people, more than 5,000 of them children, according to the Hamas government which has ruled Gaza since 2007.</p>\r\n\r\n<p>The UN says some 1.6 million people have been displaced inside the Gaza Strip by six weeks of fighting, and Israel said Saturday its military was now \"expanding its operational activities in additional neighbourhoods in the area of the Gaza Strip.\"</p>\r\n\r\n<p>- 'Extreme suffering' -</p>\r\n\r\n<p>Gaza's largest hospital, Al-Shifa, has been a key focus in recent days, with Israeli forces alleging Hamas uses it as a command centre -- a claim denied by the group and medical staff.</p>\r\n\r\n<p>On Sunday, the WHO said a UN assessment team reached the hospital found a \"death zone\", with a mass grave at the entrance and nearly 300 patients left inside with 25 health workers.</p>\r\n\r\n<p>\"WHO and partners are urgently developing plans for the immediate evacuation of the remaining patients, staff and their families,\" the body said, warning however that nearby facilities were already overstretched.</p>\r\n\r\n<p>It urged an immediate ceasefire given the \"extreme suffering of the people of Gaza.\"</p>\r\n\r\n<p>On Saturday, hundreds of people fled the hospital on foot on orders from the Israeli army, according to the facility's director.</p>\r\n\r\n<p>Columns of sick and injured -- some of them amputees -- were seen making their way towards the seafront along with displaced people, doctors, and nurses, as loud explosions were heard around the complex.</p>\r\n\r\n<p>At least 15 bodies, some in advanced stages of decomposition, could be seen along the route, lined with heavily damaged shops and overturned vehicles, an AFP journalist at the scene said.</p>\r\n\r\n<p>NGO Doctors without Borders said a convoy carrying its staff and family members came under attack Saturday while evacuating from near Al-Shifa, despite coordinating with both sides. One person was killed.</p>\r\n\r\n<p>Israeli forces denied ordering the evacuation of the hospital, saying it had \"acceded to the request of the director\" to allow more civilians to leave.</p>\r\n\r\n<p>The WHO said 29 patients at the hospital with serious spinal injuries cannot move without medical assistance, and others have infected wounds due to lack of antibiotics.</p>\r\n\r\n<p>There are also 32 babies in \"extremely critical condition,\" WHO said.</p>\r\n\r\n<p>- 'Not normal' -</p>\r\n\r\n<p>An Israeli siege on Gaza has left food, water, medicine and fuel in short supply, with just a trickle of aid allowed in from Egypt.</p>\r\n\r\n<p>Under US pressure, Israel permitted a first consignment of fuel to enter late Friday, allowing telecommunications to resume after a two-day blackout.</p>\r\n\r\n<p>The UN said Israel had agreed to allow in 60,000 litres (16,000 gallons) of fuel a day from Saturday, but warned it was little more than a third of what is needed.</p>\r\n\r\n<p>Israel has told Palestinians to move south for their safety, but deadly strikes have continued there too, including on a residential building where at least 26 people were killed on Saturday, according to the director of the Nasser hospital in Khan Yunis.</p>\r\n\r\n<p>\"I was asleep and we were surprised by the strike. At least 20 bombs were dropped,\" Imed al-Mubasher, 45, told AFP.</p>\r\n\r\n<p>Diplomatic efforts are currently focused on securing the release of hostages, with US President Joe Biden's chief adviser for the Middle East saying more fuel deliveries and a \"significant pause\" in fighting would come \"when hostages are released.\"</p>\r\n\r\n<p>Relatives of those taken, who range from infants to octogenarians, piled pressure on Israel's government Saturday after arriving outside Prime Minister Benjamin Netanyahu's Jerusalem office on a march from Tel Aviv.</p>\r\n\r\n<p>\"It's not normal to have children kidnapped for 43 days. We don't know what the government is doing, we don't have any information,\" said marcher Ari Levi.</p>\r\n\r\n<p>The bodies of two female hostages were recovered in Gaza this week, the Israeli military said, while four abductees have so far been released.</p>\r\n\r\n<p>Gaza's fate after the conflict remains unclear, and Biden argued in an opinion piece published Saturday that the coastal territory and the Israeli-occupied West Bank should come under a single \"revitalised\" administration.</p>\r\n\r\n<p>\"As we strive for peace, Gaza and the West Bank should be reunited under a single governance structure, ultimately under a revitalised Palestinian Authority,\" he wrote in the Washington Post.</p>\r\n\r\n<p>However, Netanyahu has insisted the Palestinian Authority \"in its current form is not capable of receiving responsibility for Gaza.\"</p>\r\n\r\n<p>Biden also threatened sanctions, including visa bans, against settlers who have ramped up attacks on Palestinians in the West Bank in recent weeks.</p><p><i>(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/f6kqci1o_al-shifa-gaza-hospital_625x300_13_November_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Gaza's largest hospital, Al-Shifa, has been a key focus in recent days"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/israel-hamas-reach-tentative-deal-to-pause-war-free-hostages-report-4586331"},"title":{"#cdata-section":"Israel, Hamas Reach Tentative Deal To Pause War, Free Hostages: Report"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/israel-hamas-reach-tentative-deal-to-pause-war-free-hostages-report-4586331"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 07:47:24 +0530"},"description":{"#cdata-section":"Israel, the United States, and Hamas have reached a tentative agreement to free dozens of women and children held hostage in Gaza in exchange for a five-day pause in fighting, the Washington Post reported on Saturday."},"content:encoded":{"#cdata-section":"<p>Israel, the United States, and Hamas have reached a tentative agreement to free dozens of women and children held hostage in Gaza in exchange for a five-day pause in fighting, the Washington Post reported on Saturday, citing people familiar with the deal.</p>\r\n\r\n<p>As part of the detailed, six-page agreement, all parties would freeze combat operations for at least five days while \"an initial 50 or more hostages are released in smaller groups every 24 hours\", the Post reported.</p>\r\n\r\n<p>Hamas took about 240 hostages during its Oct. 7 rampage inside Israel that killed 1,200 people.</p>\r\n\r\n<p>The newspaper said overhead surveillance would monitor ground movement to help police the pause, which also is intended to allow in a significant amount of humanitarian aid.</p>\r\n\r\n<p>There was no immediate comment from the White House or the Israeli prime minister's office on the Post report.</p>\r\n\r\n<p>The hostage release could begin within the next several days, according to people familiar with its the agreement.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/n1aso5dg_israel-hamas-war_625x300_04_November_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Hamas took about 240 hostages during its October 7 rampage inside Israel"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/sam-altman-mira-murati-openai-ceo-sam-altman-openai-investors-press-companys-board-to-bring-back-sam-altman-as-ceo-4586323"},"title":{"#cdata-section":"OpenAI Investors Press Company's Board To Bring Back Sam Altman As CEO"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/sam-altman-mira-murati-openai-ceo-sam-altman-openai-investors-press-companys-board-to-bring-back-sam-altman-as-ceo-4586323"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 07:20:07 +0530"},"description":{"#cdata-section":"OpenAI investors are pressing the company's board to reverse its decision to fire Sam Altman as chief executive officer and remove him as a director, according to people with knowledge of the matter."},"content:encoded":{"#cdata-section":"<p>OpenAI investors are pressing the company's board to reverse its decision to fire Sam Altman as chief executive officer and remove him as a director, according to people with knowledge of the matter.&nbsp;</p>\r\n\r\n<p>Some of the investors including Thrive Capital are in talks with Microsoft Corp., the largest shareholder of OpenAI, about <a href=\"https://www.ndtv.com/world-news/sam-altman-chatgpt-mira-murati-openais-sam-altman-greg-brockman-fired-over-google-meet-call-4584477\" target=\"_blank\">reinstating Altman as CEO</a>, said the people, who asked not to be identified because the overtures are private. Tiger Global Management is also part of the campaign, according to one person.</p>\r\n\r\n<p>Thrive, which was expected to lead a tender offer for employee shares, has not yet wired the money and has made it clear to OpenAI that Atlman's departure will affect its actions.</p>\r\n\r\n<p>Thrive, the largest OpenAI investor aside from Microsoft, is working to reinstate both <a href=\"https://www.ndtv.com/world-news/sam-altman-chatgpt-mira-murati-openais-sam-altman-greg-brockman-fired-over-google-meet-call-4584477\" target=\"_blank\">Altman and Greg Brockman</a>, the startup's president who quit on Friday in protest.</p>\r\n\r\n<p>Altman is open to returning to the company, one of the people said. In one scenario under consideration, members of the current OpenAI board would step down as soon as this weekend, according to multiple people. However, the situation is still fluid and no decisions have been made, the people said.&nbsp;</p>\r\n\r\n<p>Microsoft CEO Satya Nadella has been in touch with Altman and pledged to support him in whatever steps he takes next, the people said. Nadella was blindsided by the board's decision, according to people familiar with the situation.&nbsp;</p>\r\n\r\n<p>Representatives of San Francisco-based OpenAI and Redmond, Washington-based Microsoft declined to comment. Thrive and Tiger Global declined to comment.&nbsp;</p>\r\n\r\n<p><a href=\"https://www.ndtv.com/feature/mira-murati-new-interim-ceo-of-openai-who-replaced-sam-altman-4584320\" target=\"_blank\"><strong>ALSO READ |&nbsp;Who Is Mira Murati, The 34-Year-Old Engineer Now Leading OpenAI?</strong></a></p>\r\n\r\n<p>The OpenAI board has been subjected to intense criticism over its decision to remove Altman, which came as a surprise to both investors and to Altman himself.&nbsp;</p>\r\n\r\n<p>Several people, including co-founder Brockman, have departed from the company in protest. The resignations are likely to continue, the people said.&nbsp;</p>\r\n\r\n<p>If Altman were to return, he would ask for changes in the way the company is governed, some of the people said.</p>\r\n\r\n<p>If he does not return, <a href=\"https://www.ndtv.com/world-news/openais-sam-altman-planning-new-venture-after-getting-fired-report-4586215\" target=\"_blank\">Altman has been considering launching a new venture</a>, possibly with former staffers of OpenAI, according to several people.&nbsp;</p>\r\n\r\n<p>Forbes and the Verge earlier reported some details of the campaign to reinstate Altman.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/r3rto398_sam-altman_625x300_18_November_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"ChatGPT creator OpenAI on Friday sacked CEO Sam Altman"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/significant-pause-in-gaza-war-if-hostages-freed-us-official-4586273"},"title":{"#cdata-section":"\"Significant Pause\" In Gaza War If Hostages Freed: US Official"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/significant-pause-in-gaza-war-if-hostages-freed-us-official-4586273"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 05:29:38 +0530"},"description":{"#cdata-section":"US President Joe Biden's main adviser on the Middle East said Saturday there would be a \"significant pause\" in the Israel-Hamas war if hostages held by militants in Gaza are freed."},"content:encoded":{"#cdata-section":"<p>US President Joe Biden's main adviser on the Middle East said Saturday there would be a \"significant pause\" in the Israel-Hamas war if hostages held by militants in Gaza are freed.</p>\r\n\r\n<p>Hamas terrorists seized about 240 hostages on October 7 when they surged across Gaza's militarised border into southern Israel to kill around 1,200 people, mostly civilians, according to Israeli officials.</p>\r\n\r\n<p>In response, Israel is carrying out a relentless bombardment and ground offensive of targets in the Gaza Strip which has so far killed 12,300 people, according to the Palestinian territory's Hamas government.</p>\r\n\r\n<p>\"The surge in humanitarian relief, the surge in fuel, the pause... will come when hostages are released,\" Brett McGurk told a security conference in Bahrain.</p>\r\n\r\n<p>Release of a large number of hostages would result in \"a significant pause... and a massive surge of humanitarian relief,\" he said.</p>\r\n\r\n<p>McGurk said Biden had discussed the issue on Friday evening with the ruler of the Gulf nation of Qatar, which is leading mediation efforts toward a ceasefire and release of the captives.</p>\r\n\r\n<p>The White House said Biden and Qatar's Emir Sheikh Tamim bin Hamad Al-Thani discussed \"the urgent need for all hostages held by Hamas to be released without further delay\".</p>\r\n\r\n<p>Two days earlier Biden had said he was \"mildly hopeful\" of reaching a deal to free the hostages, believed to include about 10 US citizens.</p>\r\n\r\n<p>French President Emmanuel Macron also discussed the hostages with al-Thani and Egyptian leader Abdel Fattah al-Sisi on Saturday, his office said.</p>\r\n\r\n<p>Macron said immediately freeing the captives, of whom eight are French, was \"an absolute priority for France\".</p>\r\n\r\n<p>The three leaders also talked about strengthening their coordination to deliver aid to civilians in Gaza, Macron's office said.</p>\r\n\r\n<p>So far efforts by Qatar have led to the release of four of the captives. A fifth hostage, a soldier, was rescued in an Israeli operation.</p>\r\n\r\n<p>Israel's army said this week it had recovered the bodies of two women hostages in Gaza.</p>\r\n\r\n<p><strong>No Arab troops' in Gaza</strong></p>\r\n\r\n<p>McGurk said on Saturday that the situation in the besieged Palestinian territory was \"horrific\" and \"intolerable\".</p>\r\n\r\n<p>Israel has refused to heed calls for a ceasefire before all the hostages are released.</p>\r\n\r\n<p>Jordanian Foreign Minister Ayman Safadi, who also attended the Bahrain conference, said it was \"unacceptable\" to link humanitarian pauses to release of hostages.</p>\r\n\r\n<p>Meanwhile EU foreign policy chief Josep Borrell reflected on the future of Gaza, saying, \"Hamas cannot be in control of Gaza anymore\".</p>\r\n\r\n<p>The Palestinian Authority, based in the occupied West Bank city of Ramallah, \"told me they are ready and willing to take this responsibility\" with the help of the international community, said Borrell.</p>\r\n\r\n<p>He added that Arab countries should also play a role in any future configuration, both political and economic, for Gaza.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-10/p41el1b8_israel-gaza-violence_625x300_10_October_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Earlier Biden had said he was \"mildly hopeful\" of reaching a deal to free the hostages. (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/over-80-dead-in-israeli-strikes-on-gaza-camp-says-hamas-4586262"},"title":{"#cdata-section":"Over 80 Dead In Israeli Strikes On Gaza Camp, Says Hamas"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/over-80-dead-in-israeli-strikes-on-gaza-camp-says-hamas-4586262"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 05:05:10 +0530"},"description":{"#cdata-section":"A Hamas health official said more than 80 people were killed Saturday in twin strikes on a northern Gaza refugee camp, including a UN school used as a shelter for people displaced by the Israel-Hamas war."},"content:encoded":{"#cdata-section":"<p>A Hamas health official said more than 80 people were killed Saturday in twin strikes on a northern Gaza refugee camp, including a UN school used as a shelter for people displaced by the Israel-Hamas war.</p>\r\n\r\n<p>Social media videos verified by AFP showed bodies covered in blood and dust on the floor of a building, where mattresses had been wedged under school tables in Jabalia, the Palestinian territory's biggest refugee camp.</p>\r\n\r\n<p>Israel has vowed to destroy Hamas in response to the October 7 attacks which Israeli officials say killed about 1,200 people, most of them civilians in southern Israel, and saw about 240 people taken hostage.</p>\r\n\r\n<p>The army's relentless air and ground campaign has since killed 12,300 people, more than 5,000 of them children, according to the Hamas government which has ruled Gaza since 2007.</p>\r\n\r\n<p>\"At least 50 people\" were killed in a dawn strike on the UN-run Al-Fakhura school in the camp, which has been converted into a shelter for displaced Palestinians, a health ministry official in Hamas-controlled Gaza told AFP.</p>\r\n\r\n<p>According to UN figures, some 1.6 million people have been displaced inside the Gaza Strip by six weeks of fighting.</p>\r\n\r\n<p>UN humanitarian chief Martin Griffiths denounced the \"tragic news of the children, women and men killed\".</p>\r\n\r\n<p>\"Shelters are a place for safety,\" he posted on X, formerly Twitter. \"Civilians cannot and should not have to bear this any longer.\"</p>\r\n\r\n<p>Egypt called the bombing of the UN-run school a \"war crime\" and \"a deliberate insult to the United Nations\".</p>\r\n\r\n<p>A separate strike Saturday on another building in Jabalia camp killed 32 people from the same family, 19 of them children, the Hamas official said.</p>\r\n\r\n<p>Without mentioning the strikes, the Israeli army said \"an incident in the Jabalia region\" was under review.</p>\r\n\r\n<p>Israel has told Palestinians to move from north Gaza for their safety, but deadly air strikes continued to hit central and southern areas of the coastal enclave.</p>\r\n\r\n<p>On Saturday, hundreds of people fled on foot after the director of Gaza's main hospital said the Israeli army ordered the evacuation of the facility where some 2,000 people were trapped.</p>\r\n\r\n<p>Columns of sick and injured -- some of them amputees -- were seen making their way out of Al-Shifa hospital towards the seafront without ambulances along with displaced people, doctors and nurses, as loud explosions were heard around the complex.</p>\r\n\r\n<p>On the way, an AFP journalist saw at least 15 bodies, some in advanced stages of decomposition, along a road lined by heavily damaged shops and overturned vehicles.</p>\r\n\r\n<p>The health ministry said 120 wounded, along with an unspecified number of premature babies, were still at Al-Shifa hospital.</p>\r\n\r\n<p>Israel has been pressing military operations inside the hospital, searching for the Hamas operations centre it says lies under the sprawling complex -- a charge Hamas denies.</p>\r\n\r\n<p><strong>'Patients cannot leave'</strong></p>\r\n\r\n<p>In Gaza City, Israeli troops had called over loudspeakers to evacuate Al-Shifa \"in the next hour\", an AFP journalist at the hospital reported.</p>\r\n\r\n<p>They also called the hospital's director, Mohammed Abu Salmiya, telling him to ensure \"the evacuation of patients, wounded, the displaced and medical staff\", he said.</p>\r\n\r\n<p>But Israel's army denied ordering the evacuation, saying instead it had \"acceded to the request of the director\" to allow more civilians to leave.</p>\r\n\r\n<p>According to Ahmed El Mokhallalati, a doctor at the hospital, \"most of the medical staff and patients had left\" but he was staying at Al-Shifa along with five other doctors.</p>\r\n\r\n<p>\"Many patients cannot leave the hospital as they are in the ICU beds or the baby incubators,\" Mokhallalati said on X.</p>\r\n\r\n<p>Israel has imposed a siege on Gaza, allowing just a trickle of aid in from Egypt but barring most shipments of fuel over concerns Hamas could divert supplies for military purposes.</p>\r\n\r\n<p>A first consignment of fuel entered the territory after Israel's war cabinet bowed to pressure from its ally the United States and agreed to let in two tankers of diesel a day.</p>\r\n\r\n<p>A two-day blackout caused by fuel shortages ended after a first delivery arrived from Egypt late Friday, but UN officials continued to plead for a ceasefire, warning no part of Gaza is safe.</p>\r\n\r\n<p>A strike on a residential building in southern Gaza killed 26 people, the director of the Nasser hospital in Khan Yunis said.</p>\r\n\r\n<p>\"I was asleep and we were surprised by the strike. At least 20 bombs were dropped,\" Imed al-Mubasher, 45, told AFP.</p>\r\n\r\n<p>The UN said Israel had agreed to allow in 60,000 litres (16,000 gallons) of fuel a day from Saturday, but warned it was little more than a third of what is needed to keep hospitals, water and sanitation facilities running.</p>\r\n\r\n<p>US President Joe Biden's chief adviser for the Middle East said more fuel deliveries and a potential \"significant pause\" in the fighting both depend of the release of hostages.</p>\r\n\r\n<p>\"The surge in humanitarian relief, the surge in fuel, the pause... will come when hostages are released,\" Brett McGurk told a security conference in Bahrain.</p>\r\n\r\n<p><strong>Biden wants Gaza, West Bank 'reunited'</strong></p>\r\n\r\n<p>The military says it has found rifles, ammunition, explosives and the entrance to a tunnel shaft at the Al-Shifa hospital complex, claims that cannot be independently verified.</p>\r\n\r\n<p>Israel has not recovered hostages at the hospital but said it found not far away the bodies of two kidnapped women including a soldier.</p>\r\n\r\n<p>Those held hostage range from infants to octogenarians, and there has been little information on their fate despite ongoing negotiations mediated by Qatar and Egypt to secure releases.</p>\r\n\r\n<p>Waving Israeli flags and placards depicting the hostages, thousands of people reached Jerusalem Saturday on the fifth and final day of a march calling for their release.</p>\r\n\r\n<p>As Israel says it would not allow Hamas to hold on to power in Gaza, Biden argued the coastal enclave and the occupied West Bank -- nominally under the control of the Palestinian Authority -- should eventually come under a single \"revitalised\" administration.</p>\r\n\r\n<p>\"As we strive for peace, Gaza and the West Bank should be reunited under a single governance structure, ultimately under a revitalised Palestinian Authority, as we all work toward a two-state solution,\" Biden wrote in an opinion piece in the Washington Post.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2022-07/9hpkbdig_israel-gaza_625x300_16_July_22.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"A Hamas health official said more than 80 people were killed Saturday. (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/taylor-swift-postpones-rio-show-due-to-extreme-heat-after-fan-death-4586234"},"title":{"#cdata-section":"Taylor Swift Postpones Scorching Rio De Janeiro Show After Fan's Death"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/taylor-swift-postpones-rio-show-due-to-extreme-heat-after-fan-death-4586234"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 03:41:30 +0530"},"description":{"#cdata-section":"US singer Taylor Swift postponed her show on Saturday in Rio de Janeiro due to scorching heat, the day after the death of a fan who fell ill in the sweltering concert venue."},"content:encoded":{"#cdata-section":"<p>US singer Taylor Swift postponed her show on Saturday in Rio de Janeiro due to scorching heat, the day after the death of a fan who fell ill in the sweltering concert venue.</p>\r\n\r\n<p>\"The decision has been made to postpone tonight's show due to the extreme temperatures in Rio,\" Swift wrote on Instagram about two hours before she was to go on stage. \"The safety and well-being of my fans, fellow performers, and crew has to, and always will, come first.\"</p>\r\n\r\n<p>Ana Clara Benevides, 23, became unwell at Nilton Santos stadium during Friday's show, event organizer T4F wrote on Instagram. She died later in hospital. Her cause of death was not yet known and will be investigated, Rio's state health service said.</p>\r\n\r\n<p>Rio on Friday hit a record high of the heat index, which combines temperature and humidity, at 59.3 degrees Celsius (138.7 degrees Fahrenheit). On Saturday, the heat index peaked at 59.7 degrees Celsius (139.5).</p>\r\n\r\n<p>Some 60,000 fans had gathered on Friday for Swift's sell-out first concert at the open-air stadium, which is far from Rio's breezy beaches in a hotter northern neighborhood.</p>\r\n\r\n<p>Swift was also scheduled to perform in Rio on Sunday, followed by three shows in Sao Paulo from Nov. 24 to 26. T4F said Saturday's show was postponed to Monday.</p>\r\n\r\n<p>During Friday's concert, several fans fell ill, prompting Swift to interrupt her performance and request that the production team provide them water, videos showed.</p>\r\n\r\n<p>National Consumer Secretary Wadih Damous posted on X that the government had ordered T4F to guarantee water access at all of Swift's concerts in Brazil.</p>\r\n\r\n<p>In the wake of Benevides' death, Justice Minister Flavio Dino announced that the government would issue a directive allowing water bottles to be brought into concerts.</p>\r\n\r\n<p>\"Companies producing shows with high heat exposure must provide free drinking water in easily accessible 'hydration islands.' The measure is effective immediately,\" he added on X, formerly known as Twitter.</p>\r\n\r\n<p>Swift fans outside the stadium on Saturday were suffering in the heat as they waited to access the show. As news spread of the show's postponement, many young girls burst into tears.</p>\r\n\r\n<p>Heat exhaustion, which can include dizziness, headaches, shaking and thirst, is not usually serious, providing the person cools down within 30 minutes.</p>\r\n\r\n<p>The more serious version is heat-stroke, when the body's core temperature goes above 105 degrees Fahrenheit (40.6 degrees Celsius). It is a medical emergency and can lead to long-term organ damage and death.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-09/l2bq8chg_taylor-swift_625x300_15_September_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Taylor Swift postponed her show in Rio de Janeiro due to scorching heat. (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/openais-sam-altman-planning-new-venture-after-getting-fired-report-4586215"},"title":{"#cdata-section":"OpenAI's Sam Altman Planning New Venture After Getting Fired: Report"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/openais-sam-altman-planning-new-venture-after-getting-fired-report-4586215"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 02:06:23 +0530"},"description":{"#cdata-section":"Sam Altman, the recently ousted CEO of OpenAI, has been telling investors that he is planning to launch a new venture, the Information reported on Saturday."},"content:encoded":{"#cdata-section":"<p>Sam Altman, the recently ousted CEO of OpenAI, has been telling investors that he is planning to launch a new venture, the Information reported on Saturday.</p>\r\n\r\n<p>Former OpenAI president Greg Brockman is expected to join the effort and the project is still in development, the report added citing a person familiar with the matter.</p>\r\n\r\n<p>Altman could not be reached for comment and Greg Brockman did not immediately respond to a Reuters' request for comment.</p>\r\n\r\n<p>Sam Altman and Apple's former design chief Jony Ive have been discussing building a new artificial intelligence (AI) hardware device, the Information reported in September. It also reported at the time that SoftBank CEO Masayoshi Son has also been involved in the conversation.</p>\r\n\r\n<p>The board of OpenAI, the company behind hit product ChatGPT, on Friday pushed out its high-profile CEO Altman. Co-founder Brockman quit shortly after Altman was fired.</p>\r\n\r\n<p>Sam Altman's ouster was over \"breakdown of communications,\" not \"malfeasance\", Chief Operating Officer Brad Lightcap wrote in an internal company memo earlier Saturday that was viewed by Reuters.</p>\r\n\r\n<p></p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/2ou52js8_sam-altman-afp_625x300_18_November_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Sam Altman's ouster was over \"breakdown of communications\". (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/palestinian-authority-should-ultimately-govern-gaza-west-bank-joe-biden-4586190"},"title":{"#cdata-section":"Palestinian Authority Should Ultimately Govern Gaza, West Bank: Joe Biden"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/palestinian-authority-should-ultimately-govern-gaza-west-bank-joe-biden-4586190"},"pubDate":{"#cdata-section":"Sun, 19 Nov 2023 01:24:28 +0530"},"description":{"#cdata-section":"US President Joe Biden said on Saturday the Palestinian Authority should ultimately govern the Gaza Strip and the West Bank following the Israel-Hamas war."},"content:encoded":{"#cdata-section":"<p>US President Joe Biden said on Saturday the Palestinian Authority should ultimately govern the Gaza Strip and the West Bank following the Israel-Hamas war.</p>\r\n\r\n<p>\"As we strive for peace, Gaza and the West Bank should be reunited under a single governance structure, ultimately under a revitalized Palestinian Authority, as we all work toward a two-state solution,\" Biden said in an opinion article in the Washington Post.</p>\r\n\r\n<p>\"There must be no forcible displacement of Palestinians from Gaza, no reoccupation, no siege or blockade, and no reduction in territory,\" Joe Biden said.</p>\r\n\r\n<p>He used the op-ed to try to answer the question of what the United States wants for Gaza once the conflict is over. Israeli Prime Minister Benjamin Netanyahu has said Israel must maintain \"overall military responsibility\" in Gaza \"for the foreseeable future.\"</p>\r\n\r\n<p>Biden also said the United States is prepared to issue visa bans against \"extremists\" attacking civilians in the West Bank. Violence by Israeli settlers against Palestinians living in the Israeli-occupied West Bank has increased since the Oct. 7 Hamas attack on Israel.</p>\r\n\r\n<p>\"I have been emphatic with Israel's leaders that extremist violence against Palestinians in the West Bank must stop and that those committing the violence must be held accountable,\" Joe Biden said.</p>\r\n\r\n<p>The West Bank, home to 3 million Palestinians who live among more than half a million Jewish settlers, has been seething for more than 18 months, drawing growing international concern as violence has escalated after Oct. 7.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-10/bpk9iqmg_joe-biden-afp_625x300_17_October_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Joe Biden said the Palestinian Authority should ultimately govern the Gaza Strip. (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/jailed-russian-ultranationalist-nominates-himself-for-president-4586111"},"title":{"#cdata-section":"Jailed Russian Ultranationalist Nominates Himself For President"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/jailed-russian-ultranationalist-nominates-himself-for-president-4586111"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 23:38:07 +0530"},"description":{"#cdata-section":"Igor Girkin, a prominent ultranationalist in custody in Russia awaiting trial on charges of inciting extremism, nominated himself to run for president in 2024 in an announcement read on"},"content:encoded":{"#cdata-section":"<p>Igor Girkin, a prominent ultranationalist in custody in Russia awaiting trial on charges of inciting extremism, nominated himself to run for president in 2024 in an announcement read on his behalf on Saturday, the online SOTA news channel said.</p>\r\n\r\n<p>Girkin said from custody in August that he would make a better president than Vladimir Putin, whom he described as \"too kind\". His comments at the time were laced with irony and he is considered an unlikely contender.</p>\r\n\r\n<p>In a post on its Telegram channel, SOTA carried a video of Oleg Nelzin, whom it described as co-chair of a group called Russian Movement for Strelkov, reading a letter from Girkin at a news conference.</p>\r\n\r\n<p>The letter instructed his followers to set up a headquarters and start collecting signatures for his candidacy, SOTA said. Supporters of Girkin said in September that his criminal investigation had been extended until Dec. 18.</p>\r\n\r\n<p>Girkin, who lost an appeal against pre-trial detention in a Moscow court in August, is best known in the West for his conviction in absentia by a Dutch court for his role in shooting down a Malaysian passenger plane over eastern Ukraine in 2014.</p>\r\n\r\n<p>Kremlin spokesman Dmitry Peskov has said Putin has unprecedented support and that he would win an overwhelming majority if he ran.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/3jnojkno_igor-girkin_625x300_19_November_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Igor Girkin is a prominent ultranationalist in custody in Russia. (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/death-count-in-gaza-crosses-12-000-5-000-of-them-children-says-hamas-4586053"},"title":{"#cdata-section":"Death Count In Gaza Crosses 12,000, 5,000 Of Them Children, Says Hamas"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/death-count-in-gaza-crosses-12-000-5-000-of-them-children-says-hamas-4586053"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 23:07:17 +0530"},"description":{"#cdata-section":"Gaza's Hamas government said Saturday the death count from fighting between Israeli troops and Hamas in the Palestinian territory had reached 12,300 since hostilities started on October 7."},"content:encoded":{"#cdata-section":"<p>Gaza's Hamas government said Saturday the death count from fighting between Israeli troops and Hamas&nbsp; in the Palestinian territory had reached 12,300 since hostilities started on October 7.</p>\r\n\r\n<p>The Hamas government said more than 5,000 children were among the dead, alongside 3,300 women, with 30,000 more people wounded. Its health ministry has previously said it can no longer give exact numbers as intense fighting has prevented bodies from being recovered.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/nl1tpci8_israel-hamas-attack-_625x300_13_November_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"With the war entering its seventh week, there was no sign of a let-up (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/ukraine-says-two-killed-seven-injured-in-russian-strike-near-frontline-zaporizhzhia-4585999"},"title":{"#cdata-section":"Ukraine Says Two Killed, Seven Injured In Russian Strike Near Frontline"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/ukraine-says-two-killed-seven-injured-in-russian-strike-near-frontline-zaporizhzhia-4585999"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 22:46:40 +0530"},"description":{"#cdata-section":"Ukraine said two first responders were killed and at least seven people injured in Russian rocket strikes on the southeastern region of Zaporizhzhia on Saturday."},"content:encoded":{"#cdata-section":"<p>Ukraine said two first responders were killed and at least seven people injured in Russian rocket strikes on the southeastern region of Zaporizhzhia on Saturday.</p>\r\n\r\n<p>The attacks came as Kyiv's air force said Russia fired 38 drones at its territory overnight -- the highest reported number in more than six weeks.</p>\r\n\r\n<p>Ukrainian police said Russia fired a series of rocket strikes at the village of Komyshuvakha, close to the frontline in the Zaporizhzhia region, which Russia claimed to have annexed last year.</p>\r\n\r\n<p>\"As a result of the first two strikes, four local residents were injured and a fire broke out in a residential building,\" they said in a statement.&nbsp;</p>\r\n\r\n<p>\"When the police and rescuers arrived at the scene, Russians conducted another strike. Two emergency service workers were killed, and three more were injured.\"&nbsp;</p>\r\n\r\n<p>Separately, Ukraine's air force said Saturday it shot down 29 of the 38 Iranian-made Shahed drones -- also known as \"kamikaze drones\" because they are packed with explosives to detonate upon reaching their targets -- fired by Russia.</p>\r\n\r\n<p>According to its figures, that is the most drones launched by Russia in an overnight attack since September 30.</p>\r\n\r\n<p>An energy facility was hit in the southern Odesa region, with the resulting fire quickly extinguished, Ukraine's emergency services said.</p>\r\n\r\n<p>Russia's defence ministry said its forces had shot down 20 Ukrainian aerial drones over Russian-controlled parts of Ukraine, and seven naval drones in the Black Sea, off the annexed peninsula of Crimea.</p>\r\n\r\n<p>Ukraine also said Saturday that its forces \"continue to hold positions on the left (eastern) bank of the Dnipro river.\"</p>\r\n\r\n<p>Ukrainian and Russian forces have been entrenched on opposite sides of the vast waterway in the southern Kherson region for more than a year, after Russia withdrew its troops from the western bank last November.</p>\r\n\r\n<p>Ukrainian forces have staged multiple attempts to cross and hold positions on the Russian-controlled side -- with officials in Kyiv finally reporting a \"successful\" breakthrough last week.</p>\r\n\r\n<p>\"Our defenders are consolidating their positions and firing on the occupiers,\" the general staff said in a Saturday morning briefing on its operations on the eastern side of the river.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-07/5u3d700o_russia-ukraine-war-_625x300_11_July_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"An energy facility was hit in the southern Odesa region, Ukraine said (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/ex-pak-pm-shehbaz-sharif-others-acquitted-in-mega-housing-corruption-scam-4585947"},"title":{"#cdata-section":"Ex-Pak PM Shehbaz Sharif, Others Acquitted In Mega Corruption Scam"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/ex-pak-pm-shehbaz-sharif-others-acquitted-in-mega-housing-corruption-scam-4585947"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 22:25:14 +0530"},"description":{"#cdata-section":"Pakistan's former prime minister Shehbaz Sharif and two members of the incumbent federal caretaker cabinet were acquitted in a mega housing corruption scam on Saturday."},"content:encoded":{"#cdata-section":"<p>Pakistan's former prime minister Shehbaz Sharif and two members of the incumbent federal caretaker cabinet were acquitted in a mega housing corruption scam on Saturday.</p>\r\n\r\n<p>Accountability Court Lahore Judge Ali Zulqarnain Awan acquitted Shehbaz, federal cabinet members -- Fawad Hassan Fawad and Ahad Khan Cheema -- and others in the mega Ashiana-i-Iqbal Housing Scheme corruption case on the report of the national anti-graft body.</p>\r\n\r\n<p>Shehbaz Sharif, 72, is the younger brother of three-time former prime minister Nawaz Sharif.</p>\r\n\r\n<p>National Accountability Bureau (NAB) Prosecutor Waris Ali Janjua submitted a report on the interpretation of a recent order by the Supreme Court wherein the trial courts had been restrained from announcing final orders till a decision on appeals against a judgment on the amendments in the law.</p>\r\n\r\n<p>\"The stay order of the top court does not apply to acquittal applications in hand as the trial court heard them on merits and the defunct amendments in the law had nothing to do with the proceedings,\" he told the court.</p>\r\n\r\n<p>After going through the NAB's report, the judge allowed the applications of the accused persons and acquitted them in the reference. The judge observed: \"There is no probability of the conviction in the case.\"&nbsp;</p>\r\n\r\n<p>Since the ouster of former premier Imran Khan in April 2022, the Sharif brothers - Nawaz Sharif and Shehbaz Sharif - and other members of the Pakistan Muslim League-Nawaz (PML-N) party have been getting relief from courts in one corruption case or another.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2022-09/66abjdp8_shehbaz-sharif-pakistan-pm-afp_625x300_21_September_22.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Shehbaz Sharif is the younger brother of three-time former prime minister Nawaz Sharif (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/us-presidential-elections-my-hindu-faith-led-me-to-this-presidential-campaign-vivek-ramaswamy-4585939"},"title":{"#cdata-section":"\"There's One True God\": Vivek Ramaswamy Talks About His Hindu Faith"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/us-presidential-elections-my-hindu-faith-led-me-to-this-presidential-campaign-vivek-ramaswamy-4585939"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 22:20:04 +0530"},"description":{"#cdata-section":"Republican presidential candidate Vivek Ramaswamy opened up about his 'Hindu' faith, emphasizing that it provides him with freedom and has motivated him to undertake this presidential campaign as a moral obligation."},"content:encoded":{"#cdata-section":"<p>Republican presidential candidate Vivek Ramaswamy opened up about his 'Hindu' faith, emphasizing that it provides him with freedom and has motivated him to undertake this presidential campaign as a moral obligation.</p>\r\n\r\n<p>Speaking at 'The Family Leader' forum organized by The Daily Signal platform on Saturday, the Indian-American entrepreneur drew parallels between the teachings of Hinduism and Christianity, expressing his intention to promote shared values for the benefit of the next generation.</p>\r\n\r\n<p>Mr Ramaswamy said, \"My faith is what gives me my freedom. My faith is what led me to this presidential campaign...I am a Hindu. I believe there is one true God. I believe god put each of us here for a purpose. My faith teaches us that we have a duty, a moral duty to realise that purpose. Those are God's instruments that work through us in different ways, but we are still equal because God resides in each of us. That's the core of my faith\".</p>\r\n\r\n<p>Speaking about his upbringing, he said that he was instilled with values surrounding family, marriage, and respect for parents.</p>\r\n\r\n<p>\"I grew up in a traditional household. My parents taught me family is the foundation. Respect your parents. Marriage is sacred. Abstinence before marriage is the way to go. Adultery is wrong. Marriage is between a man and a woman. Divorce is not just some preference you opt for...you get married before God and you make an oath to God and your family,\" Mr Ramaswamy said.</p>\r\n\r\n<p>The Ohio-based bio-tech entrepreneur also drew parallels between Hindu and Christian faiths and said that these are the 'shared values' of God, and he will stand for those shared values.</p>\r\n\r\n<p>\"I went to Christian High School. What do we learn? We learned the 10 commandments. We read the Bible. Scriptures class. God is real. There is one true God. Don't take his name in vain. Respect your parents. Don't lie. Don't steal. Don't commit adultery. What I learned at that time, is that these values are familiar to me. They don't belong to Hindus. But, they don't belong to Christians either. They belong to God actually. And I think these are the values that undergird this country,\" Mr Ramaswamy said.</p>\r\n\r\n<p>He added, \"Can I be a President who can promote Christianity across the country? I can't...I don't think that's what we should want a US President to do either...but will I stand for those shared values? Will I promote them in the examples that we set for the next generations? You are damn right, I will! Because that's my duty\".</p>\r\n\r\n<p>The Republican leader further said that as a president it will be his responsibility to make faith, family, hard work, patriotism, and faith \"cool\" again in the US.</p>\r\n\r\n<p>\"One of the teachings is that we don't choose who God chooses to work through. That's not our choice, that belongs to God...so yes are founded on Judai-Christian values and these are values that I deeply share....as a president, it is my duty to make faith and family and hard work and patriotism, but faith includes, cool again in this country for the next generation.</p>\r\n\r\n<p>Notably, 38-year-old Vivek Ramaswamy is a native of southwest Ohio. His mother was a geriatric psychiatrist and his father worked as an engineer at General Electric. His parents migrated to the US from Kerala.</p>\r\n\r\n<p>Vivek Ramaswamy's campaign has gained attention, and he has risen in GOP primary polls, although he still trails behind Trump and Florida Governor Ron DeSantis in support.</p>\r\n\r\n<p>The next US presidential election is scheduled for November 5, 2024.</p><p><i>(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/ub0ng3eo_vivek-ramaswamy_625x300_08_November_23.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Vivek Ramaswamy is a native of southwest Ohio (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/urgent-need-to-ease-gaza-humanitarian-crisis-german-chancellor-tells-netanyahu-4585921"},"title":{"#cdata-section":"\"Urgent Need To Ease Gaza Crisis\": German Chancellor Tells Netanyahu"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/urgent-need-to-ease-gaza-humanitarian-crisis-german-chancellor-tells-netanyahu-4585921"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 22:11:36 +0530"},"description":{"#cdata-section":"German Chancellor Olaf Scholz told Israeli Prime Minister Benjamin Netanyahu on Saturday there was an \"urgent need\" to ease the humanitarian crisis in Gaza, where Israeli forces have vowed to destroy Hamas."},"content:encoded":{"#cdata-section":"<p>German Chancellor Olaf Scholz told Israeli Prime Minister Benjamin Netanyahu on Saturday there was an \"urgent need\" to ease the humanitarian crisis in Gaza, where Israeli forces have vowed to destroy Hamas.</p>\r\n\r\n<p>Scholz \"underscored the urgent need to improve the humanitarian situation for residents in the Gaza Strip,\" his office said in a statement after a call between the two leaders.</p>\r\n\r\n<p>\"Humanitarian ceasefires could contribute to a significant improvement in care for the population,\" the statement said.</p>\r\n\r\n<p>It added that Netanyahu had \"given details on Israel's efforts to protect civilians in the Gaza Strip\".</p>\r\n\r\n<p>Hamas seized 239 hostages on October 7 when they surged across Gaza's militarised border into southern Israel to kill around 1,200 people, mostly civilians, according to Israeli officials.</p>\r\n\r\n<p>In response, Israel's air strikes and ground attacks in the Gaza Strip that have killed 12,000 people, according to the Palestinian territory's Hamas government.</p>\r\n\r\n<p>Israel has refused to heed international calls for a ceasefire before all hostages are released.</p>\r\n\r\n<p>Scholz, who was one of the first western leaer to visit Israel after the October 7 attacks, assured Netanyahu of \"Germany's complete solidarity with the people of Israel\" and assured his country's \"unfailing support\".</p>\r\n\r\n<p>The comments came after Scholz met in Berlin on Friday with Turkey's President Recep Tayyip Erdogan, who has slammed Israel's assault on Gaza as a violation of human rights and called Israel a \"terror state\".</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-05/c21lpumg_olaf-scholz-_625x300_26_May_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Olaf Scholz underscored the urgent need to improve the humanitarian situation in Gaza (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/taylor-swift-devastated-after-fan-23-dies-at-sweltering-brazil-concert-4585856"},"title":{"#cdata-section":"Taylor Swift \"Devastated\" After Fan Dies At Sweltering Brazil Concert"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/taylor-swift-devastated-after-fan-23-dies-at-sweltering-brazil-concert-4585856"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 21:38:10 +0530"},"description":{"#cdata-section":"American superstar Taylor Swift on Saturday was mourning the death of a 23-year-old fan during her first show in Brazil before a crowd of 60,000."},"content:encoded":{"#cdata-section":"<p>American superstar Taylor Swift on Saturday was mourning the death of a 23-year-old fan during her first show in Brazil before a crowd of 60,000.</p>\r\n\r\n<p>The death came in an overheated venue in Rio de Janeiro during which Swift, as seen in videos on social media, tried to help thirsty fans by dispatching aides to pass out water bottles and even throwing one to the audience herself.</p>\r\n\r\n<p>\"It's with a shattered heart that I say we lost a fan earlier tonight,\" Swift said in a post on Instagram to her millions of followers. \"I can't even tell you how devastated I am by this.\"</p>\r\n\r\n<p>The Rio Health Secretariat reported that Benevides died Friday after saying she felt poorly and then suffered a cardiorespiratory arrest in the Nilton Santos stadium during Swift's concert, her first in Brazil.</p>\r\n\r\n<p>It said efforts to revive the young woman failed and an investigation has been launched. \"At this time, the cause of death cannot be determined,\" the agency said.</p>\r\n\r\n<p>The death occurred as much of central and southeast Brazil has been suffering an unusually oppressive springtime heat wave.</p>\r\n\r\n<p>The heat index in Rio -- combining air temperature and humidity -- had risen as high as 59 degrees centigrade (138 Fahrenheit) during the day.&nbsp;</p>\r\n\r\n<p>Event organizers are facing scathing criticism after refusing to allow people to bring water bottles into the venue, despite the soaring temperatures.</p>\r\n\r\n<p>Justice Minister Flavio Dion said Saturday that his ministry would adopt \"necessary measures on access to water in shows and other public spectacles,\" as well as investigating responsibility for damage \"already caused.\"&nbsp;</p>\r\n\r\n<p>\"It is unacceptable that people suffer, faint and even die due to lack of access to water,\" he said, while adding that the cause of Benevides' death had yet to be formally ascertained.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-10/e8mqk5po_taylor-swift_625x300_12_October_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"\"I can't even tell you how devastated I am by this,\" Taylor Swift said in a post (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/french-senator-joel-guerriau-suspended-for-giving-date-rape-drug-to-female-mp-sexual-assault-4585812"},"title":{"#cdata-section":"French Senator, 66, Suspended For Giving Date-Rape Drug To Female MP"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/french-senator-joel-guerriau-suspended-for-giving-date-rape-drug-to-female-mp-sexual-assault-4585812"},"pubDate":{"#cdata-section":"Sat, 18 Nov 2023 21:15:20 +0530"},"description":{"#cdata-section":"A leading French party on Saturday suspended 66-year-old Senator Joel Guerriau after his arrest for giving a date-rape drug to a female MP as part of a plot to carry out a sexual assault."},"content:encoded":{"#cdata-section":"<p>A leading French party on Saturday suspended 66-year-old Senator Joel Guerriau after his arrest for giving a date-rape drug to a female MP as part of a plot to carry out a sexual assault.</p>\r\n\r\n<p>Guerriau is accused of spiking a glass of champagne he gave to 48-year-old Sandrine Josso, whose lawyer said she was now in \"shock\".</p>\r\n\r\n<p>The senator and banker was formally charged on Friday and is now in detention, while revelations over the case have shocked the French public.&nbsp;</p>\r\n\r\n<p>The Horizons party, led by former prime minister Edouard Philippe, suspended Guerriau on Saturday as a first step to kicking him out.</p>\r\n\r\n<p>Horizons said it \"will never tolerate the slightest complacency towards sexual and sexist violence\".</p>\r\n\r\n<p>The Independents caucus in the French Senate also suspended Guerriau and warned he would be expelled.&nbsp;</p>\r\n\r\n<p>Josso, a member of the centrist MoDem party, fell ill after accepting a glass of champagne on Tuesday night at Guerriau's Paris home, prosecutors said.&nbsp;</p>\r\n\r\n<p>The two have known each other for about 10 years but are not in an intimate relationship, they added.</p>\r\n\r\n<p>She saw the senator \"grabbing a small plastic bag containing something white, in a drawer in his kitchen\", her lawyer Julia Minkowski told AFP.&nbsp;</p>\r\n\r\n<p>\"She had to deploy monumental physical and intellectual forces to overcome her terror and extricate herself at the last minute from this ambush,\" Minkowski said.</p>\r\n\r\n<p>Police searched Guerriau's office and home and prosecutors confirmed that ecstasy had been found. Tests revealed that Josso had ecstasy in her system, investigators said, prompting her to file a criminal complaint.</p>\r\n\r\n<p>Guerriau, a senator since 2011, denied any sexual assault plot in a first formal questioning on Friday.</p>\r\n\r\n<p>A source close to the investigation said Guerriau had told investigators he believed that he had procured a drug to induce euphoria, but that it was not ecstasy, from another senate member to help him with personal troubles.</p>\r\n\r\n<p>Guerriau \"will fight to prove he never intended to administer a substance on his colleague and longstanding friend to abuse her\", said his lawyer, Remi-Pierre Drai.</p>\r\n\r\n<p>\"Guerriau is not a predator. He is an honest man, respected and respectable.\"</p>\r\n\r\n<p>Josso has received widespread backing. \"Full and complete support to my colleague Sandrine Josso,\" said MoDem vice president in the National Assembly, Elodie Jacquier-Laforge, in a social media post.</p>\r\n\r\n<p>\"Neither procrastination, nor complacency, our thoughts are with the complainant,\" said Christophe Bechu, minister for ecological transition and secretary general of Horizons.</p>\r\n\r\n<p>Saint-S&amp;#233;bastien-sur-Loire, the western town where Guerriau was mayor for 22 years, was \"in shock\", according to local lawmaker Herve Camus.</p>\r\n\r\n<p>He said Guerriau was an \"affable\" man who had a \"certain aura\" with the town's population but who could also be \"very unpleasant with opposition lawmakers\".</p>\r\n\r\n<p>Laurent Keunebroek, an opposition lawmaker in Saint-Sebastien, said the scandal could have \"consequences\" on the views about elected officials.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-11/hirngrng_joel-guerriau_120x90_18_November_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Joel Guerriau denied any sexual assault plot in a first formal questioning (AFP)"}}}]}}}