<?xml version="1.0" encoding="UTF-8"?><rss version="2.0"
	xmlns:content="http://purl.org/rss/1.0/modules/content/"
	xmlns:wfw="http://wellformedweb.org/CommentAPI/"
	xmlns:dc="http://purl.org/dc/elements/1.1/"
	xmlns:atom="http://www.w3.org/2005/Atom"
	xmlns:sy="http://purl.org/rss/1.0/modules/syndication/"
	xmlns:slash="http://purl.org/rss/1.0/modules/slash/"
	
	xmlns:georss="http://www.georss.org/georss"
	xmlns:geo="http://www.w3.org/2003/01/geo/wgs84_pos#"
	>

<channel>
	<title>World &#8211; TIME</title>
	<atom:link href="https://time.com/world/feed/" rel="self" type="application/rss+xml" />
	<link>https://time.com</link>
	<description>Current &#38; Breaking News &#124; National &#38; World Updates</description>
	<lastBuildDate>Wed, 25 Jun 2025 22:19:15 +0000</lastBuildDate>
	<language>en-US</language>
	<sy:updatePeriod>
	hourly	</sy:updatePeriod>
	<sy:updateFrequency>
	1	</sy:updateFrequency>
	<generator>https://wordpress.org/?v=6.4.5</generator>
<site xmlns="com-wordpress:feed-additions:1">228315549</site>	<item>
		<title>نرگس محمدی، برنده نوبل صلح: از دست رفتن دموکراسی چه آسان است و چه معنایی دارد</title>
		<link>https://time.com/7297614/narges-mohammadi-iran-america-democracy-essay-farsi/</link>
					<comments>https://time.com/7297614/narges-mohammadi-iran-america-democracy-essay-farsi/#respond</comments>
		
		<dc:creator><![CDATA[Narges Mohammadi]]></dc:creator>
		<pubDate>Wed, 25 Jun 2025 21:55:03 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[world affairs]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297614</guid>

					<description><![CDATA[در پیامی هشدارآمیز، نرگس محمدی به مردم جوامع دموکراتک مانند آمریکا یادآور می‌شود: حقوق و آزادی‌هایی که امروز بدیهی می‌نمایند، نه دائمی‌اند و نه تضمین‌شده؛ حفظ آن‌ها نیازمند هوشیاری، تعهد و مقاومت مداوم است
]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297614"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297614/narges-mohammadi-iran-america-democracy-essay-farsi/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/Narges-Mohammadi-1.jpg" alt="Narges-Mohammadi"/>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1606;&#1582;&#1587;&#1578; &#1576;&#1585; &#1575;&#1740;&#1606; &#1576;&#1575;&#1608;&#1585;&#1605; &#1705;&#1607; &#1607;&#1605;&#1607; &#1605;&#1575; &#1605;&#1740; &#1576;&#1575;&#1740;&#1587;&#1578; &#1575;&#1586; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575; &#1608; &#1570;&#1585;&#1605;&#1575;&#1606; &#1607;&#1575;&#1740; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1578;&#1740;&#1705;  &#1583;&#1585; &#1607;&#1585; &#1580;&#1575;&#1740; &#1575;&#1740;&#1606; &#1705;&#1585;&#1607; &#1582;&#1575;&#1705;&#1740; &#1605;&#1581;&#1575;&#1601;&#1592;&#1578; &#1705;&#1606;&#1740;&#1605;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1588;&#1575;&#1740;&#1583; &#1575;&#1605;&#1705;&#1575;&#1606; &#1605;&#1575;&#1583;&#1740; &#1576;&#1585;&#1575;&#1740; &#1705;&#1605;&#1705; &#1576;&#1607; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1588;&#1605;&#1575; &#1585;&#1575; &#1606;&#1583;&#1575;&#1588;&#1578;&#1607; &#1576;&#1575;&#1588;&#1740;&#1605;&#1548; &#1575;&#1605;&#1575; &#1583;&#1585; &#1576;&#1581;&#1585;&#1575;&#1606; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1705;&#1606;&#1608;&#1606;&#1740;&#1548; &#1575;&#1605;&#1740;&#1583;&#1608;&#1575;&#1585;&#1605; &#1575;&#1740;&#1606; &#1711;&#1601;&#1578;&#1711;&#1608; &#1576;&#1607; &#1587;&#1607;&#1605; &#1582;&#1608;&#1583; &#1587;&#1575;&#1586;&#1606;&#1583;&#1607; </bdo><bdo lang="fa" dir="rtl">.</bdo><bdo lang="fa" dir="rtl">&#1576;&#1575;&#1588;&#1583;&#1548; &#1608; &#1583;&#1585; &#1606;&#1607;&#1575;&#1740;&#1578; &#1576;&#1576;&#1740;&#1606;&#1740;&#1605; &#1705;&#1607; &#1588;&#1576;&#1575;&#1607;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1605;&#1575; &#1576;&#1587;&#1740;&#1575;&#1585; &#1593;&#1605;&#1740;&#1602;&zwnj;&#1578;&#1585; &#1575;&#1586; &#1578;&#1601;&#1575;&#1608;&#1578;&zwnj;&#1607;&#1575;&#1740;&#1740; &#1575;&#1587;&#1578; &#1705;&#1607; &#1576;&#1607; &#1670;&#1588;&#1605; &#1605;&#1740;&zwnj;&#1570;&#1740;&#1583;</bdo></p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1605;&#1575; &#1582;&#1608;&#1583; &#1585;&#1575; &#1588;&#1585;&#1740;&#1705; &#1605;&#1576;&#1575;&#1585;&#1586;&#1607; &#1588;&#1605;&#1575; &#1576;&#1585;&#1575;&#1740; &#1576;&#1585;&#1602;&#1585;&#1575;&#1585;&#1740; &#1608; &#1581;&#1601;&#1575;&#1592;&#1578; &#1575;&#1586; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1605;&#1740;&zwnj;&#1583;&#1575;&#1606;&#1740;&#1605;&#1548; &#1670;&#1608;&#1606; &#1608;&#1580;&#1608;&#1583; &#1608; &#1593;&#1740;&#1606;&#1740;&#1578;&zwnj;&#1740;&#1575;&#1601;&#1578;&#1711;&#1740;&#1616; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1583;&#1585; &#1576;&#1585;&#1582;&#1740; &#1705;&#1588;&#1608;&#1585;&#1607;&#1575;&#1740; &#1580;&#1607;&#1575;&#1606;&#1548; &#1576;&#1607; &#1608;&#1740;&#1688;&#1607; &#1583;&#1585; &#1594;&#1585;&#1576;&#1548; &#1576;&#1585;&#1575;&#1740; &#1578;&#1602;&#1604;&#1575;&#1711;&#1585;&#1575;&#1606;&#1616; &#1578;&#1581;&#1602;&#1602;&#1616; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1583;&#1585; &#1705;&#1588;&#1608;&#1585;&#1607;&#1575;&#1740;&#1616; &#1594;&#1740;&#1585;&#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1578;&#1740;&#1705;&#1548; &#1576;&#1607; &#1605;&#1579;&#1575;&#1576;&#1607; &#1575;&#1604;&#1711;&#1608; &#1608; &#1578;&#1580;&#1587;&#1605;&zwnj;&#1576;&#1582;&#1588;&#1616; &#8220;&#1575;&#1740;&#1583;&#1607;&#8221; &#1608; &#1585;&#1608;&#1740;&#1575;&#1740;&#1740; &#1576;&#1608;&#1583;&#1607; &#1575;&#1587;&#1578; &#1705;&#1607; &#1576;&#1585;&#1575;&#1740; &#1570;&#1606; &#1605;&#1576;&#1575;&#1585;&#1586;&#1607; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1606;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1575;&#1711;&#1585; &#1576;&#1582;&#1608;&#1575;&#1607;&#1605; &#1587;&#1575;&#1583;&#1607;&zwnj;&#1578;&#1585; &#1578;&#1608;&#1590;&#1740;&#1581; &#1576;&#1583;&#1607;&#1605; &#1575;&#1586; &#1607;&#1605;&#1575;&#1606; &#1583;&#1608;&#1585;&#1575;&#1606;&#1740; &#1705;&#1607; &#1601;&#1602;&#1591; &#1605;&#1585;&#1583;&#1575;&#1606; &#1581;&#1602;&#1616; &#1585;&#1571;&#1740; &#1583;&#1575;&#1588;&#1578;&#1606;&#1583;&#1548; &#1575;&#1606;&#1578;&#1582;&#1575;&#1576; &#1605;&#1740;&zwnj;&#1705;&#1585;&#1583;&#1606;&#1583; &#1608; &#1575;&#1606;&#1578;&#1582;&#1575;&#1576; &#1605;&#1740;&zwnj;&#1588;&#1583;&#1606;&#1583;&#1548; &#1578;&#1575; &#1586;&#1605;&#1575;&#1606;&#1740; &#1705;&#1607; &#1586;&#1606;&#1575;&#1606; &#1607;&#1605; &#1578;&#1608;&#1575;&#1606;&#1587;&#1578;&#1607; &#1575;&#1606;&#1583; &#1576;&#1607; &#1580;&#1575;&#1740;&#1711;&#1575;&#1607; &#1581;&#1602;&#1608;&#1602;&#1740; &#1576;&#1585;&#1575;&#1576;&#1585; &#1582;&#1608;&#1583; &#1576;&#1585;&#1587;&#1606;&#1583;. &#1575;&#1586; &#1586;&#1605;&#1575;&#1606;&#1740; &#1705;&#1607; &#1585;&#1606;&#1711; &#1662;&#1608;&#1587;&#1578; &#1576;&#1607;&#1575;&#1606;&#1607;&zwnj;&#1575;&#1740; &#1576;&#1585;&#1575;&#1740; &#1576;&#1607; &#1576;&#1585;&#1583;&#1711;&#1740; &#1711;&#1585;&#1601;&#1578;&#1606; &#1583;&#1740;&#1711;&#1585;&#1740; &#1576;&#1608;&#1583;&#1548; &#1578;&#1575; &#1586;&#1605;&#1575;&#1606;&#1740; &#1705;&#1607; &#1587;&#1705;&#1575;&#1606; &#1705;&#1588;&#1608;&#1585;&#1740; &#1576;&#1575; &#1578;&#1605;&#1575;&#1605; &#1578;&#1606;&#1608;&#1593;&zwnj;&#1607;&#1575;&#1740;&#1588;&#1548; &#1583;&#1585; &#1583;&#1587;&#1578; &#1578;&#1605;&#1575;&#1605; &#1575;&#1601;&#1585;&#1575;&#1583;&#1548; &#1601;&#1575;&#1585;&#1594; &#1575;&#1586; &#1606;&#1688;&#1575;&#1583; &#1608; &#1580;&#1606;&#1587;&#1548; &#1608; &#1575;&#1593;&#1578;&#1576;&#1575;&#1585; &#1582;&#1575;&#1606;&#1608;&#1575;&#1583;&#1711;&#1740;&zwnj;&#1575;&#1588; &#1602;&#1585;&#1575;&#1585; &#1711;&#1585;&#1601;&#1578;&#1548; &#1575;&#1740;&#1606; &#1605;&#1576;&#1575;&#1585;&#1586;&#1607;&#1548; &#1605;&#1602;&#1589;&#1583; &#1606;&#1607;&#1575;&#1740;&#1740; &#1606;&#1583;&#1575;&#1585;&#1583;&#1548; &#1608; &#1576;&#1607; &#1582;&#1608;&#1583;&#1740; &#1582;&#1608;&#1583; &#1586;&#1606;&#1583;&#1711;&#1740; &#1585;&#1575; &#1605;&#1593;&#1606;&#1575; &#1608; &#1601;&#1585;&#1583;&#1575; &#1585;&#1575; &#1576;&#1607;&#1578;&#1585; &#1575;&#1586; &#1575;&#1605;&#1585;&#1608;&#1586; &#1605;&#1740; &#1587;&#1575;&#1586;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1575;&#1586; &#1575;&#1740;&#1606; &#1585;&#1608;&#1548; &#1588;&#1705;&#1606;&#1606;&#1583;&#1711;&#1740; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1575;&#1605;&#1585;&#1608;&#1586; &#1583;&#1585; &#1587;&#1591;&#1581; &#1580;&#1607;&#1575;&#1606;&#1740;&#1548; &#1576;&#1585;&#1575;&#1740; &#1607;&#1605;&#1607; &#1605;&#1575; &#1576;&#1587;&#1740;&#1575;&#1585; &#1605;&#1608;&#1580;&#1576; &#1606;&#1711;&#1585;&#1575;&#1606;&#1740; &#1575;&#1587;&#1578;. &#1605;&#1578;&#1586;&#1604;&#1586;&#1604; &#1588;&#1583;&#1606; &#1575;&#1585;&#1705;&#1575;&#1606; &#1575;&#1589;&#1604;&#1740; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1583;&#1585; &#1594;&#1585;&#1576;&#1548; &#1576;&#1607; &#1605;&#1593;&#1606;&#1575;&#1740; &#1575;&#1586; &#1583;&#1587;&#1578; &#1585;&#1601;&#1578;&#1606; &#1740;&#1705; &#1584;&#1607;&#1606;&#1740;&#1578; &#1740;&#1575; &#1584;&#1607;&#1606;&#1740;&#1578; &#1586;&#1583;&#1575;&#1740;&#1740;</bdo>  <bdo lang="fa" dir="rtl">&#1575;&#1586; &#1586;&#1606;&#1583;&#1711;&#1740; &#1575;&#1580;&#1578;&#1605;&#1575;&#1593;&#1740; &#1575;&#1606;&#1587;&#1575;&#1606;&#1740; &#1605;&#1575; &#1605;&#1576;&#1578;&#1606;&#1740; &#1576;&#1585; &#1705;&#1585;&#1575;&#1605;&#1578; &#1575;&#1606;&#1587;&#1575;&#1606;&#1740;&#1548; &#1570;&#1586;&#1575;&#1583;&#1740; &#1608; &#1607;&#1605;&#1576;&#1587;&#1578;&#1711;&#1740; &#1582;&#1608;&#1575;&#1607;&#1583; &#1576;&#1608;&#1583;. &#1575;&#1586; &#1605;&#1606; &#1576;&#1607; &#1593;&#1606;&#1608;&#1575;&#1606; &#1705;&#1587;&#1740; &#1705;&#1607; &#1587;&#1575;&#1604;&#1607;&#1575; &#1583;&#1585; &#1582;&#1575;&#1606;&#1607; &#1582;&#1608;&#1583; &#1605;&#1579;&#1604; &#1576;&#1740;&#1711;&#1575;&#1606;&#1607; &#1576;&#1575; &#1575;&#1608; &#1585;&#1601;&#1578;&#1575;&#1585; &#1588;&#1583;&#1607;&#1548; &#1608; &#1705;&#1587;&#1740; &#1705;&#1607; &#1576;&#1575; &#1575;&#1587;&#1578;&#1576;&#1583;&#1575;&#1583; &#1583;&#1740;&#1606;&#1740; &#1608; &#1570;&#1662;&#1575;&#1585;&#1578;&#1575;&#1740;&#1583; &#1580;&#1606;&#1587;&#1740;&#1578;&#1740; &#1580;&#1606;&#1711;&#1740;&#1583;&#1607; &#1575;&#1587;&#1578;&#1548; &#1576;&#1588;&#1606;&#1608;&#1740;&#1583; &#1705;&#1607; &#1583;&#1585;&#1608;&#1594; &#1575;&#1587;&#1578; &#1608;&#1602;&#1578;&#1740; &#1605;&#1740;&zwnj;&#1711;&#1608;&#1740;&#1606;&#1583; &#1578;&#1575;&#1585;&#1740;&#1582; &#1607;&#1585;&#1711;&#1586; &#1576;&#1607; &#1593;&#1602;&#1576; &#1576;&#1585;&#1606;&#1605;&#1740;&zwnj;&#1711;&#1585;&#1583;&#1583;. &#1575;&#1711;&#1585; &#1575;&#1605;&#1585;&#1608;&#1586; &#1576;&#1575; &#1601;&#1705;&#1585;&#1740; &#1588;&#1601;&#1575;&#1601; &#1608; &#1576;&#1575; &#1580;&#1583;&#1740;&#1578; &#1578;&#1583;&#1576;&#1740;&#1585;&#1740; &#1606;&#1705;&#1606;&#1740;&#1583;&#1548; &#1601;&#1585;&#1583;&#1575; &#1605;&#1605;&#1705;&#1606; &#1575;&#1587;&#1578; &#1578;&#1606;&#1607;&#1575; &#1606;&#1592;&#1575;&#1585;&#1607;&zwnj;&#1711;&#1585; &#1584;&#1607;&#1606;&#1740;&#1578;&zwnj;&#1586;&#1583;&#1575;&#1740;&#1740; &#1575;&#1586; &#1575;&#1605;&#1585; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1576;&#1575;&#1588;&#1740;&#1583;&#1548; &#1670;&#1608;&#1606; &#1705;&#1575;&#1585; &#1575;&#1586; &#1705;&#1575;&#1585; &#1711;&#1584;&#1588;&#1578;&#1607; &#1575;&#1587;&#1578;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1576;&#1576;&#1740;&#1606;&#1740;&#1583; &#1670;&#1607; &#1575;&#1578;&#1601;&#1575;&#1602;&#1740; &#1583;&#1575;&#1585;&#1583; &#1576;&#1585; &#1587;&#1585; &#1585;&#1587;&#1575;&#1606;&#1607;&zwnj;&#1607;&#1575; &#1605;&#1740;&zwnj;&#1575;&#1601;&#1578;&#1583;. &#1585;&#1587;&#1575;&#1606;&#1607; &#1602;&#1585;&#1575;&#1585; &#1576;&#1608;&#1583; &#1585;&#1705;&#1606; &#1670;&#1607;&#1575;&#1585;&#1605; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1576;&#1575;&#1588;&#1583; &#1608; &#1588;&#1585;&#1591; &#1590;&#1585;&#1608;&#1585;&#1740; &#1588;&#1601;&#1575;&#1601;&#1740;&#1578; &#1608; &#1576;&#1602;&#1575;&#1740; &#1606;&#1592;&#1575;&#1605; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1578;&#1740;&#1705;. &#1575;&#1605;&#1575; &#1575;&#1605;&#1585;&#1608;&#1586; &#1583;&#1585; &#1576;&#1587;&#1740;&#1575;&#1585;&#1740; &#1575;&#1586; &#1605;&#1608;&#1575;&#1585;&#1583; &#1588;&#1575;&#1607;&#1583; &#1578;&#1576;&#1583;&#1740;&#1604; &#1588;&#1583;&#1606; &#1580;&#1585;&#1740;&#1575;&#1606;&zwnj;&#1607;&#1575;&#1740; &#1585;&#1587;&#1575;&#1606;&#1607;&zwnj;&#1575;&#1740; &#1576;&#1607; &#1575;&#1576;&#1586;&#1575;&#1585;&#1607;&#1575;&#1740; &#1605;&#1607;&#1606;&#1583;&#1587;&#1740; &#1575;&#1580;&#1578;&#1605;&#1575;&#1593;&#1740;&#1548; &#1606;&#1601;&#1585;&#1578;&zwnj;&#1662;&#1585;&#1575;&#1705;&#1606;&#1740;&#1548; &#1583;&#1740;&#1711;&#1585;&#1740;&zwnj;&#1607;&#1585;&#1575;&#1587;&#1740;&#1548; &#1608; &#1705;&#1578;&#1605;&#1575;&#1606; &#1581;&#1602;&#1740;&#1602;&#1578; &#1607;&#1587;&#1578;&#1740;&#1605;. &#1740;&#1575; &#1576;&#1607; &#1608;&#1590;&#1593;&#1740;&#1578; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&zwnj;&#1607;&#1575;&#1740; &#1575;&#1605;&#1585;&#1608;&#1586; &#1606;&#1711;&#1575;&#1607;&#1740; &#1576;&#1740;&#1606;&#1583;&#1575;&#1586;&#1740;&#1583;&#1548; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; &#1607;&#1605;&#1608;&#1575;&#1585;&#1607; &#1587;&#1606;&#1711;&#1585; &#1705;&#1588;&#1601; &#1583;&#1575;&#1606;&#1588;&#1548; &#1608; &#1605;&#1581;&#1604; &#1705;&#1606;&#1580;&#1705;&#1575;&#1608;&#1740; &#1608; &#1662;&#1585;&#1587;&#1588;&zwnj;&#1711;&#1585;&#1740; &#1576;&#1608;&#1583;&#1607; &#1575;&#1587;&#1578;&#1548; &#1670;&#1606;&#1575;&#1606;&#1705;&#1607; &#1605;&#1575; &#1583;&#1585; &#1575;&#1740;&#1585;&#1575;&#1606; &#1576;&#1607; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; &#1605;&#1740;&zwnj;&#1711;&#1608;&#1740;&#1740;&#1605; &laquo;&#1587;&#1606;&#1711;&#1585; &#1570;&#1586;&#1575;&#1583;&#1740;&raquo;. &#1575;&#1605;&#1575; &#1575;&#1605;&#1585;&#1608;&#1586; &#1583;&#1585; &#1576;&#1585;&#1582;&#1740; &#1605;&#1608;&#1575;&#1585;&#1583; &#1575;&#1587;&#1578;&#1602;&#1604;&#1575;&#1604; &#1570;&#1606; &#1586;&#1740;&#1585; &#1587;&#1608;&#1575;&#1604; &#1585;&#1601;&#1578;&#1607; &#1608; &#1576;&#1607; &#1605;&#1740;&#1583;&#1575;&#1606; &#1580;&#1606;&#1711; &#1602;&#1583;&#1585;&#1578;&#1548; &#1608; &#1581;&#1578;&#1740; &#1711;&#1575;&#1607; &#1586;&#1740;&#1585; &#1662;&#1575; &#1711;&#1584;&#1575;&#1588;&#1578;&#1606; &#1575;&#1589;&#1608;&#1604; &#1575;&#1582;&#1604;&#1575;&#1602;&#1740; &#1705;&#1575;&#1585; &#1593;&#1604;&#1605;&#1740; &#1608; &#1578;&#1608;&#1604;&#1740;&#1583; &#1583;&#1575;&#1606;&#1588; &#1576;&#1607; &#1606;&#1601;&#1593; &#1580;&#1585;&#1740;&#1575;&#1606;&zwnj;&#1607;&#1575;&#1740; &#1575;&#1602;&#1578;&#1583;&#1575;&#1585;&#1711;&#1585;&#1575;&#1740; &#1587;&#1740;&#1575;&#1587;&#1740; &#1608; &#1575;&#1602;&#1578;&#1589;&#1575;&#1583;&#1740; &#1578;&#1576;&#1583;&#1740;&#1604; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1740;&#1705; &#1602;&#1583;&#1605; &#1576;&#1740;&#1575;&#1740;&#1740;&#1605; &#1593;&#1602;&#1576;&zwnj;&#1578;&#1585; &#1608; &#1576;&#1607; &#1580;&#1607;&#1575;&#1606;&#1740;&zwnj;&#1587;&#1575;&#1586;&#1740; &#1606;&#1711;&#1575;&#1607; &#1705;&#1606;&#1740;&#1605;. &#1576;&#1585;&#1575;&#1740; &#1670;&#1606;&#1583; &#1583;&#1607;&#1607; &#1588;&#1575;&#1607;&#1583; &#1711;&#1587;&#1578;&#1585;&#1588; &#1605;&#1601;&#1575;&#1607;&#1740;&#1605; &#1608; &#1587;&#1576;&#1705;&zwnj;&#1607;&#1575;&#1740; &#1586;&#1606;&#1583;&#1711;&#1740; &#1580;&#1607;&#1575;&#1606;&#1588;&#1605;&#1608;&#1604; &#1608; &#1580;&#1588;&#1606; &#1576;&#1585;&#1575;&#1740; &#1578;&#1582;&#1585;&#1740;&#1576; &#1583;&#1740;&#1608;&#1575;&#1585;&#1607;&#1575; &#1576;&#1740;&#1606; &#1605;&#1585;&#1583;&#1605; &#1587;&#1585;&#1586;&#1605;&#1740;&#1606;&zwnj;&#1607;&#1575;&#1740; &#1605;&#1582;&#1578;&#1604;&#1601; &#1576;&#1608;&#1583;&#1607;&zwnj;&#1575;&#1740;&#1605;. &#1570;&#1606;&#1670;&#1607; &#1575;&#1605;&#1585;&#1608;&#1586; &#1583;&#1575;&#1585;&#1583; &#1575;&#1578;&#1601;&#1575;&#1602; &#1605;&#1740;&zwnj;&#1575;&#1601;&#1578;&#1583;&#1548; &#1585;&#1608;&#1606;&#1583; &#1580;&#1607;&#1575;&#1606;&#1740;&zwnj;&#1587;&#1575;&#1586;&#1740;&zwnj;&#1586;&#1583;&#1575;&#1740;&#1740; </bdo> de-globalization <bdo lang="fa" dir="rtl">&#1606;&#1740;&#1587;&#1578;&#1548; &#1576;&#1604;&#1705;&#1607; &#1576;&#1575;&#1586;&#1578;&#1575;&#1576; </bdo> blowback <bdo lang="fa" dir="rtl">&#1608; &#1575;&#1605;&#1578;&#1583;&#1575;&#1583; &#1605;&#1606;&#1591;&#1602;&#1740; &#1607;&#1605;&#1575;&#1606; &#1585;&#1608;&#1606;&#1583; &#1662;&#1740;&#1588;&#1740;&#1606; &#1575;&#1587;&#1578;. &#1587;&#1575;&#1604;&#1607;&#1575; &#1580;&#1607;&#1575;&#1606;&#1740;&zwnj;&#1587;&#1575;&#1586;&#1740;&#1548; &#1575;&#1586; &#1576;&#1575;&#1604;&#1575; &#1608; &#1705;&#1605;&#1575;&#1576;&#1740;&#1588; &#1576;&#1607; &#1589;&#1608;&#1585;&#1578; &#1583;&#1587;&#1578;&#1608;&#1585;&#1740; &#1608; &#1576;&#1575; &#1578;&#1571;&#1705;&#1740;&#1583; &#1589;&#1585;&#1601; &#1576;&#1585; &#1575;&#1608;&#1604;&#1608;&#1740;&#1578; &#1575;&#1602;&#1578;&#1589;&#1575;&#1583; &#1608; &#1576;&#1575;&#1586;&#1575;&#1585; &#1580;&#1607;&#1575;&#1606;&#1740; &#1576;&#1585; &#1583;&#1740;&#1711;&#1585; &#1602;&#1604;&#1605;&#1585;&#1608;&#1607;&#1575;&#1740; &#1575;&#1580;&#1578;&#1605;&#1575;&#1593;&#1740; &#1589;&#1608;&#1585;&#1578; &#1711;&#1585;&#1601;&#1578;&#1548; &#1576;&#1607; &#1580;&#1575;&#1740; &#1575;&#1740;&#1606;&#1705;&#1607; &#1575;&#1608;&#1604;&#1608;&#1740;&#1578; &#1576;&#1607; &#1575;&#1580;&#1605;&#1575;&#1593;&zwnj;&#1587;&#1575;&#1586;&#1740;&#1548; &#1576;&#1607; &#1711;&#1601;&#1578;&#1711;&#1608; &#1608; &#1607;&#1605;&#1576;&#1587;&#1578;&#1711;&#1740; &#1580;&#1607;&#1575;&#1606;&#1740; &#1583;&#1575;&#1583;&#1607; &#1588;&#1608;&#1583;. &#1583;&#1585;&#1587;&#1578; &#1575;&#1587;&#1578; &#1705;&#1607; &#1583;&#1740;&#1608;&#1575;&#1585;&#1607;&#1575;&#1740;&#1740; &#1601;&#1585;&#1608;&#1585;&#1740;&#1582;&#1578;&#1606;&#1583;&#1548; &#1575;&#1605;&#1575; &#1583;&#1740;&#1608;&#1575;&#1585;&#1607;&#1575;&#1740; &#1606;&#1575;&#1605;&#1585;&#1574;&#1740; &#1583;&#1740;&#1711;&#1585;&#1740; &#1587;&#1585;&#1576;&#1585;&#1570;&#1608;&#1585;&#1583;&#1606;&#1583; &#1705;&#1607; &#1575;&#1605;&#1585;&#1608;&#1586; &#1583;&#1585; &#1605;&#1585;&#1586;&#1607;&#1575;&#1740; &#1705;&#1588;&#1608;&#1585; &#1588;&#1605;&#1575; &#1589;&#1585;&#1601;&#1575;&#1611; &#1588;&#1575;&#1607;&#1583; &#1605;&#1585;&#1574;&#1740; &#1588;&#1583;&#1606; &#1575;&#1740;&#1606; &#1583;&#1740;&#1608;&#1575;&#1585;&#1607;&#1575;&#1740; &#1575;&#1586; &#1662;&#1740;&#1588; &#1605;&#1608;&#1580;&#1608;&#1583; &#1607;&#1587;&#1578;&#1740;&#1605;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1576;&#1575;&#1586; &#1607;&#1605; &#1740;&#1705; &#1602;&#1583;&#1605; &#1576;&#1740;&#1575;&#1740;&#1740;&#1605; &#1593;&#1602;&#1576;&zwnj;&#1578;&#1585; &#1608; &#1576;&#1607; &#1705;&#1604;&#1740;&#1578; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1662;&#1575;&#1585;&#1604;&#1605;&#1575;&#1606;&#1740; &#1606;&#1711;&#1575;&#1607; &#1705;&#1606;&#1740;&#1583;&#1548; &#1607;&#1605;&#1575;&#1606; &#1581;&#1705;&#1605;&zwnj;&#1585;&#1575;&#1606;&#1740; &laquo;&#1575;&#1586; &#1583;&#1604; &#1605;&#1585;&#1583;&#1605;&#1548; &#1578;&#1608;&#1587;&#1591; &#1605;&#1585;&#1583;&#1605;&#1548; &#1608; &#1576;&#1585;&#1575;&#1740; &#1605;&#1585;&#1583;&#1605;&raquo;. &#1588;&#1605;&#1575; &#1607;&#1605; &#1605;&#1740;&zwnj;&#1576;&#1740;&#1606;&#1740;&#1583; &#1705;&#1607; &#1583;&#1585; &#1576;&#1585;&#1582;&#1740; &#1605;&#1608;&#1575;&#1585;&#1583; &#1576;&#1607; &#1593;&#1705;&#1587; &#1582;&#1608;&#1583; &#1576;&#1583;&#1604; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;&#1567; &#1740;&#1575;&#1583; &#1580;&#1605;&#1604;&#1607; &#1575;&#1605;&#1575;&#1606;&#1608;&#1574;&#1604; &#1705;&#1575;&#1606;&#1578;&#1548; &#1575;&#1586; &#1576;&#1606;&#1740;&#1575;&#1606;&#1711;&#1584;&#1575;&#1585;&#1575;&#1606; &#1601;&#1705;&#1585;&#1740; &#1605;&#1601;&#1575;&#1607;&#1740;&#1605; &#1604;&#1740;&#1576;&#1585;&#1575;&#1604; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1605;&#1740;&zwnj;&#1575;&#1601;&#1578;&#1605; &#1705;&#1607; &#1605;&#1740;&zwnj;&#1711;&#1601;&#1578; &#1576;&#1583;&#1578;&#1585;&#1740;&#1606; &#1588;&#1585; &#1586;&#1605;&#1575;&#1606;&#1740; &#1575;&#1587;&#1578; &#1705;&#1607; &#1740;&#1705; &#1605;&#1601;&#1607;&#1608;&#1605; &#1576;&#1607; &#1606;&#1575;&#1605; &#1607;&#1605;&#1575;&#1606; &#1605;&#1601;&#1607;&#1608;&#1605; &#1604;&#1711;&#1583;&#1605;&#1575;&#1604; &#1605;&#1740;&zwnj;&#1588;&#1608;&#1583;. &#1670;&#1607; &#1705;&#1575;&#1585; &#1705;&#1606;&#1740;&#1605; &#1578;&#1575; &#1605;&#1591;&#1605;&#1574;&#1606; &#1576;&#1575;&#1588;&#1740;&#1605; &#1585;&#1587;&#1575;&#1606;&#1607;&#1548; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&#1548; &#1608; &#1589;&#1606;&#1583;&#1608;&#1602; &#1585;&#1571;&#1740; &#1607;&#1605;&#1575;&#1606;&#1740; &#1705;&#1575;&#1585;&#1740; &#1585;&#1575; &#1582;&#1608;&#1575;&#1607;&#1606;&#1583; &#1705;&#1585;&#1583; &#1705;&#1607; &#1576;&#1575;&#1740;&#1583; &#1575;&#1606;&#1580;&#1575;&#1605; &#1583;&#1607;&#1606;&#1583;&#1548; &#1740;&#1593;&#1606;&#1740; &#1581;&#1602; &#1581;&#1705;&#1605;&zwnj;&#1585;&#1575;&#1606;&#1740; &#1607;&#1605;&#1711;&#1575;&#1606;&#1548; &#1583;&#1585; &#1593;&#1740;&#1606; &#1605;&#1581;&#1575;&#1601;&#1592;&#1578; &#1705;&#1575;&#1605;&#1604; &#1575;&#1586; &#1578;&#1605;&#1575;&#1605; &#1581;&#1602;&#1608;&#1602; &#1601;&#1585;&#1583;&#1740; &#1608; &#1711;&#1585;&#1608;&#1607;&#1740;&#1567; </bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1578;&#1605;&#1575;&#1605; &#1605;&#1579;&#1575;&#1604;&zwnj;&#1607;&#1575;&#1740;&#1740; &#1705;&#1607; &#1586;&#1583;&#1605; &#1576;&#1585;&#1575;&#1740; &#1576;&#1587;&#1740;&#1575;&#1585;&#1740; &#1575;&#1586; &#1588;&#1605;&#1575; &#1581;&#1705;&#1605; &#1576;&#1583;&#1740;&#1607;&#1740;&#1575;&#1578; &#1585;&#1575; &#1583;&#1575;&#1585;&#1583;&#1548; &#1575;&#1605;&#1575; &#1580;&#1575;&#1740;&#1740; &#1705;&#1607; &#1605;&#1606; &#1583;&#1585; &#1570;&#1606; &#1586;&#1606;&#1583;&#1711;&#1740; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1605; &#1581;&#1705;&#1605; &#1570;&#1585;&#1605;&#1575;&#1606;&zwnj;&#1607;&#1575;&#1740; &#1607;&#1606;&#1608;&#1586; &#1605;&#1581;&#1602;&#1602; &#1606;&#1588;&#1583;&#1607;&#1563; &#1585;&#1587;&#1575;&#1606;&#1607;&zwnj;&#1607;&#1575;&#1740; &#1585;&#1587;&#1605;&#1740; &#1705;&#1588;&#1608;&#1585; &#1605;&#1606; &#1607;&#1605;&#1608;&#1575;&#1585;&#1607; &#1662;&#1585;&#1608;&#1662;&#1575;&#1711;&#1575;&#1606;&#1583;&#1575;&#1740; &#1602;&#1583;&#1585;&#1578; &#1576;&#1608;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583;&#1548; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; &#1607;&#1605;&#1608;&#1575;&#1585;&#1607; &#1605;&#1608;&#1585;&#1583; &#1583;&#1587;&#1578;&zwnj;&#1583;&#1585;&#1575;&#1586;&#1740; &#1581;&#1705;&#1608;&#1605;&#1578; &#1576;&#1608;&#1583;&#1607;&#1548; &#1581;&#1575;&#1705;&#1605;&#1740;&#1578; &#1605;&#1575; &#1607;&#1605;&#1608;&#1575;&#1585;&#1607; &#1570;&#1585;&#1605;&#1575;&#1606;&zwnj;&#1607;&#1575;&#1740; &#1580;&#1607;&#1575;&#1606;&#1740; &#1585;&#1575; &#1591;&#1585;&#1583; &#1705;&#1585;&#1583;&#1607; &#1608; &#1583;&#1585; &#1570;&#1582;&#1585;&#1740;&#1606; &#1606;&#1605;&#1608;&#1606;&#1607; &#1587;&#1582;&#1606;&#1711;&#1608;&#1740; &#1602;&#1608;&#1607;&zwnj;&#1740; &#1602;&#1590;&#1575;&#1740;&#1740;&#1607; &#1585;&#1587;&#1605;&#1575;&#1611; &#1575;&#1593;&#1604;&#1575;&#1605; &#1705;&#1585;&#1583;&#1607; &#1705;&#1607; &laquo;&#1582;&#1588;&#1608;&#1606;&#1578; &#1607;&#1605; &#1607;&#1605;&#1670;&#1608;&#1606; &#1578;&#1585;&#1608;&#1585;&#1740;&#1587;&#1605; &#1740;&#1705; &#1605;&#1601;&#1607;&#1608;&#1605; &#1594;&#1585;&#1576;&#1740; &#1575;&#1587;&#1578;&raquo;&#1548; &#1585;&#1575;&#1580;&#1593; &#1576;&#1607; &#1711;&#1585;&#1583;&#1588; &#1602;&#1583;&#1585;&#1578; &#1608; &#1583;&#1587;&#1578;&#1711;&#1575;&#1607; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1575;&#1740;&#1606;&#1580;&#1575; &#1607;&#1605; &#1705;&#1607; &#1583;&#1740;&#1711;&#1585; &#1711;&#1601;&#1578;&#1606; &#1606;&#1583;&#1575;&#1585;&#1583;! &#1575;&#1605;&#1575; &#1583;&#1602;&#1740;&#1602;&#1575;&#1611; &#1576;&#1607; &#1582;&#1575;&#1591;&#1585; &#1607;&#1605;&#1740;&#1606; &#1575;&#1582;&#1578;&#1604;&#1575;&#1601; &#1580;&#1575;&#1740;&#1711;&#1575;&#1607; &#1608; &#1583;&#1585; &#1606;&#1607;&#1575;&#1740;&#1578; &#1583;&#1594;&#1583;&#1594;&#1607; &#1608; &#1589;&#1605;&#1740;&#1605;&#1740;&#1578;&#1548; &#1608; &#1576;&#1607; &#1593;&#1606;&#1608;&#1575;&#1606; &#1740;&#1705; &#1591;&#1585;&#1581; &#1605;&#1587;&#1574;&#1604;&#1607; &#1605;&#1740;&zwnj;&zwnj;&#1582;&#1608;&#1575;&#1607;&#1605; &#1576;&#1607; &#1588;&#1605;&#1575; &#1576;&#1711;&#1608;&#1740;&#1605; &#1705;&#1607; &#1575;&#1740;&#1606; &#1605;&#1608;&#1575;&#1585;&#1583; &#1586;&#1606;&#1711; &#1582;&#1591;&#1585;&#1740; &#1607;&#1587;&#1578;&#1606;&#1583; &#1705;&#1607; &#1583;&#1585; &#1576;&#1585;&#1575;&#1576;&#1585; &#1570;&#1606; &#1580;&#1606;&#1711; &#1587;&#1606;&#1711;&#1585; &#1576;&#1607; &#1587;&#1606;&#1711;&#1585; &#1590;&#1585;&#1608;&#1585;&#1740; &#1575;&#1605;&#1575; &#1606;&#1575;&#1705;&#1575;&#1601;&#1740; &#1575;&#1587;&#1578;. &#1578;&#1605;&#1575;&#1605; &#1605;&#1588;&#1705;&#1604;&#1575;&#1578; &#1605;&#1575; &#1576;&#1607; &#1575;&#1588;&#1705;&#1575;&#1604; &#1605;&#1582;&#1578;&#1604;&#1601; &#1605;&#1579;&#1604; &#1740;&#1705; &#1705;&#1604;&#1575;&#1601; &#1583;&#1585; &#1607;&#1605; &#1578;&#1606;&#1740;&#1583;&#1607; &#1607;&#1587;&#1578;&#1606;&#1583;. &#1575;&#1586; &#1575;&#1740;&#1606; &#1581;&#1740;&#1579;&#1548; &#1605;&#1580;&#1605;&#1608;&#1593;&#1607;&zwnj;&#1740; &#1576;&#1581;&#1585;&#1575;&#1606;&zwnj;&#1607;&#1575;&#1740;&#1740; &#1705;&#1607; &#1575;&#1605;&#1585;&#1608;&#1586; &#1583;&#1585; &#1587;&#1591;&#1581; &#1583;&#1606;&#1740;&#1575; &#1576;&#1575; &#1570;&#1606; &#1605;&#1608;&#1575;&#1580;&#1607; &#1607;&#1587;&#1578;&#1740;&#1605;&#1548; &#1575;&#1586; &#1580;&#1606;&#1711; &#1608; &#1601;&#1602;&#1585; &#1608; &#1605;&#1581;&#1740;&#1591; &#1586;&#1740;&#1587;&#1578; &#1711;&#1585;&#1601;&#1578;&#1607;&#1548; &#1578;&#1575; &#1587;&#1578;&#1605; &#1576;&#1585; &#1575;&#1602;&#1604;&#1740;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1580;&#1606;&#1587;&#1740;&#1578;&#1740;&#1548; &#1606;&#1688;&#1575;&#1583;&#1740;&#1548; &#1602;&#1608;&#1605;&#1740;&#1548; &#1575;&#1586; &#1578;&#1602;&#1608;&#1740;&#1578; &#1581;&#1705;&#1608;&#1605;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1575;&#1602;&#1578;&#1583;&#1575;&#1585;&#1711;&#1585;&#1575; &#1608; &#1576;&#1606;&#1740;&#1575;&#1583;&#1711;&#1585;&#1575;&#1740;&#1740; &#1583;&#1740;&#1606;&#1740; &#1711;&#1585;&#1601;&#1578;&#1607; &#1578;&#1575; &#1606;&#1575;&#1576;&#1585;&#1575;&#1576;&#1585;&#1740; &#1575;&#1580;&#1578;&#1605;&#1575;&#1593;&#1740;&#1548; &#1585;&#1608;&#1740; &#1607;&#1605; &#1585;&#1601;&#1578;&#1607; &#1705;&#1740;&#1601;&#1740;&#1578; &#1740;&#1705; &#1576;&#1581;&#1585;&#1575;&#1606; &#1601;&#1585;&#1575;&#1711;&#1740;&#1585; &#1585;&#1575; &#1576;&#1585;&#1608;&#1586; &#1605;&#1740;&zwnj;&#1583;&#1607;&#1606;&#1583;. &#1605;&#1578;&#1575;&#1587;&#1601;&#1575;&#1606;&#1607; &#1576;&#1607; &#1606;&#1592;&#1585; &#1605;&#1740;&zwnj;&#1585;&#1587;&#1583; &#1583;&#1587;&#1578;&#1711;&#1575;&#1607; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1594;&#1585;&#1576;&#1548; &#1583;&#1585; &#1570;&#1585;&#1575;&#1740;&#1588; &#1601;&#1593;&#1604;&#1740; &#1582;&#1608;&#1583; &#1578;&#1608;&#1575;&#1606;&#1575;&#1740;&#1740; &#1662;&#1575;&#1587;&#1582; &#1583;&#1575;&#1583;&#1606; &#1576;&#1607; &#1662;&#1740;&#1670;&#1740;&#1583;&#1711;&#1740;&zwnj;&zwnj;&#1607;&#1575;&#1740; &#1570;&#1606; &#1585;&#1575; &#1606;&#1583;&#1575;&#1585;&#1583;&#1548; &#1608; &#1575;&#1711;&#1585; &#1583;&#1585; &#1587;&#1591;&#1581; &#1605;&#1587;&#1575;&#1574;&#1604; &#1605;&#1608;&#1585;&#1583; &#1576;&#1607; &#1605;&#1608;&#1585;&#1583; &#1576;&#1575;&#1602;&#1740; &#1576;&#1605;&#1575;&#1606;&#1583; &#1608; &#1582;&#1608;&#1583; &#1585;&#1575; &#1576;&#1585;&#1575;&#1740; &#1740;&#1705; &#1662;&#1575;&#1587;&#1582; &#1601;&#1585;&#1575;&#1711;&#1740;&#1585; &#1605;&#1578;&#1606;&#1575;&#1587;&#1576; &#1576;&#1575; &#1587;&#1591;&#1581; &#1576;&#1581;&#1585;&#1575;&#1606; &#1570;&#1605;&#1575;&#1583;&#1607; &#1606;&#1705;&#1606;&#1583;&#1548; &#1583;&#1585; &#1570;&#1740;&#1606;&#1583;&#1607; &#1588;&#1575;&#1607;&#1583; &#1578;&#1593;&#1605;&#1740;&#1602; &#1575;&#1740;&#1606; &#1576;&#1581;&#1585;&#1575;&#1606;&zwnj;&#1607;&#1575; &#1608; &#1578;&#1590;&#1593;&#1740;&#1601; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1583;&#1585; &#1587;&#1585;&#1578;&#1575;&#1587;&#1585; &#1705;&#1585;&#1607;&zwnj;&#1740; &#1582;&#1575;&#1705;&#1740; &#1582;&#1608;&#1575;&#1607;&#1740;&#1605; &#1576;&#1608;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1605;&#1605;&#1705;&#1606; &#1575;&#1587;&#1578; &#1578;&#1575; &#1575;&#1605;&#1585;&#1608;&#1586; &#1583;&#1585; &#1670;&#1606;&#1583; &#1580;&#1576;&#1607;&#1607; &#1588;&#1705;&#1587;&#1578; &#1582;&#1608;&#1585;&#1583;&#1607; &#1576;&#1575;&#1588;&#1740;&#1605; (&#1576;&#1585; &#1582;&#1604;&#1575;&#1601; &#1576;&#1585;&#1582;&#1740; &#1575;&#1586; &#1588;&#1605;&#1575; &#1705;&#1607; &#1711;&#1575;&#1607; &#1576;&#1585;&#1575;&#1740;&#1578;&#1575;&#1606; &laquo;&#1576;&#1585;&#1606;&#1583;&#1607; &#1576;&#1608;&#1583;&#1606;&raquo; &#1575;&#1586; &#1607;&#1605;&#1607; &#1670;&#1740;&#1586; &#1605;&#1607;&#1605;&zwnj;&#1578;&#1585; &#1575;&#1587;&#1578;&#1548; &#1580;&#1575;&#1740;&#1740; &#1705;&#1607; &#1605;&#1606; &#1575;&#1586; &#1570;&#1606; &#1605;&#1740;&zwnj;&#1570;&#1740;&#1605;&#1548; &#1605;&#1575; &#1576;&#1607; &#1605;&#1585;&#1608;&#1585; &#1740;&#1575;&#1583; &#1711;&#1585;&#1601;&#1578;&#1607;&zwnj;&#1575;&#1740;&#1605;&#1548; &#1575;&#1740;&#1606; &#1588;&#1705;&#1587;&#1578;&zwnj;&#1607;&#1575; &#1585;&#1575; &#1576;&#1662;&#1584;&#1740;&#1585;&#1740;&#1605; &#1608; &#1583;&#1601;&#1593;&#1607; &#1576;&#1593;&#1583; &#1576;&#1607;&#1578;&#1585; &#1576;&#1580;&#1606;&#1711;&#1740;&#1605;). &#1602;&#1591;&#1593;&#1575;&#1611; &#1583;&#1585; &#1570;&#1740;&#1606;&#1583;&#1607; &#1606;&#1740;&#1586; &#1583;&#1585; &#1580;&#1576;&#1607;&#1607;&zwnj;&#1607;&#1575;&#1740;&#1740; &#1588;&#1705;&#1587;&#1578; &#1582;&#1608;&#1575;&#1607;&#1740;&#1605; &#1582;&#1608;&#1585;&#1583;. &#1575;&#1605;&#1575; &#1587;&#1585;&#1606;&#1608;&#1588;&#1578; &#1575;&#1740;&#1606; &#1580;&#1606;&#1711; &#1576;&#1607; &#1607;&#1740;&#1670; &#1593;&#1606;&#1608;&#1575;&#1606; &#1605;&#1602;&#1583;&#1608;&#1585; &#1606;&#1740;&#1587;&#1578;. &#1608; &#1583;&#1587;&#1578; &#1605;&#1575; &#1607;&#1605; &#1576;&#1585;&#1575;&#1740; &#1662;&#1740;&#1585;&#1608;&#1586;&#1740; &#1583;&#1585; &#1570;&#1606; &#1576;&#1607; &#1607;&#1740;&#1670; &#1593;&#1606;&#1608;&#1575;&#1606; &#1582;&#1575;&#1604;&#1740; &#1606;&#1740;&#1587;&#1578;. &#1575;&#1608;&#1604;&#1575;&#1611; &#1583;&#1587;&#1578;&#1711;&#1575;&#1607; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1602;&#1575;&#1576;&#1604;&#1740;&#1578; &#1578;&#1571;&#1605;&#1604; &#1583;&#1585; &#1582;&#1608;&#1583; &#1585;&#1575; &#1583;&#1575;&#1585;&#1583;&#1548; &#1608; &#1605;&#1740;&zwnj;&zwnj;&#1578;&#1608;&#1575;&#1606;&#1583; &#1711;&#1584;&#1588;&#1578;&#1607;&zwnj;&#1740; &#1582;&#1608;&#1583; &#1585;&#1575; &#1670;&#1585;&#1575;&#1594; &#1585;&#1575;&#1607; &#1570;&#1740;&#1606;&#1583;&#1607; &#1602;&#1585;&#1575;&#1585; &#1583;&#1607;&#1583;. &#1590;&#1605;&#1606; &#1575;&#1740;&#1606;&#1705;&#1607; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1592;&#1585;&#1601;&#1740; &#1575;&#1587;&#1578; &#1576;&#1585;&#1575;&#1740; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578; &#1581;&#1583;&#1575;&#1705;&#1579;&#1585;&#1740; &#1607;&#1605;&#1711;&#1575;&#1606;&#1548; &#1608; &#1576;&#1606;&#1575;&#1576;&#1585;&#1575;&#1740;&#1606; &#1576;&#1607; &#1607;&#1740;&#1670; &#1602;&#1575;&#1604;&#1576; &#1589;&#1604;&#1576;&#1740; &#1605;&#1581;&#1583;&#1608;&#1583; &#1606;&#1605;&#1740;&zwnj;&#1605;&#1575;&#1606;&#1583; &#1608; &#1605;&#1740;&zwnj;&#1578;&#1608;&#1575;&#1606;&#1583; &#1607;&#1585; &#1576;&#1575;&#1585; &#1582;&#1608;&#1583; &#1585;&#1575; &#1575;&#1586; &#1585;&#1740;&#1588;&#1607; &#1576;&#1575;&#1586;&#1587;&#1575;&#1586;&#1740; &#1705;&#1606;&#1583;. &#1583;&#1585; &#1575;&#1740;&#1606; &#1585;&#1575;&#1607;&#1548; &#1605;&#1575; &#1605;&#1601;&#1575;&#1607;&#1740;&#1605; &#1576;&#1606;&#1740;&#1575;&#1583;&#1740;&#1606;&#1740; &#1583;&#1575;&#1585;&#1740;&#1605; &#1705;&#1607; &#1587;&#1578;&#1575;&#1585;&#1607;&zwnj;&#1740; &#1588;&#1605;&#1575;&#1604; &#1605;&#1575; &#1607;&#1587;&#1578;&#1606;&#1583;&#1548; &#1605;&#1601;&#1575;&#1607;&#1740;&#1605;&#1740; &#1605;&#1575;&#1606;&#1606;&#1583; &#1570;&#1586;&#1575;&#1583;&#1740; (&#1607;&#1605; &#1601;&#1585;&#1583;&#1740; &#1608; &#1607;&#1605; &#1580;&#1605;&#1593;&#1740;)&#1548; &#1576;&#1585;&#1575;&#1576;&#1585;&#1740; (&#1583;&#1585; &#1601;&#1585;&#1589;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1586;&#1606;&#1583;&#1711;&#1740; &#1608; &#1583;&#1606;&#1576;&#1575;&#1604; &#1705;&#1585;&#1583;&#1606; &#1587;&#1593;&#1575;&#1583;&#1578;)&#1548; &#1608; &#1607;&#1605;&#1576;&#1587;&#1578;&#1711;&#1740; (&#1576;&#1575; &#1578;&#1605;&#1575;&#1605; &#1575;&#1601;&#1585;&#1575;&#1583;&#1548; &#1575;&#1602;&#1604;&#1740;&#1578;&zwnj;&#1607;&#1575;&#1548; &#1711;&#1585;&#1608;&#1607;&zwnj;&#1607;&#1575;).</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1588;&#1575;&#1740;&#1583; &#1586;&#1605;&#1575;&#1606; &#1570;&#1606; &#1601;&#1585;&#1575; &#1585;&#1587;&#1740;&#1583;&#1607; &#1576;&#1575;&#1588;&#1583; &#1578;&#1575; &#1576;&#1575; &#1575;&#1578;&#1705;&#1575; &#1576;&#1607; &#1575;&#1740;&#1606; &#1583;&#1575;&#1588;&#1578;&#1607;&zwnj;&#1607;&#1575; &#1608; &#1583;&#1585; &#1670;&#1575;&#1585;&#1670;&#1608;&#1576; &#1662;&#1578;&#1575;&#1606;&#1587;&#1740;&#1604;&zwnj;&#1607;&#1575;&#1740; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1578;&#1740;&#1705; &#1605;&#1608;&#1580;&#1608;&#1583; &#1740;&#1705; &#1670;&#1588;&#1605;&zwnj;&#1575;&#1606;&#1583;&#1575;&#1586; &#1580;&#1583;&#1740;&#1583; &#1575;&#1586; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1580;&#1607;&#1575;&#1606;&#1740; &#1585;&#1575; &#1578;&#1585;&#1587;&#1740;&#1605; &#1705;&#1606;&#1740;&#1605;. &#1578;&#1608;&#1580;&#1607; &#1576;&#1740;&#1588; &#1575;&#1586; &#1581;&#1583; &#1576;&#1607; &#1576;&#1575;&#1604;&#1575; &#1608; &#1576;&#1607; &#1583;&#1587;&#1578;&#1711;&#1575;&#1607; &#1583;&#1608;&#1604;&#1578;&#1740;&#1548; &#1581;&#1578;&#1740; &#1583;&#1585; &#1583;&#1608;&#1604;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1578;&#1740;&#1705; &#1607;&#1605; &#1593;&#1605;&#1604;&#1575;&#1611; &#1576;&#1607; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1590;&#1585;&#1576;&#1607; &#1608;&#1575;&#1585;&#1583; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1583;. &#1583;&#1585; &#1605;&#1608;&#1575;&#1580;&#1607;&#1607; &#1605;&#1740;&#1575;&#1606; &#1583;&#1608;&#1604;&#1578;&zwnj;&#1607;&#1575; &#1608; &#1602;&#1583;&#1585;&#1578;&zwnj;&#1607;&#1575;&#1548; &#1607;&#1585; &#1740;&#1705; &#1576;&#1607; &#1583;&#1606;&#1576;&#1575;&#1604; &#1581;&#1583;&#1575;&#1705;&#1579;&#1585; &#1587;&#1608;&#1583; &#1576;&#1585;&#1575;&#1740; &#1582;&#1608;&#1583;&#1588;&#1575;&#1606; &#1607;&#1587;&#1578;&#1606;&#1583; &#1608; &#1576;&#1585;&#1606;&#1583;&#1607; &#1705;&#1587;&#1740; &#1575;&#1587;&#1578; &#1705;&#1607; &#1576;&#1740;&#1588;&#1578;&#1585;&#1740;&#1606; &#1587;&#1607;&#1605; &#1585;&#1575; &#1575;&#1586; &#1585;&#1608;&#1740; &#1605;&#1740;&#1586; &#1576;&#1585;&#1583;&#1575;&#1585;&#1583; (&#1576;&#1575; &#1607;&#1585; &#1575;&#1576;&#1586;&#1575;&#1585; &#1605;&#1605;&#1705;&#1606;). &#1575;&#1605;&#1575; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575;&#1740; &#1605;&#1583;&#1606;&#1740; &#1585;&#1575;&#1576;&#1591;&#1607;&zwnj;&#1740; &#1583;&#1740;&#1711;&#1585;&#1740; &#1576;&#1575; &#1740;&#1705;&#1583;&#1740;&#1711;&#1585; &#1583;&#1575;&#1585;&#1606;&#1583;. &#1583;&#1585; &#1576;&#1587;&#1740;&#1575;&#1585;&#1740; &#1575;&#1586; &#1605;&#1608;&#1575;&#1585;&#1583;&#1548; &#1605;&#1740;&#1575;&#1606; &#1575;&#1740;&#1606; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575; &#1578;&#1576;&#1575;&#1583;&#1604;&zwnj;&#1607;&#1575; &#1576;&#1607;&zwnj;&#1711;&#1608;&#1606;&#1607;&zwnj;&#1575;&#1740; &#1575;&#1587;&#1578; &#1705;&#1607; &#1607;&#1585; &#1705;&#1583;&#1575;&#1605; &#1605;&#1740;&zwnj;&#1582;&#1608;&#1575;&#1607;&#1606;&#1583; &#1576;&#1740;&#1588;&#1578;&#1585;&#1740; &#1605;&#1602;&#1583;&#1575;&#1585; &#1585;&#1575; &#1576;&#1607; &#1591;&#1585;&#1601; &#1605;&#1602;&#1575;&#1576;&#1604; &#1607;&#1583;&#1740;&#1607; &#1705;&#1606;&#1606;&#1583;&#1548; &#1608; &#1607;&#1585; &#1705;&#1587;&#1740; &#1576;&#1740;&#1588;&#1578;&#1585; &#1576;&#1583;&#1607;&#1583;&#1548; &#1580;&#1575;&#1740;&#1711;&#1575;&#1607;&zwnj; &#1576;&#1575;&#1604;&#1575;&#1578;&#1585;&#1740; &#1583;&#1575;&#1585;&#1583;&#1548; &#1740;&#1575; &#1576;&#1607; &#1602;&#1608;&#1604; &#1588;&#1605;&#1575; &laquo;&#1576;&#1585;&#1606;&#1583;&#1607;&raquo; &#1576;&#1607; &#1581;&#1587;&#1575;&#1576; &#1605;&#1740;&zwnj;&#1570;&#1740;&#1583;. &#1583;&#1585; &#1607;&#1605;&#1740;&#1606; &#1585;&#1608;&#1606;&#1583; &#1575;&#1587;&#1578; &#1705;&#1607; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575;&#1740; &#1578;&#1579;&#1576;&#1740;&#1578;&zwnj;&#1588;&#1583;&#1607;&zwnj;&#1575;&#1740; &#1605;&#1579;&#1604; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575;&#1740; &#1605;&#1583;&#1606;&#1740; &#1588;&#1605;&#1575;&#1548; &#1576;&#1607; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575;&#1740; &#1605;&#1583;&#1606;&#1740; &#1605;&#1575; &#1585;&#1587;&#1605;&#1740;&#1578; &#1576;&#1582;&#1588;&#1740;&#1583;&#1606;&#1583;&#1548; &#1608; &#1576;&#1607; &#1605;&#1575; &#1583;&#1585; &#1605;&#1576;&#1575;&#1585;&#1586;&#1607; &#1593;&#1604;&#1740;&#1607; &#1575;&#1587;&#1578;&#1576;&#1583;&#1575;&#1583; &#1608; &#1575;&#1602;&#1578;&#1583;&#1575;&#1585;&#1711;&#1585;&#1575;&#1740;&#1740; &#1740;&#1575;&#1585;&#1740; &#1585;&#1587;&#1575;&#1606;&#1583;&#1606;&#1583;. &#1583;&#1585; &#1605;&#1602;&#1575;&#1576;&#1604; &#1605;&#1575; &#1607;&#1605; &#1705;&#1607; &#1607;&#1605;&#1608;&#1575;&#1585;&#1607; &#1586;&#1740;&#1585; &#1601;&#1588;&#1575;&#1585; &#1608; &#1587;&#1585;&#1705;&#1608;&#1576; &#1576;&#1608;&zwnj;&#1583;&#1607;&zwnj;&#1575;&#1740;&#1605;&#1548; &#1576;&#1607; &#1582;&#1608;&#1576;&#1740; &#1605;&#1740;&zwnj;&#1583;&#1575;&#1606;&#1740;&#1605; &#1705;&#1607; &laquo;&#1593;&#1606;&#1589;&#1585; &#1605;&#1602;&#1575;&#1608;&#1605;&#1578;&raquo; &#1705;&#1604;&#1740;&#1583; &#1608; &#1585;&#1605;&#1586; &#1576;&#1602;&#1575;&#1740; &#1605;&#1575; &#1575;&#1587;&#1578;. &#1570;&#1606;&#1670;&#1607; &#1605;&#1575; &#1605;&#1740;&zwnj;&#1578;&#1608;&#1575;&#1606;&#1740;&#1605; &#1576;&#1607; &#1593;&#1606;&#1608;&#1575;&#1606; &#1575;&#1585;&#1580;&zwnj;&#1711;&#1584;&#1575;&#1585;&#1740; &#1576;&#1607; &#1588;&#1605;&#1575; &#1576;&#1585;&#1711;&#1585;&#1583;&#1575;&#1606;&#1740;&#1605;&#1548; &#1578;&#1580;&#1585;&#1576;&#1607;&zwnj; &#1608; &#1589;&#1583;&#1575;&#1740; &#1605;&#1602;&#1575;&#1608;&#1605;&#1578; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575;&#1740; &#1605;&#1583;&#1606;&#1740; &#1575;&#1587;&#1578;. &#1580;&#1575;&#1605;&#1593;&#1607;&zwnj; &#1605;&#1583;&#1606;&#1740; &#1740;&#1705; &#1606;&#1740;&#1585;&#1608;&#1740;&#1616; &#1583;&#1585;&#1608;&#1606;&#1740;&#1548; &#1740;&#1705; &#1662;&#1578;&#1575;&#1606;&#1587;&#1740;&#1604; &#1601;&#1586;&#1575;&#1740;&#1606;&#1583;&#1607;&#1548; &#1575;&#1606;&#1587;&#1580;&#1575;&#1605;&zwnj;&#1576;&#1582;&#1588;&#1548; &#1605;&#1576;&#1578;&#1606;&#1740; &#1576;&#1585; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578; &#1608; &#1605;&#1587;&#1574;&#1608;&#1604;&#1740;&#1578;&zwnj;&#1570;&#1601;&#1585;&#1740;&#1606; &#1575;&#1587;&#1578; &#1705;&#1607; &#1585;&#1608;&#1575;&#1576;&#1591; &#1583;&#1585;&#1608;&#1606;&#1740; &#1575;&#1740;&#1606; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575; &#1605;&#1593;&#1605;&#1608;&#1604;&#1575;&#1611; &#1605;&#1576;&#1578;&#1606;&#1740; &#1576;&#1585; &#1581;&#1583;&#1575;&#1705;&#1579;&#1585; &#1583;&#1607;&#1588;   gift &#1608; &#1576;&#1575; &#1585;&#1608;&#1740;&#1705;&#1585;&#1583; &#1576;&#1607; &#1585;&#1587;&#1605;&#1740;&#1578; &#1588;&#1606;&#1575;&#1582;&#1578;&#1606; &#1605;&#1578;&#1602;&#1575;&#1576;&#1604; &#1607;&#1605;&#1583;&#1740;&#1711;&#1585; &#1575;&#1587;&#1578;. &#1575;&#1586; &#1575;&#1740;&#1606; &#1604;&#1581;&#1575;&#1592;&#1548; &#1605;&#1740;&zwnj;&#1711;&#1608;&#1740;&#1605; &#1588;&#1576;&#1575;&#1607;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1605;&#1740;&#1575;&#1606; &#1605;&#1575; &#1576;&#1587;&#1740;&#1575;&#1585; &#1593;&#1605;&#1740;&#1602;&zwnj;&#1578;&#1585; &#1575;&#1586; &#1578;&#1601;&#1575;&#1608;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1605;&#1575; &#1575;&#1587;&#1578;. &#1711;&#1608;&#1740;&#1740; &#1605;&#1575; &#1608; &#1588;&#1605;&#1575; &#1583;&#1608; &#1575;&#1606;&#1578;&#1607;&#1575;&#1740; &#1740;&#1705; &#1585;&#1608;&#1606;&#1583; &#1711;&#1584;&#1575;&#1585; &#1605;&#1588;&#1578;&#1585;&#1705; &#1608; &#1580;&#1607;&#1575;&#1606;&#1740; &#1602;&#1585;&#1575;&#1585; &#1583;&#1575;&#1585;&#1740;&#1605;. &#1585;&#1608;&#1606;&#1583;&#1740; &#1606;&#1575;&#1605;&#1591;&#1605;&#1574;&#1606; &#1705;&#1607; &#1601;&#1602;&#1591; &#1576;&#1575; &#1580;&#1583;&#1740;&#1578;&#1548; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578;&#1548; &#1608; &#1586;&#1606;&#1580;&#1740;&#1585;&#1607;&zwnj;&#1575;&#1740; &#1580;&#1607;&#1575;&#1606;&#1740; &#1575;&#1586; &#1578;&#1605;&#1575;&#1605; &#1606;&#1607;&#1575;&#1583;&#1607;&#1575;&#1740; &#1605;&#1583;&#1606;&#1740; &#1608; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1578;&#1740;&#1705; &#1576;&#1585;&#1575;&#1740; &#1576;&#1575;&#1586;&#1740;&#1575;&#1576;&#1740; &#1583;&#1605;&#1608;&#1705;&#1585;&#1575;&#1587;&#1740; &#1580;&#1607;&#1575;&#1606;&#1740; &#1605;&#1605;&#1705;&#1606; &#1582;&#1608;&#1575;&#1607;&#1583; &#1576;&#1608;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1606;&#1585;&#1711;&#1587; &#1605;&#1581;&#1605;&#1583;&#1740; </bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1785; &#1582;&#1585;&#1583;&#1575;&#1583; &#1780;&#1776;<bdo lang="fa" dir="rtl"><bdo lang="fa" dir="rtl">&#1780;</bdo>&#1777;</bdo></bdo></p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297614/narges-mohammadi-iran-america-democracy-essay-farsi/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297614</post-id>	</item>
		<item>
		<title>An Iranian Nobel Laureate Warns Americans &#8216;What It Means to Lose Democracy&#8217;</title>
		<link>https://time.com/7297668/narges-mohammadi-iran-america-democracy-essay/</link>
					<comments>https://time.com/7297668/narges-mohammadi-iran-america-democracy-essay/#respond</comments>
		
		<dc:creator><![CDATA[Narges Mohammadi]]></dc:creator>
		<pubDate>Wed, 25 Jun 2025 19:15:24 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[world affairs]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297668</guid>

					<description><![CDATA[The Iranian Nobel Laureate warns Americans the rights and freedoms we take for granted are not guaranteed.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297668"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297668/narges-mohammadi-iran-america-democracy-essay/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/Narges-Mohammadi-1.jpg" alt="Narges-Mohammadi"/>



<p>Democracy is not a gift, nor a given; it is the hard-earned result of generations of struggle, sacrifice, and resistance. That is why I believe democratic ideals and institutions must be fiercely protected&mdash;everywhere, by all of us, at all times.</p>



<p>For years I have spoken of the ups and downs of this path in Iran, my own country, of our hopes for democracy, and the solidarity we seek from democratic and human rights institutions around the world. But today I speak as someone sounding <a href="https://time.com/7266334/us-human-rights-watchlist-civil-liberties/"  target="_blank" rel="noreferrer noopener">an alarm</a>, as one who knows from experience what it means to lose democracy&mdash;not slowly, but almost overnight.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>I want to remind you that the rights and freedoms you may take for granted are not guaranteed. They can be eroded if they not actively protected. Whether you feel it yet or not, you, too, are engaged in the same fragile struggle: <a href="https://time.com/6338333/angelina-jolie-narges-mohammadi-nobel-peace-prize/"  target="_blank" rel="noreferrer noopener">the defense of democracy and human rights</a>. Perhaps this reflection, born of experience and resistance, can play a small part in reinforcing what we all stand to lose. And perhaps, in this shared vulnerability, we will come to see how much more deeply we are connected.</p>



<p>We see ourselves as your partners in defending democracy&mdash;not just because our futures are connected, but because the existence of democracy in the West has long been a source of hope and inspiration, a guiding model for those of us still struggling for it elsewhere.<strong> </strong>When democracy is <a href="https://freedomhouse.org/report/freedom-world/2025/uphill-battle-to-safeguard-rights"  target="_blank" rel="noreferrer noopener" target="_blank">weakened</a> in one part of the world, it sends shockwaves through the hopes of people everywhere who are still fighting to achieve it.</p>



<p>From the days when only men could vote and hold power, to the long fight that led to women gain equal rights; from the era when skin color justified slavery, to the moment when people of all races, genders, and backgrounds could lead a nation, democracy has been shaped through struggle. And that struggle never truly ends. It is what gives meaning to our shared humanity and carries the promise that tomorrow can be more just than today.</p>



<p>That is why the <a href="https://time.com/5606244/stanford-expert-mr-democracy-interview/"  target="_blank" rel="noreferrer noopener">growing fragility </a>of democracy around the world should alarm us all. When the foundations of democracy are weakened even in the West, it threatens not just political systems, but an entire way of life built on dignity, freedom, and solidarity. I say this as someone who has lived through its collapse&mdash;who has<a href="https://time.com/7203735/narges-mohammadi-margaret-atwood/"  target="_blank" rel="noreferrer noopener"> been made a stranger in her own country</a>, and who has resisted religious tyranny and gender apartheid. Don&rsquo;t believe the myth that history only moves forward. If you don&rsquo;t act today&mdash;with clarity and urgency&mdash;you may wake up tomorrow in a world where the very idea of democracy has vanished, and realize too late that your silence helped erase it.<br><br><strong>Read more:</strong><a href="Iranian Nobel Laureate Narges Mohammadi Calls for Israel-Iran Ceasefire" target="_blank" rel="noreferrer noopener"> Iranian Nobel Laureate Narges Mohammadi Calls for Israel-Iran Ceasefire</a></p>



<p>Just look at what&rsquo;s happening to the media and freedom of speech. Once the fourth pillar of democracy&mdash;essential for transparency and accountability&mdash;it is, in many cases, turning into a tool for manipulating public opinion: a vehicle for fear, hate, and the silencing of truth.</p>



<p>Or look at universities. These institutions were meant to be sanctuaries of knowledge, curiosity, and intellectual freedom. In Iran, we call them &ldquo;the strongholds of liberty.&rdquo; But today, even some of these spaces are <a href="https://time.com/7278236/university-funding-trump-harvard-cornell-northwestern-brown-princeton-penn-columbia/"  target="_blank" rel="noreferrer noopener">losing their independence</a>&mdash;becoming arenas for power struggles, where truth is sacrificed to political or financial agendas, and the ethical foundations of education and research are under attack.</p>



<p>Let&rsquo;s step back and consider globalization. For years, we saw it as a <a href="https://humanprogress.org/globalizations-triumph-the-death-of-extreme-poverty/"  target="_blank">triumph</a>&mdash;the breaking down of barriers, the sharing of ideas, the merging of cultures. But what we&rsquo;re witnessing now isn&rsquo;t the reversal of globalization, it&rsquo;s its backlash. When globalization was enforced from above, driven primarily by economic interests and market expansion, with little regard for social justice, shared values, or real dialogue, it created fractures. Yes, some visible walls fell&mdash;but invisible ones rose in their place. What Americans now see at their borders is just the surface expression of deeper divisions that have been building for years.</p>



<p>Now let&rsquo;s take another step back to the very idea of parliamentary democracy&mdash;government of the people, by the people, for the people. Isn&rsquo;t it true that, in some cases, it is being hollowed out from within? I recall the words of Immanuel Kant: &ldquo;The greatest evil occurs when a concept is destroyed in the name of that same concept.&rdquo; So how do we ensure that institutions like the media, universities, and elections stay true to their purpose&mdash;empowering people, protecting rights, and advancing freedom?</p>



<p>Perhaps these questions sound basic to you. But in Iran, they are distant hopes. Our state media has always been a mouthpiece for power. Our universities have always been under state control. Just recently, the Judiciary&rsquo;s spokesperson declared that &ldquo;violence, like terrorism, is a Western concept&rdquo;&mdash;openly dismissing universal values. As for democratic institutions and peaceful transitions of power, we have yet to even begin.</p>



<p>And it&rsquo;s precisely because of the distance between our worlds&mdash;and from a place of deep sincerity&mdash;that I offer this not as a complaint, but as a warning. These are alarm bells. Yes, fighting back trench by trench is essential, but it is not enough. Today&rsquo;s global crises are tightly interwoven: war, poverty, climate collapse, gender oppression, systemic racism, rising authoritarianism, religious extremism, economic inequality. Together, they form a single, comprehensive global crisis.<br><br><strong>Read more:</strong> <a href="https://time.com/6321404/nobel-laureate-narges-mohammadis-evin-prison/" >Read the Nobel Peace Laureate&#8217;s Gripping Account of the Fire in Her Prison</a> <br><br>The unfortunate truth is this: the current framework of Western democratic systems appears unprepared for the scale and complexity of this challenge. If democratic governments continue to respond with fragmented, issue-by-issue solutions&mdash;without a coherent and collective strategy&mdash;we will all face the accelerating erosion of democracy.</p>



<p>We know what defeat looks like. In places like Iran, it&rsquo;s a familiar companion. Unlike in systems where victory is often the main goal, we&rsquo;ve learned to survive defeat, learn from it, and keep going. And yes, more setbacks will come. But this struggle is not lost&mdash;and we are not powerless.</p>



<p>Democracy, at its best, is <a href="https://time.com/7071872/us-trial-and-error-essay/" >self-correcting</a>. It can learn from its mistakes, regenerate from the ground up, and grow stronger through inclusion. It offers the widest space for participation. And on this road, we walk guided by a shared compass: freedom (individual and collective), equality (of opportunity and dignity), and solidarity (especially with the vulnerable and the silenced).</p>



<p>Perhaps it is time to imagine a new future for global democracy&mdash;one rooted not in the preservation of old power structures, but in the full potential of democratic ideals. Because democracy is weakened when too much attention is placed on state power alone. In geopolitical games, every state seeks to win by taking more. But in the world of civil society, we win by giving more.</p>



<p>This is the logic that has long connected us. Civil society institutions in democratic countries gave us legitimacy, recognition, and strength when our own democratic institutions were crushed. And we&mdash;those who have resisted tyranny under relentless pressure&mdash;have in return offered something vital: the knowledge, experience, and example of nonviolent resistance.</p>



<p>Our differences matter far less than what unites us. We are two ends of the same fragile, global transition. And the success of this process depends on seriousness, unity, and the creation of a global alliance of democratic and civil institutions&mdash;to defend and revive democracy for all.</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297668/narges-mohammadi-iran-america-democracy-essay/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297668</post-id>	</item>
		<item>
		<title>From Trump Fighting Back on Iran Reports to Defense Spending Pledges, the Key Takeaways From the 2025 NATO Summit</title>
		<link>https://time.com/7297698/nato-2025-summit-trump-iran-ukraine-defense-topics/</link>
					<comments>https://time.com/7297698/nato-2025-summit-trump-iran-ukraine-defense-topics/#respond</comments>
		
		<dc:creator><![CDATA[Callum Sutherland]]></dc:creator>
		<pubDate>Wed, 25 Jun 2025 19:06:27 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Donald Trump]]></category>
		<category><![CDATA[News Desk]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297698</guid>

					<description><![CDATA[From Trump fighting back on Iran reports and responding to being referred to as 'daddy,' to defense spending goals and cease-fire reactions.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297698"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297698/nato-2025-summit-trump-iran-ukraine-defense-topics/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2221295813.jpg" alt="NATO Leaders Attend 2025 Summit In The Hague"/>



<p>In a week that dealt with the aftermath of the <a href="https://time.com/7296469/u-s-strikes-iran-nuclear-trump-war/" >U.S. launching strikes on Iran</a> and the <a href="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/" >brokering of an Israel-Iran cease-fire</a>, albeit a fragile one, global leaders put on a somewhat united front at the 2025 NATO Summit.</p>



<p>President Donald Trump arrived at The Hague in the Netherlands on Tuesday, hours after issuing a <a href="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/" >public rebuke of Israel and Iran</a> amid accusations of <a href="https://time.com/7297098/israel-iran-ceasefire-broken-missile-strikes-tehran/https://time.com/7297098/israel-iran-ceasefire-broken-missile-strikes-tehran/" >cease-fire violations</a> and threats of further military action. Unsurprisingly, the Israel-Iran conflict, and its far-reaching impact, was a key talking point during the summit.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>NATO members also discussed defense spending, with the United Kingdom set to buy at least a dozen F-35 capable of carrying nuclear warheads, and Spain <a href="https://english.elpais.com/international/2025-06-25/spain-is-a-problem-trump-lashes-out-over-nato-contributions.html"  target="_blank">showing restraint on committing</a> to the 5% defense spending target.</p>



<p>The war in Ukraine was a key focus of the summit too, with leaders reiterating <a href="https://www.nato.int/cps/en/natohq/news_236641.htm"  target="_blank">their support for President Volodymyr Zelensky</a> as Russia continues its invasion of Ukraine, posing an ongoing, prevalent concern for European security.</p>



<p>Here are the key takeaways from the 2025 NATO Summit. </p>



<h2 class="wp-block-heading"><strong>Debate over the effectiveness of U.S. missile strikes on Iranian nuclear facilities</strong></h2>



<p>Early U.S. intelligence on the weekend strikes carried out in Iran <a href="https://www.cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites"  target="_blank">reportedly suggests</a> that they were not as effective as initially thought, in stark contrast to Trump&rsquo;s assertion that the strikes &ldquo;totally obliterated&#8221; the three key nuclear facilities.</p>



<p>Speaking at NATO, Trump doubled down on his previous statements, saying that the operation &ldquo;was very, very successful. It was called <em>obliteration</em>. No other military on Earth could have done it.&rdquo;</p>



<p>The President cited a report from the Israel Atomic Energy Commission, saying it found that U.S. strikes &ldquo;destroyed the site&#8217;s critical infrastructure and rendered the enrichment facility totally inoperable. It was devastated.&rdquo; </p>



<p>Per Trump, the report concluded that Iran&rsquo;s ability to develop nuclear weapons had been set back &ldquo;for many years to come.&rdquo;</p>



<p>Israel&#8217;s military meanwhile, has said that it&#8217;s &#8220;<a href="https://www.timesofisrael.com/idf-assesses-irans-nuclear-program-set-back-years-but-too-early-to-know-for-sure/"  target="_blank">still too early to determine</a>&#8221; the exact outcome and effectiveness of the strikes upon Iran&#8217;s nuclear infrastructure.</p>



<p>Trump was also asked at NATO about sanctions on Iran and its capability to continue selling oil to China, its main trading partner in the industry. &ldquo;I could stop it if I wanted and sell China the oil myself. I don&#8217;t want to do that,&rdquo; Trump said. &ldquo;We&#8217;re not taking over the oil. We could have, you know, I used to say with Iraq, &#8216;keep the oil.&#8217; I could say it here, too.&rdquo;</p>



<p>Sitting with <a href="https://time.com/7295448/rutte-nato-secretary-general-interview/" >NATO Secretary General Mark Rutte</a>, Trump was<a href="https://www.bbc.co.uk/news/articles/ce9x809vgrro"  target="_blank"> asked by reporters</a> if the U.S. would strike Iran again, should it rebuild its nuclear facilities. To which the President responded: &ldquo;Sure, but I&#8217;m not going to have to worry about that. It&#8217;s gone for years.&#8221;</p>



<p><strong>Read More</strong>: <em><a href="https://time.com/7295798/new-middle-east-time-cover/" >A New Middle East Is Unfolding Before Our Eyes</a></em></p>



<h2 class="wp-block-heading"><strong>Trump reacts after he&#8217;s referred to as &#8220;daddy&#8221;</strong></h2>



<p>When praising Trump&#8217;s intervention in the Israel-Iran conflict, Rutte referred to the U.S. President as <a href="https://news.sky.com/story/nato-chief-heaps-praise-on-trump-at-meeting-after-us-president-cast-doubt-on-commitment-to-collective-defence-13388255"  target="_blank">&ldquo;daddy.&rdquo;</a></p>



<p>Trump compared Israel and Iran to &ldquo;two kids in a school yard&rdquo; who &ldquo;fight like hell,&rdquo; to which Rutte, referencing Trump&rsquo;s intervention, said: &ldquo;Then daddy has to sometimes use strong language.&#8221;</p>



<p>(In an outburst ahead of the summit, Trump told reporters outside the White House on Tuesday: &#8220;We have two countries that have been fighting for so long and so hard, that they don&#8217;t know what the f-ck they&#8217;re doing.&#8221;)</p>



<p>The remark from Rutte seemed to catch the room off-guard, and Trump was later confronted about the moment during a press conference.</p>



<p>When asked asked if he considers NATO members to be like &#8220;his children,&#8221; Trump said of Rutte&#8217;s comment: &#8220;He likes me, I think he likes me. If he doesn&#8217;t, I&#8217;ll let you know. I&#8217;ll come back, and I&#8217;ll hit him hard, OK? He did it very affectionately&#8230; &#8216;daddy, you&#8217;re my daddy.'&#8221; </p>



<h2 class="wp-block-heading"><strong>NATO allies agree on 5% defense spending target and an &#8220;ironclad&#8221; Article 5 commitment</strong></h2>



<p><a href="https://www.nato.int/cps/en/natohq/official_texts_236705.htm?utm_source=social&amp;utm_medium=posts&amp;utm_campaign=250625%2Bmulti%2Bdeclaration"  target="_blank">In a joint statement</a> from 32 NATO leaders at the summit, the countries agreed to 5% of annual GDP going on &ldquo;core defence requirements as well as defence-and security-related spending&rdquo; by 2035.</p>



<p>&ldquo;We remain united and steadfast in our resolve to protect our one billion citizens, defend the Alliance, and safeguard our freedom and democracy,&rdquo; the statement read.</p>



<p>The 5% target is well beyond what any NATO country currently spends on defense, and a significant increase on <a href="https://www.nato.int/cps/en/natohq/topics_49198.htm"  target="_blank">the previous 2% guideline</a> laid out by the organization. <a href="https://www.nato.int/nato_static_fl2014/assets/pdf/2024/6/pdf/240617-def-exp-2024-en.pdf"  target="_blank">As of 2024</a>, Poland spends an estimated 4.2% of their annual GDP on defense, at that point the highest of all members.</p>



<p><a href="https://www.nato.int/nato_static_fl2014/assets/pdf/2024/6/pdf/240617-def-exp-2024-en.pdf"  target="_blank">The United States</a> spent an estimated 3.38% in 2024, a slight decrease from spending percentages throughout the ten years prior.</p>



<p><a href="https://www.nato.int/cps/en/natohq/official_texts_236705.htm?utm_source=social&amp;utm_medium=posts&amp;utm_campaign=250625%2Bmulti%2Bdeclaration"  target="_blank">NATO members say</a> that the aim of this new target is to provide security in the face of the &ldquo;long- term threat posed by Russia to Euro-Atlantic security and the persistent threat of terrorism.&rdquo;</p>



<p>&ldquo;We reaffirm our ironclad commitment to collective defence as enshrined in Article 5 of the Washington Treaty&mdash;that an attack on one is an attack on all,&rdquo; the NATO leaders said.</p>



<p>Should one NATO member be attacked, <a href="https://www.nato.int/cps/en/natohq/topics_110496.htm"  target="_blank">Article 5 commits</a> all other members to take the action &ldquo;it deems necessary, including the use of armed force, to restore and maintain the security of the North Atlantic area.&rdquo;</p>



<p><a href="https://www.nato.int/cps/en/natohq/topics_110496.htm"  target="_blank">The only occasion</a> that Article 5 has previously been invoked was after the 9/11 terrorist attacks.</p>



<p>Both commitments have been regularly brought up by Trump. Speaking at a press conference at the summit, he said: &ldquo;This will be known as the Hague defense commitment&hellip; it will add $1 trillion a year. It&rsquo;s a monumental win for the United States because we were carrying much more than our fair share, which was quite unfair actually.&rdquo;</p>



<p>Reiterating his &ldquo;America first&rdquo; mantra, Trump added that it&rsquo;s &ldquo;vital that this additional money be spent on very serious military hardware, not bureaucracy. And hopefully that hardware is going to be made in America.&rdquo;</p>



<p><strong>Read More</strong>: <em><a href="https://time.com/7296554/us-strikes-iranian-regime-benefits/" >How U.S. Strikes May Have Inadvertently Helped the Iranian Regime</a></em></p>



<figure class="wp-block-gutenberg-custom-blocks-inline-image"><img decoding="async" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2221354785.jpg" alt="NATO Leaders Attend 2025 Summit In The Hague" alignment="center"/><p class="article_header"></p><p class="article_subheading"></p><p class="article_text"></p></figure>



<h2 class="wp-block-heading"><strong>Zelensky warns Russia could attack a Nato country within the next five years</strong></h2>



<p>Speaking with Sky News in The Hague, Zelensky was asked if the 2035 spending commitment from NATO members was too slow.</p>



<p>&ldquo;This is slow, we believe starting in 2030 [Russian President Vladimir] Putin can have significantly greater capabilities. Today, Ukraine is holding him up, he has no time to drill the army,&rdquo; he said.</p>



<p>When asked if he believes if Russia could attack a NATO member, putting Article 5 to the test, Zelensky replied: &#8220;Precisely so, I believe so.&rdquo;</p>



<p>Trump also commented about the ongoing efforts to procure a lasting cease-fire between Russia and Ukraine, saying that he had shared a phone call with Putin, during which the Russian President offered support in Middle Eastern negotiations. &ldquo;I said &lsquo;No, no, you help me get a settlement with <em>you</em>, with Russia&rsquo;, and I think we&#8217;re going to be doing that too,&rdquo; Trump emphasized. &ldquo;Putin really has to end that war. People are dying at levels that people haven&#8217;t seen before for a long time.&rdquo;</p>



<p>When asked if the U.S. is willing to sell anti-air missiles to Ukraine, Trump said &ldquo;we&#8217;re going to see if we can make some available.&rdquo;</p>



<p>&ldquo;The Ukraine crisis has also highlighted the urgency of rebuilding our defense industrial base, both in the United States and among the allied nations. We cannot afford to be dependent on foreign adversaries for critical minerals,&rdquo; Trump said, highlighting <a href="https://time.com/7282110/ukraine-minerals-deal/" >the economic deal signed with Ukraine</a> in May.</p>



<h2 class="wp-block-heading"><strong>Ukraine membership</strong></h2>



<p>There was no official word on Ukraine&rsquo;s long-sought after NATO membership, which has <a href="https://www.bbc.co.uk/news/articles/clymn8zyrp9o"  target="_blank">been a key talking point </a>over the past few years, even more so since Russia&rsquo;s invasion in 2022.</p>



<p>&ldquo;NATO has no business in Ukraine. Ukraine is not a member of NATO, neither Russia, my job is to keep it as it is,&rdquo; <a href="https://news.sky.com/video/key-moments-from-nato-summit-13388538"  target="_blank">said Hungarian Prime Minister</a> Viktor Orb&aacute;n at the summit.</p>



<p>Meanwhile, NATO remains clear on its stance.</p>



<p>&ldquo;Ukraine is not a NATO member. Ukraine is a NATO partner country, which means that it cooperates closely with NATO but it is not covered by the security guarantee in the Alliance&rsquo;s founding treaty,&rdquo; <a href="https://www.nato.int/cps/en/natohq/topics_192648.htm"  target="_blank">the organisation&rsquo;s website reads</a>, adding that &ldquo;NATO condemns in the strongest possible terms Russia&#8217;s brutal and unprovoked war of aggression against Ukraine.&rdquo;</p>



<h2 class="wp-block-heading"><strong>World leaders react to the fragile Israel-Iran cease-fire</strong></h2>



<p><a href="https://www.youtube.com/watch?v=FoKhak3qJ7E"  target="_blank">Speaking at a NATO press conference</a> on Wednesday, British Prime Minister Sir Keir Starmer reacted to the fragile cease-fire between Iran and Israel, praising the U.S. intervention.</p>



<p>&ldquo;We need to make sure that the cease-fire holds, and seize this opportunity to stabilize the region and get Iran back round the negotiation table with the United States. Ultimately this is how we will ensure a complete, verifiable, and irreversible to Iran&#8217;s nuclear programme,&rdquo; Starmer said.</p>



<p>French President Emmanuel Macron said that the analysis of the damage from U.S. strikes on Iranian nuclear facilities is ongoing, including a French investigation.</p>



<p>&#8220;We will compare that with the analysis of other countries, Israel, the United States, and other Europeans,&#8221; Macron divulged at the summit.</p>



<p>In his joint press conference with President Trump, <a href="https://www.youtube.com/watch?v=oHJGeyP3x20"  target="_blank">Rutte also commented</a> on the U.S missile strikes, saying: &#8220;This was crucial, you [Trump] did it in a way that is extremely impressive. The signal that it sends to the rest of the world is this President when it comes to it&hellip; he is willing to use strength.&#8221;</p>



<p>Meanwhile, German Chancellor Friedrich Merz welcomed the simmered-down tensions, <a href="https://www.iranintl.com/en/202506251053"  target="_blank">telling reporters</a>: &ldquo;If the cease-fire between Iran and Israel succeeds, it will be a good development that makes the Mideast and the entire world safer.&rdquo;</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297698/nato-2025-summit-trump-iran-ukraine-defense-topics/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297698</post-id>	</item>
		<item>
		<title>Norwegian Tourist Claims U.S. Denied Him Entry Over a J.D. Vance Meme. Authorities Said It Was His Drug Use</title>
		<link>https://time.com/7297472/jd-vance-meme-mads-mikkelsen-tourist-denied-entry-cbp-ice/</link>
					<comments>https://time.com/7297472/jd-vance-meme-mads-mikkelsen-tourist-denied-entry-cbp-ice/#respond</comments>
		
		<dc:creator><![CDATA[Chad de Guzman]]></dc:creator>
		<pubDate>Wed, 25 Jun 2025 09:30:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Donald Trump]]></category>
		<category><![CDATA[News Desk]]></category>
		<category><![CDATA[overnight]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297472</guid>

					<description><![CDATA[The Trump Administration said reports a man was denied entry over a meme on his phone are false, but tourists have been experiencing tighter controls.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297472"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297472/jd-vance-meme-mads-mikkelsen-tourist-denied-entry-cbp-ice/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/jd-vance.jpg" alt="U.S. Vice President JD Vance talks to reporters on board Air Force Two at Leonardo da Vinci International Airport in Rome, Italy on May 19, 2025."/>



<div class="brief-podcast-player"><h3 class="podcast-title">The Brief June 25, 2025</h3><h4>Updates on New York&#8217;s primary, Iran, and more</h4><p>Podcast ID &#8211; Short Length: <code>85514303-5732-49f6-aeb4-50c602413301</code></p><p>Podcast ID &#8211; Long Length: <code>2d42fbbd-6977-4c45-b783-b86d5c920ea8</code></p></div>



[time-brightcove not-tgx=&#8221;true&#8221;]

<p>&ldquo;Two pictures spoiled Mads&rsquo; dream vacation,&rdquo; read a <a href="https://www.nordlys.no/mads-sin-drommereise-til-usa-spolert-pa-grunn-av-satirebilde-pa-mobilen/s/5-34-2171723"  target="_blank">headline</a> from Norwegian newspaper <em>Nordlys</em> on Monday, which was <a href="https://www.dailymail.co.uk/news/article-14842359/Norwegian-tourist-21-barred-entering-US-ICE-guards-meme.html"  target="_blank">amplified</a> by British tabloid the <em>Daily Mail</em> on Tuesday. </p>



<p>Mads Mikkelsen&mdash;not <a href="https://www.imdb.com/name/nm0586568/"  target="_blank">the Danish actor</a> but a 21-year-old tourist from Norway&mdash;<a href="https://www.instagram.com/p/DLPnDeQuBtR/"  target="_blank">told his hometown outlet</a> that he was denied entry to the U.S. at Newark Liberty International Airport on June 11 after handing over his phone to Immigration and Customs Enforcement (ICE) officials who came across a meme of U.S. Vice President J.D. Vance.</p>



<p>Mikkelsen claimed the officials threatened him with a $5,000 fine or five years in prison if he refused to give the password to his mobile device and that, after he relented and it was scrutinized, he was sent back to Norway.</p>



<p>On social media, anti-Trump influencers including former Republican congressman <a href="https://x.com/AdamKinzinger/status/1937575742227046418"  target="_blank">Adam Kinzinger</a> and #Resistance movement activist <a href="https://x.com/krassenstein/status/1937623798809002159"  target="_blank">Brian Krassenstein</a>, among others, shared reports of the denial of entry and encouraged the spreading of more Vance memes, which <a href="https://www.forbes.com/sites/danidiplacido/2025/03/08/how-jd-vance-edit-memes-broke-the-internet/"  target="_blank">became popular</a> after President Donald Trump&rsquo;s <a href="https://time.com/7262883/trump-zelensky-meeting/" >explosive meeting</a> with <a href="https://time.com/7270880/zelensky-trump-putin-ukraine-endgame-interview/" >Volodomyr Zelensky</a> in the Oval Office in February, when Vance demanded the Ukrainian President say &ldquo;thank you&rdquo; to Trump.</p>



<figure class="wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter"><div class="wp-block-embed__wrapper">
<div class="time-embed time-embed__twitter" data-provider="twitter" data-url="https://twitter.com/NewsWire_US/status/1937580587902013676" ><blockquote class="twitter-tweet" data-width="500" data-dnt="true"><p lang="en" dir="ltr">Norwegian tourist, 21, refused entry to U.S. and deported after ICE finds JD Vance meme on phone &mdash; Daily Mail <a href="https://t.co/CvPRbTO6L0"  target="_blank">pic.twitter.com/CvPRbTO6L0</a></p>&mdash; NewsWire (@NewsWire_US) <a href="https://twitter.com/NewsWire_US/status/1937580587902013676?ref_src=twsrc%5Etfw"  target="_blank">June 24, 2025</a></blockquote></div>
</div></figure>



<p>&ldquo;These are the same people who blame Europe for a lack of free speech,&rdquo; disinformation researcher Pekka Kallioniemi <a href="https://x.com/P_Kallioniemi/status/1937497385892024527"  target="_blank">posted on X</a> about the Trump Administration in relation to the story.</p>



<p>Tricia McLaughlin, a spokesperson for the Department of Homeland Security, which oversees ICE and Customs and Border Protection (CBP), called the claims of Mikkelsen&rsquo;s denied entry over the Vance meme <a href="https://x.com/TriciaOhio/status/1937644506872193279"  target="_blank">&ldquo;FALSE&rdquo; and &ldquo;BS.&rdquo;</a></p>



<p>CBP said in a <a href="https://x.com/CBP/status/1937651325354795444"  target="_blank">post on X</a> that &ldquo;Mads Mikkelsen was not denied entry for any memes or political reasons, it was for his admitted drug use.&rdquo;</p>



<p>The second photo seen by the ICE officials, by Mikkelsen&rsquo;s own admission, was a wooden pipe he&rsquo;d made himself a few years ago. He also told <em>Nordlys</em> that the officials asked him &ldquo;direct questions about drug smuggling, terrorist plots, and right-wing extremism&rdquo; and that he had been forced to give a <a href="https://www.thedailybeast.com/tourist-mads-mikkelsen-claims-he-was-denied-entry-to-us-because-of-vance-meme-on-phone/?via=twitter_page&amp;utm_source=twitter_owned_tdb&amp;utm_campaign=owned_social&amp;utm_medium=socialflow"  target="_blank">blood sample</a>.</p>



<p>It remains unclear why Mikkelsen was subjected to heightened scrutiny. CBP did not answer TIME&rsquo;s requests for comment.</p>



<h2 class="wp-block-heading">The bigger picture</h2>



<p>Tighter immigration controls, however, have become a cornerstone of Trump&rsquo;s second term.</p>



<p>Besides <a href="https://time.com/7291314/trump-new-travel-ban-countries-immigrant-entry-restrictions-nonimmigrant-visas/" >an outright ban on nationals from certain countries and heightened vigilance on nationals from others</a>, the Trump Administration has required immigration officials to improve vetting procedures for some non-immigrant visas, including <a href="https://time.com/7295949/international-student-visas-colleges-universities-social-media-state-department-trump/" >social media screening of international student visa applicants</a>. DHS also announced in April that authorities would begin screening the social media accounts of undocumented immigrants in the U.S. for &ldquo;<a href="https://www.uscis.gov/newsroom/news-releases/dhs-to-begin-screening-aliens-social-media-activity-for-antisemitism"  target="_blank">antisemitic activity</a>.&rdquo;&nbsp;</p>



<p>While border agents have long been empowered to deny entry on a case-by-case basis, reports of increased <a href="https://www.pbs.org/newshour/politics/as-trumps-new-travel-ban-begins-some-visitors-report-extra-scrutiny-at-u-s-airports"  target="_blank">scrutiny</a>, <a href="https://apnews.com/article/border-tourists-german-canadian-detention-immigration-408cd27338e8065268fabc835f8b0c34"  target="_blank">detentions</a>, and <a href="https://www.nbcnews.com/news/world/trump-immigration-detained-visitors-border-search-device-visa-passport-rcna197736"  target="_blank">denials</a> of tourists have proliferated in recent months.&nbsp;</p>



<p>Some incidents have sparked concerns about border agents&rsquo; discretion becoming politicized. In March, a French minister <a href="https://www.lemonde.fr/international/article/2025/03/19/etats-unis-un-chercheur-francais-refoule-pour-avoir-exprime-une-opinion-personnelle-sur-la-politique-menee-par-l-administration-trump_6583618_3210.html"  target="_blank">deplored</a> how a researcher for the French National Center for Scientific Research was denied entry to the U.S. after authorities found &ldquo;personal opinion on the Trump administration&#8217;s research policy&rdquo; on his phone. And just last week, border agents reportedly <a href="https://www.abc.net.au/news/2025-06-16/australian-denied-entry-united-states-israel-gaza-columbia/105419154"  target="_blank">sent back</a> an Australian writer to Melbourne from Los Angeles after they interrogated him about his views on the conflict in Gaza.&nbsp;</p>



<p>Some countries, including <a href="https://www.reuters.com/world/china/china-issues-risk-alert-tourists-travelling-us-2025-04-09/"  target="_blank">China</a>, <a href="https://um.dk/rejse-og-ophold/rejse-til-udlandet/pas-og-visum/usa"  target="_blank">Denmark,</a> and <a href="https://um.fi/resemeddelande/-/c/US"  target="_blank">Finland</a>, have issued travel advisories to their citizens about heading to the U.S. in response to various Trump policies.</p>



<p>Amid all this, travelers are increasingly turning away from the U.S., and the World Travel &amp; Tourism Council said the U.S. economy is <a href="https://wttc.org/news/us-economy-set-to-lose-12-5bn-in-international-traveler-spend-this-year"  target="_blank">set to lose $12.5 billion</a> in international traveler spending this year.</p>



<p>There&rsquo;s not much visitors can do if border officials want to deny them entry. You have the right to remain silent, an immigration lawyer told the <a href="https://www.nytimes.com/2025/03/20/travel/us-border-crossing-international-visa.html"  target="_blank"><em>New York Times</em></a>, but a border officer is likely to deny you entry as a result. And if they detain you instead of sending you back right away, they can hold you for up to 90 days.</p>



<p>Nate Freed Wessler, a lawyer at the American Civil Liberties Union (ACLU), told <a href="https://www.theguardian.com/us-news/2025/may/15/travel-trump-america-us-border-detentions"  target="_blank"><em>the Guardian</em></a> that after landing on an international flight but before clearing customs, you have fewer civil rights than you do elsewhere in the U.S. &ldquo;The normal Fourth Amendment requirement of a warrant or individualized suspicion doesn&rsquo;t apply,&rdquo; he said. &ldquo;The only minimal protection CBP has in their policy is distinguishing between manual and forensic searches,&rdquo; he added, explaining that a forensic search of a mobile phone, for example, involves plugging it into another device to analyze it, while a manual search includes scrolling through its contents. &ldquo;For a forensic search, they say they need reasonable suspicion, but they don&rsquo;t define what that means. For a manual search, there are no guardrails. They argue it&rsquo;s less invasive, but that&rsquo;s just not true. They can still do keyword searches and spend hours combing through your device.&rdquo;&nbsp;</p>



<p>&ldquo;Keep calm (but delete your nudes)&rdquo; advised <em>the Guardian</em>&rsquo;s headline for tourists headed to the U.S. <em>WIRED</em> has <a href="https://www.wired.com/story/how-to-protect-yourself-from-phone-searches-at-the-us-border/"  target="_blank">advised</a> traveling with a separate phone altogether&mdash;though a phone that appears &ldquo;too squeaky clean,&rdquo; it warns, &ldquo;can arouse suspicion&rdquo;&mdash;or at the very least minimizing risk by printing your boarding pass and any other documents you may need to present so you can avoid taking your phone out of your pocket.</p>



<p>Noor Zafar, a senior staff attorney with the ACLU&rsquo;s Immigrants&rsquo; Rights Project, <a href="https://www.washingtonpost.com/travel/2025/03/21/travelers-entering-united-states-rights/"  target="_blank">told</a> the <em>Washington Post</em> that travelers should keep the contact information of an immigration attorney in case they run into complications at the border.</p>



<p>&ldquo;The stories are definitely concerning,&rdquo; Zafar said in March. &ldquo;I think we&rsquo;re just in a period of more aggressive policies being implemented at the border. And I think that requires people to take extra precautionary measures.&rdquo;</p>



<h3 class="wp-block-heading">More from TIME</h3>



<div class="wp-block-gutenberg-custom-blocks-video-jw">[video id=hBorD65P autostart="viewable"]</div>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297472/jd-vance-meme-mads-mikkelsen-tourist-denied-entry-cbp-ice/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297472</post-id>	</item>
		<item>
		<title>I Was A Hostage in Iran. Did My Friends Survive Israel’s Bombing of Our Prison?</title>
		<link>https://time.com/7297385/evin-prison-israeli-airstrike-bombing-iran-islamic-republic-innocent-deaths/</link>
					<comments>https://time.com/7297385/evin-prison-israeli-airstrike-bombing-iran-islamic-republic-innocent-deaths/#respond</comments>
		
		<dc:creator><![CDATA[Siamak Namazi]]></dc:creator>
		<pubDate>Wed, 25 Jun 2025 09:00:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[world affairs]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297385</guid>

					<description><![CDATA[Israel’s airstrike, writes Siamak Namazi, who was held hostage for eight years in the same prison, “did not distinguish between evil magistrates and political prisoners.”]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297385"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297385/evin-prison-israeli-airstrike-bombing-iran-islamic-republic-innocent-deaths/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/iran-prison-bomb-01.jpg" alt=""/>



<p>When I saw the images of Evin Prison&rsquo;s front gate <a href="https://x.com/JasonMBrodsky/status/1937096800231367099"  target="_blank" rel="noreferrer noopener" target="_blank">torn to shreds</a> by an Israeli airstrike, my eyes filled with tears. I spent <a href="https://time.com/6315728/iran-president-mahsa-amini-prisoner-swap/"  target="_blank" rel="noreferrer noopener">eight years</a> behind that gate as a hostage of the Islamic Republic&mdash;held in a place where brutality is policy and hope is contraband.</p>



<p>But my tears were not tears of joy. I wasn&rsquo;t reveling in the thought that some of those responsible for tossing me&mdash;and later <a href="https://time.com/6315295/us-iran-prisoner-swap/"  target="_blank" rel="noreferrer noopener">my ailing father</a>&mdash;into solitary confinement were finally getting what they deserved. My heart was too tormented by imagining the horror that so many innocent prisoners&mdash;some of whom I spent years locked up with&mdash;and their families must be experiencing now.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>This was not just a strike on a symbol of repression. Israel didn&rsquo;t merely blow open a prison gate. Its bombs&mdash;dropped in the middle of working hours&mdash;severely damaged the adjoining Shahid Moghaddas judicial complex, where prisoners are dragged before malevolent magistrates and fed into the machinery of the Revolutionary Court. I&rsquo;ve been in those rooms&mdash;shackled, humiliated&mdash;facing men who called themselves judges but acted like junior members of the intelligence services, signing whatever orders they were handed. One I called &ldquo;Jenayatkar&rdquo; behind his back&mdash;a play on his name that means &ldquo;criminal&rdquo; in Farsi. The nickname stuck. I remember him sneering at me once while I was being held incommunicado, saying, <em>&ldquo;Your mom is downstairs in the waiting room. She comes every single day, pleading for a visit,&rdquo;</em> with a grin I wished I could smack off his face.<br><br><strong>Read More:</strong> <a href="https://time.com/7296872/iranians-beaten-imprisoned-regime-condemn-foreign-interference/" ><em>Why Iranians Beaten and Imprisoned by the Regime Condemn Foreign Interference</em></a></p>



<p>But that center of injustice wasn&rsquo;t filled only with villains. The bombs did not distinguish between evil magistrates and political prisoners, or the 18- to 20-year-old conscripts tasked with escorting them. Were human rights lawyers, who braved those halls to defend the defenseless, among the casualties? How many janitors and clerks&mdash;who commute for hours from Tehran&rsquo;s poorest suburbs&mdash;are now dead or injured? And what of the families gathered in the waiting area, as my own mother once did, pleading for visits, for medicine deliveries, or simply for confirmation that their loved ones were even being held inside Evin at all?</p>



<p>Israel&rsquo;s bombs also hit the infirmary, where I and countless others once lined up to see the doctor. I remember the desperation there&mdash;but also the acts of quiet courage. What has become of the young female physician I used to address as &ldquo;Superhero,&rdquo; who once stormed into the women&rsquo;s ward during the pandemic and forced a reluctant warden to send a political prisoner with acute COVID-19 to a hospital? She saved that woman&rsquo;s life. I recall many other stories of the infirmary staff helping prisoners in ways I cannot divulge. Their quiet, thankless compassion helped us endure and survive. Now that infirmary lies in ruins.</p>



<p>Ward 4, where many political prisoners and foreign or dual-national hostages are held, was also damaged&mdash;including the library, our main refuge, where I spent most of my days. So was the women&rsquo;s ward. Immediately after the strike, political prisoners&mdash;men and women&mdash;were suddenly rounded up, placed on buses, and transported to an undisclosed location without any of their belongings. Terrified families are now frantically calling one another, desperately seeking news and praying their loved ones are alive&mdash;and <a href="https://iranhumanrights.org/2025/06/lives-of-prisoners-in-iran-in-immediate-danger/"  target="_blank" rel="noreferrer noopener" target="_blank">that the regime won&rsquo;t take out its fury on them</a>.</p>



<p>The Evin Prison complex houses multiple detention centers. The most harrowing&mdash;controlled by the Ministry of Intelligence and the Islamic Revolutionary Guard Corps&mdash;were reportedly damaged as well. <a href="https://www.nytimes.com/2022/06/29/opinion/iran-prisoners-detained-americans.html"  target="_blank" rel="noreferrer noopener" target="_blank">I spent over two years</a> in one of them. We don&rsquo;t know if any of the interrogators who beat me were harmed&mdash;just as we don&rsquo;t know whether any political prisoners were buried beneath the rubble of their solitary cells or the torture chambers where they were blindfolded and brutalized.<br><br><strong>Read More</strong>: <a href="https://time.com/7288811/iran-womens-rights-evin-prison-reza-khandan/"  target="_blank" rel="noreferrer noopener"><em>Meet the Jailed Husband of Iran&rsquo;s Most Prominent Women&#8217;s Right Defender</em></a></p>



<p>And what about the visitation center, also damaged in the bombing? How many prisoners, families, and lawyers were harmed there? What became of the kind monitor who used to let my mom stay as long as she liked&mdash;quietly ignoring the 20-minute limit and saying this small gesture was all he could offer a family that had been through so much injustice?</p>



<p>This was no surgical strike on senior regime officials or military commanders in their ill-gotten penthouses. Those bombs certainly <a href="https://time.com/7296872/iranians-beaten-imprisoned-regime-condemn-foreign-interference/" >don&rsquo;t inspire the Iranian people to rise up</a> and topple the Islamic Republic. Quite the opposite. A former political prisoner reports that families of prisoners, guards, and administrators have all gathered outside the prison&mdash;helplessly seeking news of their loved ones and shedding tears together.</p>



<p>Israel&rsquo;s bombing of Evin lays bare what happens when two reprehensible systems collide: one that cages the innocent, and another that claims to liberate them with bombs. We can only hope the recent <a href="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/"  target="_blank" rel="noreferrer noopener">fragile ceasefire</a> between Iran, Israel, and the United States holds&mdash;and that this madness finally ends.</p>



<p>But even if it does, we all know what will follow. The Ayatollahs, having failed to stop the bombs from Israel or the U.S., will turn their vengeance inward. They will try to reassert control in the only way they know how: through brute force. Thousands will be rounded up, tortured, and executed as the regime spreads fear to survive. Already-persecuted communities&mdash;like the <a href="https://iranpresswatch.org/post/8160/the-little-religion-that-persists-the-bahai-in-israel/"  target="_blank">Baha&rsquo;is</a>&mdash;will likely be among the first to suffer.</p>



<p>As always, the most innocent will pay the highest price.</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297385/evin-prison-israeli-airstrike-bombing-iran-islamic-republic-innocent-deaths/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297385</post-id>	</item>
		<item>
		<title>How Bombing Iran May Have Made Nuclear Diplomacy Much Harder</title>
		<link>https://time.com/7297464/nuclear-diplomacy-iran-us-strikes-damage-non-proliferation-treaty-weapon/</link>
					<comments>https://time.com/7297464/nuclear-diplomacy-iran-us-strikes-damage-non-proliferation-treaty-weapon/#respond</comments>
		
		<dc:creator><![CDATA[Miranda Jeyaretnam]]></dc:creator>
		<pubDate>Wed, 25 Jun 2025 09:00:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Donald Trump]]></category>
		<category><![CDATA[News Desk]]></category>
		<category><![CDATA[overnight]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297464</guid>

					<description><![CDATA[While Trump claims to have destroyed Iran’s nuclear program, analysts say U.S. and Israeli attacks may have pushed the country closer to building a weapon.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297464"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297464/nuclear-diplomacy-iran-us-strikes-damage-non-proliferation-treaty-weapon/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/crater.jpg" alt="Destroyed Buildings at Isfahan Nuclear Facility"/>



<div class="brief-podcast-player"><h3 class="podcast-title">The Brief June 25, 2025</h3><h4>Updates on New York&#8217;s primary, Iran, and more</h4><p>Podcast ID &#8211; Short Length: <code>85514303-5732-49f6-aeb4-50c602413301</code></p><p>Podcast ID &#8211; Long Length: <code>2d42fbbd-6977-4c45-b783-b86d5c920ea8</code></p></div>



<p>What began as a military campaign against <a href="https://time.com/7294133/iran-israel-nuclear-program-attack/" >Iran&rsquo;s nuclear infrastructure</a> may have given way to a more enduring crisis: the collapse of decades-long efforts to contain nuclear proliferation through diplomacy.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>After <a href="https://time.com/7294609/iran-israel-war-pictures-strike/" >days of escalating airstrikes</a> between Israel and Iran that killed hundreds in Iran and dozens in Israel&mdash;and the <a href="https://time.com/7296469/u-s-strikes-iran-nuclear-trump-war/" >United States&rsquo; decision to involve itself</a>&mdash;one of the most lasting, and difficult to quantify, losses may be the fragile framework of international nuclear cooperation.</p>



<p><strong>Read More:</strong> <a href="https://time.com/7297049/iran-israel-ceasefire-trump/" ><em>Trump Brokers Ceasefire to End &lsquo;12 Day War&rsquo; Between Israel and Iran</em></a></p>



<p>While the full scope of physical damage to Iran&rsquo;s nuclear facilities remains unclear, analysts warn that the attacks may have pushed Iran to the brink of abandoning the Nuclear Non-Proliferation Treaty (NPT), the foundational agreement designed to limit the spread of nuclear weapons and promote peaceful atomic energy that Iran has been a party to for five-and-a-half decades.</p>



<p>Iran is now &ldquo;quite likely&rdquo; to withdraw from the NPT under which it pledged not to develop a bomb, <a href="https://x.com/AliVaez/status/1936611464451657820"  target="_blank">warned</a> Ali Vaez, director of the Iran Project at the International Crisis Group. Outlining &ldquo;worst-case scenarios&rdquo; in an essay for TIME, Vaez <a href="https://time.com/7294202/grim-reality-conflict-iran-israel/" >suggested</a>: &ldquo;Over time, Iran&rsquo;s regime could attempt to reconstitute its nuclear activity from the rubble, only with an explicit aim of fashioning a weapon in the shortest possible time as a means of deterrence in the future.&rdquo;</p>



<p><strong>Read More: </strong><a href="https://time.com/7295632/israel-strikes-iran-nuclear-site-program/" ><em>Where Iran&rsquo;s Nuclear Program Goes From Here</em></a></p>



<p>Trita Parsi, executive vice president of the Quincy Institute in Washington, D.C., <a href="https://x.com/tparsi/status/1936841878407684232"  target="_blank">said</a> in a post on X that Iran&rsquo;s nuclear program &ldquo;has at best been set back, but certainly not destroyed, while dramatically increasing Tehran&rsquo;s determination to achieve nuclear deterrence.&rdquo; He added that Iran having a damaged but not fully dismantled nuclear program makes any future peace between Iran and Israel even more precarious.</p>



<p>Israel, which is believed to have its own clandestine <a href="https://www.nytimes.com/2025/06/17/world/middleeast/israel-nuclear-weapons.html"  target="_blank">nuclear weapons program</a> and is not a member of the NPT, has stated that it cannot allow nations hostile to it to develop a nuclear weapon.</p>



<p>&ldquo;While Trump may have genuinely envisioned a one-and-done,&rdquo; Parsi said, U.S. intervention <a href="https://time.com/7295726/netanyahu-trump-israel-iran-nuclear-strikes/" >at the request of Israel</a> has signaled that, should Israel or Iran choose to <a href="https://time.com/7297098/israel-iran-ceasefire-broken-missile-strikes-tehran/" >reignite the war</a>, Israel will have &ldquo;succeeded in trapping him in a long, if not a forever, war.&rdquo;</p>



<p><strong>Read More:</strong> <a href="https://time.com/7296013/trump-strike-iran-war-regime-change/" ><em>In Bombing Iran, Trump Looked Past 80 Years of U.S. Regime Change Mistakes</em></a></p>



<p>For diplomacy to resume, he argues, &ldquo;Trump&rsquo;s only exit out of this is to discard the Israeli red line of zero-enrichment and return to the American red line of no weaponization.&rdquo;</p>



<figure class="wp-block-gutenberg-custom-blocks-inline-image"><img decoding="async" src="https://api.time.com/wp-content/uploads/2025/06/grossi.jpg" alt="Rafael Grossi" alignment="original-size-image"/><p class="article_header"></p><p class="article_subheading"></p><p class="article_text"></p></figure>



<h2 class="wp-block-heading">A blow to non-proliferation diplomacy</h2>



<p>The diplomatic fallout is already materializing in Tehran. Iran&rsquo;s parliamentary national security committee <a href="https://www.tasnimnews.com/en/news/2025/06/23/3340784/parliament-seeks-to-suspend-iran-s-cooperation-with-iaea"  target="_blank">passed</a> the outline of a bill on Monday to suspend Tehran&rsquo;s cooperation with the United Nations&rsquo; nuclear watchdog&mdash;the International Atomic Energy Agency (IAEA)&mdash;so long as Iran&rsquo;s nuclear sites remain vulnerable to military attack. Committee spokesperson Ebrahim Rezaei <a href="https://www.reuters.com/world/middle-east/iranian-parliament-committee-approves-general-plan-suspend-cooperation-with-iaea-2025-06-23/"  target="_blank">reportedly told</a> semi-official Tasnim news agency that the bill would mean a suspension in installing surveillance cameras, inspections, and submitting reports to the IAEA.</p>



<p>Mohammad Eslami, the head of the Atomic Energy Organization of Iran, said the government is planning to restore its nuclear program as it evaluates what damage has been done. &ldquo;Preparations for recovery had already been anticipated, and our plan is to prevent any interruption in production or services,&rdquo; Eslami said in a statement <a href="https://aje.io/7jaly7?update=3796825"  target="_blank">reportedly</a> carried by government-affiliated Mehr News.</p>



<p>Iran&rsquo;s envoy to the IAEA, Reza Najafi, <a href="https://www.bloomberg.com/news/articles/2025-06-23/iran-says-nuclear-arms-control-treaty-irreparably-damaged-by-us"  target="_blank">told reporters</a> on the sidelines of an emergency IAEA board meeting on Monday that U.S. involvement in the strikes had &ldquo;delivered a fundamental and irreparable blow to the international non-proliferation regime conclusively demonstrating that the existing NPT framework has been rendered ineffective.&rdquo;</p>



<h2 class="wp-block-heading">Scope of physical damage to Iran&rsquo;s nuclear facilities remains unclear</h2>



<p>The breakdown in diplomacy is unfolding as questions hang over just how significant the physical damage is to Iran&rsquo;s nuclear infrastructure&mdash;an element that may carry long-term consequences for non-proliferation efforts.</p>



<p>After the U.S. dropped 30,000-pound bombs on three of Iran&rsquo;s key nuclear facilities and risked a wider war, President Donald Trump declared from the White House that &ldquo;Iran&rsquo;s key nuclear enrichment facilities have been completely and totally obliterated.&rdquo;</p>



<p>&ldquo;THE NUCLEAR SITES ARE COMPLETELY DESTROYED!&rdquo; President Donald Trump <a href="https://truthsocial.com/@realDonaldTrump/114741478150368433"  target="_blank">posted</a> on Truth Social on Tuesday. Earlier the same day, he <a href="https://truthsocial.com/@realDonaldTrump/114738128058193093"  target="_blank">posted</a>: &ldquo;IRAN WILL NEVER REBUILD THEIR NUCLEAR FACILITIES!&rdquo;</p>



<p>But Iran&rsquo;s nuclear program has at most been set back a few months, according to a <a href="https://edition.cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites"  target="_blank">reported</a> initial assessment by U.S. intelligence.</p>



<p>A <a href="https://www.wsj.com/world/middle-east/u-s-strikes-set-back-iran-nuclear-program-by-a-few-months-initial-report-says-db9373ad"  target="_blank">leaked Defense Intelligence Agency preliminary report</a>, which members of the Trump Administration have claimed is wrong, found that Iran&rsquo;s nuclear facilities were damaged, but not severely degraded, and that Iran still has the ability to enrich uranium. Earlier <a href="https://www.nytimes.com/2025/06/22/world/middleeast/iran-fordo-nuclear-damaged-not-destroyed.html"  target="_blank">damage assessments</a> by U.S. and Israeli militaries using satellite images of Fordow also suggested that the site had not been obliterated.</p>



<p><strong>Read More:</strong> <a href="https://time.com/7297389/iran-strike-briefing-congress/" ><em>Democrats in Congress Fume as Iran Strike Briefing Is Abruptly Cancelled</em></a></p>



<p>Iran&rsquo;s Foreign Minister Abbas Araghchi said at a news conference on Sunday that the country is &ldquo;calculating the damages&rdquo; from the strike.</p>



<p>IAEA Director-General Rafael Grossi <a href="https://www.reuters.com/world/middle-east/un-security-council-meet-sunday-over-us-strikes-iran-2025-06-22/"  target="_blank">told</a> the U.N. Security Council that there are visible craters at Fordow, and that entrances to tunnels used to store enriched uranium appeared to have been hit at Isfahan. But he also cautioned that &ldquo;no one, including the IAEA, is in a position to assess the underground damage.&rdquo;</p>



<figure class="wp-block-gutenberg-custom-blocks-inline-image"><img decoding="async" src="https://api.time.com/wp-content/uploads/2025/06/fordow.jpg" alt="Extensive Damage at Fordow Underground Complex After Airstrikes" alignment="original-size-image"/><p class="article_header"></p><p class="article_subheading"></p><p class="article_text"></p></figure>



<p>Some observers believe Iran may have preemptively moved enriched uranium to undisclosed locations. The IAEA <a href="https://www.bloomberg.com/news/articles/2025-06-18/iran-nuclear-infrastructure-location-of-enriched-uranium-stocks-uncertain?srnd=homepage-asia"  target="_blank">confirmed</a> last week it was unable to track Iran&rsquo;s stockpile amid the ongoing bombardment. Iran had previously warned the IAEA that its stockpile, which is typically secured at Isfahan, could be moved in the event of an Israeli attack.</p>



<p>Grossi said after the U.S. strikes that &ldquo;Iran has informed the IAEA there has been no increase in off-site radiation levels at all three sites,&rdquo; suggesting that the strikes may not have hit uranium stores directly. Still, he urged Iran to disclose the new location of any relocated nuclear material and reaffirmed Tehran&rsquo;s obligations under the treaty.</p>



<p><strong>Read More:</strong> <a href="https://time.com/7297135/environmental-risks-bombing-iran-nuclear-enrichment-sites/" ><em>Breaking Down the Environmental Risks From Strikes on Iran&rsquo;s Nuclear Enrichment Sites</em></a></p>



<p>Iran&rsquo;s legislative response suggests a hardening stance. &ldquo;Iran has no plans for non-peaceful activities, but the world witnessed clearly that the IAEA has not honored any of its commitments and has turned into a political instrument,&rdquo; parliamentary speaker Mohammed-Bagher Ghalibaf said during Monday&rsquo;s session.</p>



<p>&ldquo;This war makes it more, not less, likely that the Iranian government will eventually build a nuclear weapon,&rdquo; argues Sara Haghdoosti, executive director of Win Without War, a progressive Washington, D.C.-based advocacy group. &ldquo;Israeli&mdash;or even U.S.&mdash;airstrikes cannot wipe out the knowledge behind the nuclear program or reliably destroy all centrifuges and uranium in a country over twice the size of Texas.&rdquo;</p>



<h2 class="wp-block-heading">Iran more likely to withdraw from nuclear diplomacy</h2>



<p>Whether Iran was actively pursuing a nuclear weapon remains in dispute. U.S. intelligence <a href="https://www.dni.gov/files/ODNI/documents/assessments/ODNI-Unclassified-Irans-Nuclear-Weapons-Capability-and-Terrorism-Monitoring-Act-of-2022-202411.pdf"  target="_blank">concluded</a> earlier this year that the country had no plans to develop a nuclear weapon, while Trump and Israeli officials have <a href="https://www.axios.com/2025/06/17/trump-gabbard-iran-nuclear-weapon-testimony"  target="_blank">insisted</a> it did. Iran has <a href="https://www.iranintl.com/en/202505143023"  target="_blank">maintained</a> that its uranium enrichment is in line with its right to peaceful enrichment for energy purposes under the NPT. Iranian President Masoud Pezeshkian reiterated that view on Tuesday, <a href="https://www.barrons.com/news/iran-says-not-seeking-nuclear-weapons-but-will-assert-legitimate-rights-534d2572"  target="_blank">reportedly</a> telling regional officials that Iran is interested only in pursuing its &ldquo;legitimate rights&rdquo; and has no ambitions &ldquo;to acquire nuclear weapons.&rdquo;</p>



<p>Iran and the U.S. had been in the midst of <a href="https://time.com/7287313/iran-israel-strike-report-nuclear-us-trump-history-context-explainer/" >protracted talks</a> centered on Iran&rsquo;s nuclear program when <a href="https://time.com/7293795/israel-strikes-iran-attack-what-to-know/" >Israel launched its surprise attack on Iran</a>. The war put a halt to further talks with the U.S.&mdash;although Iran continued <a href="https://www.euronews.com/my-europe/2025/06/22/europes-leaders-call-for-talks-but-iran-says-diplomacys-been-blown-away"  target="_blank">talks with European officials</a>&mdash;and it is unclear whether they will begin again.</p>



<p>Several agencies and countries, including the <a href="https://x.com/vonderleyen/status/1937412192300683690"  target="_blank">European Union</a> and <a href="https://x.com/rafaelmgrossi/status/1937426770862489806"  target="_blank">Grossi</a>, have urged Iran to return to the negotiating table. But Iran&rsquo;s envoy to the U.N. Ali Bahreini <a href="https://www.middleeasteye.net/live-blog/live-blog-update/iran-tells-un-israel-destroyed-diplomacy-ahead-nuclear-talks"  target="_blank">said</a> on Sunday<strong> </strong>that it can&rsquo;t return to something &ldquo;it never left.&rdquo; He said the NPT has been &ldquo;manipulated into a political weapon&rdquo; and &ldquo;exploited as a pretext for aggression and unlawful action.&rdquo;</p>



<p><strong>Read More:</strong> <a href="https://time.com/7295798/new-middle-east-time-cover/" ><em>A New Middle East Is Unfolding Before Our Eyes</em></a></p>



<p>Iran ratified the treaty in 1970, and <a href="https://2009-2017.state.gov/e/eb/tfs/spi/iran/jcpoa/#:~:text=On%20July%2014%2C%202015%2C%20the,program%20will%20be%20exclusively%20peaceful."  target="_blank">signed another deal</a> with former President Barack Obama in 2015 <a href="https://time.com/3957036/obama-iran-nuclear-deal-transcript/" >agreeing</a> that its nuclear program will be exclusively peaceful in exchange for the relief of economic sanctions. Trump <a href="https://time.com/5269746/donald-trump-iran-nuclear-deal-macron/" >exited the deal in 2018</a> during his first term, reimposing heavy sanctions on Iran, which pushed Iran to restart some nuclear operations.</p>



<p>Foad Izadi, a professor at the University of Tehran, <a href="https://aje.io/7jaly7?update=3796653"  target="_blank">told Al Jazeera</a> that Iran&rsquo;s collaboration with the IAEA as a member of the NPT has clearly not benefited or protected Tehran.</p>



<p>&ldquo;Iran doesn&rsquo;t have to be there,&rdquo; Izadi said, &ldquo;given the fact that Iranian nuclear sites that were under the supervision of the International Atomic Energy Agency, that were under the monitoring of [the IAEA], were attacked.&rdquo;</p>



<p>Haghdoosti, the Win Without War activist, tells TIME that the airstrikes on Iran, which the Trump Administration has <a href="https://time.com/7297452/trump-doctrine-vance-peace-through-strength-america-first-presidents-history/" >framed as part of a deliberate strategy</a> to pursue &ldquo;peace through strength,&rdquo; will erode diplomatic efforts around nuclear programs for all countries now and in the future.</p>



<p>&ldquo;The lesson of this war for the Iranian government and any other government contemplating acquiring nuclear weapons is that even if the U.S. is negotiating with you to end that pursuit, it will still support&mdash;and even join&mdash;a war against you,&rdquo; Haghdoosti says. &ldquo;That&rsquo;s a strong incentive for governments to skip diplomacy entirely and go straight to getting a nuclear weapon.&rdquo;</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297464/nuclear-diplomacy-iran-us-strikes-damage-non-proliferation-treaty-weapon/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297464</post-id>	</item>
		<item>
		<title>Trump Veers From Victory Lap to Expletive-Laced Rant as Ceasefire Proves Fragile</title>
		<link>https://time.com/7297315/ceasefire-iran-israel-trump-f-bomb/</link>
					<comments>https://time.com/7297315/ceasefire-iran-israel-trump-f-bomb/#respond</comments>
		
		<dc:creator><![CDATA[Brian Bennett]]></dc:creator>
		<pubDate>Tue, 24 Jun 2025 18:00:08 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Donald Trump]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297315</guid>

					<description><![CDATA[The profanity exposed Trump’s increasing irritation with Israel in particular]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297315"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297315/ceasefire-iran-israel-trump-f-bomb/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2221176644.jpg" alt="US President Donald Trump departs White House for NATO Summit"/>



<p>In 12 hours, President Trump veered from crowing about a huge foreign policy <a href="https://time.com/7297049/iran-israel-ceasefire-trump/" >victory</a> to swearing in <a href="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/" >frustration</a> on the South Lawn. The ceasefire between Iran and Israel he had proudly announced the evening before&mdash;going so far as to tell a reporter it might last &#8220;<a href="https://www.nbcnews.com/politics/donald-trump/trump-expects-israel-iran-ceasefire-last-forever-rcna214660"  target="_blank">forever</a>&#8220;&mdash;was already wavering.</p>



[time-brightcove not-tgx=&#8221;true&#8221;]

<p>The President had been posting on social media up until 1 a.m., alternating between praising himself for landing a peace deal and writing all caps messages demanding Israel and Iran adhere to it. But in the morning, Israel and Iran accused each other of violating the shaky agreement. By the time he came across reporters gathered to see him depart the White House to attend the <a href="https://time.com/7295448/rutte-nato-secretary-general-interview/" >NATO Summit</a> in The Hague, he was visibly angry. &ldquo;I&#8217;m not happy with Iran, but I&#8217;m really not happy with Israel,&rdquo; Trump said. &ldquo;We basically have two countries that have been fighting so long and so hard that they don&rsquo;t know what the f&#8211;k they&rsquo;re doing.&rdquo;</p>



<p>The profanity exposed Trump&rsquo;s increasing irritation with Israel hesitating to back down from the fight when he wanted them to silence their guns, says Timothy Naftali, a Presidential historian at Columbia School of International and Public Affairs. &ldquo;Swearing at the Iranians is not a surprise, but swearing at the Israelis is very interesting,&rdquo; Naftali says. &ldquo;Most Presidents, because of the power of the office, work through their team and choose their words carefully because they know they carry enormous weight&mdash;this President is unfiltered.&rdquo;</p>



<p>That lack of filter has led to Trump sending mixed signals in the previous few days, including suggesting <a href="https://time.com/7296670/trump-iran-regime-change-khamenei-hegseth-vance-rubio-us-war/" >regime change in Iran</a> might be a good idea and then backing away from it. On Tuesday, he told reporters on Air Force One that pushing to topple the Islamic government in Iran would bring &ldquo;chaos.&rdquo;</p>



<p>It was a dizzying turn of events&mdash;both in the Middle East and for the White House, as Trump appears to be losing patience with the main players in a hair-trigger war that had already led to him launching a <a href="https://time.com/7296670/trump-iran-regime-change-khamenei-hegseth-vance-rubio-us-war/" >rare B-2 bombing raid</a> against Iranian nuclear sites. His statements to reporters and online Tuesday morning suggested he is interested in focusing his, and the country&rsquo;s, attention on other matters. </p>



<p>The fragile ceasefire appeared to come about quickly late Monday,<strong> </strong>after Iran retaliated to the U.S. airstrike with a dangerous but largely symbolic volley of ballistic missiles targeting major U.S. base in Qatar. Trump announced a ceasefire Monday evening, even as Iran and Israel appeared to still be deciding just what exactly that would look like.</p>



<p>Trump told reporters Tuesday morning he &ldquo;didn&rsquo;t like&rdquo; that Israel &ldquo;unloaded&rdquo; on Iran after the deal was made and hours before the formal ceasefire went into effect. In addition, he said Iran fired a rocket that missed its target after the negotiated time limit and Israel responded by launching planes for a bombing run<strong>.</strong> &ldquo;These guys got to calm down. Ridiculous,&rdquo; Trump said.</p>



<p>Trump&rsquo;s brash communication style at this sensitive moment is &ldquo;a double-edged sword&rdquo; says Lauren Wright, a political scientist at Princeton University. &ldquo;The public appreciates the directness and the transparency,&rdquo; Wright says. &ldquo;Of course, when you&rsquo;re talking about people&rsquo;s lives being at stake, including American service members, when you&rsquo;re talking about bombing campaigns, there&rsquo;s nothing more serious that a President could talk about.&rdquo;</p>



<p>But the public and other world leaders have come to expect brazen statements from Trump. &ldquo;There&rsquo;s very few things he could say that would be damaging to his reputation. They have come to know how he speaks, and it applies to the most serious of foreign policy issues and it applies to the most casual of topics and conversations,&rdquo; Wright says.</p>



<p>In another sign that Trump is trying to keep Iran on board with a peace deal, Trump announced Tuesday morning that he was lifting some sanctions on Chinese companies that buy oil from Iran. &ldquo;China can now continue to purchase Oil from Iran. Hopefully, they will be purchasing plenty from the U.S., also,&rdquo; Trump wrote on Truth Social. In April, the Trump administration sanctioned a Chinese oil refinery accused of processing Iranian oil. At the time, the Trump administration said the money Iran earned from the oil sales was being used to fund terrorist proxy groups in the Middle East.</p>



<p>Trump signaled on social media Tuesday that he wants to spend more of his time and effort on other priorities, such as pressuring Congress to pass a <a href="https://time.com/7296762/big-beautiful-bill-byrd-rule/" >&ldquo;Big, Beautiful Bill&rdquo;</a> that would extend his 2017 tax cuts and beef up immigration enforcement, and negotiating with Russian President Vladimir Putin to end the war in Ukraine.</p>



<p>Aboard Air Force One as he flew over the Atlantic for the NATO Summit in The Hague, Trump seemed eager to declare his work done in negotiating peace between Israel and Iran. &ldquo;Now that we have made PEACE abroad, we must finish the job here at home by passing &lsquo;THE GREAT, BIG, BEAUTIFUL BILL,&rsquo; and getting the Bill to my desk, ASAP,&rdquo; Trump wrote on Truth Social. &ldquo;NO ONE GOES ON VACATION UNTIL IT&rsquo;S DONE,&rdquo; Trump wrote, insisting that representatives and senators not leave Washington for summer recess until the bill is passed. As much as Trump wants to move on from the conflict in the Middle East, whether the war winds down will largely depend on the leaders in Israel and Iran, and events outside of his control.</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297315/ceasefire-iran-israel-trump-f-bomb/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297315</post-id>	</item>
		<item>
		<title>Breaking Down the Environmental Risks From Strikes on Iran&#8217;s Nuclear Enrichment Sites</title>
		<link>https://time.com/7297135/environmental-risks-bombing-iran-nuclear-enrichment-sites/</link>
					<comments>https://time.com/7297135/environmental-risks-bombing-iran-nuclear-enrichment-sites/#respond</comments>
		
		<dc:creator><![CDATA[Jeffrey Kluger]]></dc:creator>
		<pubDate>Tue, 24 Jun 2025 13:40:18 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[healthscienceclimate]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297135</guid>

					<description><![CDATA[The U.S. attack on Iran's nuclear enrichment sites poses minimum radiation danger.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297135"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297135/environmental-risks-bombing-iran-nuclear-enrichment-sites/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2220642625.jpg" alt="TOPSHOT-US-IRAN-ISRAEL-CONFLICT-TRUMP"/>



<p>There is all manner of geopolitical and military fallout likely to come from the U.S. bombing of Iranian nuclear enrichment sites on June 21. What worries a lot of people more, however, is the literal fallout&mdash;the radioactive contamination that could be released when massive, bunker-buster munitions are dropped on facilities said to contain more than <a href="https://www.iaea.org/newscenter/statements/iaea-director-general-grossis-statement-to-unsc-on-situation-in-iran-20-june-2025"  target="_blank">400</a> kg (880 lbs.) of enriched uranium. Demolishing the sites, so the thinking goes, could have the same effect as detonating a so-called dirty bomb&mdash;a piece of non-fissile ordnance that spreads dangerous radioactive material across a large footprint of land and expanse of sky.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>But that fear is unfounded, say experts. &ldquo;The attack on the enrichment sites in Iran doesn&#8217;t pose the same hazard as an accident with a functioning nuclear reactor,&rdquo; says Simon Middleburgh, professor of Nuclear Engineering at the Nuclear Futures Institute at Bangor University, U.K. Any contamination is likely to be local, Middleburgh explains, because enrichment doesn&rsquo;t involve fission, which is what presents the real peril when handling radioactive materials.&nbsp;</p>



<p>But that&rsquo;s not to say there is no danger at all. While radioactive poisoning may be held in check, chemical poisoning&mdash;toxic exposure to gasses produced during nuclear enrichment&mdash;is another matter.</p>



<p>&ldquo;No increase in off-site radiation levels was reported,&rdquo; said Rafael Mariono Grossi, director general of the International Atomic Energy Agency (IAEA) <a href="https://www.iaea.org/newscenter/statements/iaea-director-generals-introductory-statement-to-the-board-of-governors-23-june-2025"  target="_blank">in a June 23 statement</a> about the state of the attack sites. &ldquo;[T]he main concern is chemical toxicity.&rdquo; However much contamination has been released, Grossi added, the U.S. and Israel must choose any future targets carefully, especially taking pains to steer wide of Iran&rsquo;s <a href="https://www.msn.com/en-in/news/world/nuclear-watchdog-warns-of-serious-catastrophe-if-israel-targets-iran-s-bushehr-reactor/ar-AA1H89rS"  target="_blank">Bushehr Nuclear Power Plant</a>, the Middle East&rsquo;s first civilian nuclear reactor. </p>



<p><strong>Read more: </strong><em><a href="https://time.com/7296218/israel-iran-climate-change/" >What Conflict in the Middle East Means for Climate Change</a></em></p>



<p>&ldquo;I want to make it absolutely and completely clear,&rdquo; Grossi warned, &ldquo;[in] case of an attack on [the plant], a direct hit could result in a very high release of radioactivity to the environment.&rdquo; Damage to the power grid serving the reactor could also cause its core to melt down, leading to a release of high amounts of radiation that would necessitate evacuation or protective sheltering&mdash;measures that the IAEA said would have to be taken over distances of hundreds of miles.&nbsp;</p>



<p>Here&rsquo;s what else you&mdash;and the Iranian people in the nuclear crosshairs&mdash;need to know.</p>



<p>For all the mortal mischief a nuclear weapons facility could whip up, there is very little radiation risk associated with the job of enriching uranium-235 up to the level of 90% purity needed to produce a bomb. By itself, the enriched U-235 isotope is something of &ldquo;a damp squib,&rdquo; says Paddy Regan, a nuclear physics professor at the U.K.&rsquo;s University of Surrey. &ldquo;Uranium itself is not particularly radioactive.&rdquo; Iran&rsquo;s 400 kg of U-235, he says, &ldquo;would be much more dangerous if it fell on you.&rdquo; That&rsquo;s partly due to U-235&rsquo;s long half-life, which measures 700 million years&mdash;the time it takes half of the material to decay away. At the sites of the U.S. attack, Regan says, &ldquo;the bombing will do much more damage to the people in the locality than the poisoning.&rdquo;</p>



<p>Adds James Smith, professor of environmental science at the University of Portsmouth, &ldquo;I&rsquo;ve worked for a long time at Chernobyl and there&rsquo;s lots of uranium from the nuclear fuel in the environment there. There&rsquo;s something like six tons of it dispersed as small fuel particles. But it&rsquo;s not the uranium we worry about.&rdquo;</p>



<p>Far more dangerous than U-235 are the elemental products given off when nuclear fuel goes through fission&mdash;especially iodine, strontium, and cesium. &ldquo;These are the things that uranium splits into when it&rsquo;s working in a reactor or a bomb,&rdquo; says Smith. &ldquo;Those fission products are much more densely radioactive than uranium.&rdquo;</p>



<p>An enrichment plant&mdash;which does not produce fission&mdash;poses other dangers beyond U-235&rsquo;s relatively low radiation load. Those more-worrisome materials are the toxic gasses that are generated as a byproduct of the enrichment process. &ldquo;When uranium is mined it&rsquo;s milled into a substance called yellow cake,&rdquo; says Jeffrey Lewis, professor and director of the East Asia Nonproliferation Project at Middlebury Institute of International Studies in Monterey, Calif. &ldquo;This is kind of a powder. You want to enrich that material in a centrifuge, and to do that you have to transform it into a gas.&rdquo; </p>



<p>Actually, it&rsquo;s transformed into multiple gasses, including uranium hexafluoride, uranyl fluoride, and hydrogen fluoride&mdash;all of which are highly corrosive and toxic when inhaled or ingested. The IAEA warns that these byproducts have likely been dispersed throughout the damaged Iranian facilities and may have escaped into the outdoor environment as well. </p>



<p><strong>Read more:</strong> <em><a href="https://time.com/7295798/new-middle-east-time-cover/" >A New Middle East Is Unfolding Before Our Eyes</a></em></p>



<p>The best guess the IAEA has advanced at the moment is that if the gasses have indeed escaped, they have remained local, but the group cannot say so for sure. &ldquo;When a bomb hits a site you can get a plume of dust and gas and debris,&rdquo; says Smith. That could be carried on the wind well beyond the initial point of bunker-buster impact.</p>



<p>The fog of war makes it difficult to ascertain exactly how badly the targeted sites have been hit and just how much radiation or chemical toxicity may have spread. The IAEA <a href="https://www.iaea.org/newscenter/statements/iaea-director-general-grossis-statement-to-unsc-on-situation-in-iran-20-june-2025"  target="_blank">relies in part</a> on Iran itself to report these measures; after Israel bombed the enrichment plants but before U.S. planes dropped their much heavier ordnance, the Iranians claimed there was no increase in off-site radiation levels. It&rsquo;s uncertain, however, how much of that was true and how much was just all-is-well spin.</p>



<p>For now, the IAEA plans to maintain a presence in Iran and resume inspection of the enrichment sites, as required by the nuclear Nonproliferation Treaty (NPT), of which Iran is a signatory &ldquo;as soon as safety and security conditions allow,&rdquo; according to the June 23 statement. Even before the American strikes, however, Iran <a href="https://www.aljazeera.com/news/2025/6/17/what-is-the-npt-and-why-has-iran-threatened-to-pull-out-of-the-treaty#:~:text=Israel%2DIran%20conflict-,What%20is%20the%20NPT%2C%20and%20why%20has%20Iran%20threatened%20to,escalating%20military%20conflict%20with%20Israel."  target="_blank">was threatening to withdraw</a> from the NPT, and now, battered on one side by what it considers aggression by the Israelis and on the other by the Americans, Tehran may be ill-inclined to play the good global citizen.</p>



<p>The Trump Administration, meantime, is keeping its military options open, signalling that the weekend strike <a href="https://www.theguardian.com/us-news/2025/jun/21/trump-iran-attack-analysis"  target="_blank">was a one-off</a>, while at the same time retaining the option of future attacks. &ldquo;Iran, the bully of the Middle East, must now make peace,&rdquo; <a href="https://abcnews.go.com/Politics/trump-warned-iran-retaliate-us/story?id=123128251"  target="_blank">President Donald Trump said</a> in his Saturday night address, after the bombings. &ldquo;If they do not, future attacks would be far greater and a lot easier.&rdquo;</p>



<p>At present, the damage to the targeted sites seems relatively contained. Whether conditions will remain that way is impossible to say. If the truce announced late on June 23 holds, the differences among the parties could be settled without further military action. </p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297135/environmental-risks-bombing-iran-nuclear-enrichment-sites/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297135</post-id>	</item>
		<item>
		<title>How TIME and Statista Determined the World&#8217;s Most Sustainable Companies of 2025</title>
		<link>https://time.com/7296709/worlds-most-sustainable-companies-2025-methodology/</link>
					<comments>https://time.com/7296709/worlds-most-sustainable-companies-2025-methodology/#respond</comments>
		
		<dc:creator><![CDATA[TIME Staff]]></dc:creator>
		<pubDate>Tue, 24 Jun 2025 12:35:56 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Companies]]></category>
		<guid isPermaLink="false">https://time.com/?p=7296709</guid>

					<description><![CDATA[Statista and TIME have joined forces to identify the World&#8217;s Most Sustainable Companies of 2025, aiming to highlight corporate responsibility and promote sustainable practices. In an era marked by significant environmental challenges and social inequalities, it is crucial to recognize and reward companies prioritizing sustainability. By featuring these leading entities, the ranking sets a benchmark&#8230;]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7296709"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module video-2" data-src="https://time.com/7296709/worlds-most-sustainable-companies-2025-methodology/" data-widget-id="SB_4" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/Most-Sustainable-Companies-2025.jpg" alt=""/>



<p><a href="https://r.statista.com/en/"  target="_blank">Statista</a> and TIME have joined forces to identify the <a href="https://time.com/collection/worlds-most-sustainable-companies-2025/" >World&rsquo;s Most Sustainable Companies of 2025</a>, aiming to highlight corporate responsibility and promote sustainable practices. In an era marked by significant environmental challenges and social inequalities, it is crucial to recognize and reward companies prioritizing sustainability. By featuring these leading entities, the ranking sets a benchmark for other businesses, fostering transparency and accountability and encouraging the integration of sustainability into core corporate strategies.</p>



<h2 class="wp-block-heading">Methodology</h2>

[time-brightcove not-tgx=&#8221;true&#8221;]



<p>The ranking process began with a comprehensive selection from over 5,000 of the world&#8217;s largest and most influential companies, considering factors such as revenue, market capitalization, and public prominence. The process involved a rigorous 4-step methodology to identify the top 500 companies, evaluated on more than 20 key data points.</p>



<p><strong>Exclusion of Non-Sustainable Businesses:</strong> The first step excluded companies involved in non-sustainable industries like fossil fuels or deforestation. Additionally, companies appearing on negative lists related to sustainability issues, such as those identified as carbon majors or associated with environmental catastrophes, were automatically disqualified. These include: Forest 500 Report (based on 2023 data), Carbon Majors (based on 2023 data), PERI Top 100 Polluter Indexes: Air, Water, Greenhouse, Toxic Greenhouse, Suppliers, Coal (based on 2022 data.)</p>



<p>This step also considered significant scandals or controversies related to sustainability.</p>



<p><strong>Commitment &amp; Ratings:</strong> The second step involved assessing companies based on external sustainability ratings and commitments from reputable organizations. Key criteria included CDP ratings, adherence to the UN Global Compact, alignment with the Science Based Targets initiative (near-term and long-term), inclusion in the S&amp;P Global Sustainability Yearbook, participation in the UNFCCC Race to Zero campaign, and MSCI ESG &amp; SRI evaluations.</p>



<p><strong>Reporting &amp; Transparency:</strong> The third step evaluated the availability and quality of sustainability reports. This included verifying whether companies published an ESG report for 2023, ensuring these reports had undergone external assurance, and assessing compliance with international reporting standards such as GRI, SASB, and TCFD (now part of the IFRS/ISSB standards).</p>



<p><strong>Environmental &amp; Social Stewardship:</strong> The final step involved researching various environmental and social Key Performance Indicators (KPIs) from companies&#8217; Corporate Social Responsibility (CSR) reports. Environmental metrics included emission intensity, emission intensity reduction, energy intensity, renewable energy ratio, waste intensity and the proportion of recycled waste.</p>



<p>Social metrics covered aspects like gender diversity on the board of directors and in leadership, gender pay gap, work safety, and employee turnover.</p>



<p>An overall sustainability score was calculated, with a maximum achievable score of 100. The top 500 companies with the highest scores were awarded the title of World&rsquo;s Most Sustainable Companies 2025. These companies are spread across more than 30 countries, with the United States, Japan, and France hosting the highest numbers.</p>



<p><strong><a href="https://time.com/collection/worlds-most-sustainable-companies-2025/" >See the full list here.</a></strong></p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7296709/worlds-most-sustainable-companies-2025-methodology/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7296709</post-id>	</item>
		<item>
		<title>Shaky Israel-Iran Cease-Fire Appears to Hold After Trump Publicly Rebukes Both Countries</title>
		<link>https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/</link>
					<comments>https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/#respond</comments>
		
		<dc:creator><![CDATA[Callum Sutherland]]></dc:creator>
		<pubDate>Tue, 24 Jun 2025 11:23:26 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[News Desk]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297123</guid>

					<description><![CDATA["We have two countries that have been fighting for so long, they don't know what the f-ck they're doing," Trump said.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297123"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2219823149.jpg" alt="President Trump Holds Bill-Signing Ceremony At The White House"/>



<div class="brief-podcast-player"><h3 class="podcast-title">The Brief June 24, 2025</h3><h4>Updates on Iran, Trump, immigration, and more</h4><p>Podcast ID &#8211; Short Length: <code>b55c1aa3-900c-4a9f-8d1a-dfe63efccd9c</code></p><p>Podcast ID &#8211; Long Length: <code>a9194dab-f0b9-461b-b3c2-df9a06f21fc2</code></p></div>



<p>President Donald <a href="https://truthsocial.com/@realDonaldTrump/posts/114739003459183372"  target="_blank">Trump has said</a> it was his &#8220;great honor to destroy all [Iranian] nuclear facilities and capability&#8221; and &#8220;stop the war&#8221; between Israel and Iran. He also said that both countries &#8220;wanted to stop the war equally.&#8221; His statement, shared via social media, came hours after he publicly intervened as the shaky cease-fire threatened to break down entirely when Israel accused Iran of violating the preliminary terms of the deal and vowed retaliation. Iran denied firing further missiles.<br><br>Trump issued a stern, public warning to Israel early Tuesday morning, instructing the country not to bomb Iran as the cease-fire he announced just hours before <a href="https://time.com/7297098/israel-iran-ceasefire-broken-missile-strikes-tehran/" >hung in the balance.</a> </p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>&#8220;ISRAEL. DO NOT DROP THOSE BOMBS. IF YOU DO IT IS A MAJOR VIOLATION. BRING YOUR PILOTS HOME,&#8221; <a href="https://truthsocial.com/@realDonaldTrump/posts/114737953503348541"  target="_blank">Trump posted</a> on his social media platform, Truth Social.</p>



<p>Trump, who has since travelled to The Hague in the Netherlands to attend a NATO Summit, further aired his frustrations when talking to reporters outside the White House. He claimed both countries had violated the cease-fire, and said he didn&#8217;t like the fact that &#8220;Israel unloaded right after we made the deal.&#8221;</p>



<p>Taking aim at Israel and Iran, Trump said: &#8220;We have two countries that have been fighting for so long and so hard, that they don&#8217;t know what the f-ck they&#8217;re doing.&#8221;</p>



<p>In a follow-up post online, <a href="https://truthsocial.com/@realDonaldTrump/posts/114738104789842114"  target="_blank">Trump announced a reprieve in the tensions</a>, saying: &#8220;Israel is not going to attack Iran. All planes will turn around and head home, while doing a friendly &#8216;plane wave&#8217; to Iran. Nobody will be hurt, the cease-fire is in effect.&#8221;</p>



<p>Doubling down on his previous statements, whereby he said that <a href="https://time.com/7296469/u-s-strikes-iran-nuclear-trump-war/" >U.S. strikes had &#8220;obliterated&#8221;</a> three key Iranian nuclear sites over the weekend, Trump added: &#8220;Iran will never rebuild their nuclear facilities!&#8221;</p>



<p>Trump and Israeli Prime Minister Benjamin Netanyahu shared a call early Tuesday. Upon confirming a conversation had taken place, <a href="https://www.gov.il/en/pages/pmo-statement-24-jun-2025"  target="_blank">Netanyahu&rsquo;s office said</a> that Israeli forces had destroyed a radar installation near Tehran in response to Iranian missile launches. They announced an intention to stand down from further military action.</p>



<p>&ldquo;Pursuant to the conversation between President Trump and Prime Minister Netanyahu, Israel has refrained from additional attacks,&rdquo; the office confirmed.</p>



<p><strong>Read More</strong>: <em><a href="https://time.com/7296861/strait-of-hormuz-function-iran-closure-threat-impact-trade/" >What Is the Strait of Hormuz and What Impact Could It Have on International Trade If Iran Closes It?</a></em></p>



<p>Prior to this, Israel&#8217;s Defense Minister Israel Katz maintained that a violation had taken place, and said he had instructed the Israel Defense Forces to &#8220;respond forcefully.&#8221;</p>



<p>&#8220;I have instructed the IDF, in coordination with the Prime Minister, to respond forcefully to the violation of the cease-fire by Iran through intense strikes against regime targets in the heart of Tehran,&#8221; <a href="https://x.com/Israel_katz/status/1937446603880906753"  target="_blank">he said</a>. &#8220;The Iranian regime has severely violated the cease-fire declared by the President of the United States and launched missiles toward Israel, and in accordance with the government&#8217;s policy as determined&mdash;we will respond forcefully to any violation.&#8221;</p>



<p>Amid the back-and-forth discourse, Iranian state media claimed that the cease-fire had been &#8220;imposed&#8221; due to Iran&rsquo;s &ldquo;steadfast defense and crushing retaliatory strikes against the Israeli regime&rdquo; that &ldquo;forced the enemy to feel remorse, confess defeat and, approve the unilateral cessation of the onslaught against Iran.&rdquo; </p>



<p>As tensions simmered down, <a href="https://www.bbc.co.uk/news/live/cn7ze4vmk2pt?post=asset%3Aec6ed1e7-4ca7-4b63-9812-0b6af5c55534#post"  target="_blank">Trump told reporters</a> on Air Force One that he does not want to push through a regime change in Iran, after all, seemingly backtracking after he shared his keenness to &#8220;Make Iran Great Again&#8221;<a href="https://truthsocial.com/@realDonaldTrump/posts/114729009239087163"  target="_blank"> in a social media post</a> on Sunday.</p>



<p>&ldquo;I&#8217;d like to see everything calm down as quickly as possible&hellip; Regime change takes chaos, and ideally we don&#8217;t want to see so much chaos,&rdquo; Trump said.</p>



<p>The cease-fire was announced late Monday, after Iran had launched missiles at <a href="https://time.com/7296830/iran-qatar-air-base-trump/" >U.S. military targets at the Al Udeid airbase</a> in Qatar. The strikes were intercepted by the U.S., and no casualties were reported. The military action was retaliatory, a direct response to the U.S. strikes on nuclear facilities over the weekend, which marked a significant turn in the conflict with the U.S. becoming an active participant in the Israel-Iran combat.</p>



<p>The conflict&mdash;which started when Israel targeted nuclear and military sites on June 13, amid growing concerns over Iran&#8217;s nuclear capabilities&mdash;has resulted in significant losses on both sides. <a href="https://www.gov.il/en/pages/operation-rising-lion-update"  target="_blank">Israel has reported</a> 24 deaths and over 1,361 injuries. The Human Rights Activists News Agency <a href="https://www.en-hrana.org/the-eleventh-day-of-israeli-strikes-key-developments/"  target="_blank">has reported</a> 974 deaths and 3,458 injuries in Iran. Trump had been vocal in his encouragement of a cease-fire to end the &#8220;death and destruction.&#8221;</p>



<p><strong>Read More</strong>: <em><a href="https://time.com/7296872/iranians-beaten-imprisoned-regime-condemn-foreign-interference/" >Even Iranians Beaten and Imprisoned by an Unforgiving Regime Condemn Foreign Interference. Here&rsquo;s Why</a></em></p>



<p>Meanwhile, after the threat of cease-fire violations abated, Trump returned to social media on Tuesday to share a <a href="https://truthsocial.com/@realDonaldTrump/posts/114738606142462442"  target="_blank">message</a> sent to him by NATO Secretary General Mark Rutte, who praised the U.S. for its intervention in the Middle East.</p>



<p>&ldquo;Congratulations and thank you for your decisive action in Iran, that was truly extraordinary, and something no one else dared to do. It makes us all safe,&#8221; Rutte said. &ldquo;You are flying into another big success in The Hague this evening. It was not easy but we&rsquo;ve got them all signed onto 5%!&rdquo;</p>



<p>The 5% GDP defense spending target is expected to be announced by all NATO members at the summit. The United Kingdom <a href="https://www.bbc.co.uk/news/articles/c07dk90d94vo"  target="_blank">has already confirmed</a> its commitment to reach the spending target by 2035.</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297123</post-id>	</item>
	</channel>
</rss>
