<?xml version="1.0" encoding="UTF-8"?><rss version="2.0"
	xmlns:content="http://purl.org/rss/1.0/modules/content/"
	xmlns:wfw="http://wellformedweb.org/CommentAPI/"
	xmlns:dc="http://purl.org/dc/elements/1.1/"
	xmlns:atom="http://www.w3.org/2005/Atom"
	xmlns:sy="http://purl.org/rss/1.0/modules/syndication/"
	xmlns:slash="http://purl.org/rss/1.0/modules/slash/"
	
	xmlns:georss="http://www.georss.org/georss"
	xmlns:geo="http://www.w3.org/2003/01/geo/wgs84_pos#"
	>

<channel>
	<title>World &#8211; TIME</title>
	<atom:link href="https://time.com/world/feed/" rel="self" type="application/rss+xml" />
	<link>https://time.com</link>
	<description>Current &#38; Breaking News &#124; National &#38; World Updates</description>
	<lastBuildDate>Mon, 30 Jun 2025 22:02:02 +0000</lastBuildDate>
	<language>en-US</language>
	<sy:updatePeriod>
	hourly	</sy:updatePeriod>
	<sy:updateFrequency>
	1	</sy:updateFrequency>
	<generator>https://wordpress.org/?v=6.4.5</generator>
<site xmlns="com-wordpress:feed-additions:1">228315549</site>	<item>
		<title>من هشت سال گروگان ایران بودم. آیا دوستانم از بمباران اسرائیل جان سالم به در بردند؟</title>
		<link>https://time.com/7298723/iran-evin-prison-israeli-airstrike-farsi-essay/</link>
					<comments>https://time.com/7298723/iran-evin-prison-israeli-airstrike-farsi-essay/#respond</comments>
		
		<dc:creator><![CDATA[Siamak Namazi]]></dc:creator>
		<pubDate>Mon, 30 Jun 2025 17:08:30 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[world affairs]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298723</guid>

					<description><![CDATA[سیا‌مک نمازی می‌نویسد: حمله هوایی اسرائیل میان بازپُرسان بی‌رحم و زندانیان سیاسی فرقی نگذاشت]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298723"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298723/iran-evin-prison-israeli-airstrike-farsi-essay/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/iran-prison-bomb-01.jpg" alt=""/>



<p class="has-text-align-center"><em><a href="https://time.com/7297385/evin-prison-israeli-airstrike-bombing-iran-islamic-republic-innocent-deaths/" >Read this story in English here</a></em></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1606;&#1605;&#1575;&#1586;&#1740; &#1711;&#1585;&#1608;&#1711;&#1575;&#1606; &#1587;&#1575;&#1576;&#1602; &#1570;&#1605;&#1585;&#1740;&#1705;&#1575;&#1740;&#1740; &#1583;&#1585; &#1575;&#1740;&#1585;&#1575;&#1606; &#1575;&#1587;&#1578; &#1608; &#1575;&#1705;&#1606;&#1608;&#1606; &#1593;&#1590;&#1608; &#1607;&#1740;&#1574;&#1578; &#1605;&#1588;&#1575;&#1608;&#1585;&#1575;&#1606; &#1575;&#1576;&#1578;&#1705;&#1575;&#1585; &#1570;&#1586;&#1575;&#1583;&#1740; &#1576;&#1585;&#1575;&#1740; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1587;&#1740;&#1575;&#1587;&#1740; &#1583;&#1585; &#1605;&#1572;&#1587;&#1587;&#1607; &#1605;&#1705;&zwnj;&#1705;&#1740;&#1606; &#1608; &#1711;&#1585;&#1608;&#1607; <a href="https://hostageaid.org/"  target="_blank">&#1705;&#1605;&#1705; &#1580;&#1607;&#1575;&#1606;&#1740; &#1576;&#1607; &#1711;&#1585;&#1608;&#1711;&#1575;&#1606;&zwnj;&#1607;&#1575;</a> &#1575;&#1587;&#1578;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1608;&#1602;&#1578;&#1740; &#1578;&#1589;&#1575;&#1608;&#1740;&#1585; &#1583;&#1585;&#1608;&#1575;&#1586;&#1607;&zwnj;&#1740; &#1608;&#1585;&#1608;&#1583;&#1740; <a href="https://x.com/JasonMBrodsky/status/1937096800231367099"  target="_blank">&#1586;&#1606;&#1583;&#1575;&#1606; &#1575;&#1608;&#1740;&#1606;</a> &#1585;&#1575; &#1583;&#1740;&#1583;&#1605; &#1705;&#1607; &#1576;&#1575; &#1581;&#1605;&#1604;&#1607;&zwnj;&#1740; &#1607;&#1608;&#1575;&#1740;&#1740; &#1575;&#1587;&#1585;&#1575;&#1574;&#1740;&#1604; &#1578;&#1705;&#1607; &#1578;&#1705;&#1607; &#1588;&#1583;&#1607; &#1576;&#1608;&#1583;&#1548; &#1670;&#1588;&#1605;&#1575;&#1606;&#1605; &#1662;&#1585; &#1575;&#1586; &#1575;&#1588;&#1705; &#1588;&#1583;. &#1605;&#1606; &#1607;&#1588;&#1578; &#1587;&#1575;&#1604; &#1662;&#1588;&#1578; &#1570;&#1606; &#1583;&#1585;&#1608;&#1575;&#1586;&#1607; &#1576;&#1607;&zwnj;&#1593;&#1606;&#1608;&#1575;&#1606; &#1711;&#1585;&#1608;&#1711;&#1575;&#1606; <a href="https://time.com/6315728/iran-president-mahsa-amini-prisoner-swap/" >&#1580;&#1605;&#1607;&#1608;&#1585;&#1740; &#1575;&#1587;&#1604;&#1575;&#1605;&#1740;</a> &#1606;&#1711;&#1607;&#1583;&#1575;&#1585;&#1740; &#1588;&#1583;&#1605; &mdash; &#1583;&#1585; &#1605;&#1705;&#1575;&#1606;&#1740; &#1705;&#1607; &#1592;&#1604;&#1605;&#1548; &#1602;&#1575;&#1606;&#1608;&#1606; &#1575;&#1587;&#1578; &#1608; &#1575;&#1605;&#1740;&#1583; &#1602;&#1575;&#1670;&#1575;&#1602; &#1605;&#1740;&zwnj;&#1588;&#1608;&#1583;.</bdo></p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1575;&#1605;&#1575; &#1575;&#1588;&#1705;&zwnj;&#1607;&#1575;&#1740;&#1605; &#1575;&#1586; &#1582;&#1608;&#1588;&#1581;&#1575;&#1604;&#1740; &#1606;&#1576;&#1608;&#1583;. &#1575;&#1586; &#1575;&#1740;&#1606;&zwnj;&#1705;&#1607; &#1705;&#1587;&#1575;&#1606;&#1740; &#1705;&#1607; &#1605;&#1606; &#1608; &#1576;&#1593;&#1583;&#1578;&#1585; <a href="https://time.com/6315295/us-iran-prisoner-swap/" >&#1662;&#1583;&#1585;</a> &#1576;&#1740;&#1605;&#1575;&#1585;&#1605; &#1585;&#1575; &#1576;&#1607; &#1587;&#1604;&#1608;&#1604; &#1575;&#1606;&#1601;&#1585;&#1575;&#1583;&#1740; &#1575;&#1606;&#1583;&#1575;&#1582;&#1578;&#1606;&#1583; &#1576;&#1575;&#1604;&#1575;&#1582;&#1585;&#1607; &#1578;&#1575;&#1608;&#1575;&#1606;&#1740; &#1662;&#1587; &#1583;&#1575;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583;&#1548; &#1604;&#1584;&#1578;&#1740; &#1606;&#1605;&#1740;&zwnj;&#1576;&#1585;&#1583;&#1605;. &#1602;&#1576;&#1604;&#1605; &#1662;&#1585; &#1575;&#1586; &#1575;&#1606;&#1583;&#1608;&#1607; &#1576;&#1608;&#1583; &#1608;&#1602;&#1578;&#1740; &#1576;&#1607; &#1608;&#1581;&#1588;&#1578;&#1740; &#1601;&#1705;&#1585; &#1605;&#1740;&zwnj;&#1705;&#1585;&#1583;&#1605; &#1705;&#1607; &#1575;&#1705;&#1606;&#1608;&#1606; &#1576;&#1587;&#1740;&#1575;&#1585;&#1740; &#1575;&#1586; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1576;&#1740;&zwnj;&#1711;&#1606;&#1575;&#1607; &mdash; &#1575;&#1586; &#1580;&#1605;&#1604;&#1607; &#1705;&#1587;&#1575;&#1606;&#1740; &#1705;&#1607; &#1587;&#1575;&#1604;&zwnj;&#1607;&#1575; &#1607;&#1605;&zwnj;&#1587;&#1604;&#1608;&#1604;&#1740;&zwnj;&#1575;&#1605; &#1576;&#1608;&#1583;&#1606;&#1583; &mdash; &#1608; &#1582;&#1575;&#1606;&#1608;&#1575;&#1583;&#1607;&zwnj;&#1607;&#1575;&#1740;&#1588;&#1575;&#1606; &#1578;&#1580;&#1585;&#1576;&#1607; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1606;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1575;&#1740;&#1606; &#1601;&#1602;&#1591; &#1740;&#1705; &#1581;&#1605;&#1604;&#1607; &#1576;&#1607; &#1606;&#1605;&#1575;&#1583; &#1587;&#1585;&#1705;&#1608;&#1576; &#1606;&#1576;&#1608;&#1583;. &#1575;&#1587;&#1585;&#1575;&#1574;&#1740;&#1604; &#1578;&#1606;&#1607;&#1575; &#1583;&#1585;&#1616; &#1586;&#1606;&#1583;&#1575;&#1606; &#1585;&#1575; &#1605;&#1606;&#1601;&#1580;&#1585; &#1606;&#1705;&#1585;&#1583;. &#1576;&#1605;&#1576;&zwnj;&#1607;&#1575;&#1740;&#1588;&#1548; &#1583;&#1585; &#1587;&#1575;&#1593;&#1575;&#1578; &#1705;&#1575;&#1585;&#1740;&#1548; &#1605;&#1580;&#1578;&#1605;&#1593; &#1602;&#1590;&#1575;&#1740;&#1740; &#1588;&#1607;&#1740;&#1583; &#1605;&#1602;&#1583;&#1587; &#1585;&#1575; &#1606;&#1740;&#1586; &#1576;&#1607; &#1588;&#1583;&#1578; &#1578;&#1582;&#1585;&#1740;&#1576; &#1705;&#1585;&#1583;. &#1580;&#1575;&#1740;&#1740; &#1705;&#1607; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1585;&#1575; &#1662;&#1740;&#1588; &#1576;&#1575;&#1586;&#1662;&#1585;&#1587;&#1575;&#1606; &#1576;&#1740;&zwnj;&#1585;&#1581;&#1605; &#1605;&#1740;&zwnj;&#1576;&#1585;&#1606;&#1583; &#1608; &#1608;&#1575;&#1585;&#1583; &#1605;&#1575;&#1588;&#1740;&#1606; &#1587;&#1585;&#1705;&#1608;&#1576; &#1583;&#1575;&#1583;&#1711;&#1575;&#1607; &#1575;&#1606;&#1602;&#1604;&#1575;&#1576; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1606;&#1583;. &#1605;&#1606; &#1583;&#1585; &#1570;&#1606; &#1575;&#1578;&#1575;&#1602;&zwnj;&#1607;&#1575; &#1576;&#1608;&#1583;&#1607;&zwnj;&#1575;&#1605;&#1548; &#1583;&#1587;&#1578;&zwnj;&#1576;&#1606;&#1583; &#1582;&#1608;&#1585;&#1583;&#1607; &#1608; &#1578;&#1581;&#1602;&#1740;&#1585; &#1588;&#1583;&#1607;&#1548; &#1605;&#1602;&#1575;&#1576;&#1604; &#1605;&#1585;&#1583;&#1575;&#1606;&#1740; &#1705;&#1607; &#1582;&#1608;&#1583; &#1585;&#1575; &#1602;&#1575;&#1590;&#1740; &#1605;&#1740;&zwnj;&#1606;&#1575;&#1605;&#1740;&#1583;&#1606;&#1583; &#1575;&#1605;&#1575; &#1605;&#1575;&#1606;&#1606;&#1583; &#1586;&#1740;&#1585;&#1583;&#1587;&#1578;&#1575;&#1606; &#1605;&#1571;&#1605;&#1608;&#1585;&#1575;&#1606; &#1575;&#1591;&#1604;&#1575;&#1593;&#1575;&#1578; &#1585;&#1601;&#1578;&#1575;&#1585; &#1605;&#1740;&zwnj;&#1705;&#1585;&#1583;&#1606;&#1583; &#1608; &#1607;&#1585; &#1581;&#1705;&#1605;&#1740; &#1705;&#1607; &#1570;&#1606;&#1607;&#1575; &#1605;&#1740;&zwnj;&#1583;&#1575;&#1583;&#1606;&#1583; &#1585;&#1575; &#1575;&#1605;&#1590;&#1575; &#1605;&#1740;&zwnj;&#1705;&#1585;&#1583;&#1606;&#1583;. &#1740;&#1705;&#1740;&zwnj;&#1588;&#1575;&#1606; &#1585;&#1575; &#1583;&#1585; &#1582;&#1601;&#1575; &#8220;&#1580;&#1606;&#1575;&#1740;&#1578;&zwnj;&#1705;&#1575;&#1585;&#8221; &#1589;&#1583;&#1575; &#1605;&#1740;&zwnj;&#1586;&#1583;&#1605;&#1548; &#1604;&#1602;&#1576;&#1740; &#1705;&#1607; &#1576;&#1575;&#1586;&#1740; &#1576;&#1575; &#1606;&#1575;&#1605;&#1588; &#1576;&#1608;&#1583; &#1608; &#1576;&#1740;&#1606; &#1605;&#1575; &#1605;&#1575;&#1606;&#1583;&#1711;&#1575;&#1585; &#1588;&#1583;. &#1740;&#1575;&#1583;&#1605; &#1607;&#1587;&#1578; &#1608;&#1602;&#1578;&#1740; &#1583;&#1585; &#1576;&#1740;&zwnj;&#1582;&#1576;&#1585;&#1740; &#1705;&#1575;&#1605;&#1604; &#1608; &#1602;&#1591;&#1593; &#1575;&#1586; &#1583;&#1606;&#1740;&#1575;&#1740; &#1576;&#1740;&#1585;&#1608;&#1606; &#1576;&#1607; &#1587;&#1585; &#1605;&#1740;&zwnj;&#1576;&#1585;&#1583;&#1605; &#1576;&#1575; &#1662;&#1608;&#1586;&#1582;&#1606;&#1583;&#1740; &#1711;&#1601;&#1578;: &laquo;&#1605;&#1575;&#1583;&#1585;&#1578; &#1591;&#1576;&#1602;&#1607;&zwnj;&#1740; &#1662;&#1575;&#1740;&#1740;&#1606; &#1605;&#1606;&#1578;&#1592;&#1585;&#1607;. &#1607;&#1585; &#1585;&#1608;&#1586; &#1605;&#1740;&#1575;&#1583; &#1608; &#1575;&#1604;&#1578;&#1605;&#1575;&#1587; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1607; &#1576;&#1585;&#1575;&#1740; &#1605;&#1604;&#1575;&#1602;&#1575;&#1578;&raquo;&#1563; &#1662;&#1608;&#1586;&#1582;&#1606;&#1583;&#1740; &#1705;&#1607; &#1583;&#1604;&#1605; &#1605;&#1740;&zwnj;&#1582;&#1608;&#1575;&#1587;&#1578; &#1576;&#1575; &#1587;&#1740;&#1604;&#1740; &#1575;&#1586; &#1589;&#1608;&#1585;&#1578;&#1588; &#1662;&#1575;&#1705; &#1705;&#1606;&#1605;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1575;&#1605;&#1575; &#1570;&#1606; &#1605;&#1585;&#1705;&#1586; &#1576;&#1740;&zwnj;&#1593;&#1583;&#1575;&#1604;&#1578;&#1740; &#1601;&#1602;&#1591; &#1662;&#1585; &#1575;&#1586; &#1580;&#1604;&#1575;&#1583; &#1606;&#1576;&#1608;&#1583;. &#1576;&#1605;&#1576;&zwnj;&#1607;&#1575; &#1576;&#1740;&#1606; &#1576;&#1575;&#1586;&#1662;&#1585;&#1587;&#1575;&#1606; &#1592;&#1575;&#1604;&#1605; &#1608; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1587;&#1740;&#1575;&#1587;&#1740;&#1548; &#1608; &#1740;&#1575; &#1587;&#1585;&#1576;&#1575;&#1586;&#1575;&#1606; &#1608;&#1592;&#1740;&#1601;&#1607; &#1777;&#1784; &#1578;&#1575; &#1778;&#1776; &#1587;&#1575;&#1604;&#1607; &#1705;&#1607; &#1589;&#1585;&#1601;&#1575;&#1611; &#1605;&#1571;&#1605;&#1608;&#1585; &#1607;&#1605;&#1585;&#1575;&#1607;&#1740; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1607;&#1587;&#1578;&#1606;&#1583; &#1601;&#1585;&#1602; &#1606;&#1605;&#1740;&zwnj;&#1711;&#1584;&#1575;&#1585;&#1606;&#1583;. &#1570;&#1740;&#1575; &#1608;&#1705;&#1604;&#1575;&#1740; &#1581;&#1602;&#1608;&#1602; &#1576;&#1588;&#1585;&#1740; &#1705;&#1607; &#1576;&#1575; &#1588;&#1580;&#1575;&#1593;&#1578; &#1575;&#1586; &#1576;&#1740;&zwnj;&#1583;&#1601;&#1575;&#1593;&zwnj;&#1607;&#1575; &#1583;&#1601;&#1575;&#1593; &#1605;&#1740;&zwnj;&#1705;&#1585;&#1583;&#1606;&#1583; &#1607;&#1605; &#1583;&#1585; &#1605;&#1740;&#1575;&#1606; &#1602;&#1585;&#1576;&#1575;&#1606;&#1740;&#1575;&#1606; &#1576;&#1608;&#1583;&#1606;&#1583;&#1567; &#1670;&#1606;&#1583; &#1606;&#1601;&#1585; &#1575;&#1586; &#1606;&#1592;&#1575;&#1601;&#1578;&zwnj;&#1670;&#1740;&zwnj;&#1607;&#1575; &#1608; &#1705;&#1575;&#1585;&#1605;&#1606;&#1583;&#1575;&#1606; &#1575;&#1583;&#1575;&#1585;&#1740; &#1705;&#1607; &#1575;&#1586; &#1581;&#1608;&#1605;&#1607;&zwnj;&#1740; &#1583;&#1608;&#1585; &#1608; &#1601;&#1602;&#1740;&#1585; &#1578;&#1607;&#1585;&#1575;&#1606; &#1576;&#1585;&#1575;&#1740; &#1705;&#1575;&#1585; &#1605;&#1740;&zwnj;&#1570;&#1605;&#1583;&#1606;&#1583; &#1581;&#1575;&#1604;&#1575; &#1705;&#1588;&#1578;&#1607; &#1740;&#1575; &#1605;&#1580;&#1585;&#1608;&#1581; &#1588;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583;&#1567; &#1582;&#1575;&#1606;&#1608;&#1575;&#1583;&#1607;&zwnj;&#1607;&#1575;&#1740;&#1740; &#1705;&#1607; &#1583;&#1585; &#1587;&#1575;&#1604;&#1606; &#1575;&#1606;&#1578;&#1592;&#1575;&#1585; &#1576;&#1608;&#1583;&#1606;&#1583;&#1548; &#1605;&#1579;&#1604; &#1586;&#1605;&#1575;&#1606;&#1740; &#1705;&#1607; &#1605;&#1575;&#1583;&#1585;&#1605; &#1607;&#1585; &#1585;&#1608;&#1586; &#1605;&#1740;&zwnj;&#1570;&#1605;&#1583; &#1578;&#1575; &#1583;&#1585;&#1582;&#1608;&#1575;&#1587;&#1578; &#1605;&#1604;&#1575;&#1602;&#1575;&#1578; &#1740;&#1575; &#1583;&#1575;&#1585;&#1608; &#1705;&#1606;&#1583;&#1548; &#1670;&#1607; &#1587;&#1585;&#1606;&#1608;&#1588;&#1578;&#1740; &#1662;&#1740;&#1583;&#1575; &#1705;&#1585;&#1583;&#1606;&#1583;&#1567;</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1576;&#1605;&#1576;&zwnj;&#1607;&#1575;&#1740; &#1575;&#1587;&#1585;&#1575;&#1574;&#1740;&#1604; &#1583;&#1585;&#1605;&#1575;&#1606;&#1711;&#1575;&#1607; &#1586;&#1606;&#1583;&#1575;&#1606; &#1585;&#1575; &#1607;&#1605; &#1586;&#1583;&#1606;&#1583;&#1563; &#1580;&#1575;&#1740;&#1740; &#1705;&#1607; &#1605;&#1606; &#1608; &#1576;&#1587;&#1740;&#1575;&#1585;&#1740; &#1583;&#1740;&#1711;&#1585; &#1576;&#1575;&#1585;&#1607;&#1575; &#1576;&#1585;&#1575;&#1740; &#1608;&#1740;&#1586;&#1740;&#1578; &#1576;&#1607; &#1589;&#1601; &#1605;&#1740;&zwnj;&#1588;&#1583;&#1740;&#1605;. &#1580;&#1575;&#1574;&#1740; &#1705;&#1607; &#1662;&#1585; &#1575;&#1586; &#1606;&#1575;&#1575;&#1605;&#1740;&#1583;&#1740; &#1576;&#1608;&#1583;&#1548; &#1575;&#1605;&#1575; &#1588;&#1580;&#1575;&#1593;&#1578;&zwnj;&#1607;&#1575;&#1740; &#1662;&#1606;&#1607;&#1575;&#1606;&#1740; &#1607;&#1605; &#1608;&#1580;&#1608;&#1583; &#1583;&#1575;&#1588;&#1578;. &#1576;&#1585; &#1587;&#1585; &#1570;&#1606; &#1583;&#1705;&#1578;&#1585; &#1586;&#1606; &#1580;&#1608;&#1575;&#1606; &#1705;&#1607; &#1605;&#1606; &laquo;&#1602;&#1607;&#1585;&#1605;&#1575;&#1606;&raquo; &#1582;&#1591;&#1575;&#1576;&#1588; &#1605;&#1740;&zwnj;&#1705;&#1585;&#1583;&#1605; &#1670;&#1607; &#1570;&#1605;&#1583;&#1567; &#1575;&#1608; &#1740;&#1705; &#1576;&#1575;&#1585; &#1583;&#1585; &#1583;&#1608;&#1585;&#1575;&#1606; &#1705;&#1585;&#1608;&#1606;&#1575; &#1576;&#1575; &#1588;&#1580;&#1575;&#1593;&#1578; &#1608;&#1575;&#1585;&#1583; &#1576;&#1606;&#1583; &#1586;&#1606;&#1575;&#1606; &#1588;&#1583; &#1605;&#1587;&#1574;&#1608;&#1604;&#1575;&#1606; &#1586;&#1606;&#1583;&#1575;&#1606; &#1585;&#1575; &#1605;&#1580;&#1576;&#1608;&#1585; &#1705;&#1585;&#1583; &#1705;&#1607; &#1740;&#1705; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740; &#1587;&#1740;&#1575;&#1587;&#1740; &#1585;&#1575; &#1705;&#1607; &#1608;&#1590;&#1593;&#1740;&#1578; &#1608;&#1582;&#1740;&#1605; &#1705;&#1585;&#1608;&#1606;&#1575;&#1740;&#1740; &#1583;&#1575;&#1588;&#1578;&#1548; &#1576;&#1607; &#1576;&#1740;&#1605;&#1575;&#1585;&#1587;&#1578;&#1575;&#1606; &#1605;&#1606;&#1578;&#1602;&#1604; &#1705;&#1606;&#1606;&#1583;. &#1575;&#1608; &#1580;&#1575;&#1606; &#1570;&#1606; &#1586;&#1606; &#1585;&#1575; &#1606;&#1580;&#1575;&#1578; &#1583;&#1575;&#1583;. &#1705;&#1575;&#1585;&#1705;&#1606;&#1575;&#1606; &#1583;&#1585;&#1605;&#1575;&#1606;&#1711;&#1575;&#1607; &#1576;&#1575;&#1585;&#1607;&#1575; &#1576;&#1607; &#1605;&#1575; &#1705;&#1605;&#1705; &#1705;&#1585;&#1583;&#1606;&#1583; &mdash; &#1705;&#1605;&#1705;&zwnj;&#1607;&#1575;&#1740;&#1740; &#1705;&#1607; &#1606;&#1605;&#1740;&zwnj;&#1578;&#1608;&#1575;&#1606;&#1605; &#1593;&#1604;&#1606;&#1740; &#1576;&#1711;&#1608;&#1740;&#1605;. &#1605;&#1607;&#1585;&#1576;&#1575;&#1606;&#1740;&zwnj;&#1607;&#1575;&#1740; &#1576;&#1740;&zwnj;&#1605;&#1606;&#1578; &#1608; &#1576;&#1740;&zwnj;&#1662;&#1575;&#1583;&#1575;&#1588;&zwnj;&#1588;&#1575;&#1606; &#1576;&#1607; &#1605;&#1575; &#1575;&#1605;&#1740;&#1583; &#1575;&#1583;&#1575;&#1605;&#1607; &#1586;&#1606;&#1583;&#1711;&#1740; &#1605;&#1740;&zwnj;&#1583;&#1575;&#1583;. &#1581;&#1575;&#1604;&#1575; &#1570;&#1606; &#1583;&#1585;&#1605;&#1575;&#1606;&#1711;&#1575;&#1607; &#1608;&#1740;&#1585;&#1575;&#1606; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1576;&#1606;&#1583; &#1780;&#1548; &#1705;&#1607; &#1605;&#1581;&#1604; &#1606;&#1711;&#1607;&#1583;&#1575;&#1585;&#1740; &#1576;&#1587;&#1740;&#1575;&#1585;&#1740; &#1575;&#1586; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1587;&#1740;&#1575;&#1587;&#1740; &#1608; &#1711;&#1585;&#1608;&#1711;&#1575;&#1606;&zwnj;&#1607;&#1575;&#1740; &#1583;&#1608;&#1578;&#1575;&#1576;&#1593;&#1740;&#1578;&#1740; &#1740;&#1575; &#1582;&#1575;&#1585;&#1580;&#1740; &#1575;&#1587;&#1578;&#1548; &#1606;&#1740;&#1586; &#1570;&#1587;&#1740;&#1576; &#1583;&#1740;&#1583;&#1607;. &#1575;&#1586; &#1580;&#1605;&#1604;&#1607; &#1705;&#1578;&#1575;&#1576;&#1582;&#1575;&#1606;&#1607;&#1548; &#1578;&#1606;&#1607;&#1575; &#1662;&#1606;&#1575;&#1607;&#1711;&#1575;&#1607; &#1605;&#1575;&#1548; &#1580;&#1575;&#1740;&#1740; &#1705;&#1607; &#1605;&#1606; &#1576;&#1740;&#1588;&#1578;&#1585; &#1585;&#1608;&#1586;&#1607;&#1575; &#1585;&#1575; &#1570;&#1606;&zwnj;&#1580;&#1575; &#1605;&#1740;&zwnj;&#1711;&#1584;&#1585;&#1575;&#1606;&#1583;&#1605;. &#1576;&#1606;&#1583; &#1586;&#1606;&#1575;&#1606; &#1607;&#1605; &#1570;&#1587;&#1740;&#1576; &#1583;&#1740;&#1583;&#1607;. &#1576;&#1604;&#1575;&#1601;&#1575;&#1589;&#1604;&#1607; &#1576;&#1593;&#1583; &#1575;&#1586; &#1581;&#1605;&#1604;&#1607;&#1548; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1587;&#1740;&#1575;&#1587;&#1740; &#1586;&#1606; &#1608; &#1605;&#1585;&#1583; &#1585;&#1575; &#1606;&#1575;&#1711;&#1607;&#1575;&#1606;&#1740; &#1587;&#1608;&#1575;&#1585; &#1575;&#1578;&#1608;&#1576;&#1608;&#1587; &#1705;&#1585;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583; &#1608; &#1576;&#1583;&#1608;&#1606; &#1608;&#1587;&#1575;&#1740;&#1604; &#1588;&#1582;&#1589;&#1740;&zwnj;&#1588;&#1575;&#1606; &#1576;&#1607; &#1605;&#1705;&#1575;&#1606;&#1740; &#1606;&#1575;&#1605;&#1593;&#1604;&#1608;&#1605; &#1605;&#1606;&#1578;&#1602;&#1604; &#1705;&#1585;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583;. &#1582;&#1575;&#1606;&#1608;&#1575;&#1583;&#1607;&zwnj;&#1607;&#1575;&#1740; &#1608;&#1581;&#1588;&#1578;&zwnj;&#1586;&#1583;&#1607; &#1575;&#1705;&#1606;&#1608;&#1606; &#1605;&#1587;&#1578;&#1575;&#1589;&#1604; &#1576;&#1575; &#1740;&#1705;&#1583;&#1740;&#1711;&#1585; &#1578;&#1605;&#1575;&#1587; &#1605;&#1740;&zwnj;&#1711;&#1740;&#1585;&#1606;&#1583;&#1548; &#1583;&#1606;&#1576;&#1575;&#1604; &#1582;&#1576;&#1585;&#1740; &#1575;&#1586; &#1593;&#1586;&#1740;&#1586;&#1575;&#1606;&#1588;&#1575;&#1606; &#1607;&#1587;&#1578;&#1606;&#1583;&#1548; &#1583;&#1593;&#1575; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1606;&#1583; &#1705;&#1607; &#1586;&#1606;&#1583;&#1607; &#1576;&#1575;&#1588;&#1606;&#1583; &#1608; &#1606;&#1592;&#1575;&#1605; &#1587;&#1593;&#1740; &#1606;&#1705;&#1606;&#1583; &#1575;&#1586; &#1570;&#1606;&zwnj;&#1607;&#1575; &#1575;&#1606;&#1578;&#1602;&#1575;&#1605; &#1581;&#1605;&#1604;&#1607; <a href="https://iranhumanrights.org/2025/06/lives-of-prisoners-in-iran-in-immediate-danger/"  target="_blank">&#1575;&#1587;&#1585;&#1575;&#1574;&#1740;&#1604;&#1740;&zwnj;&#1607;&#1575;</a> &#1585;&#1575; &#1576;&#1711;&#1740;&#1585;&#1583;&zwnj;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1586;&#1606;&#1583;&#1575;&#1606; &#1575;&#1608;&#1740;&#1606; &#1588;&#1575;&#1605;&#1604; &#1670;&#1606;&#1583;&#1740;&#1606; &#1576;&#1575;&#1586;&#1583;&#1575;&#1588;&#1578;&#1711;&#1575;&#1607; &#1575;&#1587;&#1578;. &#1576;&#1583;&#1578;&#1585;&#1740;&#1606;&zwnj;&#1588;&#1575;&#1606; &#1586;&#1740;&#1585; &#1606;&#1592;&#1585; &#1608;&#1586;&#1575;&#1585;&#1578; &#1575;&#1591;&#1604;&#1575;&#1593;&#1575;&#1578; &#1608; &#1587;&#1662;&#1575;&#1607; &#1662;&#1575;&#1587;&#1583;&#1575;&#1585;&#1575;&#1606; &#1602;&#1585;&#1575;&#1585; &#1583;&#1575;&#1585;&#1583;. &#1576;&#1606;&#1575; &#1576;&#1607; &#1582;&#1576;&#1585;&#1607;&#1575;&#1740; &#1585;&#1587;&#1740;&#1583;&#1548; &#1570;&#1606;&zwnj;&#1607;&#1575; &#1606;&#1740;&#1586; &#1570;&#1587;&#1740;&#1576; &#1583;&#1740;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583;. &#1605;&#1606; &#1576;&#1740;&#1588; &#1575;&#1586; &#1583;&#1608; &#1587;&#1575;&#1604; &#1583;&#1585; &#1740;&#1705;&#1740; &#1575;&#1586; <a href="https://www.nytimes.com/2022/06/29/opinion/iran-prisoners-detained-americans.html"  target="_blank">&#1607;&#1605;&#1575;&#1606; &#1576;&#1575;&#1586;&#1583;&#1575;&#1588;&#1578;&#1711;&#1575;&#1607;&zwnj;&#1607;&#1575; &#1576;&#1608;&#1583;&#1605;</a>. &#1606;&#1605;&#1740;&zwnj;&#1583;&#1575;&#1606;&#1740;&#1605; &#1570;&#1740;&#1575; &#1576;&#1575;&#1586;&#1580;&#1608;&#1607;&#1575;&#1740;&#1740; &#1705;&#1607; &#1605;&#1606; &#1585;&#1575; &#1705;&#1578;&#1705; &#1605;&#1740;&zwnj;&#1586;&#1583;&#1606;&#1583; &#1570;&#1587;&#1740;&#1576; &#1583;&#1740;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583; &#1740;&#1575; &#1606;&#1607;&#1548; &#1607;&#1605;&#1575;&#1606;&zwnj;&#1591;&#1608;&#1585; &#1705;&#1607; &#1606;&#1605;&#1740;&zwnj;&#1583;&#1575;&#1606;&#1740;&#1605; &#1570;&#1740;&#1575; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1587;&#1740;&#1575;&#1587;&#1740; &#1586;&#1740;&#1585; &#1570;&#1608;&#1575;&#1585; &#1587;&#1604;&#1608;&#1604;&zwnj;&#1607;&#1575;&#1740; &#1575;&#1606;&#1601;&#1585;&#1575;&#1583;&#1740; &#1608; &#1575;&#1578;&#1575;&#1602;&zwnj;&#1607;&#1575;&#1740; &#1588;&#1705;&#1606;&#1580;&#1607; &#1605;&#1583;&#1601;&#1608;&#1606; &#1588;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583; &#1740;&#1575; &#1606;&#1607;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1605;&#1585;&#1705;&#1586; &#1605;&#1604;&#1575;&#1602;&#1575;&#1578; &#1586;&#1606;&#1583;&#1575;&#1606; &#1607;&#1605; &#1570;&#1587;&#1740;&#1576; &#1583;&#1740;&#1583;&#1607;. &#1670;&#1606;&#1583; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1548; &#1582;&#1575;&#1606;&#1608;&#1575;&#1583;&#1607; &#1740;&#1575; &#1608;&#1705;&#1740;&#1604; &#1583;&#1585; &#1570;&#1606;&zwnj;&#1580;&#1575; &#1705;&#1588;&#1578;&#1607; &#1740;&#1575; &#1605;&#1580;&#1585;&#1608;&#1581; &#1588;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583;&#1567; &#1570;&#1606; &#1606;&#1575;&#1592;&#1585; &#1605;&#1607;&#1585;&#1576;&#1575;&#1606;&#1740; &#1705;&#1607; &#1575;&#1580;&#1575;&#1586;&#1607; &#1605;&#1740;&zwnj;&#1583;&#1575;&#1583; &#1605;&#1575;&#1583;&#1585;&#1605; &#1576;&#1740;&#1588;&#1578;&#1585; &#1576;&#1605;&#1575;&#1606;&#1583; &#1608; &#1605;&#1581;&#1583;&#1608;&#1583;&#1740;&#1578; &#1778;&#1776; &#1583;&#1602;&#1740;&#1602;&#1607;&zwnj;&#1575;&#1740; &#1605;&#1604;&#1575;&#1602;&#1575;&#1578;&zwnj;&#1607;&#1575; &#1585;&#1575; &#1606;&#1575;&#1583;&#1740;&#1583;&#1607; &#1605;&#1740;&zwnj;&#1711;&#1585;&#1601;&#1578; &#1608; &#1605;&#1740;&zwnj;&#1711;&#1601;&#1578;: &laquo;&#1575;&#1740;&#1606; &#1578;&#1606;&#1607;&#1575; &#1705;&#1605;&#1705;&#1740;&#1607; &#1705;&#1607; &#1605;&#1740;&zwnj;&#1578;&#1608;&#1606;&#1605; &#1576;&#1607; &#1582;&#1575;&#1606;&#1608;&#1575;&#1583;&#1607; &#1588;&#1605;&#1575; &#1705;&#1607; &#1575;&#1606;&#1602;&#1583;&#1585; &#1592;&#1604;&#1605; &#1583;&#1740;&#1583;&#1607; &#1576;&#1705;&#1606;&#1605;&raquo;&#1548; &#1670;&#1607; &#1587;&#1585;&#1606;&#1608;&#1588;&#1578;&#1740; &#1740;&#1575;&#1601;&#1578;&#1567;</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1575;&#1740;&#1606; &#1740;&#1705; &#1581;&#1605;&#1604;&#1607;&zwnj;&#1740; &#1607;&#1583;&#1601;&#1605;&#1606;&#1583; &#1576;&#1607; &#1601;&#1585;&#1605;&#1575;&#1606;&#1583;&#1607;&#1575;&#1606; &#1606;&#1592;&#1575;&#1605;&#1740; &#1740;&#1575; &#1605;&#1602;&#1575;&#1605;&#1575;&#1578; &#1593;&#1575;&#1604;&#1740;&zwnj;&#1585;&#1578;&#1576;&#1607; &#1585;&#1688;&#1740;&#1605; &#1606;&#1576;&#1608;&#1583;. <a href="https://time.com/7296872/iranians-beaten-imprisoned-regime-condemn-foreign-interference/" >&#1575;&#1740;&#1606; &#1576;&#1605;&#1576;&zwnj;&#1607;&#1575; &#1605;&#1585;&#1583;&#1605; &#1575;&#1740;&#1585;&#1575;&#1606; &#1585;&#1575; &#1578;&#1588;&#1608;&#1740;&#1602;</a> &#1606;&#1605;&#1740;&zwnj;&#1705;&#1606;&#1583; &#1578;&#1575; &#1593;&#1604;&#1740;&#1607; &#1580;&#1605;&#1607;&#1608;&#1585;&#1740; &#1575;&#1587;&#1604;&#1575;&#1605;&#1740; &#1576;&#1585;&#1582;&#1740;&#1586;&#1606;&#1583;. &#1576;&#1585;&#1593;&#1705;&#1587;. &#1740;&#1705;&#1740; &#1575;&#1586; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606; &#1587;&#1575;&#1576;&#1602; &#1605;&#1740;&zwnj;&#1711;&#1608;&#1740;&#1583; &#1582;&#1575;&#1606;&#1608;&#1575;&#1583;&#1607;&zwnj;&#1607;&#1575;&#1740; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740;&#1575;&#1606;&#1548; &#1606;&#1711;&#1607;&#1576;&#1575;&#1606;&#1575;&#1606; &#1608; &#1705;&#1575;&#1585;&#1705;&#1606;&#1575;&#1606; &#1570;&#1606; &#1576;&#1740;&#1585;&#1608;&#1606; &#1586;&#1606;&#1583;&#1575;&#1606; &#1580;&#1605;&#1593; &#1588;&#1583;&#1607;&zwnj;&#1575;&#1606;&#1583; &#1578;&#1575; &#1576;&#1604;&#1705;&#1607; &#1582;&#1576;&#1585;&#1740; &#1575;&#1586; &#1593;&#1586;&#1740;&#1586;&#1588;&#1575;&#1606; &#1576;&#1588;&#1606;&#1608;&#1606;&#1583; &#1608; &#1583;&#1585; &#1705;&#1606;&#1575;&#1585; &#1607;&#1605; &#1583;&#1585; &#1581;&#1575;&#1604; &#1575;&#1588;&#1705; &#1585;&#1740;&#1582;&#1578;&#1606; &#1607;&#1587;&#1578;&#1606;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1576;&#1605;&#1576;&#1575;&#1585;&#1575;&#1606; &#1575;&#1608;&#1740;&#1606; &#1606;&#1588;&#1575;&#1606; &#1605;&#1740;&zwnj;&#1583;&#1607;&#1583; &#1608;&#1602;&#1578;&#1740; &#1583;&#1608; &#1606;&#1592;&#1575;&#1605;  &#1594;&#1740;&#1585;&#1575;&#1582;&#1604;&#1575;&#1602;&#1740;&#1576;&#1575; &#1607;&#1605; &#1576;&#1585;&#1582;&#1608;&#1585;&#1583; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1606;&#1583;&#1548; &#1670;&#1607; &#1575;&#1578;&#1601;&#1575;&#1602;&#1740; &#1605;&#1740;&zwnj;&#1575;&#1601;&#1578;&#1583;: &#1740;&#1705;&#1740; &#1576;&#1740;&zwnj;&#1711;&#1606;&#1575;&#1607;&#1575;&#1606; &#1585;&#1575; &#1586;&#1606;&#1583;&#1575;&#1606;&#1740; &#1605;&#1740;&zwnj;&#1705;&#1606;&#1583;&#1548; &#1608; &#1583;&#1740;&#1711;&#1585;&#1740; &#1576;&#1575; &#1576;&#1605;&#1576;&zwnj;&#1576;&#1575;&#1585;&#1575;&#1606;&#1588;&#1575;&#1606; &#1605;&#1583;&#1593;&#1740; &#1570;&#1586;&#1575;&#1583;&#1740; &#1570;&#1606;&zwnj;&#1607;&#1575; &#1575;&#1587;&#1578;. &#1578;&#1606;&#1607;&#1575; &#1575;&#1605;&#1740;&#1583; &#1605;&#1575; &#1575;&#1740;&#1606; &#1575;&#1587;&#1578; &#1705;&#1607; <a href="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/" >&#1570;&#1578;&#1588;&zwnj;&#1576;&#1587;</a> &#1588;&#1705;&#1606;&#1606;&#1583;&#1607; &#1605;&#1740;&#1575;&#1606; &#1575;&#1740;&#1585;&#1575;&#1606;&#1548; &#1575;&#1587;&#1585;&#1575;&#1574;&#1740;&#1604; &#1608; &#1570;&#1605;&#1585;&#1740;&#1705;&#1575; &#1662;&#1575;&#1576;&#1585;&#1580;&#1575; &#1576;&#1605;&#1575;&#1606;&#1583; &#1608; &#1575;&#1740;&#1606; &#1583;&#1740;&#1608;&#1575;&#1606;&#1711;&#1740; &#1662;&#1575;&#1740;&#1575;&#1606; &#1740;&#1575;&#1576;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1575;&#1605;&#1575; &#1581;&#1578;&#1740; &#1575;&#1711;&#1585; &#1670;&#1606;&#1740;&#1606; &#1588;&#1608;&#1583;&#1548; &#1607;&#1605;&#1607; &#1605;&#1740;&zwnj;&#1583;&#1575;&#1606;&#1740;&#1605; &#1576;&#1593;&#1583;&#1588; &#1670;&#1607; &#1582;&#1608;&#1575;&#1607;&#1583; &#1588;&#1583;. &#1570;&#1740;&#1578;&zwnj;&#1575;&#1604;&#1604;&#1607;&zwnj;&#1607;&#1575; &#1705;&#1607; &#1606;&#1578;&#1608;&#1575;&#1606;&#1587;&#1578;&#1607;&zwnj;&#1575;&#1606;&#1583; &#1580;&#1604;&#1608;&#1740; &#1576;&#1605;&#1576;&zwnj;&#1607;&#1575; &#1585;&#1575; &#1576;&#1711;&#1740;&#1585;&#1606;&#1583;&#1548; &#1582;&#1588;&#1605; &#1582;&#1608;&#1583; &#1585;&#1575; &#1576;&#1607; &#1583;&#1575;&#1582;&#1604; &#1606;&#1588;&#1575;&#1606;&#1607; &#1582;&#1608;&#1575;&#1607;&#1606;&#1583; &#1711;&#1585;&#1601;&#1578;. &#1570;&#1606;&zwnj;&#1607;&#1575; &#1587;&#1593;&#1740; &#1582;&#1608;&#1575;&#1607;&#1606;&#1583; &#1705;&#1585;&#1583; &#1576;&#1575; &#1582;&#1588;&#1608;&#1606;&#1578; &#1602;&#1583;&#1585;&#1578; &#1582;&#1608;&#1583; &#1585;&#1575; &#1576;&#1575;&#1586;&#1711;&#1585;&#1583;&#1575;&#1606;&#1606;&#1583;. &#1607;&#1586;&#1575;&#1585;&#1575;&#1606; &#1606;&#1601;&#1585; &#1583;&#1587;&#1578;&#1711;&#1740;&#1585;&#1548; &#1588;&#1705;&#1606;&#1580;&#1607; &#1608; &#1575;&#1593;&#1583;&#1575;&#1605; &#1582;&#1608;&#1575;&#1607;&#1606;&#1583; &#1588;&#1583; &#1578;&#1575; &#1585;&#1688;&#1740;&#1605; &#1576;&#1575; &#1575;&#1740;&#1580;&#1575;&#1583; &#1578;&#1585;&#1587; &#1586;&#1606;&#1583;&#1607; &#1576;&#1605;&#1575;&#1606;&#1583;. &#1580;&#1608;&#1575;&#1605;&#1593; &#1570;&#1587;&#1740;&#1576;&zwnj;&#1662;&#1584;&#1740;&#1585;&#1578;&#1585; &mdash; &#1605;&#1575;&#1606;&#1606;&#1583; <a href="https://iranpresswatch.org/post/8160/the-little-religion-that-persists-the-bahai-in-israel/"  target="_blank">&#1576;&#1607;&#1575;&#1574;&#1740;&#1575;&#1606;</a> &mdash; &#1575;&#1581;&#1578;&#1605;&#1575;&#1604;&#1575;&#1611; &#1580;&#1586;&#1608; &#1606;&#1582;&#1587;&#1578;&#1740;&#1606; &#1602;&#1585;&#1576;&#1575;&#1606;&#1740;&#1575;&#1606; &#1582;&#1608;&#1575;&#1607;&#1606;&#1583; &#1576;&#1608;&#1583;.</bdo></p>



<p class="has-text-align-right"><bdo lang="fa" dir="rtl">&#1607;&#1605;&#1575;&#1606;&zwnj;&#1591;&#1608;&#1585; &#1705;&#1607; &#1607;&#1605;&#1740;&#1588;&#1607; &#1576;&#1608;&#1583;&#1607;&#1548; &#1576;&#1740;&zwnj;&#1711;&#1606;&#1575;&#1607;&#1575;&#1606; &#1576;&#1740;&#1588;&#1578;&#1585;&#1740;&#1606; &#1578;&#1575;&#1608;&#1575;&#1606; &#1585;&#1575; &#1582;&#1608;&#1575;&#1607;&#1606;&#1583; &#1583;&#1575;&#1583;.</bdo></p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298723/iran-evin-prison-israeli-airstrike-farsi-essay/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298723</post-id>	</item>
		<item>
		<title>The Iran-Israel War Is Over. But the Arab World Is Grappling With Its Consequences</title>
		<link>https://time.com/7298676/iran-israel-conflict-arab-reaction/</link>
					<comments>https://time.com/7298676/iran-israel-conflict-arab-reaction/#respond</comments>
		
		<dc:creator><![CDATA[H.A. Hellyer]]></dc:creator>
		<pubDate>Mon, 30 Jun 2025 16:03:20 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[freelance]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298676</guid>

					<description><![CDATA[The region is relieved about de-escalation. But it is also alarmed about an unrestrained Israel. ]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298676"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298676/iran-israel-conflict-arab-reaction/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2219583326.jpg" alt="Israeli-Airstrikes-in-Tehran"/>



<p>The Iran-Israel ceasefire seems to be holding. Arab capitals are <a href="https://www.washingtonpost.com/world/2025/06/24/israel-iran-ceasefire-qatar-nuclear/"  target="_blank">relieved</a> about the de-escalation. But they are also <a href="https://www.al-monitor.com/originals/2025/06/gulf-countries-fear-israel-iran-spillover"  target="_blank">alarmed</a> about what the latest flare up means for the Middle East. </p>



<p>When Iran signed the JCPOA nuclear deal with the Obama Administration, its reception in the Arab Gulf was, at best, <a href="https://www.aljazeera.com/news/2015/4/14/why-saudi-arabia-and-israel-oppose-iran-nuclear-deal"  target="_blank">frosty</a>. The Iranian regime&rsquo;s role in propping up Bashar al-Assad&rsquo;s rule in Syria&mdash;one of the <a href="https://www.nytimes.com/2025/01/12/world/middleeast/syria-prosecution-assad-regime.html"  target="_blank">most devastating in modern Arab history</a>&mdash;combined with its nefarious influence in Iraq and Lebanon, ensured that Gulf states such as Saudi Arabia, the United Arab Emirates, and Bahrain saw the deal <a href="https://www.reuters.com/article/world/saudi-arabia-calls-iran-nuclear-deal-a-flawed-agreement-idUSKBN1GV2CA/"  target="_blank">not as a diplomatic breakthrough</a>, but as an endorsement of a destabilizing actor.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>So when President Donald Trump withdrew from the JCPOA in 2018, these same states <a href="https://www.aljazeera.com/news/2018/5/9/world-leaders-react-to-us-withdrawal-from-iranian-nuclear-deal"  target="_blank">applauded</a> the move. Others in the region, including Egypt and Jordan, while more muted, also expressed concern about Tehran&rsquo;s regional agenda. Yet fast forward to the present and the very <a href="https://www.washingtonpost.com/world/2025/06/22/iran-strikes-arab-gulf-reaction/"  target="_blank">same</a> states opposed a fight with Iran, and <a href="https://www.middleeasteye.net/news/vindicated-unscathed-war-gulf-states-look-capitalise-israel-and-irans-losses"  target="_blank">support</a> re-engagement.</p>



<p>This U-Turn is not due to any newfound trust in Tehran. The Arab Gulf states, broadly speaking, remain deeply cynical about the Iranian regime. If the Islamic Republic could be replaced with something more pragmatic and less ideologically driven than Khomeini&rsquo;s revolutionary doctrine, few in the Arab Gulf would mourn. But this cynicism has evolved into a pragmatic rejection of war&mdash;especially one at the behest of a belligerent Israel and a complicit Washington.</p>



<p>For these reasons, the <a href="https://www.reuters.com/world/middle-east/world-reacts-israeli-strike-iran-over-nuclear-programme-2025-06-13/"  target="_blank">overwhelming</a> response in Arab capitals has been fierce <a href="https://www.aljazeera.com/news/2025/6/22/everlasting-consequences-world-reacts-to-us-attacks-on-iran"  target="_blank">opposition</a> to Israel&rsquo;s strikes, and America&rsquo;s bombing on June 22.</p>



<p>There are two core reasons for this opposition. First, these strikes are not happening in isolation. Over the past 20 months, Israel has waged a <a href="https://www.ap.org/news-highlights/spotlights/2025/more-than-55000-palestinians-have-been-killed-in-the-israel-hamas-war-gaza-health-officials-say/"  target="_blank">deadly</a> and <a href="https://www.theguardian.com/world/2025/jan/18/a-visual-guide-to-the-destruction-of-gaza"  target="_blank">destructive</a> campaign in Gaza following the <a href="https://time.com/6321849/israel-attack/" >Oct. 7 Hamas attack</a>, which has brought about a <a href="https://time.com/6553912/israel-south-africa-icj-genocide/" >genocide case at the International Court of Justice</a>. Israel has also <a href="https://www.theguardian.com/world/2025/mar/12/israel-to-occupy-syrian-southern-territory-for-unlimited-time-says-minister"  target="_blank">expanded its military footprint</a> beyond the occupied Syrian Golan Heights, amid the chaos following the ouster of Assad. And it has struck Beirut and parts of Lebanon repeatedly, including <a href="https://www.aljazeera.com/news/2025/6/28/israeli-strikes-on-south-lebanon-kill-three-ministry"  target="_blank">within the past week</a>.</p>



<p>In short, even among states that are highly critical of Iran, there are <a href="https://www.washingtonpost.com/world/2025/06/28/iran-saudi-arabia-uae-ties/"  target="_blank">concerns</a> about an unrestrained Israel. A vision of a new regional order where Israel behaves with impunity while dictating security norms to its neighbors is <a href="https://www.ft.com/content/8c9c2034-7d16-47d3-a57c-1a5483ca1d3f"  target="_blank">profoundly unwelcome</a> to Arab states, including traditionally pro-Western Arab governments such as Saudi Arabia and Jordan.</p>



<p>The second reason is more fundamental. For decades, Arab societies have criticized the West&rsquo;s selective enforcement of international norms. That includes the <a href="https://www.theguardian.com/world/2004/sep/16/iraq.iraq"  target="_blank">2003 Iraq war</a>, Israel&rsquo;s ongoing <a href="https://www.bbc.co.uk/news/articles/c1j5954edlno"  target="_blank">occupation in the West Bank</a> and Gaza, and more recently the U.S. <a href="https://thehill.com/policy/international/4398781-israel-gaza-blinken-genocide-case-meritless/"  target="_blank">denunciation of the ICJ case</a> and <a href="https://www.bbc.co.uk/news/articles/ce80pl1xrllo"  target="_blank">sanctioning of ICC judges</a> after it issued arrest warrants for Israeli leaders. There is a perception that powerful Western states shield Tel Aviv from consequences. </p>



<p><strong>Read More:</strong><a href="https://time.com/6330746/global-south-ukraine-israel-gaza/" ><strong> </strong><em>The West Is Losing the Global South Over Gaza</em></a></p>



<p>To be sure, the Arab states are hardly models of legality themselves. Various U.N. <a href="https://rolhr.undp.org/annualreport/2023/arab-states/region-overview.html"  target="_blank">reports</a> have repeatedly described an undemocratic region rife with issues around corruption, nepotism, and closed civil society spaces. But the powerful Western countries that erected the &ldquo;rules-based&rdquo; order should be exemplar pillars of it&mdash;otherwise, trust in the project altogether collapses.<br><br>That&rsquo;s why the <a href="https://time.com/7296530/united-states-strikes-iran-world-leaders-react/" >U.S. bombing of Iran</a>&mdash;using the GBU-57 Massive Ordnance Penetrator, the <a href="https://www.businessinsider.com/what-we-know-bunker-buster-bombs-us-reportedly-hit-iran-2025-6"  target="_blank">heaviest non-nuclear weapon</a> in its arsenal&mdash;set a dangerous precedent. Despite the undeniable nature of Iran being a nefarious actor in the region, there was <a href="https://www.theguardian.com/commentisfree/2025/jun/22/trump-iran-george-w-bush-netanyahu"  target="_blank">no imminent threat,</a> no U.N. Security Council authorization, and no widespread international consensus to engage in such a military strike. </p>



<p>The war between Iran and Israel is over, at least for now. Whether Iran&rsquo;s nuclear program has been hobbled is a separate <a href="https://www.thedailybeast.com/un-nuclear-watchdog-humiliates-trump-with-brutal-iran-assessment/"  target="_blank">question</a>, one that <a href="https://www.reuters.com/world/middle-east/iaea-chief-says-iran-could-be-enriching-uranium-within-months-2025-06-29/"  target="_blank">analysts</a> and intelligence agencies will continue to assess in the weeks and months to come.&nbsp;</p>



<p>But something else may have also ended. A new era is emerging in the region increasingly defined by a presumption that might equals right. The consequences of this have yet to be truly understood&mdash;but there are likely to be many repercussions indeed.</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298676/iran-israel-conflict-arab-reaction/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298676</post-id>	</item>
		<item>
		<title>Republicans Seek to Ban Rap Duo Bob Vylan From U.S. After ‘Death to IDF’ Chant at Glastonbury</title>
		<link>https://time.com/7298655/bob-vylan-death-idf-israel-chant-glastonbury-us-tour-visas/</link>
					<comments>https://time.com/7298655/bob-vylan-death-idf-israel-chant-glastonbury-us-tour-visas/#respond</comments>
		
		<dc:creator><![CDATA[Chad de Guzman]]></dc:creator>
		<pubDate>Mon, 30 Jun 2025 10:55:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Israel-Hamas War]]></category>
		<category><![CDATA[News Desk]]></category>
		<category><![CDATA[overnight]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298655</guid>

					<description><![CDATA[The British rap duo generated global controversy after its singer led a “Death to the IDF” chant at Glastonbury.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298655"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298655/bob-vylan-death-idf-israel-chant-glastonbury-us-tour-visas/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/bob-vylan-glastonbury.jpg" alt="Bob Vylan performing on the West Holts stage during the Glastonbury Festival at Worthy Farm in Somerset on June 28, 2025."/>



<p>British punk-rock and hip-hop duo Bob Vylan may not be able to perform in the U.S., where they&rsquo;re scheduled to open for American singer <a href="https://www.instagram.com/p/DK2T33bJgG0/?hl=en"  target="_blank">grandson&rsquo;s tour in October and November</a>, after a controversial performance at the Glastonbury Festival in England over the weekend.</p>

[time-brightcove not-tgx=&#8221;true&#8221;]



<p>During the Glastonbury performance, which is aired annually on BBC, one of the group&rsquo;s members, Bobby Vylan, led the crowd to chant, &ldquo;Death to the IDF,&rdquo; referring to the <a href="https://www.haaretz.com/israel-news/2025-06-27/ty-article-magazine/.premium/idf-soldiers-ordered-to-shoot-deliberately-at-unarmed-gazans-waiting-for-humanitarian-aid/00000197-ad8e-de01-a39f-ffbe33780000"  target="_blank">Israel Defense Forces</a>, to the shock of organizers and onlookers. </p>



<p>The duo has faced a firestorm of criticism in the U.K., and British police <a href="https://x.com/ASPolice/status/1939025011844485405"  target="_blank">said</a> they are examining videos of the incident for possible criminal violations.</p>



<p>The Israeli embassy in the U.K. <a href="https://x.com/IsraelinUK/status/1939019339161563147"  target="_blank">said</a> it was &ldquo;deeply disturbed by the inflammatory and hateful rhetoric expressed on stage&rdquo; and that &ldquo;when such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.&rdquo;</p>



<p>&ldquo;We are appalled by the statements made from the West Holts stage by Bob Vylan yesterday,&rdquo; Emily Eavis, the co-organizer of Glastonbury and daughter of the festival&rsquo;s founder, said in a <a href="https://www.instagram.com/p/DLeuti8t5zC/?hl=en"  target="_blank">statement</a>. &ldquo;Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the Festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence.&rdquo;</p>



<p>U.K. Prime Minister Keir Starmer condemned Vylan&rsquo;s actions on the Glastonbury stage, <a href="https://www.bbc.com/news/articles/c33514nryy1o"  target="_blank">saying</a>, &ldquo;There is no excuse for this kind of appalling hate speech.&rdquo; He also demanded that the BBC answer questions about streaming the controversial remarks.</p>



<p>In a statement, the BBC <a href="https://www.bbc.com/mediacentre/statements/glastonbury-2025"  target="_blank">said</a> Vylan&rsquo;s expressions &ldquo;were utterly unacceptable and have no place on our airwaves.&rdquo; It explained that the performance was aired on its channels because the BBC team was dealing with &ldquo;a live situation&rdquo; but added that &ldquo;with hindsight we should have pulled the stream during the performance.&rdquo;</p>



<p>Starmer had previously said that it was &ldquo;<a href="https://www.bbc.com/news/articles/cg5z26dpgd7o"  target="_blank">not appropriate</a>&rdquo; for Irish rap trio <a href="https://www.businessinsider.com/kneecap-irish-hip-hop-group-coachella-controversy-explained-2025-4"  target="_blank">Kneecap</a>, who have accused Israel of committing genocide in Gaza and accused the U.S. and U.K. of enabling it, to be performing at the festival, and the BBC had <a href="https://www.theguardian.com/music/2025/jun/28/kneecap-glastonbury-set-will-not-be-broadcast-live-bbc-confirms"  target="_blank">decided</a> in advance not to broadcast Kneecap&rsquo;s performance live to &ldquo;ensure that our programming meets our editorial guidelines.&rdquo;</p>



<p>Vylan performed before Kneecap&rsquo;s set, where festival attendees had gathered in anticipation with Palestinian flags. Singer Bobby Vylan first led the crowd to chant, &ldquo;Free, free, Palestine!&rdquo; Then he interjected: &ldquo;Alright, but have you heard this one though?&rdquo; before leading a chant of &ldquo;Death, death to the IDF!&rdquo;</p>



<p>The chant recalled the phrasing of &ldquo;Death to Israel&rdquo; and <a href="https://www.aljazeera.com/video/newsfeed/2025/6/24/whats-with-irans-death-to-america-chant"  target="_blank">&ldquo;Death to America&rdquo; chants by Iranians</a> as well as <a href="https://apnews.com/article/israel-palestinians-jerusalem-nationalist-march-ben-gvir-0c6471592182aac205115150d1b3a552"  target="_blank">&ldquo;Death to Arabs&rdquo; chants by Israelis</a>.</p>



<p>Following the controversy that ensued, Bobby Vylan wrote &ldquo;I said what I said&rdquo; <a href="https://www.instagram.com/p/DLf3nb0oKmU/?hl=en"  target="_blank">on Instagram</a>, where he shared a statement that explained: &ldquo;Teaching our children to speak up for the change they want and need is the only way that we make this world a better place.&rdquo;</p>



<p>Here&rsquo;s what to know.</p>



<h2 class="wp-block-heading">Who is Bob Vylan?</h2>



<p>Bob Vylan is composed of singer-guitarist Bobby Vylan and drummer Bobbie Vylan, and they collectively refer to themselves as &ldquo;the Bobs.&rdquo; The two have used stage names reportedly to maintain privacy, but some U.K. <a href="https://www.thetimes.com/culture/music/article/who-bob-vylan-punk-rap-duo-glastonbury-idf-chants-9dg6cv9fk"  target="_blank">media</a> have since identified Bobby Vylan as 34-year-old Pascal Robinson-Foster.</p>



<p>The duo, which formed in Ipswich in 2017 and has more than 200,000 monthly listeners on Spotify, is known for its politically charged music and performances.</p>



<p>According to <a href="https://www.independent.co.uk/arts-entertainment/music/glastonbury/bob-vylan-glastonbury-2025-idf-b2779070.html"  target="_blank">the <em>Independent</em></a>, their songs &ldquo;often speak out against racism, homophobia, toxic masculinity and far right politics,&rdquo; and in past performances Bobby would preface their song &ldquo;Pretty Songs&rdquo; by saying &ldquo;violence is the only language that some people understand.&rdquo; The paper also said that Bobby has been deliberately provocative in past performances, such as by swinging a baseball bat at the crowd or wearing the soccer jersey of the rival team of where they were performing.</p>



<p>Last year, Bobby <a href="https://www.irishtimes.com/culture/music/2024/04/09/bob-vylan-thats-how-i-think-the-english-government-views-the-irish-theyre-all-right-so-long-as-they-stay-in-their-place/"  target="_blank">told the <em>Irish Times</em></a> that he was infuriated by bands that didn&rsquo;t speak up more about Gaza. The U.K. and U.S. governments&rsquo; response, he said, &ldquo;but also the people&rsquo;s response &ndash; the people of these countries &hellip; will be remembered forever. It will be documented throughout history. If you&rsquo;re asking yourself, &lsquo;Oh, what would you have done during slavery? What would you have done throughout the Holocaust?&rsquo; You&rsquo;re doing it now &ndash; right now. With what it is happening over there in Palestine, you&rsquo;re doing it.&rdquo;</p>



<h2 class="wp-block-heading">What are the reactions in the U.S.?</h2>



<p>StopAntisemitism, an advocacy group in the U.S., <a href="https://x.com/StopAntisemites/status/1939324518759116883"  target="_blank">flagged</a> on X that the duo has scheduled performances in the U.S. later this year and said of Bobby Vylan: &ldquo;This antisemite must have his visa denied/rescinded &#8211; his hate is not welcome here.&rdquo; Republican Rep. Randy Fine of Florida <a href="https://x.com/RepFine/status/1939388481777914309"  target="_blank">responded</a> to the post, saying &ldquo;On it.&rdquo;</p>



<p>A State Department spokesperson told TIME that it does not publicly discuss the details of individual cases but that the Department &ldquo;is committed to protecting the nation and its citizens by upholding the highest standards of national security and public safety.&rdquo; The spokesperson added that Secretary of State Marco Rubio has been clear that &ldquo;a U.S. visa is a privilege, not a right.&rdquo;</p>



<p>An unnamed senior State Department official told conservative media company <a href="https://www.dailywire.com/news/exclusive-state-department-looks-to-revoke-visa-for-british-rappers-who-chanted-death-to-the-idf"  target="_blank">the Daily Wire on Sunday</a> that they are &ldquo;looking at [the] revocation&rdquo; of the visas of the duo. The unnamed official said: &ldquo;Under the Trump Administration, the U.S. government will not issue visas to any foreigner who supports terrorists.&rdquo;</p>



<p>Rubio, who was tagged in StopAntisemitism&rsquo;s post, has so far not publicly commented on the matter. However, Leo Terrell, who was also tagged and chairs the Justice Department&rsquo;s task force to combat antisemitism, did respond publicly.</p>



<p>&ldquo;These abhorrent chants, which included calls for the death of members of the Israeli Defense Forces, are abhorrent and have no place in any civil society,&rdquo; Terrell <a href="https://x.com/LeoTerrellDOJ/status/1939378795368055110"  target="_blank">posted</a> on X. &ldquo;We understand that Mr. Vylan is planning to travel to the United States as part of the Inertia Tour. In response, Mr. Terrell&rsquo;s Task Force will be reaching out to the U.S. Department of State on Monday to determine what measures are available to address the situation and to prevent the promotion of violent antisemitic rhetoric in the United States.&rdquo;</p>



<p>Sen. Ted Cruz (R, Texas) <a href="https://x.com/tedcruz/status/1939080845702083062"  target="_blank">reposted</a> video of the incident on X, and commented: &ldquo;Truly sick. Thousands of people screaming &lsquo;Death to the IDF.&rsquo; This is the base of the Democrat Party.&rdquo;</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298655/bob-vylan-death-idf-israel-chant-glastonbury-us-tour-visas/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298655</post-id>	</item>
		<item>
		<title>After Iran, Trump Aims to End War in Gaza</title>
		<link>https://time.com/7298631/trump-israel-gaza-hamas-war-ceasefire-deal-palestinians-idf-netanyahu/</link>
					<comments>https://time.com/7298631/trump-israel-gaza-hamas-war-ceasefire-deal-palestinians-idf-netanyahu/#respond</comments>
		
		<dc:creator><![CDATA[Miranda Jeyaretnam]]></dc:creator>
		<pubDate>Mon, 30 Jun 2025 09:30:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Donald Trump]]></category>
		<category><![CDATA[News Desk]]></category>
		<category><![CDATA[overnight]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298631</guid>

					<description><![CDATA[After brokering a ceasefire between Israel and Iran, Trump is pushing for a deal to end the war in Gaza.
]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298631"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298631/trump-israel-gaza-hamas-war-ceasefire-deal-palestinians-idf-netanyahu/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/israel-gaza.jpg" alt="Israel's military mobility on Gaza border"/>



<div class="brief-podcast-player"><h3 class="podcast-title">The Brief June 30, 2025</h3><h4>Updates on an ambush in Idaho, trade talks between the U.S. and Canada, and more</h4><p>Podcast ID &#8211; Short Length: <code>07252f55-0240-468b-b65e-d8048bda1280</code></p><p>Podcast ID &#8211; Long Length: <code>8fabea66-f7a7-489b-b5b1-904bcfa20f14</code></p></div>



<p>After <a href="https://time.com/7297049/iran-israel-ceasefire-trump/" >brokering</a> a <a href="https://time.com/7297098/israel-iran-ceasefire-broken-missile-strikes-tehran/" >fragile ceasefire</a> between Israel and Iran, Donald Trump is urging Israel and Hamas to make a deal that would stop the 20-month-long war in Gaza that has killed more than 50,000 Palestinians and over a thousand Israelis.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>&ldquo;MAKE THE DEAL IN GAZA. GET THE HOSTAGES BACK!!!&rdquo; the U.S. President <a href="https://truthsocial.com/@realDonaldTrump/114764965108272159"  target="_blank">posted</a> on Truth Social early Sunday.</p>



<p>Trump <a href="https://www.facebook.com/CBSNews/videos/trump-says-ceasefire-in-gaza-possible-within-the-next-week/1089110373093546/"  target="_blank">told</a> reporters on Friday that an agreement could be reached within the next week. On Saturday evening Trump said Israeli Prime Minister Benjamin Netanyahu is &ldquo;right now in the process of negotiating a Deal with Hamas, which will include getting the Hostages back,&rdquo; in a <a href="https://truthsocial.com/@realDonaldTrump/posts/114763460580044614"  target="_blank">post</a> slamming the corruption proceedings against Netanyahu. An Israeli court on Monday <a href="https://www.theguardian.com/world/2025/jun/30/benjamin-netanyahu-corruption-trial-delayed-ntwnfb"  target="_blank">postponed</a> this week&rsquo;s hearings in Netanyahu&rsquo;s trial after he made a request based on classified diplomatic and security reasons.</p>



<p>&ldquo;How is it possible that the Prime Minister of Israel can be forced to sit in a Courtroom all day long, over NOTHING (Cigars, Bugs Bunny Doll, etc.). It is a POLITICAL WITCH HUNT, very similar to the Witch Hunt that I was forced to endure,&rdquo; Trump wrote. &ldquo;This travesty of &lsquo;Justice&rsquo; will interfere with both Iran and Hamas negotiations.&rdquo;</p>



<p><strong>Read More:</strong> <a href="https://time.com/7297951/trump-netanyahu-friend-relationship-israel-prime-minister-corruption-trial-politics/" ><em>Trump Tries to &lsquo;Save&rsquo; Netanyahu as Israeli PM Faces Challenges at Home</em></a></p>



<p>An Israeli official <a href="https://apnews.com/article/israel-palestinians-hamas-war-news-06-29-2025-f72d5701a985213e12b1ff80d1357670"  target="_blank">told</a> the Associated Press that Ron Dermer, a top adviser to Netanyahu, will visit Washington this week for ceasefire talks. Netanyahu met with his security Cabinet on Sunday evening and plans are being made for him to visit Washington in coming weeks, the official said.</p>



<p>Trump&rsquo;s shift in focus towards Gaza comes after Iran and Israel agreed to a tenuous ceasefire on June 23, ending the so-called &ldquo;12 Day War&rdquo; ignited by Israel&rsquo;s attack on <a href="https://time.com/7297464/nuclear-diplomacy-iran-us-strikes-damage-non-proliferation-treaty-weapon/" >Iran&rsquo;s nuclear program</a>. Arab mediators, Egypt and Qatar, renewed a ceasefire push for Gaza after the U.S. and Israel <a href="https://time.com/7296469/u-s-strikes-iran-nuclear-trump-war/" >bombed</a> Iran&rsquo;s nuclear facilities. Hamas has told mediators that it is ready to resume talks but reiterated that any deal must include an end to the war and Israeli withdrawal from Gaza, a Hamas official <a href="https://www.reuters.com/world/middle-east/israel-orders-evacuations-northern-gaza-trump-calls-war-end-2025-06-29/"  target="_blank">told</a> Reuters.</p>



<h2 class="wp-block-heading">Call for ceasefire comes as Israel escalates war</h2>



<p>At the same time that Trump called for a deal, Israel continued to escalate its military bombardment of Gaza. The Israeli military <a href="https://x.com/AvichayAdraee/status/1939189566398709879"  target="_blank">ordered</a> a mass evacuation of Palestinians in northern Gaza, where hundreds of thousands of people live in eastern and northern Gaza City and the Jabaliya refugee camp. The Israeli Defense Forces&rsquo; attacks will expand westward to Gaza City center, the order said. People are ordered to evacuate to Mawasi in southern Gaza, which Israel has designated as a humanitarian area.</p>



<p><a href="https://time.com/7176657/the-questions-israels-plans-for-north-gaza-endgame/" >Uprooting their lives</a> at a moment&rsquo;s notice has become routine for Palestinians in Gaza over the last nearly two years of war. <a href="https://www.doctorswithoutborders.org/latest/israeli-displacement-orders-gaza-are-psychological-warfare"  target="_blank">Humanitarian organizations</a> have <a href="https://www.bloomberg.com/news/articles/2023-10-13/un-calls-israel-order-to-evacuate-1-1-million-in-gaza-impossible"  target="_blank">criticized</a> Israel&rsquo;s <a href="https://www.bbc.com/news/articles/c2d5x60pw7eo"  target="_blank">sweeping evacuation orders</a> in the past as being unpredictable and having short deadlines that are <a href="https://www.un.org/sg/en/content/sg/articles/2023-10-13/why-israel-must-reconsider-its-gaza-evacuation-order"  target="_blank">virtually impossible</a> for many, including the <a href="https://www.reuters.com/world/middle-east/six-killed-israeli-strike-school-sheltering-displaced-people-gaza-civil-2024-12-22/"  target="_blank">sick and disabled</a>. On Sunday, Palestinians in Gaza City were yet again forced to load their children and essentials onto donkey carts before the military&rsquo;s attacks, the AP <a href="https://apnews.com/article/israel-palestinians-hamas-war-news-06-29-2025-f72d5701a985213e12b1ff80d1357670"  target="_blank">reported</a>. United Nations officials have said that <a href="https://www.un.org/unispal/document/sg-remarks-unrwa-12jul24/#:~:text=Nowhere%20is%20safe.-,Everywhere%20is%20a%20potential%20killing%20zone%E2%80%9D%20in%20Gaza%2C%20Remarks%20by,of%20the%20UNRWA%20Pledging%20Conference"  target="_blank">nowhere in Gaza is safe</a>. At least five people were <a href="https://www.youtube.com/watch?v=GgIVFv4OIUg"  target="_blank">killed</a> in an Israeli airstrike on a tent encampment in Khan Younis near Mawasi, the designated safe area, over the weekend, medics said.</p>



<figure class="wp-block-gutenberg-custom-blocks-inline-image"><img decoding="async" src="https://api.time.com/wp-content/uploads/2025/06/gaza-displacement.jpg" alt="Daily life in Gaza amid the ongoing Israeli attacks" alignment="original-size-image"/><p class="article_header"></p><p class="article_subheading"></p><p class="article_text"></p></figure>



<p>&ldquo;A month ago, they told us to go to Al-Mawasi and we stayed there for a month, it is a safe zone,&rdquo; Palestinian Zeyad Abu Marouf <a href="https://www.reuters.com/world/middle-east/israel-orders-evacuations-northern-gaza-trump-calls-war-end-2025-06-29/"  target="_blank">told</a> Reuters. Three of his children were killed and a fourth wounded in the airstrike, he said.</p>



<p>&ldquo;Families have been displaced again and again&mdash;and are now confined to less than one-fifth of Gaza&rsquo;s land,&rdquo; U.N. Secretary-General Ant&oacute;nio Guterres <a href="https://news.un.org/en/story/2025/06/1165016"  target="_blank">said</a> on Friday. &ldquo;Even these shrinking spaces are under threat. Bombs are falling&mdash;on tents, on families, on those with nowhere left to run.&rdquo;</p>



<h2 class="wp-block-heading">Roadblocks remain over a deal</h2>



<p>In spite of Trump&rsquo;s optimism, skepticism over a deal remains.</p>



<p>Hamas has accused Israeli leaders of purposely delaying a deal. Hamas official Mahmoud Mardawi <a href="https://today.lorientlejour.com/article/1467084/netanyahu-does-not-want-a-deal-says-hamas-official.html"  target="_blank">reportedly said</a> on Telegram on Sunday that Netanyahu set &ldquo;impossible conditions aimed at thwarting the possibility of reaching a ceasefire agreement and a deal on the hostages.&rdquo;</p>



<p>Hamas <a href="https://www.timesofisrael.com/hamas-ready-to-free-all-hostages-at-once-for-end-to-war-palestinian-official/"  target="_blank">has reportedly offered</a> Israel a deal that includes the release of all hostages in exchange for a full withdrawal of Israel&rsquo;s military from Gaza and an end to the war. But Mardawi said Netanyahu has insisted on a temporary agreement that releases only 10 hostages. &ldquo;Netanyahu lies when he claims he is not involved in choosing the names of the hostages,&rdquo; Mardawi wrote. &ldquo;He does not want a deal.&rdquo;</p>



<p>Netanyahu spokesperson Omer Dostri did not address Mardawi&rsquo;s claims but said, &ldquo;Hamas was the only obstacle to ending the war,&rdquo; according to the AP. Israel has said it will only agree to end the war in exchange for the full dismantlement and exile of Hamas.</p>



<p>While Trump has repeatedly urged a ceasefire in Gaza, he&rsquo;s also <a href="https://time.com/7285602/trump-plans-for-gaza-freedom-zone/" >suggested</a> a U.S. takeover that turns the territory into &ldquo;a freedom zone&rdquo; and proposed that Jordan and Egypt take in Palestinians as part of a &ldquo;clean out&rdquo; of the Gaza Strip.&nbsp;</p>



<p>In February, Trump said the U.S. could take a &ldquo;long-term ownership position&rdquo; over Gaza, &ldquo;level it out, create an economic development that will supply unlimited numbers of jobs and housing for the people of the area.&rdquo; That month, he also shared an <a href="https://www.youtube.com/watch?v=PslOp883rfI"  target="_blank">AI-generated video</a> on Truth Social of &ldquo;Trump Gaza,&rdquo; showing a reconstructed Gaza Strip with skyscrapers, luxury cars, and Trump drinking by a pool with Netanyahu.</p>



<p>Even if a deal is reached, it&rsquo;s unclear whether it will last. Israel and Hamas <a href="https://time.com/7207250/ceasefire-gaza-israel-hamas/" >reached</a> a multi-phase <a href="https://time.com/7207277/israel-hamas-gaza-ceasefire-deal/" >ceasefire agreement</a> in January, just as Trump was taking office. But Israel <a href="https://time.com/7270736/israel-hamas-ceasefire-netanyahu/" >broke</a> the ceasefire in March when it launched surprise airstrikes on Gaza before declaring that it was resuming the war.</p>



<figure class="wp-block-gutenberg-custom-blocks-inline-image"><img decoding="async" src="https://api.time.com/wp-content/uploads/2025/06/israel-anti-war-protest.jpg" alt="Israelis rally in Tel Aviv for Gaza ceasefire and return of hostages" alignment="original-size-image"/><p class="article_header"></p><p class="article_subheading"></p><p class="article_text"></p></figure>



<p>Since then, pressure has been mounting on Netanyahu to agree to a ceasefire, both from within and outside Israel. <a href="https://www.youtube.com/watch?v=YwsInT1z1m8"  target="_blank">Pro-Palestinian protesters</a> around the world <a href="https://www.youtube.com/watch?v=HLBgmCxWSCY"  target="_blank">turned out</a> over the weekend to <a href="https://www.aljazeera.com/news/2025/6/27/uk-police-arrest-four-after-pro-palestinian-protest-at-military-base"  target="_blank">call</a> for an end to the war. And earlier this month, the U.N. <a href="https://news.un.org/en/story/2025/06/1164281"  target="_blank">adopted</a> a resolution demanding an immediate, unconditional, and permanent ceasefire, with Russian Ambassador Vasily Nebenzya saying that it is the international community&rsquo;s responsibility to stop the &ldquo;slaughter&rdquo; in Gaza.</p>



<p>Protests in Israel also <a href="https://www.timesofisrael.com/saturday-night-protests-to-resume-after-two-week-hiatus-due-to-war-with-iran/"  target="_blank">resumed</a> after a two-week pause during the Israel-Iran war, with demonstrators demanding a deal that would free the hostages still in Gaza. &ldquo;There&rsquo;s a deal on the table and what prevents it is Netanyahu&#8217;s refusal to end the war,&rdquo; <a href="https://www.ynetnews.com/article/b1ztqt64ll#"  target="_blank">said</a> Einav Zangauker, the mother of one of the hostages, at the rally.</p>



<p>Earlier this month, former Prime Minister of Israel Ehud Barak <a href="https://time.com/7290294/ehud-barak-trump-ceasefire-plan-way-forward-for-israel/" >wrote</a> in a TIME essay calling for Netanyahu to back a Trump-brokered ceasefire: &ldquo;In the coming few days, Prime Minister Benjamin Netanyahu will face a defining choice between a politically motivated &lsquo;war of deception&rsquo; in Gaza and a deal to release all hostages while ending the war. He must choose between his extreme-right ministers&mdash;Itamar Ben-Gvir and Bezalel Smotrich&mdash;or aligning with Donald Trump.&rdquo;</p>



<p>Netanyahu <a href="https://www.gov.il/he/pages/event-shabak290625"  target="_blank">said</a> at the Sunday security meeting that &ldquo;many opportunities have opened up&rdquo; after Israel&rsquo;s &ldquo;victory&rdquo; in Iran, and for one of the first times he appeared to prioritize hostage exchange over the defeat of Hamas, potentially signaling appetite for a ceasefire deal: &ldquo;Firstly, to rescue the hostages,&rdquo; he said. &ldquo;Of course, we will also need to solve the Gaza issue, defeat Hamas, but I believe we will achieve both tasks.&rdquo;</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298631/trump-israel-gaza-hamas-war-ceasefire-deal-palestinians-idf-netanyahu/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298631</post-id>	</item>
		<item>
		<title>Trump Issues Blistering Response After Iran&#8217;s Supreme Leader Threatens U.S., as All Sides Claim Victory in Conflict</title>
		<link>https://time.com/7298477/trump-iran-threat-khamenei-nuclear-bombs-sanctions/</link>
					<comments>https://time.com/7298477/trump-iran-threat-khamenei-nuclear-bombs-sanctions/#respond</comments>
		
		<dc:creator><![CDATA[Rebecca Schneid]]></dc:creator>
		<pubDate>Sat, 28 Jun 2025 14:19:31 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[News Desk]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298477</guid>

					<description><![CDATA["A burned out, blown up country with no future, a decimated military, a horrible economy, and death all around them."]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298477"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298477/trump-iran-threat-khamenei-nuclear-bombs-sanctions/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2221346823.jpg" alt="TOPSHOT-NETHERLANDS-NATO-SUMMIT-DEFENCE-DIPLOMACY"/>



<p>President Donald Trump issued blistering remarks in response to Iran&rsquo;s Supreme Leader claiming victory over Israel and, by extension, the U.S. In a loaded public message, Ayatollah Ali Khamenei had also <a href="https://time.com/7297975/iran-trump-khamenei-israel-war-attack/" >threatened to attack more U.S. Military bases</a>, further splintering the Middle Eastern country&rsquo;s relationship with the U.S.</p>



<p>&ldquo;Look, you&rsquo;re a man of great faith. A man who&rsquo;s highly respected in his country. You have to tell the truth. You got beat to hell,&rdquo; Trump said as he addressed the Iranian Supreme Leader during <a href="https://www.youtube.com/watch?app=desktop&amp;v=pd4wwn30pbQ"  target="_blank">a White House press conference</a> on Friday. Trump was asked by a reporter if the U.S. would consider bombing Iran again, if intelligence reports were to conclude that Iran could enrich uranium to a level that concerns him. &#8220;Sure, without question, absolutely,&#8221; he replied.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>Trump issued an even stronger response on his social media platform, <a href="https://truthsocial.com/@realDonaldTrump/posts/114756430889057942"  target="_blank">Truth Social</a>, later in the day, and doubled down on his stance once more when he reposted his message early Saturday morning.</p>



<p>In the lengthy post, Trump accused Khamenei of publicly sharing a &ldquo;lie&rdquo; by claiming Iran achieved a victory over Israel. He reaffirmed his much debated viewpoint that the <a href="https://time.com/7296469/u-s-strikes-iran-nuclear-trump-war/" >U.S. strikes &ldquo;obliterated&rdquo; the three key nuclear facilities</a> it targeted on Saturday, June 21. Trump also seemingly made reference to previous reports that stated the <a href="https://www.bbc.co.uk/news/articles/ckg7gl4zegyo"  target="_blank">White House turned down a plan</a> by Israel to try and kill Khamenei. </p>



<p>&ldquo;His country was decimated, his three evil nuclear sites were obliterated, and I knew exactly where he was sheltered, and would not let Israel, or the U.S. Armed Forces&#8230; terminate his life. I saved him from a very ugly and ignominious death,&rdquo; Trump said, lamenting that Khamenei would not &ldquo;thank&rdquo; him for this. &ldquo;During the last few days, I was working on the possible removal of sanctions, and other things, which would have given a much better chance to Iran at a full, fast, and complete recovery. The sanctions are biting! But no, instead I get hit with a statement of anger, hatred, and disgust, and immediately dropped all work on sanction relief.&rdquo; </p>



<p>According to <a href="https://www.congress.gov/crs-product/IF12452"  target="_blank">Congress</a>, the U.S. sanctions on Iran &ldquo;are arguably the most extensive and comprehensive set of sanctions that the United States maintains on any country.&rdquo; They block Iranian government assets in the U.S., ban nearly all U.S. trade with Iran, and prohibit foreign assistance and arms sales.</p>



<p><strong>Read More:</strong> <em><a href="https://time.com/7296554/us-strikes-iranian-regime-benefits/" >How U.S. Strikes May Have Inadvertently Helped the Iranian Regime </a></em></p>



<p>Trump concluded his charged social media message by saying &ldquo;Iran has to get back into the world order flow&rdquo; or else things &ldquo;will only get worse for them.&rdquo;</p>



<p>&ldquo;They are always so angry, hostile, and unhappy, and look at what it has gotten them. A burned out, blown up country with no future, a decimated military, a horrible economy, and death all around them. They have no hope, and it will only get worse! I wish the leadership of Iran would realize that you often get more with honey than you do with vinegar. Peace!&#8221;</p>



<p>Khamenei broke his silence on Thursday, publicly speaking out&mdash;via a pre-recorded televised address and various social media comments&mdash; for the first time since Trump announced the (admittedly fragile) cease-fire between Israel and Iran.</p>



<p><strong>Read More</strong>: <a href="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/" ><em>Shaky Israel-Iran Cease-Fire Appears to Hold After Trump Publicly Rebukes Both Countries</em></a></p>



<p>In his televised message, Khamenei threatened to attack more U.S. military bases should any further aggression from the U.S. side occur.</p>



<p>&ldquo;The Islamic Republic slapped America in the face. It attacked one of the important American bases in the region,&rdquo; <a href="https://time.com/7297975/iran-trump-khamenei-israel-war-attack/" >Khamenei said</a>, referring to his country&rsquo;s air assault on Al Udeid Air Base, a U.S. airbase in Qatar. The strikes were intercepted by the U.S. (except for one that was allowed to proceed as there was no risk of contact), and no casualties were reported. The military action was retaliatory, a direct response to the U.S. strikes on nuclear facilities.&nbsp;</p>



<p>Khamenei claimed &ldquo;total victory&rdquo; over Israel. But Israel, the U.S., and Iran have all claimed to have won the war that started on June 13, when Israel launched strikes on Iranian nuclear and military targets, amid growing concern over <a href="https://time.com/7297970/iran-nuclear-program-jcpoa-trump/" >Iran&rsquo;s nuclear capabilities</a>. When the U.S. actively joined the conflict on June 21, striking three key Iranian nuclear facilities, <a href="https://time.com/7296530/united-states-strikes-iran-world-leaders-react/" >world leaders urged de-escalation </a>and a return to negotiations, amid fears of a far-reaching war erupting.</p>



<p><strong>Read More</strong>: <em><a href="https://time.com/7296530/united-states-strikes-iran-world-leaders-react/" >&lsquo;Gravely Alarmed&rsquo; World Leaders React After U.S. Strikes Iran</a></em></p>



<p>Though Trump continues to say that Iran&rsquo;s nuclear sites were <a href="https://truthsocial.com/@realDonaldTrump/posts/114756430889057942"  target="_blank">&ldquo;totally obliterated,&rdquo;</a> others have cast doubts on how effective the U.S. strikes were in setting back Iran&rsquo;s nuclear program. Leaked U.S. intelligence suggested that the damage to Iran&rsquo;s nuclear program may not be as severe as Trump has stated. CIA director John Ratcliffe said on Wednesday that the sites had been &ldquo;severely damaged&rdquo; by the U.S. strikes, and that it would take years to be rebuilt. Amid the debate, the White House has <a href="https://www.whitehouse.gov/articles/2025/06/irans-nuclear-facilities-have-been-obliterated-and-suggestions-otherwise-are-fake-news/"  target="_blank">put out statements</a> arguing Trump&rsquo;s stance that the facilities were &#8220;obliterated,&#8221; labelling reports to the contrary as &#8220;fake news.&#8221;</p>



<p>But some Democrats left a <a href="https://time.com/7298188/iran-strikes-classified-briefing-senators/" >classified meeting</a> with lingering questions over the effectiveness of the strikes.</p>



<p>&ldquo;There&rsquo;s no doubt there was damage done to the program, but the allegations that we have obliterated their program just don&rsquo;t seem to stand up to reason,&rdquo; said Sen. Chris Murphy of Connecticut on Thursday. &ldquo;To me, it still appears that we have only set back the Iranian nuclear program by a handful of months.&rdquo;</p>



<p>When asked about concerns of Iran having &ldquo;secret nuclear sites&rdquo; at Friday&rsquo;s press conference, Trump said he was &ldquo;not worried about it at all.&rdquo;</p>



<p>&ldquo;They&rsquo;re exhausted. The last thing they&#8217;re thinking about right now is nuclear,&rdquo; he told reporters.  &ldquo;You know what they&#8217;re thinking of? They&#8217;re thinking about tomorrow, trying to live in such a mess. The place was bombed to hell.&rdquo;</p>



<p><strong>Read More</strong>: <em><a href="https://time.com/7297698/nato-2025-summit-trump-iran-ukraine-defense-topics/" >Key Takeaways From the 2025 NATO Summit</a></em></p>



<p>Meanwhile, Iran&#8217;s Foreign Minister Abbas Araghchi <a href="https://x.com/araghchi/status/1938716761450520678"  target="_blank" rel="noreferrer noopener" target="_blank">said</a> on Friday that Trump needs to retire his &#8220;disrespectful&#8221; tone towards Khamenei if he wants a deal to be struck between the U.S. and Iran.<br><br>&ldquo;If President Trump is genuine about wanting a deal, he should put aside the disrespectful and unacceptable tone towards Iran&rsquo;s Supreme Leader, Grand Ayatollah Khamenei, and stop hurting his millions of heartfelt followers,&rdquo; he said. &#8220;The great and powerful Iranian people, who showed the world that the Israeli regime had no choice but to run to &#8216;Daddy&#8217; to avoid being flattened by our missiles, do not take kindly to threats and insults.&#8221;</p>



<p>Araghchi was referencing remarks made by NATO chief Mark Rutte who, during the NATO Summit on Wednesday, <a href="https://time.com/7297698/nato-2025-summit-trump-iran-ukraine-defense-topics/" >referred to Trump as the &#8220;daddy&#8221;</a> who had to intervene in the conflict between Israel and Iran.</p>



<p>Amid the back-and-forth between Trump and Iran, on Saturday, thousands of mourners gathered in Tehran for the funerals of top <a href="https://time.com/7293886/iranian-generals-scientists-targets-killed-by-israeli-strikes/" >Iranian military commanders and scientists</a> that were killed in the Israeli strikes. <a href="https://www.cnn.com/world/live-news/israel-iran-conflict-us-trump-06-28-25-intl-hnk#cmcfxthf200003b6mbyc9so60"  target="_blank">According to reports</a>, crowds chanted &#8220;death to&#8221; Israel and America.</p>



<p>Araghchi paid tribute to those who had been killed, and went on to tell Iranians on Saturday that the &#8220;pride of a nation is paramount,&rdquo; pledging that Iran would return to &ldquo;new glory and greater strength.&#8221;<br><br>As the funerals took place, <a href="https://x.com/Khamenei_fa/status/1938954701204025779"  target="_blank">Khamenei spoke out</a> via a post on his Farsi-language social media account, sharing a message that translated to: &#8220;The Iranian nation should know that the reason for the opposition to America is that they want Iran to surrender, and this is a great insult to the Iranian nation by the Americans, and such a thing will never happen.&#8221;</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298477/trump-iran-threat-khamenei-nuclear-bombs-sanctions/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298477</post-id>	</item>
		<item>
		<title>Trump Should Have Never Ditched the Iran Nuclear Deal</title>
		<link>https://time.com/7297970/iran-nuclear-program-jcpoa-trump/</link>
					<comments>https://time.com/7297970/iran-nuclear-program-jcpoa-trump/#respond</comments>
		
		<dc:creator><![CDATA[Josh Black]]></dc:creator>
		<pubDate>Sat, 28 Jun 2025 11:00:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[freelance]]></category>
		<guid isPermaLink="false">https://time.com/?p=7297970</guid>

					<description><![CDATA[The JCPOA was working before the U.S. pulled out in 2018, and another accord is still the best way forward.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7297970"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7297970/iran-nuclear-program-jcpoa-trump/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2220353710.jpg" alt="President Trump Departs White House For New Jersey"/>



<p>Questions remain over the true damage to Iran&rsquo;s nuclear program. But as conflicting <a href="https://edition.cnn.com/2025/06/26/politics/trump-iran-nuclear-program-damage"  target="_blank">comments</a> and <a href="https://edition.cnn.com/2025/06/25/politics/cia-iran-nuclear-strikes-assessments"  target="_blank">reports</a> come in from the Trump Administration and <a href="https://www.bbc.co.uk/news/articles/ckglxwp5x03o"  target="_blank">Pentagon intelligence estimates</a>, one thing is certain: Trump&rsquo;s failed diplomacy got us in this mess.&nbsp;</p>



<p>I should know. Ten years ago, I was in Vienna as part of the U.S. team negotiating a deal to stop Iran from getting a nuclear weapon.&nbsp;</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>Those negotiations culminated in the 2015 Joint Comprehensive Plan of Action (JCPOA). It was Trump&rsquo;s decision in 2018 to withdraw from the Iran nuclear deal that ultimately led to the perilous situation in the Middle East today.&nbsp;</p>



<p>The JCPOA was the result of a sustained campaign of principled, effective U.S. diplomacy. President Obama began laying groundwork for this nuclear deal as soon as he came to office in 2009. His view&mdash;shared then and now across the U.S. political spectrum&mdash;was that the U.S. cannot accept a nuclear-armed Iran. At the time, Iran claimed that its nuclear energy program was for exclusively peaceful uses. Yet given evidence of Iran&rsquo;s <a href="https://graphics8.nytimes.com/packages/pdf/international/20071203_release.pdf"  target="_blank">past interest</a> in possessing a nuclear bomb prior to 2003, the U.S. could not take this claim at face value.</p>



<p>To get the nuclear deal, Obama and his national security team rallied the world to increase pressure on Tehran. The U.S., E.U., and other allies put in place punishing sanctions. The U.N. Security Council followed suit with a <a href="https://www.bbc.co.uk/news/world-middle-east-10768146"  target="_blank">fresh round of sanctions</a> in June 2010 that were wide-ranging and <a href="https://obamawhitehouse.archives.gov/the-press-office/fact-sheet-new-un-security-council-sanctions-iran"  target="_blank">targeted the nuclear program</a>.&nbsp;</p>



<p>These sanctions worked: they convinced Iran to come to the negotiating table. To iron out the technical provisions of a deal, the U.S. then put together a team of top career diplomats, nuclear scientists, lawyers, and sanctions experts. It was a remarkable lineup of American patriots and professionals. It was my great honor to serve on that team.</p>



<p>Our goal was to offer Iran phased and reversible sanctions relief in exchange for far-reaching limits on Iran&rsquo;s nuclear activities. To maximize leverage, we coordinated with other countries, including not just European allies but also Russia and China. It was difficult, exacting, high-stakes work&mdash;for months on end.</p>



<p>The effort paid off. Iran agreed to substantial limits on its nuclear activities, including to export out of the country around 98% of its enriched uranium stockpile. Iran&rsquo;s commitments were then subject to intrusive and permanent international monitoring. By the end of the Obama Administration, the deal was working, with <a href="https://www.politico.com/story/2017/07/17/trump-iran-nuclear-deal-240641"  target="_blank">all sides implementing their commitments</a>.&nbsp;</p>



<p>Trump&rsquo;s abrupt withdrawal from the JCPOA in 2018 led to the predictable result: Iran&rsquo;s nuclear program surged ahead, breaking free of the deal&rsquo;s constraints. </p>



<p>When Trump returned to office in January, he launched a hasty effort to negotiate a new deal. But it bore a striking resemblance to the deal negotiated by Obama, with one nuclear expert calling the Trump framework a &ldquo;<a href="https://x.com/ArmsControlWonk/status/1929619015561105652"  target="_blank">dollar store JCPOA</a>.&rdquo;</p>



<p>Israeli Prime Minister Netanyahu tanked these talks with airstrikes on June 12. The U.S. launched its own strikes on Iranian nuclear facilities on June 22.&nbsp;</p>



<p>Trump <a href="https://thehill.com/policy/international/5368881-trump-iran-nuclear-deal-talks/"  target="_blank">seems convinced</a> the matter is now resolved. But what will be the fate of the tons of enriched uranium that Iran stockpiled after Trump withdrew from the JCPOA? How much Iranian nuclear infrastructure remains intact? Will Iran ever welcome back intrusive international monitoring of its nuclear activities, such as specified in the JCPOA?</p>



<p>To resolve these questions, the Trump Administration will need to do the tedious, difficult work of pursuing complex negotiations. Talks <a href="https://edition.cnn.com/2025/06/26/politics/us-iran-talks-nuclear-program"  target="_blank">look set</a> to<a href="https://www.bloomberg.com/news/articles/2025-06-25/trump-says-us-iran-to-hold-talks-next-week-mideast-war-over"  target="_blank"> resume</a> next week.</p>



<p>But it will require a high level of technical expertise and diplomatic capacity. And the timing couldn&rsquo;t be worse, as Trump and Elon Musk&rsquo;s culture war on the so-called &ldquo;Deep State&rdquo; has hollowed out and demoralized the ranks of government experts whose support was critical to achieving the JCPOA in the first place.&nbsp;</p>



<p>This sad saga has reminded me of what we&rsquo;ve lost in the Trump era. The JCPOA was a product of effective and principled American diplomacy, undertaken in close coordination with our closest allies. It was a team effort by countless government professionals and specialists, all motivated by patriotism and a sense of mission, and operating in an era where they were celebrated not denigrated. It was a victory of dialogue and diplomacy over bluster and bombs.</p>



<p>Ten years ago that approach delivered results for the American people and the world. I worry about what comes next.</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7297970/iran-nuclear-program-jcpoa-trump/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7297970</post-id>	</item>
		<item>
		<title>The World Is Doubling Down on Climate Business—With Or Without the U.S.</title>
		<link>https://time.com/7298399/london-climate-week-corporate-action/</link>
					<comments>https://time.com/7298399/london-climate-week-corporate-action/#respond</comments>
		
		<dc:creator><![CDATA[Justin Worland / London]]></dc:creator>
		<pubDate>Fri, 27 Jun 2025 19:02:29 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[climate change]]></category>
		<category><![CDATA[healthscienceclimate]]></category>
		<category><![CDATA[Leadership Report]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298399</guid>

					<description><![CDATA[The work goes on, but the U.S. is no longer at the center of the climate universe.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298399"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298399/london-climate-week-corporate-action/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/london-climate-week-finance-sustainability-2025.jpg" alt="View looking along Threadneedle Street past old low rise financial buildings in the City of London on June 3 2025 in London, United Kingdom. "/>



<p>Greetings from London. A week of interviews, events, and meetings&mdash;both on the record and behind closed-doors&mdash;at the city&rsquo;s Climate Action Week has left me with many reflections, but one stands out: the <a href="https://time.com/section/climate/" >climate </a>work goes on, but the U.S. is no longer at the center of the universe. </p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>That reality is evident almost just from the scale. The organizers tout 700 events and 45,000 participants spread across the sprawling London metropolis. This was the biggest London climate week yet, and the first time for many (myself included).&nbsp;</p>



<p>But it was also evident in the meat of the conversations. Investors talked about opportunities outside the U.S., particularly in Asia and Europe. Climate focused executives waffled about how much of a presence they wanted to have at this year&rsquo;s iteration of New York Climate Week, usually an important moment on the climate calendar each September. And British officials emphasized their ability to serve as a global hub for sustainable finance. &ldquo;As investors look around the world and they look for places to put capital, I think we sit in a very good position because of what&#8217;s happening geopolitically,&rdquo; says Chris Hayward, policy chairman of City of London, the historic center of London, now best known as a financial hub. </p>



<p><strong>Read more:</strong> <em><a href="https://time.com/7290141/wmo-climate-report-2c-business-impact/" >How Soon Should Companies Prepare for a 2&deg;C World?</a></em></p>



<p>To get from event to event in London required dashing around the city in the quickest fashion: typically the tube subway system, consistently overheated given the unseasonably hot London temperatures. But the geographic center of the week was undeniably the City of London, the one square mile that hosts the country&rsquo;s premier banking and financial institutions. There&rsquo;s a reason for that: organizers in London see an economic opportunity in supporting the energy transition.&nbsp;</p>



<p>And that&rsquo;s at the core of the global shift visible here in London. The companies that gathered this week have, for the most part, doubled down on efforts to make or save money with climate and sustainability initiatives&mdash;whether that&rsquo;s an industrial company cutting bills with energy efficiency or a financial firm creating new products to allow companies to invest in renewable power.&nbsp;</p>



<p>The reality of this profit-oriented approach means the U.S. will fall behind given the policy uncertainty. The observation was underscored by data released throughout the week. A <a href="https://www.wbcsd.org/resources/business-breakthrough-barometer-2025/"  target="_blank">survey</a> of business executives globally, released by the World Business Council for Sustainable Development (WBCSD) and Bain &amp; Company to coincide with the event, found that large global companies are continuing to invest in green solutions&mdash;but are shifting those investments away from the U.S. toward Europe and Asia. Three quarters of surveyed companies said they were increasingly interested in focusing on those regions.</p>



<p>Even still, that&rsquo;s not to say that climate work in the U.S. is dead. The report from WBCSD found that 50% of companies now have less interest in investing in climate work in the U.S. That&rsquo;s a striking figure when contrasted with the global picture. At the same time, it means a significant fraction of global companies continue to see potential.  </p>



<p><strong>Read more:</strong> <em><a href="https://time.com/7288050/brazil-finance-minister-fernando-haddad-climate-change-interview/" >Brazil&rsquo;s Finance Chief Sees Climate Change as an Economic Opportunity</a></em></p>



<p>In background chats I had, many American business and financial sector leaders were quick to share that they continue to find <a href="https://time.com/7026187/climate-week-corporate-pragmatic-action/" >opportunities</a> to cut emissions in a way that saves them money&mdash;though several expressed fear that talking about it publicly could prompt scrutiny from the administration. &ldquo;Businesses are not giving up on the decarbonization journey,&rdquo; says Peter Bakker, president and CEO of WBCSD, &ldquo;depending on where businesses are stationed, they are more or less willing to talk about it.&rdquo;</p>



<p>And I was surprised by the response to my informal, totally anecdotal poll about this year&rsquo;s New York Climate Week. In conversations, I asked sustainability executives how they planned to approach the gathering this year. While many said they had considered pulling out, the vast majority said that they have ultimately decided they still plan to show up&mdash;perhaps with a smaller footprint than in years past.</p>



<p>The calibration of the message in New York this fall will be interesting, to say the least. In more than a decade on this beat, I have never felt more of a reluctance from business leaders to speak on the record. Many long standing sources preferred to talk without attribution, wary of the political consequences of speaking truthfully even while they eagerly highlighted their work to me.&nbsp;&nbsp;</p>



<p>While that makes it more challenging to clearly tell the full story of what&rsquo;s happening, I suppose it&rsquo;s somewhat good news if your biggest concern is whether companies are still focused on capping emissions.</p>



<p><em>To get this story in your inbox, subscribe to the TIME CO2 Leadership Report newsletter <a href="https://www.time.com/co2-newsletter"  target="_blank" rel="noreferrer noopener">here</a>.</em></p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298399/london-climate-week-corporate-action/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298399</post-id>	</item>
		<item>
		<title>Iran Carries Out String of Executions and Arrests Amid Fears of Infiltration of Israeli Spies</title>
		<link>https://time.com/7298282/iran-israel-war-executions-arrests/</link>
					<comments>https://time.com/7298282/iran-israel-war-executions-arrests/#respond</comments>
		
		<dc:creator><![CDATA[Callum Sutherland]]></dc:creator>
		<pubDate>Fri, 27 Jun 2025 15:12:21 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[Iran]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298282</guid>

					<description><![CDATA[Iran has executed three men convicted of spying for Israel and detained hundreds more civilians in a widening crackdown that rights groups say reflects growing paranoia within the Islamic Republic&#8217;s leadership following a deadly exchange of strikes with Israel. The executions, carried out by hanging in the northwestern city of Urmia, targeted Edris Ali, Azad&#8230;]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298282"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298282/iran-israel-war-executions-arrests/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/GettyImages-2221237993.jpg" alt="Iran And Israel Agree To Ceasefire After Nearly Two Weeks Of Daily Airstrikes"/>



<p><a href="https://time.com/7297123/trump-warns-israel-bombs-iran-ceasefire/" >Iran</a> has executed <a href="https://iranhr.net/en/articles/7682/"  target="_blank">three men</a> convicted of spying for Israel and <a href="https://iranhumanrights.org/2025/06/iran-launches-sweeping-crackdown-hundreds-detained-executions-underway/"  target="_blank">detained hundreds</a> more civilians in a widening crackdown that rights groups say reflects growing paranoia within the Islamic Republic&#8217;s leadership following a deadly exchange of strikes with Israel.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>The executions, carried out by hanging in the northwestern city of Urmia, targeted Edris Ali, Azad Shojaei, and Rasoul Ahmad Rasoul&mdash;ethnic Kurds accused of aiding the Israeli Mossad in the 2020 <a href="https://www.bbc.co.uk/news/world-middle-east-55128970"  target="_blank">assassination</a> of Mohsen Fakhrizadeh, a prominent nuclear scientist. Their names had previously appeared on a <a href="https://iranhr.net/en/articles/7662/"  target="_blank">list published </a>by Iran Human Rights (IHR), an Oslo-based advocacy group, which warned that at least ten men faced imminent execution on similar charges.</p>



<p>The timing of the executions appears intended less to inflame anti-Israel sentiment than to project strength internally, a source familiar with the matter told TIME, describing it as a signal of resolve by a government increasingly consumed with fears of infiltration.</p>



<p>The recent crackdown has also renewed international concern over the fate of Ahmadreza Djalali, a Swedish-Iranian doctor and academic who has spent more than seven years on death row. IHR reported this week that Djalali was moved from Tehran&rsquo;s Evin Prison to <a href="https://abcnews.go.com/International/israeli-strike-damages-tehrans-evin-prison-families-report/story?id=123124238"  target="_blank">an undisclosed location</a> shortly after an Israeli strike on the facility. &ldquo;There is an imminent risk that his death sentence will be carried out at any moment,&rdquo; the group warned.</p>



<p>Since the outbreak of open hostilities with <a href="https://time.com/7293976/israel-iran-attack-war-hezbollah/" >Israel</a> on <a href="https://time.com/7293839/iran-retaliation-israel-attack-what-to-know/" >June 13,</a> Iranian authorities have arrested more than <a href="https://www.iranintl.com/en/202506250530"  target="_blank">700 people</a> on charges related to alleged collaboration with Israel, according to rights monitors. This week&rsquo;s executions bring to six the number of Iranians put to death for espionage since the start of the conflict.</p>



<p><strong>Read more:</strong> <em><a href="https://time.com/7297535/iran-israel-trump-ceasefire-prospects/" >Why Trump Must Now Negotiate With Iran</a></em></p>



<p>Though Iran&rsquo;s government has presented these arrests and executions as evidence of a crackdown on foreign meddling, public sentiment appears to be shifting in a more complex direction. A source in Iran, speaking on condition of anonymity, told TIME that for the first time in decades, &ldquo;widespread hatred&rdquo; toward Israel is growing among ordinary Iranians&mdash;fueled not by government propaganda, but by firsthand <a href="https://www.en-hrana.org/statements/joint-statement-on-the-unlawful-targeting-of-civilians-and-civilian-infrastructure-in-iran/"  target="_blank">experience of violence</a>.</p>



<p>&ldquo;Israel was very willing to kill six Iranian civilians for their [military] target, and that&rsquo;s something which has really made a lot of Iranians angry,&rdquo; the source said. &ldquo;Iranians feel very critical of their own government because it wasn&#8217;t able to defend them&hellip; and at the same time, they&rsquo;re extremely resentful, verging on hatred, toward the Israeli government because of all the civilian deaths.&rdquo;</p>



<p>The Iranian government has become increasingly paranoid about intelligence leaks since its almost two-week long conflict with Israel, which began with <a href="https://time.com/7293795/israel-strikes-iran-attack-what-to-know/" >Israeli attacks</a> on key military and nuclear targets on June 13.</p>



<p>The first strikes <a href="https://time.com/7293886/iranian-generals-scientists-targets-killed-by-israeli-strikes/" >resulted in the deaths</a> of multiple highly ranked military officials and top scientists working on Tehran&rsquo;s nuclear program.</p>



<p><strong>Read more:</strong> <a href="https://time.com/7297022/iran-missiles-trump-attacks/" ><em>Where the U.S. Could Face More Retaliation From Iran</em></a></p>



<p>Israel has previously conducted covert operations and targeted strikes within Iran&rsquo;s borders,  including the high-profile <a href="https://time.com/7006644/israel-iran-gaza-haniyeh-assassination/" >assassination</a> of Hamas political leader Ismael Haniyeh in 2024. </p>



<p>However, the scale and visibility of the latest campaign have been unprecedented. During nearly two weeks of conflict, Israeli missile strikes killed at least 974 Iranians&mdash;including 387 civilians and 268 military personnel&mdash;according to the <a href="https://www.en-hrana.org/the-eleventh-day-of-israeli-strikes-key-developments/"  target="_blank">Human Rights Activists News Agency.</a> Israel reported <a href="https://www.gov.il/en/pages/operation-rising-lion-update"  target="_blank">28 deaths</a> from Iranian missile retaliation.</p>



<p>Though <a href="https://time.com/7297049/iran-israel-ceasefire-trump/" >a cease-fire </a>is now in place, the fallout from the confrontation continues to unfold. Iranian authorities remain focused on rooting out suspected espionage networks, while the public contends with a shifting landscape of fear, anger, and mistrust&mdash;directed both at their own government and at Israel.</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298282/iran-israel-war-executions-arrests/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298282</post-id>	</item>
		<item>
		<title>Thailand Moves to De-Legalize Weed in Major Drug-Policy U-Turn</title>
		<link>https://time.com/7298262/thailand-cannabis-marijuana-weed-recriminalization-delegalization-pheu-thai-new-policy/</link>
					<comments>https://time.com/7298262/thailand-cannabis-marijuana-weed-recriminalization-delegalization-pheu-thai-new-policy/#respond</comments>
		
		<dc:creator><![CDATA[Chad de Guzman]]></dc:creator>
		<pubDate>Fri, 27 Jun 2025 09:15:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[News Desk]]></category>
		<category><![CDATA[overnight]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298262</guid>

					<description><![CDATA[In a major policy U-turn, the Thai government is tightening restrictions on the sale of cannabis just three years after loosening them.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298262"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298262/thailand-cannabis-marijuana-weed-recriminalization-delegalization-pheu-thai-new-policy/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/cannabis-bud-thailand-e1751015847840.jpg" alt="Marijuana flowers are pictured for sale at a cannabis store along Khao San Road in Bangkok, Thailand, on May 23, 2025."/>



<p>In 2022, Thailand bucked a trend in Asia. While many other countries in the region have historically meted out <a href="https://time.com/6301702/singapore-death-penalty-drug-cases/" >harsh punishments</a> for drug use and even <a href="https://time.com/6251453/hong-kong-cbd-ban-facts/" >tightened restrictions</a> in recent years, Thailand became the continent&rsquo;s first to <a href="https://time.com/6187449/southeast-asia-drugs-thailand/" >remove marijuana from its list of illegal narcotics</a>.&nbsp;</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>Since then, marijuana production and sale became a sprawling national industry, spawning around <a href="https://weed.th/"  target="_blank">11,000</a> dispensaries, sourcing from farms across the country. The industry, which also helped Thailand become a tourist haunt for those looking to access the substance, was estimated in 2022 to hit <a href="https://www.bloomberg.com/news/articles/2022-07-21/cannabis-market-in-thailand-seen-growing-to-1-2-billion-by-2025"  target="_blank">$1.2 billion</a> by 2025.</p>



<p>Now, however, the Thai government is harshing that buzz as it moved to restrict access to the drug.</p>



<p>Public Health Minister Somsak Thepsutin signed an order Monday, which took effect this week, that reclassified cannabis buds as a controlled herb and banned shops from selling cannabis to customers without a prescription. A version of the policy is now available on the <a href="https://ratchakitcha.soc.go.th/documents/76076.pdf"  target="_blank">Thai Royal Gazette online</a>.</p>



<p>But Somsak isn&rsquo;t stopping there: he <a href="https://www.nationthailand.com/news/politics/40051671"  target="_blank">vowed</a> to reclassify cannabis as a Category 5 narcotic&mdash;effectively recriminalizing its recreational use.</p>



<p>While the government says that this was a move to protect children and youth, who <a href="https://world.thaipbs.or.th/detail/explainer-everything-you-need-to-know-about-thailands-cannabis-rule-change/57878"  target="_blank">reportedly suffer</a> because of increased access, critics and activists say that political infighting has played a key role in the tightening of marijuana policies, at the expense of small businesses.</p>



<h2 class="wp-block-heading">What does the new order say?</h2>



<p>The new order requires licenses for those who wish to study, export, sell, or process cannabis buds for commercial reasons. They must report data on the source, use, and amount of cannabis that they possess&mdash;and the cannabis buds should be sourced from a producer that meets the Department for Development of Thai Traditional and Alternative Medicine&rsquo;s Good Agricultural and Collection Practices (GACP) standards.</p>



<p>Cannabis can no longer be sold through vending machines, electronic channels, or computer networks. It and its derivative products cannot be sold in religious sites, dormitories, public parks, zoos, and amusement parks. It can also no longer be advertised.</p>



<p>The sale of cannabis for smoking in cannabis business establishments will also be banned unless sold by medical practitioners, including Thai and Chinese medicine practitioners and dentists, for the treatment of their patients. Prescriptions from medical professionals will be accepted, though they must specify the amount of drug, which should not exceed 30-day use.</p>



<p>Violators may face up to a year in prison and a 20,000-baht fine. </p>



<figure class="wp-block-gutenberg-custom-blocks-inline-image"><img decoding="async" src="https://api.time.com/wp-content/uploads/2025/06/cannabis-store-thailand.jpg" alt="Trippy Nation legal cannabis storefront in the Sukhumvit district near Soi Cowboy in central Bangkok, Thailand" alignment="original-size-image"/><p class="article_header"></p><p class="article_subheading"></p><p class="article_text"></p></figure>



<h2 class="wp-block-heading">How is politics involved?</h2>



<p>Decriminalization in 2022 was <a href="https://time.com/6273768/anutin-charnvirakul-interview-cannabis/" >pushed by then-Health Minister Anutin Charnvirakul</a>, who ran for Prime Minister in 2023 as head of the Bhumjaithai Party but lost.</p>



<p>Bhumjaithai did, however, join the governing coalition of Pheu Thai, the populist party that ended up taking power but that had campaigned on recriminalizing marijuana.</p>



<p>Since the removal of cannabis from the illegal narcotics list, no comprehensive law regulating its use was passed. This allowed the quick, albeit <a href="https://time.com/6208192/thailand-war-on-drugs-weed-legal/" >legally complex, boom of marijuana businesses</a>, but authorities say it also facilitated the smuggling of marijuana, reaching countries as far as the <a href="https://www.independent.co.uk/travel/news-and-advice/thailand-british-tourists-cannabis-smuggling-b2757794.html"  target="_blank">United Kingdom</a> and <a href="https://indianexpress.com/article/cities/mumbai/marijuana-women-arrested-8-5cr-thailand-india-10047248/"  target="_blank">India</a>.</p>



<p>Following tensions over a Cabinet seat and a <a href="https://time.com/7294994/thailand-cambodia-border-dispute-hun-sen-thaksin-paetongtarn-history-explainer/" >border-dispute flareup with Cambodia</a>, the Bhumjaithai Party left the coalition earlier this month, raising concerns that Pheu Thai Prime Minister Paetongtarn Shinawatra&rsquo;s <a href="https://time.com/7295978/thailand-paetongtarn-shinawatra-government-collapse-coup-cambodia-economy-democracy-analysis/" >rule may end</a>.&nbsp;</p>



<p>But as Paetongtarn clings to power for now, Bhumjaithai leaving the coalition has allowed Pheu Thai to pursue its promises of restricting the use of marijuana to medical purposes only.</p>



<p>The Thai public has <a href="https://time.com/6992859/thailand-cannabis-criminalization-public-survey/" >viewed marijuana negatively</a>, with a 2024 poll showing a <a href="https://www.nationthailand.com/news/general/40038141"  target="_blank">majority in favor of relisting it as a narcotic</a>.</p>



<h2 class="wp-block-heading">How has the industry reacted?</h2>



<p>Speaking to the <a href="https://www.bangkokpost.com/thailand/general/3059036/cannabis-dreams-go-up-in-smoke"  target="_blank"><em>Bangkok Post</em></a>, small- and medium-sized cannabis growers said the tightening of restrictions will force some farms to close.</p>



<p>A producer named Somkiat Nitiketkosol told the paper that such stringent requirements would also open the floodgates for corrupt practices: &ldquo;Most permits are going to big players, while small farmers like me are left waiting or falling victim to scams.&rdquo;</p>



<p>Chokwan Chopaka, a Thai cannabis activist who leads Writing Thailand&rsquo;s Cannabis Future Network&mdash;a group of users, business owners, and producers of the plant&mdash;said they plan to protest the order. Chokwan argues that businesses will not disappear overnight following the new rules, which will only push sales of the drug underground.</p>



<p>&ldquo;Thailand had always been known for <em>sabai sabai</em> [easygoing, lax] culture where many illegal products from sex toys, prescription drugs, vape pens, illegal money exchange, and sex workers are readily available on the side of the road to service all types of tourist, together with well organised groups, to supply and manage those products locally (massage parlour, gogobars, illegal gambling house etc.),&rdquo; she tells TIME. &ldquo;With the new announcement, cannabis will be just but another thing that will go back to being managed by the corrupt underground system.&rdquo;</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298262/thailand-cannabis-marijuana-weed-recriminalization-delegalization-pheu-thai-new-policy/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298262</post-id>	</item>
		<item>
		<title>What the Israel-Iran War and Ceasefire Mean for China’s Relations With the U.S. and World</title>
		<link>https://time.com/7298254/china-us-diplomacy-military-intervention-taiwan-israel-iran-war-ceasefire/</link>
					<comments>https://time.com/7298254/china-us-diplomacy-military-intervention-taiwan-israel-iran-war-ceasefire/#respond</comments>
		
		<dc:creator><![CDATA[Miranda Jeyaretnam]]></dc:creator>
		<pubDate>Fri, 27 Jun 2025 08:35:00 +0000</pubDate>
				<category><![CDATA[Uncategorized]]></category>
		<category><![CDATA[News Desk]]></category>
		<category><![CDATA[overnight]]></category>
		<guid isPermaLink="false">https://time.com/?p=7298254</guid>

					<description><![CDATA[Trump’s leadership style evinced with the Middle East, at once volatile and commanding, could be both an obstacle and an opportunity for Beijing.]]></description>
										<content:encoded><![CDATA[
<aside class="right-rail__container right-rail__container--ad"><div class="right-rail__ad__wrapper right-rail__module"><div class="right-rail__ad" id="right-rail__ad-7298254"></div></div>
<div class="OUTBRAIN right-rail__outbrain right-rail__module" data-src="https://time.com/7298254/china-us-diplomacy-military-intervention-taiwan-israel-iran-war-ceasefire/" data-widget-id="SB_2" data-ob-template="timemag"></div></aside>

<img decoding="async" class="wp-block-gutenberg-custom-blocks-featured-media" src="https://api.time.com/wp-content/uploads/2025/06/china-military.jpg" alt="Man looking at a submarine"/>



<p>Donald Trump&rsquo;s <a href="https://time.com/7297452/trump-doctrine-vance-peace-through-strength-america-first-presidents-history/" >leadership style</a>, at once volatile and commanding, could be both an obstacle and an opportunity for Beijing.</p>



<p>There might be no better example than the recent events involving the Middle East: After nearly two weeks of <a href="https://time.com/7294609/iran-israel-war-pictures-strike/" >traded attacks between Israel and Iran</a>, the President made the controversial decision to <a href="https://time.com/7296469/u-s-strikes-iran-nuclear-trump-war/" >authorize U.S. strikes</a> on three Iranian nuclear facilities, risking prolonged American involvement in yet another unpopular war in the Middle East. Then just two days later, Trump announced that he had <a href="https://time.com/7297049/iran-israel-ceasefire-trump/" >brokered a ceasefire</a> between Israel and Iran&mdash;one that <a href="https://time.com/7297098/israel-iran-ceasefire-broken-missile-strikes-tehran/" >almost collapsed</a> but then appeared to hold as Trump let off an <a href="https://time.com/7297315/ceasefire-iran-israel-trump-f-bomb/" >expletive-filled rant</a> against both countries, warning Israel not to drop more bombs.</p>
[time-brightcove not-tgx=&#8221;true&#8221;]




<p>Trump even boasted of the benefits his truce would bring to other countries.</p>



<p>&ldquo;China can now continue to purchase Oil from Iran,&rdquo; Trump <a href="https://truthsocial.com/@realDonaldTrump/posts/114738521695017472"  target="_blank">posted</a> on Truth Social on Tuesday. &ldquo;Hopefully, they will be purchasing plenty from the U.S., also. It was my Great Honor to make this happen!&rdquo;</p>



<p>Trump&rsquo;s comments came after Secretary of State Marco Rubio <a href="https://www.youtube.com/watch?v=APD5gNeIJjY&amp;t=1095s"  target="_blank">said</a> on Fox News on Sunday that he had encouraged China to advise Iran not to close the <a href="https://time.com/7296861/strait-of-hormuz-function-iran-closure-threat-impact-trade/" >Strait of Hormuz</a>&mdash;the narrow waterway through which much of the world&rsquo;s oil trade flows through and which Iran had threatened to close in response to U.S. intervention. China relies on crude oil imports from the Middle East, particularly Saudi Arabia, which pass through the strait, but is also the largest importer of Iranian oil, which is under economic sanctions by the U.S.</p>



<p>Reports suggested that Trump&rsquo;s post indicated possible sanctions relief, but the White House later <a href="https://edition.cnn.com/world/live-news/israel-iran-conflict-us-trump-06-25-25-intl-hnk#cmcc2fl2h001b3b6qv8l08mf2"  target="_blank">clarified</a> to media outlets: &ldquo;The president was simply calling attention to the fact that, because of his decisive actions to obliterate Iran&rsquo;s nuclear facilities and broker a ceasefire between Israel and Iran, the Strait of Hormuz will not be impacted, which would have been devastating for China.&rdquo;</p>



<p>China, unlike the U.S. with Israel, made no indication that it would step in to militarily assist its longtime friend Iran. Instead, the Asian nation, which has in recent years tried to <a href="https://time.com/6262985/china-saudi-arabia-iran-ukraine-peace-talks/" >position itself as a global peacebroker</a>, made fervent calls for deescalation, verbal condemnations of Israel&rsquo;s attacks, and <a href="https://time.com/7296139/china-iran-israel-us-weapons-mediate-war-peace-oil-diplomacy/" >urged the U.S. not to get involved</a>. Ultimately, though, China&rsquo;s offers to mediate were not taken up, and instead it was&mdash;at least according to himself&mdash;Trump&rsquo;s strongman stance that managed to bring an <a href="https://time.com/7297049/iran-israel-ceasefire-trump/" >end for now</a> to the hostilities between Israel and Iran.</p>



<p>But experts tell TIME it was no surprise to anyone, including China, that only the U.S. could have brought an end to the war.</p>



<p>&ldquo;It is not surprising that Israel signs a cease-fire when the United States applies real pressure, because they could not pursue any conflict, in Iran or in Gaza, without the continual supply of weapons, ammunition, and military tech from the United States,&rdquo; says William Figueroa, an assistant professor of international relations at the University of Groningen. &ldquo;When the person signing the checks says they really mean it, you listen.&rdquo;</p>



<p>While China has deepened its investment in the Middle East over the years and developed close economic ties with Iran while maintaining ties with Israel, it does not hold the same level of either economic or political leverage over either country as the U.S.&nbsp;</p>



<p>&ldquo;Iran sees China more as an economic partner than a security ally,&rdquo; Lin Jing, a research fellow at the Middle East Institute at the National University of Singapore, tells TIME.</p>



<p>China has also offered sharp criticisms of Israel&rsquo;s bombardment of Gaza, and of its attacks on Iran, which would have made it unlikely for Israel to accept it as a mediator. China seemed to know this, Figueroa says, and was instead pushing the U.S. to exert its influence over Israel to end the war.</p>



<p>Still, experts say, China will learn from how the war and its ceasefire played out, if only to reinforce its view of the U.S. as an unpredictable power.</p>



<p>And Rubio will <a href="https://www.scmp.com/news/us/diplomacy/article/3316003/marco-rubio-welcome-asian-quad-counterparts-back-washington?module=top_story&amp;pgtype=homepage"  target="_blank">meet</a> next week with foreign ministers from Australia, India, and Japan to build on &ldquo;momentum to advance a free, open, and secure Indo-Pacific&rdquo;&mdash;language that suggests the U.S. wants to return focus to countering the regional threat from China.</p>



<h2 class="wp-block-heading">Strikes reinforce Chinese view of U.S. instability</h2>



<p>China already saw the U.S. under the Trump Administration as an unstable partner, particularly after Trump <a href="https://time.com/7274195/trump-reciprocal-tariffs-world-responses-china-eu-countries-leaders-countermeasures/" >slammed the world</a> with <a href="https://time.com/7274194/trump-reciprocal-tariffs-highest-country-rates-calculation-math-imports-exports/" >staggering tariff rates</a> before <a href="https://time.com/7276293/trump-tariffs-reversal-world-leaders-countries-responses-uncertainty-trade-war/" >abruptly reversing course</a>.</p>



<p><a href="https://time.com/7275987/trump-tariffs-global-economy-recession-trade-war-asia-world-impacts/" >Trump&rsquo;s tariffs</a> &ldquo;were accelerating a trend of Chinese businesses looking more and more overseas,&rdquo; Figueroa says. China <a href="https://time.com/7277920/china-manufacturing-us-trump-factory-workers-ai-videos-social-media/" >exports heavily</a> to U.S. markets, and Trump&rsquo;s <a href="https://time.com/7292207/us-china-trade-war-trump-tariffs-timeline/" >tariffs on China</a>&mdash;which rose to a prohibitive 145% before being temporarily lowered to 30%&mdash;<a href="https://time.com/7286933/trump-trade-war-us-china-tariff-pause-businesses-costs-uncertainty/" >left many Chinese and American businesses in a state of uncertainty</a>.</p>



<p>Chinese President Xi Jinping has made attempts to strengthen trade relations with other countries in recent months, assuring the world of its stability as a trading partner in contrast with the U.S. In a meeting with Singaporean Prime Minister Lawrence Wong this week, Xi <a href="https://asia.nikkei.com/Politics/International-relations/Singapore-seeks-stronger-China-ties-amid-uncertainty-over-Trump-tariffs"  target="_blank">pointed</a> to &ldquo;the current complex and turbulent international situation&rdquo; to emphasize the need for closer ties.</p>



<p>The Middle East too has become an important market and site of diplomacy for China. Figueroa says U.S. backing of Israel &ldquo;will only intensify the trend of China leaning towards the Arab states and linking regional instability to the United States and Israel.&rdquo;</p>



<p>That the U.S. intervened to strike Iranian nuclear facilities, potentially <a href="https://time.com/7297464/nuclear-diplomacy-iran-us-strikes-damage-non-proliferation-treaty-weapon/" >upending decades of global nuclear diplomacy</a>, &ldquo;reinforces [China&rsquo;s] view of the U.S. as a disruptive power, intent on setting rules, but not following them when inconvenient,&rdquo; Lin says.</p>



<p>Isaac Kardon, a senior fellow for China studies at the Carnegie Endowment for International Peace, <a href="https://www.scmp.com/news/china/diplomacy/article/3315690/are-trumps-iran-strikes-wake-call-china-us-unpredictability?module=top_story&amp;pgtype=homepage"  target="_blank">told</a> the <em>South China Morning Post</em> that the U.S. strikes on Iran might ring alarm bells for China. American escalation showed China that &ldquo;massive use of force actually is &lsquo;on the table&rsquo; and may be employed very quickly and even impulsively by a leader who is showing himself to be less gun-shy and more risk-acceptant than his first term,&rdquo; Kardon said.</p>



<p>China&rsquo;s approach to the Israel-Iran war showed that it wanted to &ldquo;avoid direct confrontation with the U.S.,&rdquo; Lin, the Singapore-based researcher, adds. While China <a href="https://www.fmprc.gov.cn/mfa_eng/xw/fyrbt/202506/t20250617_11651839.html"  target="_blank">urged</a> &ldquo;countries with special influence on Israel&rdquo; not to fan the flames of the war, it did not explicitly name the U.S. But having seen that the U.S. is willing to engage militarily, China may recalculate its own foreign policy approach, including over Taiwan, Lin says.</p>



<p>&ldquo;China may also look a bit more skeptically at Trump&rsquo;s efforts to negotiate, having seen where negotiations got Iran,&rdquo; Figueroa says.</p>



<p>At the same time, Lin says protracted U.S. involvement in the Middle East, which may result as the U.S. aims to enforce the ceasefire between Tehran and Tel Aviv while <a href="https://edition.cnn.com/2025/06/26/politics/us-iran-talks-nuclear-program"  target="_blank">reentering diplomatic talks with Iran</a> and <a href="https://www.timesofisrael.com/netanyahu-trump-said-working-on-plan-to-end-gaza-war-and-expand-abraham-accords/"  target="_blank">pushing Israel to end its war in Gaza</a>, could advantage China &ldquo;by drawing its attention away from Asia.&rdquo;</p>



<p>&ldquo;U.S. power is finite&mdash;political bandwidth and strategic bandwidth is also limited,&rdquo; Mohammed Alsudairi, an international relations lecturer at the Australian National University, <a href="https://www.washingtonpost.com/world/2025/06/24/iran-israel-us-china/"  target="_blank">told</a> the <em>Washington Post</em>. &ldquo;The U.S. could be dragged into a quagmire, not of its own making.&rdquo;</p>



<p>And Beijing would support such a quagmire, Kardon told <em>SCMP</em>, as it would &ldquo;keep U.S. naval and air forces tied up in Western Asia instead of in the Western Pacific where China&rsquo;s strategic attention is concentrated.&rdquo;</p>



<h2 class="wp-block-heading">Uncertainty around Taiwan</h2>



<p>Tensions around Taiwan have been <a href="https://time.com/6251419/us-china-general-war-2025/" >on the rise in recent years</a>. Beijing <a href="https://www.reuters.com/world/china/china-taiwan-clash-over-history-beijing-says-cant-invade-what-is-already-chinese-2025-06-25/"  target="_blank">views Taiwan as part of China</a> and has stepped up political and military pressure towards its reunification with mainland China. A majority of countries do not recognize Taiwan as an independent country, including the U.S., although the U.S. opposes the use of force by Beijing to claim Taiwan and provides Taiwan with defensive military capabilities.</p>



<p>Taiwan&rsquo;s Defense Minister Wellington Koo <a href="https://www.reuters.com/world/china/chinas-military-vows-boost-combat-readiness-after-taiwan-president-speeches-2025-06-26/"  target="_blank">said</a> Thursday that the island is determined to defend itself, after outlining annual military exercises for July. The defense ministry reported earlier that day <a href="https://www.reuters.com/world/china/taiwan-accuses-china-carrying-out-provocative-military-patrol-near-island-2025-06-06/"  target="_blank">another</a> Chinese &ldquo;joint combat readiness patrol&rdquo; around Taiwan, involving warships and warplanes. China previously <a href="https://www.bloomberg.com/news/articles/2025-06-20/china-sends-warplanes-near-taiwan-after-us-lawmakers-visit"  target="_blank">sent</a> 46 military aircraft over the Taiwan Strait in the 24 hours before last Friday morning, according to <a href="https://x.com/MoNDefense/status/1935865206892380258?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1935865206892380258%7Ctwgr%5E1913e36c1f4e440fab3bfa21b7f70a659de9a989%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2025-06-20%2Fchina-sends-warplanes-near-taiwan-after-us-lawmakers-visit"  target="_blank">Taiwan&rsquo;s defense ministry</a>, after U.S. lawmakers <a href="https://www.bloomberg.com/news/articles/2025-06-18/us-lawmakers-talks-with-top-taiwan-official-risks-irking-china"  target="_blank">met</a> with Koo in a rare publicly disclosed meeting.</p>



<figure class="wp-block-gutenberg-custom-blocks-inline-image"><img decoding="async" src="https://api.time.com/wp-content/uploads/2025/06/taiwan-drills.jpg" alt="Taiwan Coast Guard holds joint forces drill amid tensions with Beijing" alignment="original-size-image"/><p class="article_header"></p><p class="article_subheading"></p><p class="article_text"></p></figure>



<p>On the morning of June 20, Taiwan <a href="https://www.aljazeera.com/news/2025/6/20/taiwan-detects-dozens-of-chinese-aircraft-near-island-after-uk-ship-patrol"  target="_blank">detected</a> a spike in Chinese movements near the island, after China <a href="http://eng.mod.gov.cn/xb/News_213114/NewsRelease/16392429.html"  target="_blank">criticized</a> a British navy vessel <a href="http://www.reuters.com/world/china/uk-royal-navy-vessel-sails-through-taiwan-strait-2025-06-19/"  target="_blank">patrolling</a> the Taiwan Strait for the first time since 2021.</p>



<p>&ldquo;No matter what they say or do, they cannot change the fact that Taiwan is part of China,&rdquo; Chinese foreign ministry spokesperson Guo Jiakun <a href="https://www.fmprc.gov.cn/eng/xw/fyrbt/lxjzh/202506/t20250620_11654061.html"  target="_blank">said</a>.</p>



<p>China&rsquo;s defense ministry <a href="http://www.mod.gov.cn/gfbw/xwfyr/jt/16393591.html"  target="_blank">said</a> on Thursday that its military drills are &ldquo;necessary to defend national sovereignty and territorial integrity, and a stern warning to &lsquo;Taiwan independence&rsquo; separatists and external interference.&rdquo; The ministry <a href="http://www.mod.gov.cn/gfbw/xwfyr/lxjzh_246940/16393525.html"  target="_blank">added</a> that U.S. support of Taiwan could &ldquo;mislead Taiwan into the flames of war.&rdquo;</p>



<p>Qi Dongtao, a senior research fellow at the East Asian Institute at the National University of Singapore, tells TIME that Trump&rsquo;s approach to China makes it difficult to know whether the U.S. would militarily intervene to defend Taiwan. Former President Joe Biden moved the U.S. from &ldquo;strategic ambiguity&rdquo;&mdash;the policy of deliberately not clarifying whether the U.S. would militarily defend Taiwan&mdash;to &ldquo;strategic clarity,&rdquo; Qi says. On <a href="https://www.taipeitimes.com/News/front/archives/2024/06/06/2003818938"  target="_blank">multiple occasions</a>, including in an <a href="https://time.com/6984968/joe-biden-transcript-2024-interview/" >interview with TIME last year</a>, Biden said he wouldn&rsquo;t rule out &ldquo;using military force&rdquo; to defend Taiwan in the case of an invasion.</p>



<p>But Trump has <a href="https://time.com/7262281/us-taiwan-relations-trump-china-strategic-ambiguity-anxious-uncertainty-explainer/" >moved the U.S. position back towards uncertainty</a>.</p>



<p>Trump is, by and large, &ldquo;not ideologically driven,&rdquo; Qi says. Rather, his approach is &ldquo;transactional.&rdquo;</p>



<p>Trump Administration officials have also <a href="https://www.reuters.com/world/asia-pacific/taiwan-needs-hike-defense-spending-10-gdp-pentagon-nominee-2025-03-04/"  target="_blank">demanded</a> that Taiwan increase its defense spending to as much as 10% of its gross domestic product, as part of an <a href="https://www.reuters.com/world/asia-pacific/japan-scraps-us-meeting-after-washington-demands-more-defense-spending-ft-2025-06-20/"  target="_blank">overall push</a> for the U.S.&rsquo; partners to spend more on their own defenses.</p>



<p>Alexander Gray, a senior fellow at the Atlantic Council and former chief of staff of the National Security Council during Trump&rsquo;s first term, <a href="https://asia.nikkei.com/Spotlight/Policy-Asia/Iran-war-and-Trump-doctrine-blur-China-s-multipolar-vision"  target="_blank">told</a> Nikkei Asia that Israel&rsquo;s aerial campaign was &ldquo;the ultimate example of America First regional burden sharing&rdquo;&mdash;signalling that the Trump Administration expects its regional partners to do a bulk of the fighting.</p>



<p>&ldquo;For Trump, China is mainly an economic threat,&rdquo; Qi adds. For the most part, &ldquo;Trump doesn&rsquo;t want to fight a war with China.&rdquo;</p>



<h2 class="wp-block-heading">World still views China as a security concern</h2>



<p>NATO Secretary-General Mark Rutte <a href="https://www.scmp.com/news/china/diplomacy/article/3315549/beijings-massive-build-raises-threat-taiwan-strait-conflict-nato-chief"  target="_blank">said</a> Monday that NATO&rsquo;s Indo-Pacific partners&mdash;which includes Japan and South Korea&mdash;were &ldquo;very, very aware&rdquo; of China&rsquo;s &ldquo;massive&rdquo; military expansion, pointing to several Chinese defense companies that rank among the top arms makers globally. He warned that Chinese military expansion could also impact European security.</p>



<p>&ldquo;They don&rsquo;t do this only because they want to have nice parades in Beijing. I guess it&rsquo;s there for a reason,&rdquo; Rutte said. He pointed to &ldquo;the situation in Taiwan&rdquo; and cautioned that should China &ldquo;try anything with Taiwan,&rdquo; Beijing could rely on Russia to &ldquo;keep us busy here&rdquo; in Europe.</p>



<p>Rutte&rsquo;s comments signal that the West still views China mainly as a geopolitical security threat, even as Beijing tries to warm ties with Europe.</p>



<p>&ldquo;We firmly oppose NATO using China as an excuse to expand eastward into the Asia-Pacific and urge NATO to reflect on its own behaviors, change course, and contribute more to global security and stability,&rdquo; Chinese defense spokesperson Senior Colonel Zhang Xiaogang <a href="http://eng.mod.gov.cn/xb/News_213114/NewsRelease/16393598.html"  target="_blank">said</a> at a regular press conference on Thursday.</p>



<p>&ldquo;China wants to be seen as a neutral player,&rdquo; Lin says. But the U.S. is still &ldquo;the dominant power in the region&rdquo; and by most counts the world, whereas China is a &ldquo;relatively recent entry&rdquo; diplomatically and economically to the Middle East.</p>



<p>Even with some upgraded diplomatic ties in the Middle East, China is viewed mainly as an economic player, Lin adds. That informs China&rsquo;s need to balance its interests in and ties to several countries at once. If China were seen as &ldquo;too passive or too close to Iran,&rdquo; for example, &ldquo;it could limit China&rsquo;s Belt and Road ambitions in the region.&rdquo;</p>



<p>With other nations too, China is seen as a major economic player, but taken with a grain of salt with regards to diplomacy.</p>



<p>&ldquo;It is clear that China is one of the largest trading partners, and we have a few issues like climate change where we cooperate, but every relationship requires a dose of realism,&rdquo; European Union foreign policy chief Kaja Kallas <a href="https://www.scmp.com/news/china/article/3315553/eu-foreign-policy-chief-calls-dose-realism-china-relations"  target="_blank">told</a> reporters Monday after a meeting between E.U. foreign ministers. &ldquo;China is the key enabler of Russia&rsquo;s war against Ukraine. It carries out cyberattacks. It interferes in our democracies. It uses coercive trade practices. These aspects strain our relationship and make it increasingly hard to continue as before.&rdquo;</p>



<p>Even in the economic arena, China&rsquo;s relations have faltered. The E.U. earlier this month <a href="https://www.ft.com/content/81700fc4-8f23-4bec-87e9-59a83f215431"  target="_blank">cancelled</a> a flagship economic meeting with China over ongoing trade disputes.</p>



<p>U.S. sanctions have spurred collaboration between China, Russia, Iran, and North Korea, including through setting up international collaborative organizations like BRICS as alternatives to a U.S.-led international order. But the global influence of these organizations is hampered by a lack of &ldquo;sufficient critical mass,&rdquo; Stephen Olson, a visiting senior fellow at the ISEAS Yusof Ishak Institute, <a href="https://asia.nikkei.com/Spotlight/Policy-Asia/Iran-war-and-Trump-doctrine-blur-China-s-multipolar-vision"  target="_blank">told</a> Nikkei Asia. In another blow to China&rsquo;s push to become a regional leader, India on Thursday <a href="https://apnews.com/article/china-india-meeting-statement-refusal-67bfc09a329e93b9c721029c36e31176"  target="_blank">rejected</a> signing a joint statement facilitated by the Shanghai Cooperation Organization&mdash;one such grouping set up by China and Russia to counter U.S. influence.</p>



<h2 class="wp-block-heading">Israel-Iran conflict was &ldquo;a stage&rdquo; for U.S. and China&rsquo;s contrasting approaches</h2>



<p>China&rsquo;s continued policy of non-involvement contrasts sharply with what the world has seen from the U.S. in the past week&mdash;not to mention decades of its interventionist approach before Trump&mdash;which has allowed China to make &ldquo;great strides particularly in the Global South,&rdquo; Lin tells TIME. That&rsquo;s intentional, Lin says, lest China lets itself become &ldquo;indistinguishable from the hegemonic powers it criticizes.&rdquo;</p>



<p>&ldquo;This conflict between Iran and Israel has somehow become a stage for China and the U.S. to showcase contrasting visions of global leadership,&rdquo; Lin says. &ldquo;The U.S. has demonstrated its military capabilities, its commitment to allies, and its influence in crisis management. But these are not the metrics by which China measures its global role.&rdquo;</p>



<p>Where the U.S. wielded threats and weapons, China offered words.</p>



<p>&ldquo;China&rsquo;s main stake is stability,&rdquo; Lin says. &ldquo;History shows that great power involvement often worsens long-term instability. China does not aspire to become a world policeman, nor does it believe any single country should assume that role.&rdquo;</p>
]]></content:encoded>
					
					<wfw:commentRss>https://api.time.com/7298254/china-us-diplomacy-military-intervention-taiwan-israel-iran-war-ceasefire/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		<post-id xmlns="com-wordpress:feed-additions:1">7298254</post-id>	</item>
	</channel>
</rss>
