{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:foaf":"http://xmlns.com/foaf/0.1/","@xmlns:og":"http://ogp.me/ns#","@xmlns:rdfs":"http://www.w3.org/2000/01/rdf-schema#","@xmlns:schema":"http://schema.org/","@xmlns:sioc":"http://rdfs.org/sioc/ns#","@xmlns:sioct":"http://rdfs.org/sioc/types#","@xmlns:skos":"http://www.w3.org/2004/02/skos/core#","@xmlns:xsd":"http://www.w3.org/2001/XMLSchema#","@xmlns:media":"http://search.yahoo.com/mrss/","@version":"2.0","@xml:base":"https://www.nist.gov/","channel":{"title":"Cybersecurity Insights","link":"https://www.nist.gov/","description":"Cybersecurity Insights blog posts","language":"en","atom:link":{"@href":"https://www.nist.gov/blogs/cybersecurity-insights/rss.xml","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"New Year, New Initiatives for the NIST Privacy Framework!","link":"https://www.nist.gov/blogs/cybersecurity-insights/new-year-new-initiatives-nist-privacy-framework","description":"  It’s been four years since the release of The NIST Privacy Framework: A Tool for Improving Privacy Through Enterprise Risk Management, Version 1.0. Since then, many organizations have found it highly valuable for building or improving their privacy programs. We’ve also been able to add a variety of resources to support its implementation. We’re proud of how much has been accomplished in just a few short years, but we’re not resting on our laurels. As another, more famous, Dylan once said, “the times they are a-changin’.” For example, the past year has seen the release of the NIST AI Risk\n\n","pubDate":"Thu, 25 Jan 2024 12:00:00 +0000","dc:creator":"Dylan Gilbert","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1837676"}},{"title":"Privacy Attacks in Federated Learning","link":"https://www.nist.gov/blogs/cybersecurity-insights/privacy-attacks-federated-learning","description":"  This post is part of a series on privacy-preserving federated learning. The series is a collaboration between NIST and the UK government’s Centre for Data Ethics and Innovation. Learn more and read all the posts published to date at NIST’s Privacy Engineering Collaboration Space or the CDEI blog . Our first post in the series introduced the concept of federated learning—an approach for training AI models on distributed data by sharing model updates instead of training data. At first glance, federated learning seems to be a perfect fit for privacy since it completely avoids sharing data\n\n","pubDate":"Wed, 24 Jan 2024 12:00:00 +0000","dc:creator":"Joseph Near, David Darais, Dave Buckley, Mark Durkee ","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1837591"}},{"title":"Journey into the Immersive Frontier: Preliminary NIST Research on Cybersecurity and Privacy Standards for Immersive Technologies","link":"https://www.nist.gov/blogs/cybersecurity-insights/journey-immersive-frontier-preliminary-nist-research-cybersecurity-and","description":"  Words like “metaverse” and “augmented reality” may conjure up thoughts of friends in headsets wielding virtual sabers or folks roaming the streets at night in search of PokéStops. Virtual, augmented, and mixed reality technologies (“immersive technologies”) have entered the popular conscience thanks in part to the success of games, but their applications go well beyond new experiences in entertainment. They are already being utilized to increase access to education , improve manufacturing , bolster accessibility , and train workforces in healthcare and retail . Immersive technologies have the\n\n","pubDate":"Thu, 11 Jan 2024 12:00:00 +0000","dc:creator":"Dylan Gilbert, Michael Fagan","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1835636"}},{"title":"A Note on progress…NIST’s Digital Identity Guidelines.","link":"https://www.nist.gov/blogs/cybersecurity-insights/note-progressnists-digital-identity-guidelines","description":"  In August 2023 the Digital Identity Guidelines team hosted a two-day workshop to provide a public update on the status of revision 4. As part of that session, we committed to providing further information on the status of each volume going forward. In fulfillment of this commitment, we wanted to offer a quick update on where we stand. Our goal remains to have the next version of each volume out by the Spring of 2024. With our gratitude for the robust and substantive engagement we received during the comment period, at this time we would like to announce that all four volumes of Special\n\n","pubDate":"Tue, 12 Dec 2023 12:00:00 +0000","dc:creator":"Ryan Galluzzo, David Temoshok, Andrew Regenscheid, Connie LaSalle","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1832951"}},{"title":"The UK-US Blog Series on Privacy-Preserving Federated Learning: Introduction","link":"https://www.nist.gov/blogs/cybersecurity-insights/uk-us-blog-series-privacy-preserving-federated-learning-introduction","description":"  This post is the first in a series on privacy-preserving federated learning. The series is a collaboration between CDEI and NIST. Advances in machine learning and AI, fueled by large-scale data availability and high-performance computing, have had a significant impact across the world in the past two decades. Machine learning techniques shape what information we see online, influence critical business decisions, and aid scientific discovery, which is driving advances in healthcare, climate modelling, and more. Training Models: Conventional vs Federated Learning The standard way to train\n\n","pubDate":"Thu, 07 Dec 2023 12:00:00 +0000","dc:creator":"Joseph Near, David Darais, Naomi Lefkovitz, Dave Buckley","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1832656"}},{"title":"NCCoE 5G Cybersecurity: Connecting the Dots Between IT and Teleco Cybersecurity Capabilities in 5G Systems","link":"https://www.nist.gov/blogs/cybersecurity-insights/nccoe-5g-cybersecurity-connecting-dots-between-it-and-teleco","description":"  5G will eventually impact every single industry—from healthcare to financial to even agriculture and transportation...and its impact is only increasing over time. Despite its benefits, it comes with privacy and security risks. An increasing number of interconnected devices increases the attack surface. In addition, there are also increased supply chain vulnerabilities and network visibility issues (companies may have issues identifying attacks since there may be a lot of new web traffic from mobile devices and/or more sophistication when it comes to attacks). The goal of the NCCoE 5G\n\n","pubDate":"Mon, 04 Dec 2023 12:00:00 +0000","dc:creator":"Jeffrey Cichonski","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1831826"}},{"title":"NIST’s International Cybersecurity and Privacy Engagement Update – Trade Missions, Workshops, and Translations","link":"https://www.nist.gov/blogs/cybersecurity-insights/nists-international-cybersecurity-and-privacy-engagement-update-trade","description":"  Our Cybersecurity Awareness Month may have come to a close at the end of October — but the importance of enhancing cybersecurity and engaging with our international partners to enhance cybersecurity is at the forefront of our minds all year long. Here are some updates on our international work: Conversations have continued with our partners throughout the world on the update to the NIST Cybersecurity Framework (CSF) 2.0 , and NIST hosted its final workshop on September 19 and 20 with in-person and hybrid attendance featuring international participation (via both speakers and panelists). While\n\n","pubDate":"Mon, 20 Nov 2023 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1831536"}},{"title":"Cybersecurity Awareness Month 2023 Blog Series | Recognizing and Reporting Phishing","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2023-blog-series-recognizing-and","description":"  During this week’s blog series, we sat down with two of our NIST experts from the Visualization and Usability Group at NIST — Shanée Dawkins and Jody Jacobs — who discussed the importance of recognizing and reporting phishing . This blog wraps up our Cybersecurity Awareness Month 2023 blog series…but we of course plan to continue to share, collaborate, learn, and spread the word all year long. 1. This week’s Cybersecurity Awareness Month theme is ‘recognize and report phishing.’ How does your work/specialty area at NIST tie into this behavior? We work in the Information Technology Lab, but our\n\n","pubDate":"Tue, 24 Oct 2023 12:00:00 +0000","dc:creator":"Shanée Dawkins, Jody Jacobs","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1829186"}},{"title":"Cybersecurity Awareness Month 2023 Blog Series | Updating Software","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2023-blog-series-updating-software","description":"  It’s week three in our Cybersecurity Awareness Month blog series! This week, we interviewed NIST’s Michael Ogata (Computer Scientist) and Paul Watrobski (IT Security Specialist) about the importance of updating software. This week’s Cybersecurity Awareness Month theme is ‘updating software.’ How does your work/specialty area at NIST tie into this behavior? NIST’s Applied Cybersecurity Division’s core mission is to explore, measure, and evaluate both the cybersecurity guidance NIST provides as well as industry best practices. One of our current projects involves putting the practices described\n\n","pubDate":"Wed, 18 Oct 2023 12:00:00 +0000","dc:creator":"Michael Ogata, Paul Watrobski","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1828486"}},{"title":"Cybersecurity Awareness Month 2023 Blog Series | Using Strong Passwords and a Password Manager","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2023-blog-series-using-strong-passwords","description":"  Today’s blog is the second one in our 2023 Cybersecurity Awareness Month series and examines different factors associated with using strong passwords and a password manager. We interviewed NIST’s Yee-Yin Choong and Meghan Anderson to get their unique thoughts and insights. This week’s Cybersecurity Awareness Month theme is ‘ using strong passwords and a password manager .’ How does your work/specialty area at NIST tie into this behavior? Yee-Yin : At NIST, I’ve been conducting research on human factors and the usability aspects of human-technology interactions. One research area is human\n\n","pubDate":"Tue, 10 Oct 2023 12:00:00 +0000","dc:creator":"Meghan Anderson, Yee-Yin Choong","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1827566"}},{"title":"Kicking off NIST&#039;s Cybersecurity Awareness Month Celebration &amp; Our Cybersecurity Awareness Month 2023 Blog Series","link":"https://www.nist.gov/blogs/cybersecurity-insights/kicking-nists-cybersecurity-awareness-month-celebration-our","description":"  October is always an exciting time for us as we celebrate Cybersecurity Awareness Month and some of NIST’s greatest accomplishments, resources, guidance, and latest news in the cybersecurity space. This year is a big one because 2023 marks the 20 th anniversary of this important initiative —and we will celebrate in various ways every day throughout the month. What is NIST Up to in October? We’ll be using our NIST Cybersecurity Awareness Month website to share information about our events, resources, blogs, and how to stay involved. We will be using our NISTcyber X account as a vehicle to\n\n","pubDate":"Mon, 02 Oct 2023 12:00:00 +0000","dc:creator":"David Temoshok","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1827061"}},{"title":"NIST Unveils Newly Named Human-Centered Cybersecurity Program","link":"https://www.nist.gov/blogs/cybersecurity-insights/nist-unveils-newly-named-human-centered-cybersecurity-program","description":"  The Human-Centered Cybersecurity program (formerly Usable Cybersecurity) is part of the Visualization and Usability Group at NIST. It was created in 2008, but we’ve known for quite some time that we needed to rename our program to better represent the broader scope of work we provide for the cybersecurity practitioner and IT professional communities. We made the decision to update the name to Human-Centered Cybersecurity to better reflect our new (but long-time practiced) mission statement, “ championing the human in cybersecurity.” With our new name, we hope to highlight that usability still\n\n","pubDate":"Thu, 28 Sep 2023 12:00:00 +0000","dc:creator":"Julie Haney, Jody Jacobs","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1826521"}},{"title":"Hands-On Learning Experiences Encourage Cybersecurity Career Discovery","link":"https://www.nist.gov/blogs/cybersecurity-insights/hands-learning-experiences-encourage-cybersecurity-career-discovery","description":"  With a mention in the new National Cyber Workforce and Education Strategy and even a dedicated state law , K–12 cybersecurity education clearly has the eye of policymakers. However, despite public attention and new opportunities for high school students to pursue cybersecurity coursework, high schools often struggle to provide students with a clear understanding of what cybersecurity careers actually look like. Hands-on learning experiences, like those we’ve had at our schools and during our internship with NICE at NIST, can help bring cybersecurity education and career pathways into focus for\n\n","pubDate":"Mon, 11 Sep 2023 12:00:00 +0000","dc:creator":"Asher Cronin , Stephen Langelier ","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1823636"}},{"title":"NIST’s Planned Updates to Implementing the HIPAA Security Rule: A Cybersecurity Resource Guide","link":"https://www.nist.gov/blogs/cybersecurity-insights/nists-planned-updates-implementing-hipaa-security-rule-cybersecurity","description":"  Background: NIST Special Publication (SP) 800-66 Healthcare organizations face many challenges from cybersecurity threats. This can have serious impacts on the security of patient data, the quality of patient care, and even the organization’s financial status. Healthcare organizations also must comply with regulatory requirements, such as the Health Insurance Portability and Accountability Act of 1996 (HIPAA) Security Rule, which focuses on safeguarding the electronic protected health information (ePHI) held or maintained by HIPAA covered entities and business associates (collectively,\n\n","pubDate":"Tue, 05 Sep 2023 12:00:00 +0000","dc:creator":"Jeff Marron","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1823401"}},{"title":"International Engagement – Brussels and Beyond","link":"https://www.nist.gov/blogs/cybersecurity-insights/international-engagement-brussels-and-beyond","description":"  International engagement is an integral part of many ongoing NIST efforts, including the Journey to the Cybersecurity Framework (CSF 2.0) update , our update to the digital identity guidelines, and increasing awareness of the NIST Privacy Framework and IoT cybersecurity work. In the update to NIST CSF 2.0, NIST continues to work with the international community. At NIST’s February 2023 virtual workshop on the CSF 2.0 update, participants from Italian and New Zealand governments and Mexican industry spoke on panels. In addition, participants joined from several countries. We are continuing to\n\n","pubDate":"Tue, 18 Jul 2023 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1818926"}},{"title":"SSDF and IoT Cybersecurity Guidance: Building Blocks for IoT Product Security","link":"https://www.nist.gov/blogs/cybersecurity-insights/ssdf-and-iot-cybersecurity-guidance-building-blocks-iot-product","description":"  NIST’s IoT cybersecurity guidance has long recognized the importance of secure software development (SSDF) practices, highlighted by the NIST IR 8259 series —such as the recommendation for documentation in Action 3.d of NIST IR 8259B , that manufacturers have considered and documented their “secure software development and supply chain practices used.” The NIST SSDF (NIST SP 800-218) describes software development practices that can aid manufacturers in developing IoT products by providing guidance for the secure development of software and firmware. These development practices can also\n\n","pubDate":"Thu, 22 Jun 2023 12:00:00 +0000","dc:creator":"Katerina Megas, Michael Fagan, Barbara Cuthill, Murugiah Souppaya","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1815431"}},{"title":"Mapping out our Destination: Responsible Innovation via the NIST Identity Roadmap","link":"https://www.nist.gov/blogs/cybersecurity-insights/mapping-out-our-destination-responsible-innovation-nist-identity","description":"  RSA Conference week is always a whirlwind. NIST was there front and center last month, and we learned a lot, shared a lot, and made a big announcement during the festivities… We were excited to announce that NIST’s DRAFT Identity and Access Management Roadmap was released for public comment on Friday, April 14 th and that the comment period will be extended to June 16 th . What is the Roadmap? The Roadmap provides a consolidated view of NIST’s planned identity efforts over the coming years and serves as a vehicle to communicate our priorities. It provides guiding principles, strategic\n\n","pubDate":"Mon, 22 May 2023 12:00:00 +0000","dc:creator":"Ryan Galluzzo","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1812656"}},{"title":"Small Business is a Big Priority: NIST Expands Outreach to the Small Business Community","link":"https://www.nist.gov/blogs/cybersecurity-insights/small-business-big-priority-nist-expands-outreach-small-business","description":"  Did you know that 99.9% of businesses in America are small businesses? [1] Small businesses are a major source of innovation for our country—but they’re often faced with limited resources and budgets. Many of them need cybersecurity solutions, guidance, and training so they can cost-effectively address and manage their cybersecurity risks. Hmmm…where can you find guidance like this all in one place? Voila! The Small Business Cybersecurity Corner ! This website was created by NIST in 2019 in response to the NIST Small Business Cybersecurity Act, which directed us to “disseminate clear and\n\n","pubDate":"Thu, 20 Apr 2023 12:00:00 +0000","dc:creator":"Kristina Rigopoulos, Daniel Eliot","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1740341"}},{"title":"The Importance of Transparency – Fueling Trust and Security Through Communication","link":"https://www.nist.gov/blogs/cybersecurity-insights/importance-transparency-fueling-trust-and-security-through","description":"  Who needs to know ‘What,’ ‘When,’ and ‘How’ to tell them The Challenge There are many challenges to providing and maintaining cybersecurity in today’s connected world. While product developers increasingly consider security as they design and build products, they may not always communicate critical cybersecurity information about their connected products. Information gaps present a challenge to stakeholders—especially customers—who have limited insight into the security processes, functions and features that protect connected products, components, and services. Effective communication is the\n\n","pubDate":"Mon, 03 Apr 2023 12:00:00 +0000","dc:creator":"Katerina Megas, Angela Smith, Dr. Elaine Newton, Dr. Amit Elazari , Barbara Cuthill","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1738381"}},{"title":"Phishing Resistance – Protecting the Keys to Your Kingdom","link":"https://www.nist.gov/blogs/cybersecurity-insights/phishing-resistance-protecting-keys-your-kingdom","description":"  If you own a computer, watch the news, or spend virtually any time online these days you have probably heard the term “phishing.” Never in a positive context…and possibly because you have been a victim yourself. Phishing refers to a variety of attacks that are intended to convince you to forfeit sensitive data to an imposter. These attacks can take a number of different forms; from spear-phishing (which targets a specific individual within an organization), to whaling (which goes one step further and targets senior executives or leaders). Furthermore, phishing attacks take place over multiple\n\n","pubDate":"Wed, 01 Feb 2023 12:00:00 +0000","dc:creator":"Andrew Regenscheid, Ryan Galluzzo","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1732071"}},{"title":"Data Analytics for Small Businesses: How to Manage Privacy Risks","link":"https://www.nist.gov/blogs/cybersecurity-insights/data-analytics-small-businesses-how-manage-privacy-risks","description":"  Perhaps you’ve been hearing about data analytics, which is being promoted as a way for even small businesses to analyze communications with customers, enhance customer experience, save money, and ultimately improve your brand. However, data analytics can have big privacy implications. You may think of managing privacy risk as protecting sensitive customer information, such as credit cards. As the Venn diagram to the right demonstrates, data security is certainly one aspect of privacy risk, but privacy risks can also arise by means unrelated to cybersecurity incidents. People can experience\n\n","pubDate":"Fri, 27 Jan 2023 12:00:00 +0000","dc:creator":"Meghan Anderson","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1730071"}},{"title":"International Engagement Blog: Singapore International Cyber Week, the Regional Initiative for Cybersecurity Education and Training, and More","link":"https://www.nist.gov/blogs/cybersecurity-insights/international-engagement-blog-singapore-international-cyber-week","description":"  NIST has continued to collaborate into the fall season with partners throughout the world on the Cybersecurity Framework 2.0 update . International engagement and alignment with international standards are important themes for the 2.0 update and will drive changes to ensure global relevance. As part of this ongoing international engagement, NIST welcomed visitors to the NCCoE and NIST headquarters to discuss various cybersecurity topics and explore areas for mutual collaboration. In the past few weeks, NIST met with visitors from Italy, Singapore, New Zealand, Germany, and Brazil at the NCCoE\n\n","pubDate":"Wed, 14 Dec 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1726541"}},{"title":"Why Employers Should Embrace Competency-Based Learning in Cybersecurity","link":"https://www.nist.gov/blogs/cybersecurity-insights/why-employers-should-embrace-competency-based-learning-cybersecurity","description":"  There is a growing movement toward increasing the use of competency and skills-based education and hiring practices in both the public and private sectors. For example, the Executive Order on Modernizing and Reforming the Assessment and Hiring of Federal Job Candidates calls upon the Federal Government to “ensure that the individuals most capable of performing the roles and responsibilities required of a specific position are those hired for that position”—resulting in “merit-based reforms that will replace degree-based hiring with skills- and competency-based hiring .” Similarly, the\n\n","pubDate":"Tue, 25 Oct 2022 12:00:00 +0000","dc:creator":"Marni Baker-Stein, Bridgett Paradise, Rodney Petersen","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720716"}},{"title":"Cybersecurity Awareness Month 2022: Recognizing &amp; Reporting Phishing","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-recognizing-reporting-phishing","description":"  This blog will officially wrap up our 2022 Cybersecurity Awareness Month blog series — today we have a special interview from Marian Merritt, deputy director, lead for industry engagement for the National Initiative for Cybersecurity Education (NICE)! Marian will be discussing the importance of recognizing and reporting phishing incidents in detail. A phishing attack is an attempt to fool an individual into sharing private information or taking an action that gives criminals access to your accounts, your computer, login credentials or even your network. This week’s Cybersecurity Awareness\n\n","pubDate":"Mon, 24 Oct 2022 12:00:00 +0000","dc:creator":"Marian Merritt","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1718901"}},{"title":"Student Insights on Cybersecurity Careers","link":"https://www.nist.gov/blogs/cybersecurity-insights/student-insights-cybersecurity-careers","description":"  Hi, our names are Aubrie, Kyle, and Lindsey! We participated in internships at the National Initiative for Cybersecurity Education (NICE) Program Office this past year. This is a career pivot for Aubrie, meaning this is her introduction to cybersecurity from another career; she is earning her master’s with a concentration in cybersecurity. Kyle was an undergraduate intern majoring in Computer Engineering. He is almost finished with his education and will soon be transitioning into the workforce. Lindsey is a high school member of the program. The three of us come from different academic and\n\n","pubDate":"Thu, 20 Oct 2022 12:00:00 +0000","dc:creator":"Aubrie Kendall, Kyle Truong, Lindsey Walter","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720901"}},{"title":"Cybersecurity Awareness Month 2022: Updating Software","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-updating-software","description":"  Cybersecurity Awareness Month is flying by, and today’s blog identifies different security vulnerabilities that can be exposed if you are unable to keep up with your software updates. We interviewed NIST’s Michael Ogata, a computer scientist in the Applied Cybersecurity Division, and he walked us through different strategies to minimize your cybersecurity risks. Michael also was able to provide cyber tips to improve online safety. This week’s Cybersecurity Awareness Month theme is updating software. How does your work/specialty area at NIST tie into this behavior? Today, mobile applications\n\n","pubDate":"Mon, 17 Oct 2022 12:00:00 +0000","dc:creator":"Michael Ogata","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720266"}},{"title":"Cybersecurity Awareness Month 2022: Using Strong Passwords and a Password Manager","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-using-strong-passwords-and-password","description":"  The key behavior that we are highlighting this week for Cybersecurity Awareness Month is using strong passwords and a password manager. In today’s blog we interviewed NIST’s Connie LaSalle, a senior technology policy advisor, and she offers four specific ways to mitigate your cybersecurity risks online while discussing the importance of adopting strong passwords. Take a look at her responses to our questions below… This week’s Cybersecurity Awareness Month theme is using strong passwords and a password manager. How does your work/specialty area at NIST tie into this behavior? As a senior\n\n","pubDate":"Thu, 13 Oct 2022 12:00:00 +0000","dc:creator":"Connie LaSalle","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720231"}},{"title":"Cybersecurity Awareness Month 2022: Enabling Multi-factor Authentication Key behavior: Multi-factor Authentication","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-enabling-multi-factor-authentication","description":"  In celebration of Cybersecurity Awareness Month , NIST will be publishing a dedicated blog series throughout October; we will be sharing blogs each week that will match up to four key behaviors identified by the National Cybersecurity Alliance (NCA). Today’s interview-style blog features two NIST experts —Bill Newhouse and Ryan Galluzzo—discussing different reasons to enable multi-factor authentication (a mechanism to verify an individual’s identity by requiring them to provide more information than just a username and password). Here are the questions they both were asked, along with their\n\n","pubDate":"Tue, 04 Oct 2022 12:00:00 +0000","dc:creator":"Bill Newhouse, Ryan Galluzzo","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1719181"}},{"title":"NIST International Engagement Updates:  CSF 2.0 Update Workshop and More","link":"https://www.nist.gov/blogs/cybersecurity-insights/nist-international-engagement-updates-csf-20-update-workshop-and-more","description":"  The subject of international alignment and alignment with international resources continues to be an important focus for NIST, particularly with the process for the Cybersecurity Framework (CSF) 2.0 update . This was an important area for many of our stakeholders, as described in the summary of analysis of the Request for Information (RFI) from February. NIST hosted its first virtual workshop on the journey to the CSF 2.0 update process in August. During the workshop, NIST described the importance of international alignment as well as the feedback we heard on continuing our international\n\n","pubDate":"Fri, 30 Sep 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1718536"}},{"title":"The Final Countdown to Cybersecurity Awareness Month 2022: “It&#039;s easy to stay safe online!”","link":"https://www.nist.gov/blogs/cybersecurity-insights/final-countdown-cybersecurity-awareness-month-2022-its-easy-stay-safe","description":"  Today’s blog will jumpstart NIST’s celebration of Cybersecurity Awareness Month 2022 ! We have a lot in store for October and are looking forward to sharing our work, progress, events, and news with you. This year’s theme is \"See Yourself In Cyber\" and will cover four key behaviors: Enabling multi-factor authentication Using strong passwords and a password manager Updating software Recognizing and reporting phishing As a repeat Cybersecurity Awareness Month Champion , NIST is dedicated to promoting a safer online environment and helping others learn and understand the complex world of\n\n","pubDate":"Thu, 29 Sep 2022 12:00:00 +0000","dc:creator":"Kevin Stine","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1718896"}},{"title":"NIST’s Expanding International Engagement on Cybersecurity","link":"https://www.nist.gov/blogs/cybersecurity-insights/nists-expanding-international-engagement-cybersecurity","description":"  In providing a foundation for cybersecurity advancements over the years, NIST has taken the global context into account when determining priorities and approaches. Our participation in Standards Developing Organizations (SDOs) has expanded steadily, and we encourage international participation in the development of our own programs and resources. As we celebrate the 50 th anniversary of cybersecurity at NIST , it is more important than ever that we work with our partners around the world. NIST’s growing impact on the international stage is reflected in the many translations of our signature\n\n","pubDate":"Wed, 27 Jul 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1710041"}},{"title":"Standards: The CPSO’s Best Friend","link":"https://www.nist.gov/blogs/cybersecurity-insights/standards-cpsos-best-friend","description":"  Workshop Shines Light on Role of Standards in Cybersecurity for IoT What do Chief Product Security Officers (CPSOs) want to make their job easier? As it turns out, standards. This insight was one of many shared at a public virtual workshop NIST held June 22, 2022, to discuss the next steps for the Cybersecurity for the Internet of Things (IoT) program . As we move forward in developing cybersecurity guidance for IoT products, NIST remains committed to an open and transparent process that builds on input from stakeholders, including industry and the broader public. Our June 22 workshop explored\n\n","pubDate":"Fri, 15 Jul 2022 12:00:00 +0000","dc:creator":"Katerina Megas","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1709661"}},{"title":"Next Up: Integrating Information and Communication Technology Risk Programs with Enterprise Risk Management","link":"https://www.nist.gov/blogs/cybersecurity-insights/next-integrating-information-and-communication-technology-risk-programs","description":"  Given the increasing reliance of organizations on technologies over the past 50 years , a number of risk disciplines have evolved into full-fledged risk programs. In recent years, cybersecurity, supply chain, and privacy risk management programs have formalized best practices. Yet the rapid evolution of these disciplines sometimes has led to miscommunication and inefficiencies between those risk programs and overarching enterprise risk management (ERM) portfolio . The years ahead will focus on optimizing coordination and communication between all risk programs and ERM. To be supportive of\n\n","pubDate":"Tue, 05 Jul 2022 12:00:00 +0000","dc:creator":"Stephen Quinn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1708441"}},{"title":"Identity and Access Management at NIST: A Rich History and Dynamic Future","link":"https://www.nist.gov/blogs/cybersecurity-insights/identity-and-access-management-nist-rich-history-and-dynamic-future","description":"  Digital identity for access control is a fundamental and critical cybersecurity capability that ensures the right people and things have the right access to the right resources at the right time. NIST has a rich history in digital identity standardization spanning more than 50 years. We have conducted research, developed prototypes and reference implementations, and supported pilots to better understand new and emerging technologies that inform our digital identity standards, guidelines, and resources. Also, NIST participates and leads in the development of national and international standards\n\n","pubDate":"Thu, 23 Jun 2022 12:00:00 +0000","dc:creator":"Nelson Hastings, Andrew Regenscheid, Hildegard Ferraiolo, David Temoshok, Bill Fisher","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1706881"}},{"title":"NIST International Outreach Strengthened through Additional Translations and Engagement","link":"https://www.nist.gov/blogs/cybersecurity-insights/nist-international-outreach-strengthened-through-additional","description":"  With the update to the Cybersecurity Framework in full swing, NIST continues to prioritize international engagement through conversations and collaborations on cybersecurity. This work is critical to NIST’s efforts to ensure international alignment on cybersecurity and privacy resources. Here’s a quick summary of some recent engagements, with more to come in the next few weeks! Under Secretary of Commerce for Standards and Technology and NIST Director Laurie Locascio participated virtually in the G7 Digital Ministers meeting on May 10 th alongside the State Department. She spoke about current\n\n","pubDate":"Thu, 09 Jun 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1704756"}},{"title":"Setting off on the Journey to the NIST Cybersecurity Framework (CSF) 2.0","link":"https://www.nist.gov/blogs/cybersecurity-insights/setting-journey-nist-cybersecurity-framework-csf-20","description":"  Over the past few months, NIST has been seeking feedback on the use and improvements to its cybersecurity resources through the Request for Information (RFI) on “Evaluating and Improving NIST Cybersecurity Resources: The Cybersecurity Framework and Cybersecurity Supply Chain Risk Management.” In this RFI, NIST asked about evaluating and improving the NIST Cybersecurity Framework (CSF or Framework), use of the Framework in conjunction with other resources, and improving supply chain cybersecurity risk management. The RFI garnered 134 comments (at date of publication) from a diverse range of\n\n","pubDate":"Fri, 03 Jun 2022 12:00:00 +0000","dc:creator":"Cherilyn Pascoe","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1704676"}},{"title":"The Cornerstone of Cybersecurity – Cryptographic Standards and a 50-Year Evolution","link":"https://www.nist.gov/blogs/cybersecurity-insights/cornerstone-cybersecurity-cryptographic-standards-and-50-year-evolution","description":"  In today’s connected digital world, cryptographic algorithms are implemented in every device and applied to every link to protect information in transmission and in storage. Over the past 50 years, the use of cryptographic tools has expanded dramatically, from limited environments like ATM encryption to every digital application used today. Throughout this long journey, NIST has played a unique leading role in developing critical cryptographic standards. Data Encryption Standard (DES) In the early 1970s, there was little public understanding of cryptography, although most people knew that\n\n","pubDate":"Thu, 26 May 2022 12:00:00 +0000","dc:creator":"Lily Chen, Matthew Scholl","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1703211"}},{"title":"Cybersecurity for IoT: The Road We’ve Traveled, The Road Ahead","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-iot-road-weve-traveled-road-ahead","description":"  The NIST Cybersecurity for IoT program published Considerations for Managing Internet of Things (IoT) Cybersecurity and Privacy Risks ( NISTIR 8228 ) in June 2019, nearly 3 years ago. Since then, IoT technology has continued to develop and be adopted across sectors and markets. NIST’s own work, both in and outside IoT, has also progressed since the publication of NISTIR 8228. These developments warrant a new look at the contents of NISTIR 8228 and at future IoT cybersecurity priorities at NIST. As the Cybersecurity for IoT program has progressed through guidance for IoT device manufacturers (\n\n","pubDate":"Mon, 16 May 2022 12:00:00 +0000","dc:creator":"Michael Fagan","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1702341"}},{"title":"The Application of Cybersecurity for IoT Capabilities to Real-World Scenarios","link":"https://www.nist.gov/blogs/cybersecurity-insights/application-cybersecurity-iot-capabilities-real-world-scenarios","description":"  NIST has a history of collaboration between its programs, which helps maximize project impacts and practicality to industry. One great example is between NIST’s National Cybersecurity Center of Excellence ( NCCoE ) and the Cybersecurity for the Internet of Things (IoT) Program . Recent project reports from the NCCoE include mappings of relevant IoT device cybersecurity capabilities and nontechnical supporting capabilities; these three mappings align NIST’s IoT cybersecurity guidance with real-world implementation approaches: Securing Telehealth Remote Patient Monitoring Ecosystem Securing\n\n","pubDate":"Mon, 25 Apr 2022 12:00:00 +0000","dc:creator":"Jeff Marron","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1700611"}},{"title":"A Peek at Privacy: Where We Started, Where We are Now, and What’s Next","link":"https://www.nist.gov/blogs/cybersecurity-insights/peek-privacy-where-we-started-where-we-are-now-and-whats-next","description":"  As part of NIST’s 50 th anniversary of cybersecurity, this month’s blog post is centered on privacy at NIST. Since many of you have become familiar with the Privacy Engineering Program ’s popular Venn diagram showing the relationship between cybersecurity and privacy risks, let’s use it to show how NIST has expanded and matured its understanding of privacy over the last 50 years. If we go back in time to the 1960s, data privacy really came into focus when the growing use of computers created concerns about secret databases of people’s information. The report, Records, Computers, and the Rights\n\n","pubDate":"Wed, 06 Apr 2022 12:00:00 +0000","dc:creator":"Meghan Anderson","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1699526"}}]}}}