{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:foaf":"http://xmlns.com/foaf/0.1/","@xmlns:og":"http://ogp.me/ns#","@xmlns:rdfs":"http://www.w3.org/2000/01/rdf-schema#","@xmlns:schema":"http://schema.org/","@xmlns:sioc":"http://rdfs.org/sioc/ns#","@xmlns:sioct":"http://rdfs.org/sioc/types#","@xmlns:skos":"http://www.w3.org/2004/02/skos/core#","@xmlns:xsd":"http://www.w3.org/2001/XMLSchema#","@version":"2.0","@xml:base":"https://www.veracode.com/","channel":{"title":"Application Security Research, News, and Education Blog","link":"https://www.veracode.com/","description":null,"language":"en","pubDate":"Mon, 22 Jan 2024 05:10:56 -0500","item":[{"title":"Essential Cloud Security Tools for Effective DevSecOps","link":"https://www.veracode.com/blog/managing-appsec/essential-cloud-security-tools-effective-devsecops","description":"Implementation of a DevSecOps approach is the most impactful key factor in the total cost of a data breach. Successful DevSecOps in a cloud-native world is aided by the right tools. Here are a handful of the most essential cloud security tools and what to look for in them to aid DevSecOps. \nTop Essential Cloud Security Tool for DevSecOps: Software Composition Analysis \nSoftware Composition Analysis (SCA) is the bread and butter of cloud security tools for effective DevSecOps and securing the software supply chain.  \nWhy it matters: open-source software (OSS) is handy, but it comes with a few catches. There are vulnerabilities, missed updates, and license risk to be worried about. That’s where SCA comes in.  \nSCA takes a proactive approach to finding these risks early. A few things you want to look out for when picking the right SCA tool for you: \n\nContinuous Monitoring \n\n\nReporting & Analytics with Peer Benchmarking \n\n\nRemediation Guidance & Fix Suggestions \n\n\nDependency…","pubDate":"Mon, 22 Jan 2024 05:10:56 -0500","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64661"}},{"title":"Announcing a Unified Veracode SAST and SCA IDE Plugin","link":"https://www.veracode.com/blog/customer-news/announcing-veracode-scan-unified-sast-and-sca-ide-plugin","description":"Veracode is pleased to announce the availability of a new Integrated Development Environment (IDE) Plugin for VS Code. Our new plugin combines both Veracode Static Analysis (SAST) and Software Composition Analysis (SCA) into a single plugin. This allows developers to quickly scan projects for security weaknesses and risks in both first-party code and third-party libraries.   \nThe Benefits of a Combined SAST and SCA Plugin \nScanning projects with SCA and SAST is important to make sure that both the code and libraries are as safe as possible. Making these tools available natively in the IDE in a single plugin makes performing security checks both faster and easier to perform. Scanning code early in the software development process reduces both the cost of remediating flaws and the chances of flaws making it into production.  \nHow the Veracode Unified Plugin Works \nThe unified plugin takes care of packaging and sending of artifacts to the Veracode static scanner,  and then returns the…","pubDate":"Thu, 18 Jan 2024 17:51:52 -0500","dc:creator":"rhaynes@veracode.com (rhaynes)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64641"}},{"title":"Implementing AI: Balancing Business Objectives and Security Requirements ","link":"https://www.veracode.com/blog/managing-appsec/implementing-ai-balancing-business-objectives-and-security-requirements","description":"Artificial Intelligence (AI) and machine learning have become integral tools for organizations across various industries. However, the successful adoption of these technologies requires a careful balance between business objectives and security requirements. I sat down with Glenn Schmitz, the Chief Information Security Officer of the Department of Behavioral Health and Developmental Services in Virginia, as he shared valuable insights on implementing AI while ensuring safety, security, and ethical considerations. Here are some of the key takeaways. \nUnderstanding Business Objectives and Security Requirements Starts with Fundamentals \nWhen Schmitz joined the organization, he recognized the need to understand the overall security maturity level. By aligning business objectives with security requirements, he aimed to enable the business to achieve its goals in a safe and secure manner. \nSchmitz shared: \"I started at a very fundamental level. Security is here to protect the business and…","pubDate":"Tue, 16 Jan 2024 12:16:39 -0500","dc:creator":"broche@veracode.com (broche)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64621"}},{"title":"Introducing Dynamic Analysis MFA: Automated Support for MFA Setups","link":"https://www.veracode.com/blog/managing-appsec/introducing-dynamic-analysis-mfa-automated-support-mfa-setups","description":"Veracode has recently introduced a new feature called Dynamic Analysis MFA, which provides automated support for multi-factor authentication (MFA) setups during dynamic analysis scans. This eliminates the need for you to disable or manually support your MFA configurations when conducting security testing.\nUnderstanding Dynamic Analysis MFA\nWhen we log into applications, we usually use a username and password, which is considered one-factor authentication. However, to enhance security and reduce the risk of passwords being lost or stolen, multi-factor authentication (MFA) was introduced. MFA adds an extra layer of security by requiring an additional step, such as using a hardware key, receiving a text message, or entering a code from an authenticator app.\nMFA has become more common for web applications as web security becomes a higher priority, but some security testing tools require users to disable or manually support their MFA setups during application security testing. This can be…","pubDate":"Mon, 08 Jan 2024 10:54:45 -0500","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64576"}},{"title":"Securing JavaScript: Best Practices and Common Vulnerabilities","link":"https://www.veracode.com/blog/intro-appsec/securing-javascript-best-practices-and-common-vulnerabilities","description":"\nJavaScript is the most commonly-used programming language, according to the most recent StackOverflow developer survey. While JavaScript offers great flexibility and ease of use, it also introduces security risks that can be exploited by attackers. In this blog, we will explore vulnerabilities in JavaScript, best practices to secure your code, and tools to prevent attacks.\n \nUnderstanding JavaScript Vulnerabilities \n\nIf you're short on time, you can begin by using Veracode DAST Essentials, a JavaScript security scanner, to identify potential vulnerabilities. Running this tool will quickly generate reports, highlight your specific vulnerabilities, and provide clear instructions on how to remediate them. \nJavaScript Source Code Vulnerabilities\nJavaScript developers typically rely on integrating numerous public or open-source packages and libraries containing hidden vulnerabilities and exposing security issues within the source code. Open-source vulnerabilities might not be easily…","pubDate":"Mon, 08 Jan 2024 09:39:09 -0500","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64571"}},{"title":"What To Look For in an Open Source Vulnerability Scanner ","link":"https://www.veracode.com/blog/intro-appsec/what-look-open-source-vulnerability-scanner","description":"One of the top security concerns we hear from technology leaders is about the security of open source software (OSS) and cloud software development. An open source vulnerability scanner (for scanning OSS) helps you discover risk in the third-party code you use. However, just because a solution scans open source does not mean you are ultimately reducing security risk with it. Here is what to look for in an open source vulnerability scanner and security testing solution to find and fix vulnerabilities in OSS.  \nBackground on Vulnerabilities in Open Source and What the Risk Looks Like \nBefore we can talk about what to look for in a scanning solution, we need to talk about the vulnerabilities the tools are looking for. Born in 1999, the National Vulnerability Database (NVD) was a product of the National Institute of Standards and Technology (NIST) made to be “the U.S. government repository of standards based vulnerability management data.” It represents an index of known vulnerabilities…","pubDate":"Thu, 04 Jan 2024 13:35:17 -0500","dc:creator":"cbertram@veracode.com (cbertram)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64561"}},{"title":"Using Veracode Fix to Remediate an SQL Injection Flaw ","link":"https://www.veracode.com/blog/secure-development/using-veracode-fix-remediate-sql-injection-flaw","description":"Introduction \nIn this first in a series of articles looking at how to remediate common flaws using Veracode Fix – Veracode’s AI security remediation assistant, we will look at finding and fixing one of the most common and persistent flaw types – an SQL injection attack.\nAn SQL injection attack is a malicious exploit where an attacker injects unauthorized SQL code into input fields of a web application, aiming to manipulate the application's database. By manipulating input parameters, attackers can trick the application into executing unintended SQL commands. This can lead to unauthorized access, data retrieval, modification, or even deletion. Successful SQL injection attacks compromise data integrity and confidentiality, posing serious security risks.\nExample Code and Analysis\nLet’s look at a weakness in the source code of the deliberately vulnerable (and freely available) Verademo application, specifically the UserController.java source file found in the application repository in…","pubDate":"Tue, 02 Jan 2024 18:16:59 -0500","dc:creator":"rhaynes@veracode.com (rhaynes)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64316"}},{"title":"Behind the Recognition: Why We Believe We’re a Gartner® Peer Insights™ Customers’ Choice 2023","link":"https://www.veracode.com/blog/customer-news/behind-recognition-why-we-believe-were-gartnerr-peer-insightstm-customers-choice","description":"As 2023 comes to a close, we aim to inspire excellence by highlighting our customers’ dedication to a more secure world. Thanks to you, we are honored to be (for the fourth consecutive year) recognized as a 2023 Gartner® Peer Insights™ Customers’ Choice. Let’s explore some of the stories that make this recognition possible. \nVeracode Named a 2023 Gartner® Peer Insights™ Customers’ Choice for the Fourth Consecutive Year \nVeracode is recognized by Gartner® Peer Insights™ in 2023 as a Customers’ Choice for Application Security Testing – for the fourth consecutive year. This distinction, in more detail below, is based on meeting or exceeding user interest, adoption, and overall experience.\n\nWe believe what makes Veracode a Gartner® Peer Insights™ Customers’ Choice for the fourth consecutive year is what we call: customer obsession. We constantly strive to understand both the problems and North Star our customers face so we can be the partner you truly need. \nOur Partnership: Stories…","pubDate":"Thu, 21 Dec 2023 11:35:53 -0500","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64516"}},{"title":"4 Ways Veracode Fix Is a Game Changer for DevSecOps","link":"https://www.veracode.com/blog/managing-appsec/4-ways-veracode-fix-game-changer-devsecops","description":"In the fast-paced world of software development, too often security takes a backseat to meeting strict deadlines and delivering new features. Discovering software has accrued substantial security debt that will take months to fix can rip up the schedules of even the best development teams.  \nAn AI-powered tool that assists developers in remediating flaws becomes an invaluable asset in this context. In Veracode Fix, we’ve harnessed the capabilities of generative AI to build a specialized tool that allows developers to remediate flaws within minutes without manually writing a single line of code.  \nWatch this 3-minute demo of how you can easily take flawed code and use Veracode Fix to generate easily-implemented remediation suggestions. \n\n4 Major Benefits of Veracode Fix in DevSecOps \nHere are four ways that Veracode Fix supercharges DevSecOps and your SDLC with the swift remediation of security flaws. \n1. Tackle Security Debt with Rapid Flaw Remediation \nOne of the most significant…","pubDate":"Wed, 20 Dec 2023 14:21:01 -0500","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64311"}},{"title":"What Our Security Experts Discussed at AWS re:Invent 2023","link":"https://www.veracode.com/blog/managing-appsec/what-our-security-experts-discussed-aws-reinvent-2023","description":"The landscape of coding is changing as developers embrace AI, automation, microservices, and third-party libraries to boost productivity. While each new approach enhances efficiency, like a double-edged sword, flaws and vulnerabilities are also introduced faster than teams can fix them. Learn about one of the latest innovations solving this in a recap of what our security experts discussed at AWS re:Invent 2023. \nVeracode Fix: A Game Changer in Flaw Remediation for Developers\nDuring their AWS on Air segment, our experts, Vice President of Strategic Product Management, Tim Jarrett, and Senior Solutions Architect, Eric Kim, shared how Veracode Fix is a new game-changing tool that helps developers cut down the flaw remediation process from months to minutes. \nLeveraging the power of AI, the tool allows developers to easily reduce security issues by generating suggested fixes for existing code that is flawed and vulnerable.  \nWhile many AI-powered coding tools are designed to help write…","pubDate":"Thu, 14 Dec 2023 12:07:06 -0500","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64286"}},{"title":"State of Log4j Vulnerabilities: How Much Did Log4Shell Change?","link":"https://www.veracode.com/blog/research/state-log4j-vulnerabilities-how-much-did-log4shell-change","description":"December 9 marks two years since the world went on high alert because of what was deemed one of the most critical zero-day vulnerabilities ever: Log4Shell. The vulnerability that carried the highest possible severity rating (10.0) was in Apache Log4j, an ubiquitous Java logging framework that Veracode estimated at the time was used in 88 percent of organizations. \nIf exploited, the zero-day vulnerability (CVE-2021-44228) in Log4j versions Log4j2 2.0-beta9 through 2.15.0 (excluding security releases 2.12.2, 2.12.3, and 2.3.1) would allow attackers to perform a remote code execution (RCE) attack and compromise the affected server. \nIt triggered a massive effort to patch affected systems, estimated to be in the hundreds of millions. The apocalypse that many feared didn’t happen, but given its pervasiveness, the U.S. Department of Homeland Security’s Cyber Safety Review Board determined that fully remediating Log4Shell would take a decade. \nThe two-year anniversary of Log4Shell is a good…","pubDate":"Thu, 07 Dec 2023 13:23:31 -0500","dc:creator":"CEng@veracode.com (CEng)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64246"}},{"title":"Open Source Vulnerability Management Recommendations for 2024","link":"https://www.veracode.com/blog/managing-appsec/open-source-vulnerability-management-recommendations-2024","description":"Stepping in 2024, the dynamics of open source vulnerability management are shifting. Rapid changes to software development demand a more nuanced approach to open source security from practitioners. From redefining risk to the cautious integration of auto-remediation, here are the pivotal recommendations for successful open source vulnerability management in 2024 and beyond. \n1. Embrace the Permanence of Open Source (& It’s Vulnerabilities) \nWe’ve known it for years; open source is here to stay. Github’s Octoverse report tells us: “A whopping 97% of applications leverage open-source code, and 90% of companies are applying or using it in some way.” \nThe permanence (and risk) of open source is proven by the White House’s Executive Order on Improving the Nation’s Cybersecurity. It places huge importance on open source vulnerability management, calling it out specifically: “Developers often use available open source and third-party software components to create a product...…","pubDate":"Mon, 04 Dec 2023 12:06:25 -0500","dc:creator":"rhaynes@veracode.com (rhaynes)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64216"}},{"title":"How Dynamic Analysis Helps You Enhance Automation for DevSecOps","link":"https://www.veracode.com/blog/secure-development/how-dynamic-analysis-helps-you-enhance-automation-devsecops","description":"DevSecOps, also known as secure DevOps, represents a mindset in software development that holds everyone accountable for application security. By fostering collaboration between developers and IT operations and directing collective efforts towards better security decision-making, development teams can deliver safer software with greater speed and efficiency. \nDespite its merits, implementing DevSecOps can introduce friction into the development process. Traditional tools for testing code and assessing application security risk simply weren’t built for the speed that DevOps testing requires.\nTo navigate these challenges, development teams need to start with automated testing tools, as relying on manual processes can’t possibly keep pace with accelerated development timelines. Automation is considered key to continuous integration of security analysis and threat mitigation of dynamic workflows. As an extension of DevOps principles, DevSecOps automation helps integrate security testing…","pubDate":"Mon, 04 Dec 2023 10:39:37 -0500","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64211"}},{"title":"Preventing Broken Access Control Vulnerabilities in Web Applications","link":"https://www.veracode.com/blog/managing-appsec/preventing-broken-access-control-vulnerabilities-web-applications","description":"Understanding Broken Access Control\nAccess control is crucial for modern web development as it enables the management of how users, processes, and devices should be granted permissions to application functions and resources. Access control mechanisms also determine the level of access permitted and manifest activities carried out by specific entities. Broken access control vulnerabilities arise when a malicious user abuses the constraints on the actions they are allowed to perform or the objects they can access. Attackers typically leverage access control failures to gain unauthorized access to resources within the web application, run malicious commands, or gain a privileged user‘s permission. \nThis blog discusses broken access control vulnerabilities and common prevention techniques to better secure your web applications.\nAccess control issues enable unauthorized users to access, modify, and delete resources or perform actions that exceed their intended permissions. Broken access…","pubDate":"Fri, 01 Dec 2023 13:50:00 -0500","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64191"}},{"title":"Top 5 Open Source Security Risks IT Leaders Must Know","link":"https://www.veracode.com/blog/intro-appsec/top-5-open-source-security-risks-it-leaders-must-know","description":"Lurking in the open source software (OSS) that pervades applications around the world are open source security risks technology leaders must be aware of. Software is one of technology’s most vulnerable subsets with over 70% of applications containing security flaws. Here are the open source security risks IT leaders must be aware of to protect technology and help it scale safely. \nWhy Address Open Source Software Security Risks \nOn December 9, 2021, a Tweet exposed a vulnerability in the widely-used OSS library Log4j. It didn’t take long before attackers around the world were working to exploit the Log4j vulnerability. This incident was a wake-up call to how the security of a library can quickly change and proactive measures must be in place to protect from this danger.  \nLog4j is just one example of how vulnerabilities in open source pose significant risks that can impact operations, data security, and overall IT health. Strategic technology choices can make a big impact on how much…","pubDate":"Mon, 27 Nov 2023 16:01:16 -0500","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver64146"}},{"title":"DevSecOps Best Practices: Leveraging Veracode DAST Essentials","link":"https://www.veracode.com/blog/secure-development/devsecops-best-practices-leveraging-veracode-dast-essentials","description":"DevSecOps is a modern approach to software development that implements security as a shared responsibility throughout application development, deployment, and operations. As an extension of DevOps principles, DevSecOps helps your organization integrate security testing throughout the software development life cycle.\nIn this blog, we discuss DevSecOps best practices and practical steps to producing secure software.\n\nUnderstanding DevOps \nDevOps is a set of practices that combines software development (Dev) and IT operations (Ops). It aims to shorten the development life cycle and help you deliver software faster. DevOps is complementary to agile software development; several DevOps aspects came from the agile methodology.\nThe concept of DevOps practices and agility is nothing new for most companies and developers - most well-known frameworks (e.g., Scrum, XP, etc.) are applied in many teams throughout organizations. \nThe Power of DevSecOps \nDevOps primarily aims to expedite the…","pubDate":"Mon, 20 Nov 2023 19:09:05 -0500","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63931"}},{"title":"New Data Reveals Top Drivers of Secure Software in Financial Services Sector ","link":"https://www.veracode.com/blog/research/new-data-reveals-top-drivers-secure-software-financial-services-sector","description":"Across the globe, the financial services sector is affected by increased security regulations. To name a few, there is the United States’ Executive Order on Improving the Nation’s Cybersecurity, the European Union’s NIS2 Directive, the SEC’s new rules on disclosures, and ISO 20022. With so much pressure on the sector, Veracode is proud to present new data, looking specifically at organizations in this industry, that reveals the top drivers security teams can employ to measurably reduce their software security risk.  \n\"The security performance of financial applications generally outperforms other industries, with automation, targeted security training, and scanning via Application Programming Interface (API) contributing to a year-over-year reduction in the percentage of applications containing flaws,” shared our press release coverage of the research on 25 October, 2023.  \nLet’s dissect this research from the State of Software Security 2023 in Financial Services in more detail. \nData…","pubDate":"Wed, 15 Nov 2023 12:31:18 -0500","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63921"}},{"title":"Securing Your Web Applications and APIs with Veracode DAST Essentials","link":"https://www.veracode.com/blog/managing-appsec/securing-your-web-applications-and-apis-veracode-dast-essentials","description":"Web applications are one of the most common vector for breaches, accounting for over 40% of breaches according to Verizon's 2022 Data Breach Report. Ensuring that your web applications are sufficiently protected and continue to be monitored once they are in production is vital to the security of your customers and your organization. \nStaying Ahead of the Threat\nAttackers are constantly looking for new ways to exploit vulnerabilities and to breach web applications, which means that as their methods mature and they become more aggressive, even the most securely developed applications can become vulnerable. Organizations that only perform annual penetration tests on their web applications may be leaving themselves open to a breach that could be easily prevented with regular production scanning. \nApplication security outlines a collection of processes and tools focused on identifying, remediating, and preventing application-level vulnerabilities throughout the entire software development…","pubDate":"Sun, 12 Nov 2023 22:55:15 -0500","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63856"}},{"title":"Securing APIs: Practical Steps to Protecting Your Software","link":"https://www.veracode.com/blog/managing-appsec/securing-apis-practical-steps-protecting-your-software","description":"In the dynamic world of software development, Application Programming Interfaces (APIs) serve as essential conduits, facilitating seamless interaction between software components. This intermediary interface not only streamlines development but also empowers software teams to reuse code. However, the increasing prevalence of APIs in modern business comes with security challenges. That’s why we’ve created this blog post - to provide you with actionable steps to enhance the security of your APIs today. \nUnderstanding API Security\nAPI Security extends beyond protecting an application's backend services, including elements such as databases, user management systems, and components interacting with data stores. It involves adopting diverse tools and practices to strengthen the integrity of your tech stack. A strong API security strategy reduces the risk of unauthorized access and malicious actions, ensuring the protection of sensitive information.\nExploring API Vulnerabilities\nDespite the…","pubDate":"Tue, 07 Nov 2023 17:37:50 -0500","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63721"}},{"title":"SAST vs. DAST for Security Testing: Unveiling the Differences","link":"https://www.veracode.com/blog/intro-appsec/sast-vs-dast-security-testing-unveiling-differences","description":"Application Security Testing (AST) encompasses various tools, processes, and approaches to scanning applications to uncover potential security issues. Static Application Security Testing (SAST) and Dynamic Application Security Testing (DAST) are popularly used security testing approaches that follow different methodologies of scanning application codes across different stages of a software development lifecycle.  \nSAST follows a white-box testing approach to analyze the binary code to identify exploitable vulnerabilities and coding errors. On the other hand, DAST implements a black-box testing method, where security engineers parse simulated attack payloads through the application’s front end without exposing internal information on the application’s internal construct.  \nIn this blog, we will discuss SAST and DAST testing approaches, how they help detect vulnerabilities and application failures, their differences, and best use cases. \nStatic Application Security Testing (SAST) \nSAST…","pubDate":"Thu, 02 Nov 2023 13:45:06 -0400","dc:creator":"Jenny Buckingham@veracode.com (Jenny Buckingham)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63686"}},{"title":"How Executive Order on Artificial Intelligence Addresses Cybersecurity Risk","link":"https://www.veracode.com/blog/security-news/how-executive-order-artificial-intelligence-addresses-cybersecurity-risk","description":"Unlike in the 1800s when a safety brake increased the public’s acceptance of elevators, artificial intelligence (AI) was accepted by the public much before guardrails came to be. “ChatGPT had 1 million users within the first five days of being available,” shares Forbes. Almost a year later, on October 30, 2023, President Biden issued an Executive Order “to ensure that America leads the way in seizing the promise and managing the risks of artificial intelligence (AI).” Here’s what the Executive Order gets right about addressing cybersecurity risk and promise posed by AI. \nOverview of Key Points in the Executive Order on Artificial Intelligence \nBefore diving more deeply into a few cyber-specific aspects of the Executive Order on Artificial Intelligence, let’s look at some of the key points and goals included in this far-reaching order.  \nFrom requiring “developers of the most powerful AI systems share their safety test results and other critical information with the U.S. government” to…","pubDate":"Wed, 01 Nov 2023 14:51:15 -0400","dc:creator":"cwysopal@veracode.com (cwysopal)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63681"}},{"title":"Top 6 DevOps Web Application Security Best Practices","link":"https://www.veracode.com/blog/secure-development/top-6-devops-web-application-security-best-practices","description":"In today’s world, the importance of incorporating web application security best practices cannot be overstated. Recent studies show that web applications are the top attack vector in nearly 80% of incidents. The good news is DevOps processes lend themselves to integrated security practices. Here are the top six best practices for seamlessly weaving web application security into DevOps. \nThe Role of Web Application Security Best Practices in DevOps \nThe cornerstone of a successful DevOps practice is automation; this is why automating security within workflows (DevSecOps) makes so much sense. DevSecOps is lacing each step of the DevOps process and practice with security.  \nBy adding security into each step of the software development lifecycle (SDLC) – from planning to coding and building to testing to staging to operating and monitoring – the most important outputs of the SDLC are assured to be secure when deployed and attestable for compliance. Integrating security into each DevOps…","pubDate":"Mon, 30 Oct 2023 13:54:34 -0400","dc:creator":"cbertram@veracode.com (cbertram)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63621"}},{"title":"Securing Web Applications: A CISO’s Checklist for Tech Leaders","link":"https://www.veracode.com/blog/intro-appsec/securing-web-applications-cisos-checklist-tech-leaders","description":"As a CISO, securing web applications and ensuring their resilience against evolving cyber threats is a non-negotiable priority. Verizon’s Data Breach Investigations Report 2023 cites web applications as the top attack vector by a long shot (in both breaches and incidents). Here’s a simplified checklist for securing web applications that will help you improve your organization’s security posture and the integrity of your technology. \nAssessing Web Application Risk and Threats \nA powerful first step in securing web applications is discovery. You can’t secure what you don’t know about! Start with an inventory of your software or application portfolio to understand sources of risk and what you want to prioritize.  \nFor some this may be simple. For others it will be an essential inventory of what makes up your software and development process. Here are some questions to consider in your assessment of your portfolio: \n\nHow many applications do you have?  \n\n\nWhere do they reside?  \n\n\nWho…","pubDate":"Wed, 18 Oct 2023 11:21:23 -0400","dc:creator":"Sohail Iqbal@veracode.com (Sohail Iqbal)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63516"}},{"title":"Web Application Security: 5 Security Tips for Software Engineers","link":"https://www.veracode.com/blog/secure-development/web-application-security-5-security-tips-software-engineers","description":"As a software engineer in a cloud-native world, you’re the first line of defense in web application security. Armed with a few best practices that have a huge impact, securing both the code you create and the code you compile can be simple. Here are five tips that make your role easier in protecting data with secure development. \nOverview of Preventing Breaches with Web Application Security Practices \nGrowing threats in the digital landscape, like entering the era of AI-driven attacks, make proactive code security essential. A nonprofit organization focused on open-source software security, the Open Web Application Security Project (OWASP), maintains the OWASP Top 10, a list of the top 10 security risks faced by web applications. This is a foundational resource for ensuring secure code. Many of these risks can be handled using the tips that follow. \nTip 1: Start Building Apps with Security in Mind \nConsider security from the beginning. Here’s how CISA defines Secure by Design: “Secure…","pubDate":"Wed, 11 Oct 2023 10:19:23 -0400","dc:creator":"Michael Man@veracode.com (Michael Man)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63456"}},{"title":"A CISO Explains 4 Steps that Make it Easy to Stay Safe Online","link":"https://www.veracode.com/blog/security-news/ciso-explains-4-steps-make-it-easy-stay-safe-online","description":"To secure our world, Cybersecurity Awareness Month encourages four steps that make it easy to stay safe online. As a CISO, my team and I advocate for these practices constantly within our organization. If you are a security practitioner looking to bolster cybersecurity awareness, here’s a brief look at how we explain these steps to help make staying safe online easier. \nBefore we dive in, making cybersecurity practices relatable and clear is key to the adoption at any organization. Consider the recent disclosure of a new vulnerability affecting web applications. This is the type of real-life scenario that can be used to make the following information more relatable. New vulnerabilities like this one are what makes the first step so important. \nSoftware Updates – The Why & How \nSoftware updates are essential for keeping your computer secure and up-to-date. They can fix bugs, improve performance, add new features, and make your software compatible with new hardware and software. …","pubDate":"Mon, 02 Oct 2023 11:06:07 -0400","dc:creator":"Sohail Iqbal@veracode.com (Sohail Iqbal)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63286"}},{"title":"Resolving Webp Zero-day Vulnerability CVE-2023-4863","link":"https://www.veracode.com/blog/security-news/resolving-webp-zero-day-vulnerability-cve-2023-4863","description":"Executive Summary\nThe webp image library is vulnerable to Heap Buffer Overflow. The exact steps to exploit the vulnerability have not been disclosed publicly. The NSO group was actively caring out a campaign which infected Apple devices with spyware, which was disclosed by Citizen Lab. It was later discovered that the root of this attack is in the webp library, which exists in many popular applications such as Google Chrome and the Electron Framework. This vulnerability can be detected with Veracode SCA and Veracode Container scanning. We give guidance for testing and remediation below.\nHow to Detect and Remediate \nOption 1: Use one of the Veracode SCA scanners; Upload & Scan or Agent-based scan. We are able to detect the following uses of webp: \n\nWebp from OS package manager \n\nAn example is this alpine package  \n\n\nElectron declared as a dependency in package.json or code included in the node_modules directory \n\nPython Pillow library \n\nTo patch an application update to the…","pubDate":"Fri, 29 Sep 2023 10:12:09 -0400","dc:creator":"Nova Trauben@veracode.com (Nova Trauben)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63266"}},{"title":"New EMEA Software Security Data Demonstrates Necessity of SCA","link":"https://www.veracode.com/blog/research/new-emea-software-security-data-demonstrates-necessity-sca","description":"New software security data demonstrates that Software Composition Analysis (SCA) will help bolster the safety and integrity of open-source software usage for organizations in the Europe, Middle East, and Africa (EMEA) region in particular. The EU Cyber Resilience Act makes this research especially crucial and timely. Let’s dive in and look at recommendations for EMEA teams wanting to secure cloud-native development. \nUnderstanding EMEA Software Security Landscape \nThe software security landscape in EMEA is shaken up by the Commission’s proposal for a new Cyber Resilience Act (CRA) from 15 September 2022. It \"aims to safeguard consumers and businesses buying or using products or software with a digital component. The Act would see inadequate security features become a thing of the past with the introduction of mandatory cybersecurity requirements for manufacturers and retailers of such products, with this protection extending throughout the product lifecycle.”  \nWhen it comes to making…","pubDate":"Tue, 26 Sep 2023 09:52:36 -0400","dc:creator":"Robert Rhame@veracode.com (Robert Rhame)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63226"}},{"title":"Secrets Management Best Practices: Secure Cloud-native Development Series","link":"https://www.veracode.com/blog/research/secrets-management-best-practices-secure-cloud-native-development-series","description":"Build secure cloud-native applications by avoiding the top five security pitfalls we lay out in our Secure Cloud-native Development Series. This blog is the fifth and final part of the series, and it will teach you to handle credentials and secrets management best practices for securing cloud-native applications.\nEvery organization has their way of managing credentials. In the past, with legacy application architectures, this was a bit more manual and arduous. With cloud-native applications, we have options open to us that are seamless for handling credentials and secrets management. The level of sensitivity of the data will designate the means we use to protect credentials.  \nObviously, never check-in credentials to code repositories. But again, utilizing the cloud providers secret manager/vault can help us strengthen our security posture and minimize risk for leaked credentials within the architecture and application.  \nBest Practices for Secrets Management & Secure Cloud…","pubDate":"Mon, 25 Sep 2023 15:23:06 -0400","dc:creator":"dsilveri@veracode.com (dsilveri)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63206"}},{"title":"What Security Practitioners Can Learn from New SAST Vendor Analysis","link":"https://www.veracode.com/blog/intro-appsec/what-security-practitioners-can-learn-new-sast-vendor-analysis","description":"Developing and maintaining secure code at scale is hard. Having the right Static Application Security Testing (SAST) solution makes it easier, but how are practitioners to choose? In the following interview, you’ll learn about three emerging trends from detailed analysis of the SAST landscape in The Forrester Wave™: Static Application Security Testing, Q3 2023. \n\nVeracode earns the top scores across the Current Offering, Strategy, and Market Presence (tied) categories. To quote the report, “Veracode differentiates with reporting, remediation, and a programmatic approach” with a forward-looking vision that “translates to an exciting roadmap with AI-powered features for flaw prevention, automated remediation, intelligent prioritization, and cross-correlation of application security testing (AST) scans.” \nWhy a Report on SAST Matters Today\nI sat down with Christy Smith, Veracode’s Head of Analyst Relations, to talk about this timely report and what trends can be found in this quickly…","pubDate":"Tue, 19 Sep 2023 13:46:57 -0400","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63181"}},{"title":"Why New SEC Cyber Rules Promote Accountability and Maturity","link":"https://www.veracode.com/blog/intro-appsec/why-new-sec-cyber-rules-promote-accountability-and-maturity","description":"Deploying software and hoping it’s “safe enough” isn’t a measurable security strategy. It’s certainly not something that’s going to bode well when the time comes to disclose processes and practices for managing cybersecurity risks. The latest Securities and Exchange Commission (SEC) Cyber Rules will “require registrants to describe the board of directors’ oversight of risks from cybersecurity threats and management’s role and expertise in assessing and managing material risks from cybersecurity threats.”  \nHere’s why I’m optimistic this disclosure requirement begets the transparency and accountability needed to secure our digital future and promote maturity. I also share a critical action that executives can take now to align with the new cyber risk governance rules. \nA Brief Introduction to the 2023 SEC Rules on Cybersecurity Risk \nThe much-anticipated announcement of newly adopted cyber rules arrived from the SEC on July 26, 2023. These rules require public companies to disclose…","pubDate":"Mon, 18 Sep 2023 13:39:59 -0400","dc:creator":"Sohail Iqbal@veracode.com (Sohail Iqbal)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63161"}},{"title":"Easily Enable Encryption: Secure Cloud-native Development Series","link":"https://www.veracode.com/blog/research/easily-enable-encryption-secure-cloud-native-development-series","description":"Build secure cloud-native applications by avoiding the top five security pitfalls we lay out in our Secure Cloud-native Development Series. This blog is the fourth part of the series, and it will teach you why and how to easily enable encryption and save yourself headaches down the road.\nHere's a new motto: encrypt everything! When securely moving to cloud-native technologies, building encryption in from the start will save us a lot of headaches later. And it's actually anything but a headache to enable encryption while setting up your cloud-native development workflows. Here I’ll explain why enabling encryption will come in so handy, and what tools will help you do this with the greatest ease. \nA Scenario on Why You Need to Enable Encryption \nImagine the following scenario: you have been tasked with a quick and dirty POC for an upcoming service release. You design it and build something that works, but for reasons we don’t need to go into, the release has been pushed up, and now we…","pubDate":"Thu, 14 Sep 2023 17:46:27 -0400","dc:creator":"dsilveri@veracode.com (dsilveri)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63146"}},{"title":"Why Reduce Software Supply Chain Risks with Intelligent Software Security","link":"https://www.veracode.com/blog/security-news/why-reduce-software-supply-chain-risks-intelligent-software-security","description":"There’s a growing array of risks lurking within the supply chain of the digital solutions we increasingly depend upon. Leaving gaps in your software supply chain security (SSCS) could spell disaster for your organization. Let’s explore how new analysis defines an end-to-end solution and why Veracode was ranked as an Overall Leader, Product Leader, Innovation Leader, and Market Leader in the Software Supply Chain Security Leadership Compass 2023 by KuppingerCole Analysts AG. \nLeading the Charge: Software Supply Chain Security \nPicture a world where your security is only as strong as your weakest link, and that link could be a single line of code buried deep within open-source software from an unknown contributor. This is the reality of today’s software supply chain. Each component, whether it’s custom code, third-party libraries, or the configuration of CI/CD tools and infrastructure, presents a potential entry point for an attacker. \nMany players are working to provide solutions for…","pubDate":"Tue, 12 Sep 2023 14:07:47 -0400","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63106"}},{"title":"Managing Storage Access: Secure Cloud-native Development Series","link":"https://www.veracode.com/blog/research/managing-storage-access-secure-cloud-native-development-series","description":"Build secure cloud-native applications by avoiding the top five security pitfalls we lay out in our Secure Cloud-native Development Series. This blog is the third part of the series, and it will teach you how to secure cloud storage and handle access controls on S3 buckets.\nEach cloud provider has managed storage services that your organization is already probably utilizing.  Cloud storage such as Amazon Simple Storage Service (Amazon S3) or Azure storage tools are tightly integrated into the other managed services which makes it simple to manage. We will discuss specifically Amazon’s S3 storage service and how it relates to secure cloud-native development.   \nAn Introduction to Secure Cloud Storage and Access Control Configuration \nAmazon recently turned-on default server-side encryption (SSE) for all users using AES-256. Though most likely we already (or at least should have) had encryption turned on, it’s now one less thing to worry about. Additionally, tools such as Terraform can…","pubDate":"Tue, 05 Sep 2023 15:20:59 -0400","dc:creator":"dsilveri@veracode.com (dsilveri)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver63071"}},{"title":"How to Enable Logging: Secure Cloud-native Development Series","link":"https://www.veracode.com/blog/research/how-enable-logging-secure-cloud-native-development-series","description":"Build secure cloud-native applications by avoiding the top five security pitfalls we lay out in our Secure Cloud-native Development Series. This blog is the second part of the series, and it will teach you how and why to enable logging from the start. \nWe’re going to talk about enabling logging (cloud logging, to be specific). What’s the difference? Not much, other than the fact that it’s another managed service integrated with the tools we should already be utilizing.  \nWhy Enable Logging? \nAll developers/engineers know we need logging. But other conflicting priorities and time constraints get in the way sometimes, and it becomes a “we’ll do that on the next sprint”. I have worked on the engineering side of things as well as the security side, where I needed to track down network/application issues, or security incidents, only to find that we didn’t have logs or logging enabled on specific services.   \nEnabling logging can be compared to our own health. Even when we are young, we…","pubDate":"Mon, 28 Aug 2023 14:07:53 -0400","dc:creator":"dsilveri@veracode.com (dsilveri)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62966"}},{"title":"Security Researchers Share Insights on Black Hat 2023 Topics and Trends","link":"https://www.veracode.com/blog/research/security-researchers-share-insights-black-hat-2023-topics-and-trends","description":"Shocking to no one: Artificial Intelligence (AI) was a huge topic at Black Hat USA 2023, but what did we learn about it? With no shortage of talks on it, there are many insights to take into account. We asked highly skilled Software Security Researchers who attended both Black Hat and DEFCON to weigh-in on the most insightful moments, particularly related to AI. Here’s what we found. \nAI is a Double-edged Sword for Security \nAI presents society with a double-edged sword (especially when it comes to cybersecurity). John Simpson, Senior Security Researcher, explains: “AI is clearly the hot topic; at both Black Hat and DEFCON there was a lot of emphasis on the dangers but also significant talk about its potential usefulness.” \nThe intricate interplay between AI’s benefits and risks underscores the complexity of our rapidly evolving digital age. On the one hand, attackers are using AI to enhance their exploit capabilities. Conversely, we are able to enhance defenses with AI through tools…","pubDate":"Mon, 21 Aug 2023 10:25:54 -0400","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62896"}},{"title":"Enhancing Code Security with Generative AI: Using Veracode Fix to Secure Code Generated by ChatGPT","link":"https://www.veracode.com/blog/secure-development/enhancing-code-security-generative-ai-using-veracode-fix-secure-code","description":"Artificial Intelligence (AI) and companion coding can help developers write software faster than ever. However, as companies look to adopt AI-powered companion coding, they must be aware of the strengths and limitations of different approaches – especially regarding code security.  \nWatch this 4-minute video to see a developer generate insecure code with ChatGPT, find the flaw with static analysis, and secure it with Veracode Fix to quickly develop a function without writing any code. \n\nThe video above exposes the nuances of generative AI code security. While generalist companion coding tools like ChatGPT excel at creating functional code, the quality and security of the code often falls short. Specialized solutions like Veracode Fix - built to excel at remediating insecure code - bring a vital security skillset to generative AI. By using generalist and specialist AI tools in collaboration, organizations can empower their teams to accelerate software development that meets functional…","pubDate":"Thu, 17 Aug 2023 13:01:00 -0400","dc:creator":"dmaguire@veracode.com (dmaguire)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62891"}},{"title":"Find Security Flaws in Your Dart & Flutter Applications: Veracode Expands Mobile Application Security Support","link":"https://www.veracode.com/blog/secure-development/find-security-flaws-your-dart-flutter-applications-veracode-expands-mobile","description":"Veracode recently released Static Analysis support for Dart 3 and Flutter 3.10. This makes it possible for developers to leverage the power of Dart and Flutter and deliver more secure mobile applications by finding and resolving security flaws earlier in the development lifecycle when they are fastest and least expensive to fix. The release also expanded Veracode’s extensive support covering over 100 languages and frameworks, and we thought it presented a good opportunity to dive into the topic of language support: how we prioritize languages to support, the research process and what goes into actually developing support, what the team is currently working on – and how customers can influence that direction through our Community Ideas Portal.\nHow Does Veracode Prioritize Languages and Frameworks to Support?\nThere are more languages and frameworks than resources and time to support them. This means prioritization is key. Veracode takes a highly considered approach to selecting…","pubDate":"Mon, 07 Aug 2023 17:05:41 -0400","dc:creator":"Mike_McGreevey@veracode.com (Mike_McGreevey)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62856"}},{"title":"Why SCA is Critical for Securing the Software Supply Chain","link":"https://www.veracode.com/blog/intro-appsec/why-sca-critical-securing-software-supply-chain","description":"Weaknesses within software supply chains create a foothold for exploitation from cyberattacks. The problem is so significant that even the White House released an Executive Order that speaks directly on this topic. “The Federal Government must take action to rapidly improve the security and integrity of the software supply chain,” states the Executive Order emphatically. Now, you may be wondering what your organization can do to mitigate this risk. Let’s dive into understanding risk in the software supply chain and the solutions currently available for improving your supply chain security and overall cybersecurity posture. \nUnderstanding Risk in the Software Supply Chain \nTo understand risk in the software supply chain, one must understand its components. These components include source code, version control, build systems, dependencies, testing deployment, continuous integration/continuous deployment (CI/CD), release management, and monitoring. Each of these components has different…","pubDate":"Thu, 27 Jul 2023 17:23:34 -0400","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62771"}},{"title":"SBOM Explained: How SBOMs Improve Cloud-native Application Security","link":"https://www.veracode.com/blog/secure-development/sbom-explained-how-sboms-improve-cloud-native-application-security","description":"A staggering 96% of organizations utilize open-source libraries, yet fewer than 50% actively manage the security vulnerabilities within these libraries. Vulnerabilities are welcome mats for breaches from bad actors, and once they've entered your system, the impact can be colossal. A software bill of materials (SBOM) is an important tool for managing the security of open-source software. Here we will explore how SBOMs help organizations understand what’s in their applications, ensure regulatory compliance, and manage overall risk.  \nWhere Do SBOMs Fit in Your Application Security Program?\nThink of an SBOM as a magnifying glass that allows you to get a closer look at what goes on in your cloud-native applications. SBOMs provide a detailed view of open-source components that developers and security professionals can use to understand the security of third-party libraries and dependencies used in an application. With that information, teams can create cyber hygiene campaigns against known…","pubDate":"Thu, 20 Jul 2023 11:35:59 -0400","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62756"}},{"title":"Improve Visibility, Reporting, and Automation With Veracode’s Reporting API","link":"https://www.veracode.com/blog/customer-news/improve-visibility-reporting-and-automation-veracodes-reporting-api","description":"A high-functioning security program leverages data to drive optimization – by satisfying governance, reporting, and compliance (GRC) requirements efficiently, creating visibility for risk-based prioritization, and leveraging automation throughout the software development lifecycle. Often, however, the data needed to drive these processes is spread across a complex ecosystem. Fortunately, solutions like Veracode’s new Reporting API provide data extensibility making it easy for you to leverage your rich application security testing data beyond the Veracode platform. \nHere are three examples of how you can leverage Veracode’s new Reporting API to simplify reporting, improve decision support, and drive automation in your DevSecOps program. \nUsing Application Security Testing Data Extensibility for Centralized Visibility and Reporting \nRarely does a single platform or solution generate all the data relevant to an organization’s DevSecOps program. This means consumers of the data either…","pubDate":"Wed, 12 Jul 2023 11:17:50 -0400","dc:creator":"dmaguire@veracode.com (dmaguire)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62736"}},{"title":"How to Decide Whether Vulnerability Remediation Augmented by Generative AI Reduces or Incurs Risk","link":"https://www.veracode.com/blog/managing-appsec/how-decide-whether-vulnerability-remediation-augmented-generative-ai-reduces","description":"Software security vendors are applying Generative AI to systems that suggest or apply remediations for software vulnerabilities. This tech is giving security teams the first realistic options for managing security debt at scale while showing developers the future they were promised; where work is targeted at creating user value instead of looping back to old code that generates new work. However, there are certain concerns with the risks of utilizing Generative AI for augmenting vulnerability remediation. Let’s explore this rapidly evolving landscape and how you can reap the benefits without incurring the risks. \nWhat Risks Generative AI Augmented Vulnerability Remediation Solutions Could Pose \nLegal challenges to data sourcing expose the risk of training Generative AI models on all code. Unfortunately, that hasn’t stopped many vendors from taking the position that a model trained on open-source code is sufficiently safe from IP and code provenance concerns.  \nNot all code is equally…","pubDate":"Mon, 10 Jul 2023 12:57:59 -0400","dc:creator":"Kyle Metivier@veracode.com (Kyle Metivier)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62711"}},{"title":"How to Measurably Reduce Software Security Risk with Veracode Fix","link":"https://www.veracode.com/blog/secure-development/how-measurably-reduce-software-security-risk-veracode-fix","description":"Veracode Fix is now available as an add-on to Veracode Static Analysis for customers on the North American instance. Availability for customers on Veracode’s EMEA and FedRAMP instances will be coming soon! \nFrom nearly two decades of securing software, we know that fixing flaws, not just finding them, is what makes a profound impact on security posture. However, fixing flaws is one of the greatest challenges teams face when it comes to application security...until now. Veracode Fix marks a major leap forward in software security; it shifts the paradigm from application security testing tools that find flaws to intelligent solutions that generate fixes. Here’s how you can save time and secure more with AI-generated fixes developers can easily review and implement without manually writing any code.  \nThe Problem: Too much time. Too little security. \nIf we look at the current remediation workflows, developers are often asked to spend time they don’t have, fixing flaws they don’t…","pubDate":"Wed, 28 Jun 2023 15:47:09 -0400","dc:creator":"dmaguire@veracode.com (dmaguire)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62611"}},{"title":"Public Sector Software Security Two Years After Cybersecurity Executive Order","link":"https://www.veracode.com/blog/research/public-sector-software-security-two-years-after-cybersecurity-executive-order","description":"When the Public Sector wins, we all win. Rooting for the security of Public Sector software is something that comes naturally to Veracode. Federal agencies are tackling an incredibly difficult job, and the road to success is meaningful to us all – regardless of our sector or industry. The push for software security came strongly via specific requirements in the Executive Order on Improving the Nation’s Cybersecurity in 2021. Here’s a look at how Public Sector software security is doing two years later. \nA Brief Background on the Executive Order on Cybersecurity \nWe believe the release of the Executive Order (EO) on Cybersecurity in May of 2021 is a long time coming (watch our co-founder explain why). What really stands out to us about this EO is how action-oriented it is. The EO gets specific about types of security controls government agencies must adhere to, and it also includes what to look for in software vendors selling to government agencies. \nA key element of the EO is the Zero…","pubDate":"Wed, 21 Jun 2023 14:48:11 -0400","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62526"}},{"title":"The Art of Reducing Security Debt In 3 Key Steps","link":"https://www.veracode.com/blog/intro-appsec/art-reducing-security-debt-3-key-steps","description":"Introduction \n \nIn the ever-evolving landscape of digital threats and cybersecurity challenges, organizations face a significant burden known as security debt. Just like financial debt, security debt accrues when organizations compromise security measures in favor of convenience, speed, or cost-cutting measures. Over time, this accumulated debt can pose serious risks to the organization's data, reputation, and overall stability. However, with a strategic approach and a commitment to proactive security practices, organizations can effectively reduce their security debt. In this blog post, we will explore the art of reducing security debt in three key steps, enabling organizations to strengthen their security posture and safeguard their valuable assets.\n \nStep 1: Assess and Prioritize Security Risks \n \nThe first step in reducing security debt is to conduct a thorough assessment of your organization's security risks. This involves identifying vulnerabilities, evaluating existing security…","pubDate":"Tue, 20 Jun 2023 14:45:25 -0400","dc:creator":"broche@veracode.com (broche)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62521"}},{"title":"Application Security in the Era of AI-driven Attacks","link":"https://www.veracode.com/blog/intro-appsec/application-security-era-ai-driven-attacks","description":"Introduction\n \nIn today’s digital landscape, the importance of application security cannot be overstated, as businesses worldwide face evolving cyber threats. Both defenders and attackers are now harnessing the power of Artificial Intelligence (AI) to their advantage. As AI-driven attacks become increasingly sophisticated, it is crucial for organizations to adopt a comprehensive approach to application security that effectively addresses this emerging threat landscape. In this blog post, we will explore the significance of adopting a robust application security strategy in the face of AI-driven attacks and provide concrete examples to support our claims.\n \nThe Evolving Threat Landscape: AI-powered Attacks\n \nAI has transformed numerous industries, unfortunately including cybercrime. Hackers are leveraging AI to develop advanced and automated attacks that can bypass traditional security measures. Let’s delve into some concrete examples of AI-powered attacks:\n \n1. AI-powered Malware:…","pubDate":"Fri, 09 Jun 2023 12:10:38 -0400","dc:creator":"broche@veracode.com (broche)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62396"}},{"title":"Get It Right First Time with a Comprehensive Approach to Application Security","link":"https://www.veracode.com/blog/intro-appsec/get-it-right-first-time-comprehensive-approach-application-security","description":"Introduction\n \nIn the rapidly evolving digital landscape, ensuring robust application security is paramount for organizations. With the emergence of AI-powered attacks and other sophisticated threats, it is crucial to integrate comprehensive Application Security Testing (AST) into the Software Development Lifecycle (SDLC). By leveraging an effective AST platform that provides comprehensive coverage, organizations can seamlessly incorporate application security testing as a natural and essential part of the development process. In this blog post, we will explore the significance of an AST platform with comprehensive coverage in strengthening application security within the SDLC.\n \nThe Need for Comprehensive Application Security Testing\n \nAs applications become more complex and vulnerabilities continue to evolve, comprehensive application security testing is crucial. Traditional testing methods alone are often insufficient to identify all potential security weaknesses. By adopting an…","pubDate":"Fri, 09 Jun 2023 01:53:07 -0400","dc:creator":"broche@veracode.com (broche)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62391"}},{"title":"Five Leadership Tips to Set Up Your Business for AppSec Success","link":"https://www.veracode.com/blog/intro-appsec/five-leadership-tips-set-your-business-appsec-success","description":"Introduction\nIn today's digital landscape, ensuring the security of your applications is of paramount importance. AppSec, short for Application Security, involves safeguarding your software applications against potential threats and vulnerabilities. While implementing robust AppSec practices is crucial, effective leadership plays a vital role in setting up your business for AppSec success. In this blog, we will explore five key leadership tips to help you prioritize and establish a strong foundation for application security within your organization.\n\nPromote a Culture of Security\nLeaders should foster a culture where security is a top priority. Promote awareness of AppSec risks and provide regular training on secure coding practices. Encourage open communication about security concerns and involve all stakeholders in the process. By making security a core value, employees will understand its importance and actively contribute to AppSec efforts. Leveraging Veracode's platform, such as…","pubDate":"Thu, 08 Jun 2023 03:48:20 -0400","dc:creator":"broche@veracode.com (broche)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62386"}},{"title":"3 Reasons to Leverage AI for Enhanced Threat and Vulnerability Management","link":"https://www.veracode.com/blog/intro-appsec/3-reasons-leverage-ai-enhanced-threat-and-vulnerability-management","description":"As the cyber threat landscape continues to evolve, you know there’s a growing need to ensure applications and software are protected from malicious actors. A holistic and intelligent approach to threat and vulnerability management is essential for ensuring security against modern cyber risk. By leveraging AI-powered tools, especially for tasks like remediating security flaws, you can manage and reduce risk quickly and effectively. Let’s explore why using AI to bolster and modernize your threat and vulnerability management strategies will pay off big time in the long run. \nReason 1: To Stay Ahead of Rapidly Evolving Cybersecurity Threats \nThreat and vulnerability management helps businesses understand and respond to risk, but what about when the threat landscape is evolving so rapidly? When new threats emerge constantly, it’s challenging to take a preventative approach to potential attacks in applications, software, and networks. \nFor example, one particularly concerning new trend is…","pubDate":"Wed, 07 Jun 2023 16:19:57 -0400","dc:creator":"ntischler@veracode.com (ntischler)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62381"}},{"title":"Securing the Software Supply Chain: Protecting Against Insecure Code Downloads","link":"https://www.veracode.com/blog/intro-appsec/securing-software-supply-chain-protecting-against-insecure-code-downloads","description":"Introduction\nIn today's interconnected world, securing the software supply chain is crucial for maintaining robust application security. Developers often rely on package managers to import third-party code and libraries, but this convenience comes with risks. Insecure code downloads can introduce vulnerabilities that compromise the integrity of your software.\nIn this blog post, we will explore essential steps to secure the supply chain and prevent developers from downloading insecure code from package managers.\nPackage Manager Security: Start by using a reputable package manager that prioritizes security. Popular package managers like npm, PyPI, and Maven have built-in security features, including package signing, vulnerability scanning, and dependency tracking. These measures help ensure the packages you download are from trusted sources.\nCode Auditing and Testing: Implement a rigorous code auditing and testing process to identify vulnerabilities within your codebase. Regularly…","pubDate":"Sat, 27 May 2023 10:43:28 -0400","dc:creator":"broche@veracode.com (broche)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62311"}},{"title":"Colliding with the Future: The Disruptive Force of Generative AI in B2B Software","link":"https://www.veracode.com/blog/research/colliding-future-disruptive-force-generative-ai-b2b-software","description":"Over the past few months, our collective fascination with AI has reached unprecedented heights, leading to an influx of information and discussions on its potential implications. It seems that wherever we turn, AI dominates the conversation. AI has captivated the imaginations of tech enthusiasts, researchers, and everyday individuals alike.\nAt the tender age of 11, I received my very first computer, the legendary ZX Spectrum. Looking back, it's hard to believe how much has changed since then. A few years later, I eagerly built my own 286 computer, a proud accomplishment that fueled my passion for technology and software engineering.\nThose early experiences left an indelible mark on me, instilling a sense of excitement and curiosity that has endured to this day. It is this very same enthusiasm that now fills me as I delve into the captivating realms of Artificial Intelligence (AI) and Machine Learning (ML).\nThose first experiences felt like a tectonic shift in my life. Now, as we…","pubDate":"Thu, 25 May 2023 06:50:21 -0400","dc:creator":"broche@veracode.com (broche)","guid":{"@isPermaLink":"true","#text":"https://www.veracode.com/ver62306"}}]}}}