{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","@xmlns:georss":"http://www.georss.org/georss","@xmlns:geo":"http://www.w3.org/2003/01/geo/wgs84_pos#","channel":{"title":"World – TIME","atom:link":{"@href":"https://time.com/world/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://time.com","description":"Current & Breaking News | National & World Updates","lastBuildDate":"Sun, 28 Jan 2024 02:44:41 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.1.4","site":{"@xmlns":"com-wordpress:feed-additions:1","#text":"228315549"},"item":[{"title":"Who Needs Holocaust Remembrance Day in 2024?","link":"https://time.com/6589026/holocaust-remembrance-day-2024/","comments":"https://time.com/6589026/holocaust-remembrance-day-2024/#respond","dc:creator":{"#cdata-section":"Rabbi Moshe Hauer"},"pubDate":"Sat, 27 Jan 2024 12:00:00 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"freelance"},{"#cdata-section":"Israel-Hamas War"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6589026"},"description":{"#cdata-section":"Rabbi Moshe Hauer wrestles with the meaning of Holocaust Remembrance Day amidst the attacks on Israel and rising antisemitism."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6589026\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6589026/holocaust-remembrance-day-2024/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/GettyImages-1962974275.jpg\" alt=\"Eve Of International Holocaust Remembrance Day\"/>\n\n\n\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n<p>Recently, my mother, who escaped Hungary as a young teen in 1943 as the Nazis were closing in, called me from her home in Jerusalem. She was quite agitated, asking why even Israel&rsquo;s loyal friends seem to be promoting compromise on issues fundamental to its security. She begged me to speak to anyone and everyone I know, from community leaders to elected officials.</p>\n\n\n\n<p>As the world marks Saturday, January 27, as the annual International Holocaust Remembrance Day, it is clear that my mother needs no such day. The question the Jewish people must be asking is who will benefit from a day in January, 2024, designated to remember the Holocaust?</p>\n\n\n\n<p>The Holocaust deniers, including<a href=\"https://apnews.com/article/palestinians-israel-holocaust-abbas-antisemitism-1d84b3a82f0d8ff3fd8601f06bc1176e\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\"> President Mahmoud Abbas</a> of the Palestinian Authority, many Western nations&rsquo; preferred steward of Gaza for the day after the war, and Iran&rsquo;s supreme leader<a href=\"https://www.theatlantic.com/newsletters/archive/2022/06/iran-ayatollah-ali-khamenei-twitter-anti-semitism/676798/\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\"> Ayatollah Ali Khamenei</a>, whose country funds Hamas and the other armed groups attacking Israel and its allies on multiple fronts, will not benefit from it. They cannot commemorate something they claim never occurred.</p>\n\n\n\n<p>The United Nations, which at the initiative of its Israeli delegation designated the day back in 2005 to build Holocaust awareness and prevent further acts of genocide, now deploys the lessons of the Holocaust against the Jewish people. The U.N. has yet to condemn the explicitly and admittedly genocidal acts of Hamas against Israel on October 7 while its International Court of Justice is trying Israel for genocide in Gaza. If this is the result of remembering the Holocaust, we Jews would prefer they forgot about it.</p>\n\n\n\n<p>Jews surely don&rsquo;t need this day. Many of us have been remembering the Holocaust every day since that dark day in October. The Holocaust is why we do not use the word &ldquo;unprecedented&rdquo; to describe the monstrous and unspeakable acts of cruelty committed in Be&rsquo;eri and Kfar Aza, the blind hatred that drives others to destroy us even if it destroys them, and the apathy of the nations of the world who &ndash; with the notable exception of the United States and a few others &ndash; are either supporting evil or standing silently by.</p>\n\n\n\n<p>For my mother, for me, and for many Jews, the Holocaust is the precedent, the comparable, the question that, since the Hamas massacres, bewildered and frightened Jews have been asking themselves and anyone who will listen. The Holocaust is why we have no naivete about the tunnel builders, hang gliders, and missile launchers who, in their unflagging genocidal pursuit of the Jews, continue to dream, plan, rearm, and reorganize. It is why we in the U.S. are so frightened by the violent tone of the ubiquitous pro-Palestinian protests and by the intimidation of <a href=\"https://time.com/6333456/jewish-students-college-antisemitism-essay/\" >Jews on campuses</a>. We have seen this all before and shame on us if we allow ourselves to forget and fall prey once again to the empty promises of those masquerading as peacemakers and to the assumption that in the Western civilized world of course Jews will be safe.</p>\n\n\n\n<p>Everyday since Oct. 7, my mother is reminded of and haunted by the delusions of her grandparents and more than a dozen uncles and aunts who naively chose not to join her parents&rsquo; escape to Palestine as the Nazi menace spread, only to be turned to ashes in Auschwitz. She often muses aloud about how my father, of blessed memory, a Holocaust survivor, would process October 7th in Israel, October 8th in Harvard, and October 9th in the UN.</p>\n\n\n\n<p>But let us not cancel Holocaust Remembrance Day. Let us mark it with those who have traditionally been our friends and supporters in government and the arena of public opinion, those people we have brought year after year to Yad Vashem and other Holocaust memorials, who have wished only good for the Jewish people but who see our situation from the outside.&nbsp;</p>\n\n\n\n<p>Although they have done much good for us, and still do mean well, it has now become obvious that they cannot possibly see the current realities as we do. These friends are now wavering, running out of patience, understandably shaken by the devastating images from Gaza and by their desperate desire to bring the hostages home, hoping against hope&mdash;as do all good people&mdash;for the imminent arrival of the blessings of peace. It is for these reasons they are urging Israel to stop the war short of achieving its critical goal of decisively destroying Hamas and its terror infrastructure.</p>\n\n\n\n<p>There is a classic Jewish teaching that warns us against judging others until we stand in their place. Things look different from the sidelines than they do from the battlefield. Holocaust Remembrance Day is an opportunity for American and allied leaders and citizens to stand in our place and see Hamas, the United Nations, the ICJ, certain protestors and university leaders, and a long list of others through the eyes of Jews, the survivors of the Nazis and the Jew-haters of each and every generation, experiencing once again an all-too-familiar existential threat. To see them through the eyes of my mother.</p>\n\n\n\n<p>It is also an opportunity for these allies and friends to stand in the places of British Prime Minister Neville Chamberlain and President Franklin D. Roosevelt and of the leaders and press of the free world who failed miserably in the 1930&rsquo;s and 40&rsquo;s. It is the current generation&rsquo;s opportunity, to do it right, to act decisively against evil by living up to the commitment made by Churchill on February 9, 1941: &ldquo;Give us your faith and your blessing, and, under Providence, all will be well. We shall not fail or falter; we shall not weaken or tire. Neither the sudden shock of battle, nor the long-drawn trials of vigilance and exertion will wear us down. Give us the tools, and we will finish the job.&rdquo;</p>\n\n\n\n<p>That would make Holocaust Remembrance Day 2024 meaningful for everyone, even my mother. Maybe she would finally feel like people are listening, learning from the history she lived, and will take the right actions now.</p>\n"},"wfw:commentRss":"https://api.time.com/6589026/holocaust-remembrance-day-2024/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6589026"}},{"title":"13 Men Suddenly Executed in Iraq as the Country Resumes Mass Executions","link":"https://time.com/6589057/iraq-mass-executions-capital-punishment/","comments":"https://time.com/6589057/iraq-mass-executions-capital-punishment/#respond","dc:creator":{"#cdata-section":"Astha Rajvanshi"},"pubDate":"Fri, 26 Jan 2024 18:28:53 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"News"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6589057"},"description":{"#cdata-section":"On Dec. 24, 13 Iraqi inmates in the Nasiriyah prison were unexpectedly executed—the country's first mass execution after a three year pause."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6589057\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6589057/iraq-mass-executions-capital-punishment/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/GettyImages-1241139186.jpg\" alt=\"IRAQ-BRITAIN-GERMANY-ARCHAELOGY-SENTENCE\"/>\n\n\n\n<p>On Dec. 24, 2023, the names of 13 Iraqi prisoners with criminal sentences were unexpectedly <a href=\"https://shafaq.com/ar/%D8%A3%D9%85%D9%80%D9%86/%D8%B9%D8%AF%D8%A7%D9%85-%D8%B9%D8%B4%D8%B1%D8%A9-%D9%85%D8%AF%D8%A7%D9%86%D9%8A%D9%86-%D9%81%D9%8A-%D8%A7%D9%84%D8%AD%D9%88%D8%AA-%D8%AC%D9%86%D9%88%D8%A8%D9%8A-%D8%A7%D9%84%D8%B9%D8%B1%D8%A7%D9%82\"  target=\"_blank\">called out</a> on the loudspeaker inside the Nasiriyah Central Prison in Southern Iraq. The next morning, all the men were executed under the death sentence, in what one Iraqi media outlet <a href=\"https://www.basnews.com/en/babat/834052\"  target=\"_blank\">described</a> as &ldquo;secret executions&rdquo; carried out without any transparency or advanced notice to avoid any negative publicity and international condemnation.  The 13 prisoners were not allowed to call their families or lawyers before they were executed, <a href=\"https://www.hrw.org/news/2024/01/24/iraq-unlawful-mass-executions-resume\"  target=\"_blank\">according</a> to another inmate. </p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>It was the first mass execution carried out by Iraq&rsquo;s Ministry of Justice since November 2020, when 21 men were executed for terrorism charges. Now at least 150 prisoners face imminent execution without warning, Human Rights Watch (HRW) <a href=\"https://www.hrw.org/news/2024/01/24/iraq-unlawful-mass-executions-resume\"  target=\"_blank\">warned</a> this week, if Iraqi President Abdul Latif Rashid approves their death sentences. </p>\n\n\n\n<p>The executions appear to be a sudden pivot from 2020, when the number of executions and death sentences were on a downward trend in Iraq after the issue received critical attention from international rights groups.</p>\n\n\n\n<p>&ldquo;The mass executions in Iraq are a terrible example of the arbitrariness of the cruel punishment,&rdquo; Aurelie Placais, the Director of the World Coalition Against the Death Penalty, tells TIME. &ldquo;It&#8217;s arbitrary because there seems to be no specific reason as to why now, why these people and why in this prison,&rdquo; she continues.&nbsp;</p>\n\n\n\n<p>Nasiriyah prison is the only prison in Iraq that carries out executions. Commonly referred to as &ldquo;<a href=\"https://shafaq.com/en/Iraq-News/Al-Hout-houses-8-000-inmates-on-death-row-each-cost-10-a-day-source\"  target=\"_blank\">al hout</a>&rdquo; or &ldquo;the whale&rdquo; by Iraqis for &ldquo;swallowing people up and never spitting them out,&rdquo; according to HRW, it has carried out mass executions in the past. In 2017, <a href=\"https://www.ohchr.org/en/press-releases/2017/09/un-human-rights-chief-appalled-iraq-mass-execution\"  target=\"_blank\">41</a> and <a href=\"https://www.amnesty.org/en/latest/news/2017/12/iraq-38-hanged-in-abhorrent-mass-execution/\"  target=\"_blank\">38</a> people respectively were executed less than three months apart. Currently, 8,000 prisoners are reported to be on death row in Iraq, with the majority facing terrorism charges. </p>\n\n\n\n<h3>More From TIME</h3>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=EL89mTXS autostart=\"viewable\"]</div>\n\n\n\n<p>In the past, the Iraqi government has <a href=\"https://worldcoalition.org/wp-content/uploads/2022/04/Iraq-CAT-Death-Penalty-FINAL-1.pdf\"  target=\"_blank\">asserted</a> that its use of the death penalty &ldquo;is restricted to the most serious offenses,&rdquo; including those that affect the &#8220;right to life or the peace and security of society.&rdquo; Iraq currently ranks fifth among countries that carry out the most death sentences globally, according to Amnesty International.</p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2024/01/AP21110708357992.jpg\" alt=\"Mideast Executions\"/>\n\n\n\n<p>HRW has called the latest renewal of mass executions &ldquo;an appalling development,&rdquo; urging Iraqi authorities to immediately declare a moratorium on all executions with the intention of abolishing the death penalty. Matthew Goldberg, who founded the World Coalition Against the Death Penalty, added that &ldquo;declaring a moratorium is the clearest path to immediately demonstrate respect for the fundamental principle of human dignity.&rdquo;</p>\n\n\n\n<p>Experts also say that the punishment is compounded by existing flaws in Iraq&rsquo;s judicial system, including denying defendants a fair trial. The trend is most prevalent in terrorism trials, which have generally been described as rushed, based on forced confessions, and without the victim&rsquo;s participation. HRW says Iraqi authorities have <a href=\"https://www.hrw.org/news/2017/12/05/iraq-flawed-prosecution-isis-suspects\"  target=\"_blank\">systematically</a> violated due process under Iraqi law, which states that detainees have the right to a lawyer, speak to their families, and see a judge within 24 hours of their arrest. </p>\n\n\n\n<p>&ldquo;The death penalty is an unquestionably cruel punishment that appears to be only further exacerbated, in Iraq at present, by opaque and unfair legal processes,&rdquo; Goldberg said. He continued, &ldquo;We should have no confidence that fair trial rights and related safeguards are being protected, or upheld, in these circumstances.&rdquo;</p>\n"},"wfw:commentRss":"https://api.time.com/6589057/iraq-mass-executions-capital-punishment/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6589057"}},{"title":"What International Law Can’t Achieve in Gaza and Ukraine","link":"https://time.com/6588977/international-law-israel-gaza-ukraine-russia/","comments":"https://time.com/6588977/international-law-israel-gaza-ukraine-russia/#respond","dc:creator":{"#cdata-section":"Janina Dill"},"pubDate":"Fri, 26 Jan 2024 18:15:43 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"freelance"},{"#cdata-section":"Israel-Hamas War"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588977"},"description":{"#cdata-section":"These two major conflicts appear to demonstrate the weakness of international law. But war without law is no alternative at all. "},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588977\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6588977/international-law-israel-gaza-ukraine-russia/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/GettyImages-1918779274.jpg\" alt=\"NETHERLANDS-SAFRICA-ISRAEL-PALESTINIAN-CRIME\"/>\n\n\n\n<p>International law should restrain military aggression, help punish wrongdoers, and provide some guidance to conducting warfare ethically. In Ukraine and Gaza, international law seems to be doing none of these things. And yet these conflicts still underscore that international law is what we have and, more than ever, strengthening it must be a moral and political priority. </p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>International law is omnipresent in public discussions of <a href=\"https://time.com/6329188/ukraine-volodymyr-zelensky-interview/\" >Russia&rsquo;s war in Ukraine</a> and Israel&rsquo;s <a href=\"https://time.com/6342831/israelis-palestinians-nation-builders/\" >war in Gaza</a>. Everyone&mdash;from world leaders to the press to ordinary people on social media&mdash;speak about a state&rsquo;s right to self-defense, the need to ensure war crimes are not committed, and to guarantee the jurisdictional reach of international courts when they are. Given how much international law is discussed in the context of war, we expect it to constrain its reality. But, for three reasons, the wars in Ukraine and Gaza appear to demonstrate the weakness of international law. </p>\n\n\n\n<p>First, these wars have caused unimaginable horrors but world leaders have co-opted the language of law to defend them. Russia has offered legal justifications for what is evidently a war of aggression, which threatened Ukraine&rsquo;s survival and has killed <a href=\"https://www.nytimes.com/2023/08/18/us/politics/ukraine-russia-war-casualties.html\"  target=\"_blank\">tens of thousands</a> of Ukrainians, wounding and displacing many more. Israel, in contrast to Russia, has a plausible claim to be acting in self-defense. But it continues to violate the laws of war in its response to the <a href=\"https://time.com/6321849/israel-attack/\" >Oct. 7 Hamas attack</a> that left 1,200 people dead. Israel&rsquo;s military maintains the legality of attacks that destroy hospitals, schools, and places of worship&mdash;attacks that have killed at least <a href=\"https://www.npr.org/2024/01/21/1225883522/palestinian-death-toll-soars-past-25-000-in-gaza-with-no-end-to-war-in-sight\"  target=\"_blank\">25,000 people</a>, most of them women and children. Military operations that are causing <a href=\"https://time.com/6554472/gaza-starved-hunger-airdrop-food-aid/\" >catastrophic starvation</a> are argued to meet the rules of conducting warfare. The reality of these wars seems to suggest that international law legitimizes rather than limits violence.  </p>\n\n\n\n<p>Second, the International Criminal Court (ICC)&mdash;created in 1998 to hold to account those who committ war crimes, crimes against humanity, or genocide&mdash;prominently investigates but has not punished wrongdoing in these conflicts. The second anniversary of the <a href=\"https://time.com/6166681/bucha-massacre-ukraine-dispatch/\" >Bucha massacre</a>&mdash;which saw hundreds of Ukrainian civilians tortured, raped, and killed&mdash;is approaching but none of the perpetrators been brought to justice. The ICC&rsquo;s unprecedented step of <a href=\"https://time.com/6264280/vladimir-putin-icc-warrant-arrest/\" >issuing an arrest warrant</a> against a sitting head of state that is a permanent member of the U.N. Security Council has barely inconvenienced Vladimir Putin. The ICC&rsquo;s Prosecutor Karim Khan has spoken out against Hamas&rsquo;s Oct. 7 attack as well as Israel&rsquo;s use of force in Gaza. Yet the prospect of arrest warrants has not prevented indiscriminate attacks against Israel nor by it. Israel has moreover failed to meet its obligation to allow humanitarian relief into besieged Gaza. Hamas has failed to release the <a href=\"https://time.com/6324741/israel-hostages/\" >hostages</a>. All of this has fueled a belief that international law is impotent. </p>\n\n\n\n<p>Finally, across these two conflicts, the discussion of international law is inconsistent and in tension with common-sense ethical judgements. Despite the obvious differences between the wars in Ukraine and Gaza, the Biden Administration has equated sending arms to both Ukraine and Israel as part of a global struggle between <a href=\"https://www.nytimes.com/2023/10/19/us/politics/transcript-biden-speech-israel-ukraine.html\"  target=\"_blank\">democracy and autocracy</a>. The head of the European Commission, Ursula von der Leyen, has condemned Russian attacks against civilian infrastructure in Ukraine, almost in the same breath as expressing <a href=\"https://www.politico.eu/article/von-der-leyen-doubles-down-on-pro-israel-stance-lashes-out-at-iran/\"  target=\"_blank\">steadfast support for Israel</a> as it destroys the last working power plants in Gaza and renders the Strip almost <a href=\"https://time.com/6549448/gaza-shelter-unlivable/\" >uninhabitable</a>. Uncritical support for Israel fuels the charge, <a href=\"https://time.com/6330746/global-south-ukraine-israel-gaza/\" >widespread in the Global South</a>, that the West invokes international law only to constrain &ldquo;the rest.&rdquo; </p>\n\n\n\n<p>When legal arguments follow political rather than ethical considerations, as the Biden Administration and European allies are doing, can law still help us make sense of the world? Ukraine and Gaza have created a crisis of confidence in the project to constrain war with international law, but dismissing it outright would be a grave mistake. </p>\n\n\n\n<p>For starters, it is crucial for us to understand the purpose and scope of international law. International law does not prohibit all actions that we rightly consider abhorrent. It can&rsquo;t because war cannot be waged without morally unjustified violence. If law prohibited all morally unjustified violence, it would make waging war impossible, and war would revert to being a much more dangerous law-free zone. Neither can international law &ldquo;end impunity&rdquo; in war, as the creators of the ICC unwisely promised. Wrongdoing pervades war, war pervades geopolitics, courts must be selective, and punishing people for violations takes time. Crucially, in domestic societies, we think of legal accountability as worthwhile even if it does not deter wrongdoing in the first place and criminals are not brought to justice. The first remedy to the crisis of confidence in international law is a more realistic understanding of what law can do in war. Law cannot turn war into anything other than a violent moral catastrophe. But international law can and does make war less awful than it would otherwise be. </p>\n\n\n\n<p>That is certainly the hope many had for <a href=\"https://time.com/6553912/israel-south-africa-icj-genocide/\" >South Africa&rsquo;s case</a> with the International Court of Justice (ICJ) accusing Israel of violating the genocide convention in Gaza. While the ICJ fell short of ordering a ceasefire in its <a href=\"https://time.com/6588931/icj-ruling-israel-genocidal-acts-gaza-south-africa/\" >preliminary ruling</a> on Friday, it did determine that the charge of genocide was not implausible and ordered Israel to provide aid to Gazans. Whatever one makes of the ICJ ruling, it is a mistake to forgo law&rsquo;s ability to prevent <em>some</em> morally unjustified violence because it fails to prevent all or even most of it. </p>\n\n\n\n<p>A realistic understanding of international law&rsquo;s limits and an appreciation for its achievements are not enough to overcome this crisis of confidence. International law needs to be strengthened. That means making international law a political priority in wartime and ensuring aid and diplomatic support are contingent on compliance, regardless of which state is skirting their obligations. Moreover, when bad actors co-opt the language of international law, they need to be called out more forcefully, whether friend or foe. When countries abuse law to justify illegal conduct, the appropriate reaction is not to dismiss the law, but to point out its misuse. </p>\n\n\n\n<p>It is becoming more obvious to everyone that international law cannot fulfil all the roles most would expect of it. But the growing interest in international law also indicates an area of rare agreement: Law is relevant in war. We must build on this agreement because war without law is no alternative at all. </p>\n"},"wfw:commentRss":"https://api.time.com/6588977/international-law-israel-gaza-ukraine-russia/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588977"}},{"title":"U.N. Court Says Israel Must Prevent Genocidal Acts in Gaza, But Doesn’t Order a Ceasefire","link":"https://time.com/6588931/icj-ruling-israel-genocidal-acts-gaza-south-africa/","comments":"https://time.com/6588931/icj-ruling-israel-genocidal-acts-gaza-south-africa/#respond","dc:creator":{"#cdata-section":"Astha Rajvanshi"},"pubDate":"Fri, 26 Jan 2024 14:34:27 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"Explainer"},{"#cdata-section":"Israel-Hamas War"},{"#cdata-section":"News Desk"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588931"},"description":{"#cdata-section":"Today, in a landmark interim order, the ICJ ordered Israel to “take all measures within its power” to prevent acts of genocide in Gaza."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588931\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6588931/icj-ruling-israel-genocidal-acts-gaza-south-africa/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/AP24026462270880.jpg\" alt=\"World Court Israel Genocide Case\"/>\n\n\n\n<p>The world watched closely as a panel of 17 judges at the International Court of Justice (ICJ)&mdash;the highest court of the United Nations&mdash;heard arguments earlier this month<a href=\"https://time.com/6553912/israel-south-africa-icj-genocide/\" > over whether Israel is committing genocide</a> against Palestinians amid the ongoing conflict in Gaza, in a case brought forward by South Africa. Today, in a landmark <a href=\"https://www.icj-cij.org/sites/default/files/case-related/192/192-20240126-ord-01-00-en.pdf\"  target=\"_blank\">interim order</a>, the court determined that South Africa has legal standing and ordered Israel to &ldquo;take all measures within its power&rdquo; to prevent acts of genocide.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Justice Joan E. Donoghue, the presiding judge of the ICJ, <a href=\"https://www.youtube.com/watch?time_continue=1&amp;v=05WbziJjZEs&amp;embeds_referring_origin=https%3A%2F%2Flufkindailynews.com&amp;feature=emb_logo\"  target=\"_blank\">began a public sitting</a> at the Peace Palace in the Hague by saying that &ldquo;the court is acutely aware of the extent of the human tragedy that is unfolding in the region and is deeply concerned about the continuing loss of life and human suffering,&rdquo; before acknowledging that both parties have &ldquo;clearly opposite views&rdquo; on the matter.</p>\n\n\n\n<p>In the court&rsquo;s view, however, &ldquo;at least some of the acts and omissions alleged by South Africa to have been committed by Israel in Gaza appear to be capable of falling within the provisions of the [Genocide] Convention,&rdquo; Justice Donoghue said.&nbsp;</p>\n\n\n\n<p>While the court did not order Israel to cease its attacks, it has nevertheless asked the Israeli military to adhere to the Genocide Convention by preventing and punishing incitement to genocide, as well as by providing humanitarian aid.&nbsp;</p>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=EL89mTXS]</div>\n\n\n\n<p>The judge also reminded the courtroom that the Jan. 26 decision is only an interim order, part of a wider, pending case that will likely <a href=\"https://www.lawfaremedia.org/article/what-will-the-international-court-of-justice-order-on-genocide-in-gaza\"  target=\"_blank\">not see a ruling for years</a>. However, &ldquo;the catastrophic humanitarian situation in the Gaza Strip is at serious risk of deteriorating further before the court renders its final judgment,&rdquo; she added.</p>\n\n\n\n<p>It&rsquo;s unclear whether Israel will comply with the order&mdash;while the court&rsquo;s decisions are binding, it has few means of <em>enforcing</em> the order. On Thursday, Israeli government spokesperson Eylon Levy <a href=\"https://www.timesofisrael.com/liveblog_entry/israel-expecting-icj-to-toss-out-spurious-genocide-charges/\"  target=\"_blank\">told reporters</a> that Israel expected the court to toss out the &ldquo;spurious and specious charges.&rdquo; But legal experts believe that Israel&rsquo;s defense in court could make it difficult for the country to now dismiss court orders. </p>\n\n\n\n<p>Nonetheless, it&rsquo;s &ldquo;a very significant finding from both a legal and political perspective,&rdquo; Zinaida Miller, a Professor of Law at Northeastern University, tells TIME. She adds that it will most likely increase international pressure on Israeli Prime Minister Benjamin Netanyahu to curb the ongoing <a href=\"https://time.com/tag/israel-hamas-war/\" >Israel-Hamas war</a>, and that the Israeli government might &ldquo;quietly comply&rdquo; with certain measures because it will &ldquo;see it as a way of heading off an unfavorable decision on the merits later on.&rdquo;</p>\n\n\n\n<h2>What was South Africa&rsquo;s case against Israel? </h2>\n\n\n\n<p>During a two-day hearing held on Jan. 11 and 12, South Africa <a href=\"https://www.aljazeera.com/news/2024/1/11/icj-hears-south-africas-genocide-case-against-israel-over-gaza-war\"  target=\"_blank\">told</a> the ICJ that Israel&rsquo;s actions in the Gaza strip violated the U.N.&rsquo;s 1948 Genocide Convention, to which Israel is a party.&nbsp;</p>\n\n\n\n<p>Lawyers for the South African government argued that Israeli leaders have intended to &ldquo;create conditions of death&rdquo; for Palestinians in Gaza. In court, they offered videos and public statements made by Israeli officials as evidence, including a <a href=\"https://www.nytimes.com/2023/11/15/world/middleeast/israel-gaza-war-rhetoric.html#:~:text=%E2%80%9CWe%20are%20fighting%20human%20animals,Bennett%2C%20a%20former%20prime%20minister.\"  target=\"_blank\">statement </a>made by Defense Minister Yoav Gallant in October, that Israel would impose a <a href=\"https://www.nytimes.com/2023/10/10/world/middleeast/gaza-strip-israel-egypt.html\"  target=\"_blank\">complete siege</a> on the territory because it was fighting &ldquo;human animals.&rdquo; </p>\n\n\n\n<p>Israel&rsquo;s lawyers have categorically denied the genocide accusation, arguing that in late October, the country&rsquo;s military gave civilians adequate notice to leave before the invasion. They also said that Israel enabled the supply of aid delivery after freezing it at the start of the war. As part of its defense, Israel declassified more than 30 secret orders made by government and military leaders to show Israeli efforts to limit harm to civilians.</p>\n\n\n\n<p>The court, in deciding whether to impose some or all of the emergency measures requested by South Africa, needed to determine if Israel&rsquo;s alleged actions were covered under the Genocide Convention, and whether the measures requested were indeed needed to protect the rights of Palestinians in Gaza.&nbsp;</p>\n\n\n\n<h2>Does the ICJ ruling matter if it&rsquo;s non-binding?</h2>\n\n\n\n<p>The ruling has direct consequences on the assault that was launched by Israel in response to a Hamas-led attack on Oct. 7, 2023, where around 1,200 people were killed and some 240 were taken as hostages, according to Israeli officials. 25,000 people have been killed in Israel&rsquo;s military operation since, Gaza&rsquo;s health authorities say. More than 70% of casualties have been women and children, according to the U.N.&nbsp;</p>\n\n\n\n<p>&ldquo;Having the World Court say to the state of Israel that it is plausible that Israel is committing genocide will be heard by the rest of the international community, even if Netanyahu doesn&rsquo;t want to hear it,&rdquo; Zaha Hassan, a Middle East Fellow at the Carnegie Endowment for International Peace, tells TIME. Not only will it embolden international civil society in their calls for a ceasefire, it will also put pressure on the U.S. and President Biden to support a ceasefire or suspend military aid to Israel, she says. </p>\n\n\n\n<p>In light of this, Millers adds that if &ldquo;countries are sending weapons to Israel, or are in any way facilitating the mass atrocities in Gaza, they will have to consider their commitment under the 1948 Genocide Convention to prevent the crime from happening and to avoid complicity in it.&rdquo;&nbsp;</p>\n\n\n\n<p>The ICJ case, and today&rsquo;s order, are also significant for other reasons. &ldquo;It&rsquo;s a moment when Palestinians have had a public airing of the structural violence and oppression they have long faced,&rdquo; says Hassan, &ldquo;and it holds the prospect of accountability for victims, something that has always eluded Palestinians.&rdquo;</p>\n\n\n\n<p>Both Miller and Hassan also nod to the fact that the case was brought by South Africa&mdash;a country that has its own history of race-based violence and apartheid.&nbsp;</p>\n"},"wfw:commentRss":"https://api.time.com/6588931/icj-ruling-israel-genocidal-acts-gaza-south-africa/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588931"}},{"title":"China Calls on Houthis to Stop Red Sea Attacks and Urges All Parties to Cool Tensions","link":"https://time.com/6588884/china-urges-houthis-stop-red-sea-attacks/","comments":"https://time.com/6588884/china-urges-houthis-stop-red-sea-attacks/#respond","dc:creator":{"#cdata-section":"Bloomberg News"},"pubDate":"Fri, 26 Jan 2024 09:32:40 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"News Desk"},{"#cdata-section":"overnight"},{"#cdata-section":"wire"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588884"},"description":{"#cdata-section":"“We urge the cessation of attacks and harassment against civilian ships, and urge all parties to stop fueling the tensions,” a spokesman for the Chinese foreign ministry said."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588884\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module video-2\" data-src=\"https://time.com/6588884/china-urges-houthis-stop-red-sea-attacks/\" data-widget-id=\"SB_4\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/Yemen-Houthi-Red-Sea-China.jpg\" alt=\"TOPSHOT-YEMEN-PALESTINIAN-ISRAEL-PROTEST\"/>\n\n\n\n<p>China reiterated its call for Houthis militants to stop their attacks on Red Sea shipping, comments that come after Beijing reportedly asked Tehran to help rein in the rebel group.</p>\n\n\n\n<p>&ldquo;We are concerned about rising tensions in the Red Sea,&rdquo; Chinese Foreign Ministry spokesman Wang Wenbin said Friday at a regular press briefing in Beijing. &ldquo;We urge the cessation of attacks and harassment against civilian ships, and urge all parties to stop fueling the tensions.&rdquo;</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>The comments come after Reuters reported that Chinese officials asked their Iranian counterparts to intervene with the Houthis or risk harming business relations with Beijing. The talks took place at several recent meetings in Beijing and Tehran, according to the report, which cited a diplomat and people in Iran familiar with the matter whom Reuters did not name.</p>\n\n\n\n<p><strong>Read More: </strong><em><a href=\"https://time.com/6325352/china-israel-hamas-war/\" >How China Could Play a Key Role in the Israel-Hamas War&mdash;and Why It&rsquo;s Not</a></em></p>\n\n\n\n<p>The issue could come up when Chinese Foreign Minister Wang Yi meets National Security Advisor Jake Sullivan in the coming days in Bangkok. The pair would discuss Taiwan and &ldquo;issues of mutual interest,&rdquo; Wang Wenbin said.</p>\n\n\n\n<p>China has largely steered clear of the Red Sea issue as the U.S. and U.K. launched airstrikes against the Houthis. That&rsquo;s despite China importing about half of its crude oil from the Middle East and exporting more to the European Union than the U.S.</p>\n\n\n\n<p>China has been critical of the actions by the U.S. and U.K., with Beijing&rsquo;s top envoy in Brussels saying the Houthi attacks are a &ldquo;spillover&rdquo; from the Gaza crisis.</p>\n\n\n\n<h3>More From TIME</h3>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=LfjATyu5 autostart=\"viewable\"]</div>\n\n\n\n<p><strong>Read More: </strong><em><a href=\"https://time.com/6555620/us-strikes-houthis-yemen/\" >How Biden Can Stop Houthi Missile Attacks&mdash;Without Risking War</a></em></p>\n\n\n\n<p>Two-plus months of the Houthis missile, drone and hijacking attacks against civilian ships have caused the biggest diversion of international trade in decades, pushing up costs for shippers in Asia and North America.&nbsp;</p>\n\n\n\n<p>There are signs that China is growing impatient with the disruption. On Jan. 10, its envoy to the U.N., Zhang Jun, <a href=\"https://europe.chinadaily.com.cn/a/202401/11/WS659f6294a3105f21a507bc9f.html\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">urged</a> an end to the attacks. Then on Thursday, Defense Ministry spokesman Wu Qian made a similar call at a news briefing.</p>\n\n\n\n<p>Iran counts the Houthis along with Hamas in Gaza and Hezbollah in Lebanon as its &ldquo;axis of resistance.&rdquo; The Houthis started launching their strikes after Israel began attacking Hamas in Gaza over the group&rsquo;s Oct. 7 attack.</p>\n"},"wfw:commentRss":"https://api.time.com/6588884/china-urges-houthis-stop-red-sea-attacks/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588884"}},{"title":"Disapproval Grows for South Korea’s President Amid First Lady’s ‘Dior Bag Scandal’","link":"https://time.com/6588861/south-korea-president-disapproval-polls-dior-bag-scandal/","comments":"https://time.com/6588861/south-korea-president-disapproval-polls-dior-bag-scandal/#respond","dc:creator":{"#cdata-section":"Jon Herskovitz / Bloomberg"},"pubDate":"Fri, 26 Jan 2024 08:35:00 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"News Desk"},{"#cdata-section":"overnight"},{"#cdata-section":"wire"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588861"},"description":{"#cdata-section":"The scandal has cast a shadow over the president as his conservative People Power Party is trying to wrest control of parliament in an April election."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588861\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module video-2\" data-src=\"https://time.com/6588861/south-korea-president-disapproval-polls-dior-bag-scandal/\" data-widget-id=\"SB_4\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/South-Korea-President-Dior-Bag.jpg\" alt=\"South Koreans President Attends Independence Movement Day\"/>\n\n\n\n<p>The disapproval rating for South Korean President Yoon Suk Yeol hit its highest level in about nine months in a major poll amid escalating questions over whether the first lady inappropriately received a designer bag.</p>\n\n\n\n<p><strong>Read More: </strong><em><a href=\"https://time.com/6577086/south-korea-dior-bag-scandal-first-lady-kim-ppp-yoon/\" >South Korea&rsquo;s &lsquo;Dior Bag Scandal,&rsquo; Explained</a></em></p>\n\n\n\n<p>The disapproval rate for Yoon rose to 63% from 58% in a weekly tracking poll by Gallup Korea released Friday. The&nbsp;<a href=\"https://www.gallup.co.kr/gallupdb/reportContent.asp?seqNo=1454#E\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">polling group</a>&nbsp;cited the &ldquo;issue&rdquo; around the first lady as one of the drivers for the rise in the rate.&nbsp;</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>The incident has cast a shadow over the president as his conservative People Power Party is trying to wrest control of parliament in an April election.</p>\n\n\n\n<h3>More From TIME</h3>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=i1ho9dOJ autostart=\"viewable\"]</div>\n\n\n\n<p><strong>Read More:</strong><a href=\"https://time.com/6550920/world-elections-2024/\" ><em>The Ultimate Election Year: Half of World Heads to Polls in 2024</em></a></p>\n\n\n\n<p>Yoon has yet to speak publicly about a video released that appeared to show his wife Kim Keon Hee receiving a Christian Dior bag valued at about $2,200 from a Korean-American pastor in September 2022. The video was shot with a hidden camera and released on the YouTube channel of a liberal political group, Yonhap News&nbsp;<a href=\"https://en.yna.co.kr/view/AEN20240124010900320?section=search\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">reported</a>.&nbsp;</p>\n\n\n\n<p>PPP leader Han Dong-hoon said the video showed what appeared to be deliberate entrapment. Han added there were aspects of it that could cause concern among the public which briefly led to&nbsp;<a href=\"https://en.yna.co.kr/view/AEN20240123004552315?section=search\"  target=\"_blank\" rel=\"noreferrer noopener\" target=\"_blank\">some friction</a>&nbsp;with Yoon, Yonhap and other local media reported.</p>\n\n\n\n<p>Members of the Democratic Party have targeted the first lady and the party used its majority in parliament to push through a measure calling for a special investigation into allegations of stock manipulation. Yoon vetoed the measure and his wife has denied any wrongdoing.</p>\n\n\n\n<p>South Korean presidents serve a single five-year term, and the April election will determine whether Yoon can push through his agenda or if he&rsquo;ll continue to face gridlock in the body for the three years left in his term.</p>\n\n\n\n<p>If the PPP seizes control of parliament from the opposition, it is likely to push through economic policies that include taking on powerful labor unions, reducing regulations on businesses, and tax cuts for companies and on real estate transactions.</p>\n"},"wfw:commentRss":"https://api.time.com/6588861/south-korea-president-disapproval-polls-dior-bag-scandal/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588861"}},{"title":"In Philippine Presidential Polls Looking to 2028, Duterte’s Daughter Is Already the Frontrunner","link":"https://time.com/6588859/sara-duterte-philippines-president-2028-polls/","comments":"https://time.com/6588859/sara-duterte-philippines-president-2028-polls/#respond","dc:creator":{"#cdata-section":"Chad de Guzman"},"pubDate":"Fri, 26 Jan 2024 08:30:00 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"News Desk"},{"#cdata-section":"overnight"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588859"},"description":{"#cdata-section":"The Vice President and daughter of former President Rodrigo Duterte is the current frontrunner to succeed Ferdinand Marcos Jr."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588859\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6588859/sara-duterte-philippines-president-2028-polls/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/AP22127677463513.jpg\" alt=\"The Philippines' Vice President Sara Duterte-Carpio during her campaign in the lead-up to the 2022 national elections, where she won by a landslide\"/>\n\n\n\n<p>2024 may be <a href=\"https://time.com/6550920/world-elections-2024/\" >the world&rsquo;s biggest-ever election year</a>, but in the Philippines, voters are already looking ahead to 2028.</p>\n\n\n\n<p>While current President Ferdinand &ldquo;Bongbong&rdquo; Marcos Jr., elected in mid-2022, hasn&rsquo;t even reached his second year in office yet, the country&rsquo;s constitution currently permits only a single presidential term of six years, opening up early speculation about whom his successor may be.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>And based on a new poll, provided to TIME on Thursday, by local public opinion firm <a href=\"https://www.wrnumero.com/\"  target=\"_blank\">WR Numero Research</a>, Vice President and Education Secretary Sara Duterte-Carpio, the daughter of <a href=\"https://time.com/6339873/rodrigo-duterte-drug-war-international-criminal-court-investigation/\" >former President Rodrigo Duterte</a>, appears to command a significant lead.</p>\n\n\n\n<p><strong>Read More: </strong><a href=\"https://time.com/6339253/philippines-leila-de-lima-interview-duterte-justice/\" ><em>Leila de Lima Is Free but Not Finished Fighting: Exclusive Q&amp;A With Duterte&rsquo;s Fiercest Critic</em></a></p>\n\n\n\n<p>Almost 36% of respondents to a survey of Filipino adults in December said they would vote for Duterte-Carpio if elections were held now. This follows a privately commissioned poll conducted by statistics firm <a href=\"https://www.sws.org.ph/swsmain/artcldisppage/?artcsyscode=ART-20230611115407\"  target=\"_blank\">Social Weather Stations</a> last July that also showed Duterte-Carpio as the most-preferred candidate.</p>\n\n\n\n<h3>More From TIME</h3>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=fbQqbZiY autostart=\"viewable\"]</div>\n\n\n\n<p>Trailing behind her in both polls is Senator <a href=\"https://legacy.senate.gov.ph/senators/sen_bio/tulfo_raffy_bio.asp\"  target=\"_blank\">Raffy Tulfo</a>, a tough-talking former broadcaster and social media darling who has carved out a niche for himself with his public service programs, followed by former Vice President and leading opposition figure <a href=\"https://time.com/4701765/leni-robredo-duterte-drug-war-philippines/\" >Leni Robredo</a>. Tulfo was chosen by 23% of the respondents and Robredo by 9% in the latest survey.</p>\n\n\n\n<p>Duterte-Carpio, now 45, had already been leading presidential surveys in 2022, but surprised everyone when instead she chose to be Marcos Jr.&rsquo;s running mate&mdash;creating an election powerhouse that practically shot down any chance by the opposition to win.&nbsp;</p>\n\n\n\n<p>In the Philippines, the President and Vice President are elected separately. Duterte-Carpio won the vice presidency in 2022 with 32.21 million votes or 61.5% of the votes cast&mdash;more than Marcos Jr., who won the presidency with 31.62 million votes or 58.7% of the total votes cast at the same time. Of the country&rsquo;s four highest-ranking officials, including Senate President and House Speaker&mdash;Duterte-Carpio also currently has the <a href=\"https://pulseasia.ph/updates/december-2023-nationwide-survey-on-urgent-national-concerns-the-performance-ratings-of-the-national-administration-on-selected-issues-and-the-performance-and-trustworthiness-ratings-of-the-top-natio/\"  target=\"_blank\">highest approval ratings</a>. </p>\n\n\n\n<p>Both Marcos Jr. and Duterte-Carpio have struggled to address the mass killings that happened under the leaderships of their fathers. Rodrigo Duterte was the architect of a nationwide drug war that killed tens of thousands, while <a href=\"https://time.com/6257017/philippines-bongbong-marcos-people-power-revolution/\" >the late dictator Ferdinand Marcos Sr.</a> oversaw a period of corruption and human rights abuses from 1965 to 1986.  Yet the two former leaders&rsquo; children enjoy massive domestic popularity, in part due to <a href=\"https://time.com/6173757/bongbong-marcos-tiktok-philippines-election/\" >pervasive disinformation campaigns</a> as well as the <a href=\"https://time.com/6119256/duterte-election-philippines-dynasty/\" >undying influence of political dynasties</a> in the Southeast Asian country.</p>\n"},"wfw:commentRss":"https://api.time.com/6588859/sara-duterte-philippines-president-2028-polls/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588859"}},{"title":"Thousands of Australians Call National Holiday ‘Invasion Day,’ Protesting British Colonization","link":"https://time.com/6588850/australians-protest-british-colonization-invasion-day/","comments":"https://time.com/6588850/australians-protest-british-colonization-invasion-day/#respond","dc:creator":{"#cdata-section":"Associated Press"},"pubDate":"Fri, 26 Jan 2024 06:15:00 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"News Desk"},{"#cdata-section":"overnight"},{"#cdata-section":"wire"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588850"},"description":{"#cdata-section":"The holiday falls on the anniversary of the Jan. 26, 1788, arrival of British ships carrying convicts at Port Jackson in present-day Sydney."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module ad-300-250\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588850\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module video-2\" data-src=\"https://time.com/6588850/australians-protest-british-colonization-invasion-day/\" data-widget-id=\"SB_4\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/Australia-Indigenous-Invasion-Day.jpg\" alt=\"Australia Australia Day\"/>\n\n\n\n<p>SYDNEY &mdash; Thousands of Australians protested the anniversary of British colonization of their country with large crowds Friday urging for Australia Day to be moved and for a day of mourning on the holiday some call &ldquo;Invasion Day.&rdquo;</p>\n\n\n\n<p>The holiday marks the arrival of 11 British ships carrying convicts at Port Jackson in present-day Sydney on Jan. 26, 1788. For many activists, the day marked the beginning of a sustained period of discrimination and expulsion of Indigenous people from their land without a treaty.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p><strong>Read More: </strong><em><a href=\"https://time.com/6323355/australia-indigenous-voice-referendum-results/\" >Australians Reject Proposal to Enshrine Indigenous Representation: What to Know</a></em></p>\n\n\n\n<p>Thousands of people, many of whom waved Indigenous flags, rallied in front of the Victoria state parliament in Melbourne, calling for an official day of mourning to be declared across Australia. Roads and tram lines were shut down for more than four hours.</p>\n\n\n\n<p>Large crowds in Sydney chanted for the Australia Day date to be moved. Thousands of protesters also rallied in Brisbane, and the second day of Australia&rsquo;s cricket match against the West Indies was briefly disrupted by demonstrators.</p>\n\n\n\n<p>Major sports have stopped calling the holiday Australia Day, and the Australian Football League Players Association, several clubs and hockey teams have called for the date to change.</p>\n\n\n\n<p>On Thursday, two monuments symbolizing Australia&rsquo;s colonial past were damaged in Melbourne. A statue of British naval officer James Cook, who in 1770 charted Sydney&rsquo;s coast, was sawn off at the ankles, and a Queen Victoria monument was doused in red paint.</p>\n\n\n\n<p>Aboriginal and Torres Strait Islander people represented 3.8% of Australia&rsquo;s population of 26 million, according to a Bureau of Statistics census in 2021. Indigenous people are the nation&rsquo;s most disadvantaged ethnic minority.</p>\n\n\n\n<p>Tensions are high after Australian voters in October resoundingly rejected a referendum to create an advocacy committee to offer advice to parliament on policies that affect Indigenous people. The government had proposed the first constitutional change since 1977 as a step forward in Indigenous rights.</p>\n\n\n\n<p>Prime Minister Anthony Albanese said Friday that the national day was an opportunity for Australians to &ldquo;pause and reflect on everything that we have achieved as a nation.&rdquo;</p>\n"},"wfw:commentRss":"https://api.time.com/6588850/australians-protest-british-colonization-invasion-day/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588850"}},{"title":"The Stakes of the Lawsuit Alleging Biden is Complicit in Palestinian Genocide","link":"https://time.com/6588752/biden-lawsuit-israel-palestinian-genocide/","comments":"https://time.com/6588752/biden-lawsuit-israel-palestinian-genocide/#respond","dc:creator":{"#cdata-section":"Solcyre Burga"},"pubDate":"Thu, 25 Jan 2024 21:59:40 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"Explainer"},{"#cdata-section":"News Desk"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588752"},"description":{"#cdata-section":"“You get the ability to stand in court, and register your overall concerns and make your case.”"},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588752\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module\" data-src=\"https://time.com/6588752/biden-lawsuit-israel-palestinian-genocide/\" data-widget-id=\"SB_2\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/biden-israel-gaza-lawsuit.jpg\" alt=\"biden israel gaza lawsuit\"/>\n\n\n\n<p>A federal court case filed against President Joe Biden and two U.S. cabinet officials for allegedly<strong> </strong>being complicit in Israel&rsquo;s genocide against Gazans will move forward with a hearing on Friday.</p>\n\n\n\n<p>The case, which names Biden, Secretary of State Antony Blinken, and Secretary of Defense Lloyd Austin as defendants, was filed by Palestinian human rights groups and individuals with help from the nonprofit Center for Constitutional Rights. <em>Defense for Children International&ndash;Palestine v. Biden</em> seeks to stop the U.S. from supporting Israel, which plaintiffs say has cost them the lives of family members, and will be heard in Oakland, Calif.&nbsp;&nbsp;</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>&ldquo;We have lost so many people, but there are still many more who are living, and we owe it to them to do everything possible to stop this genocide,&rdquo; <a href=\"https://ccrjustice.org/home/press-center/press-releases/palestinians-sue-biden-failure-prevent-genocide-seek-emergency\"  target=\"_blank\">said Mohammad Herzallah</a>, a plaintiff in the case who has family in Gaza. &ldquo;I have done everything in my power: I have participated in protests, sit-ins, wrote letters to my representatives, civil disobedience. Now I am asking the courts to end this ongoing genocide.&rdquo;</p>\n\n\n\n<p><strong>Read More: </strong><a href=\"https://time.com/collection/davos-2024-ideas-of-the-year/6551990/antony-blinken-israel-gaza-us-power/\" ><em>For Antony Blinken, the War in Gaza Is a Test of U.S. Power</em></a></p>\n\n\n\n<p>More than 25,000 people in Gaza have died since the beginning of the war on Oct. 7, according to the Hamas-run Health Ministry. The military offensive campaign in Gaza began after Hamas killed 1,200 Israelis and kidnapped another 240.&nbsp;</p>\n\n\n\n<p>Throughout the conflict, the U.S. has supported their Middle-Eastern ally, vetoing United Nations resolutions calling for an immediate ceasefire, affirming <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/22/joint-statement-on-israel-2/#:~:text=The%20leaders%20reiterated%20their%20support,release%20of%20all%20remaining%20hostages.\"  target=\"_blank\">support for Israel</a> and its right to self-defense, and providing financial and military aid to the country<strong> </strong>since last fall.&nbsp;</p>\n\n\n\n<p>The Biden Administration is seeking to dismiss the case.<strong> </strong>&ldquo;This suit raises quintessential political questions because Plaintiffs seek to have this Court superintend the Executive Branch&rsquo;s foreign policy and national security judgment and compel the government to prevent Israel from purportedly committing genocide in Gaza,&rdquo; the defendants <a href=\"https://ccrjustice.org/sites/default/files/attach/2024/01/64_1-12-24_Govt-reply-MTD_w.pdf\"  target=\"_blank\">said in their motion to dismiss</a>.  </p>\n\n\n\n<p>The lawsuit is unusual, experts say.<strong> </strong>&ldquo;In the past, when such complaints have been filed with an American court, usually the courts tended to throw them out&hellip; because of issues of national security,&rdquo; says George Washington University professor Michael Barnett. &ldquo;That said, the fact that you have complaints filed in an American court brings attention to the very support that the U.S. continues to give to Israel.&rdquo; </p>\n\n\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-inline-image\" src=\"https://api.time.com/wp-content/uploads/2024/01/israel-gaza-biden-01.jpg\" alt=\"Biden Israel Gaza Lawsuit\"/>\n\n\n\n<h2><strong>&lsquo;</strong><strong>What really matters is that you make noise</strong><strong>&rsquo;</strong></h2>\n\n\n\n<p>On Nov. 13, Palestinians filed a lawsuit against Biden, Blinken, and Austin to prevent them from providing more &ldquo;arms, money, and diplomatic support&rdquo; because they allege Israel is committing genocide &ldquo;against the civilian population of Gaza.&rdquo;&nbsp;</p>\n\n\n\n<p>The U.S. government previously filed a motion to dismiss, saying that plaintiffs lacked jurisdiction, the complaint presents a &ldquo;nonjusticiable political question,&rdquo; and that the Genocide Convention does not &ldquo;create a private right of action.&rdquo;&nbsp;</p>\n\n\n\n<p>But the case is still moving forward to a public hearing on Jan. 26, after which plaintiffs hope the court issues a preliminary injunction that will force the U.S. to &ldquo;take all measures within their power to prevent Israel from committing genocide,&rdquo; <a href=\"https://ccrjustice.org/sites/default/files/attach/2023/11/Complaint_DCI-Pal-v-Biden_ww.pdf\"  target=\"_blank\">the complaint says</a>.&nbsp;</p>\n\n\n\n<p>Plaintiffs include Omar Al-Najjar, Ahmed Abu Artema, and Mohammed Ahmed Abu Rokbeh&mdash;all currently in Gaza; Mohammad Monadel Herzallah, Laila Elhaddad, Waeil Elbhassi, Basim Elkarra, and &ldquo;A.N.&rdquo;&mdash;all U.S. citizens with family members in Gaza; and human rights groups Defense for Children International&ndash;Palestine and Al-Haq. Seventy-seven international human rights organizations, bar associations and lawyers filed an amicus brief <a href=\"https://ccrjustice.org/sites/default/files/attach/2023/12/47_12-29-23_Amicus-Brief-Human-Rights-Orgs_w.pdf\"  target=\"_blank\">in favor of</a> the plaintiffs. </p>\n\n\n\n<h3>More From TIME</h3>\n\n\n\n<div class=\"wp-block-gutenberg-custom-blocks-video-jw\">[video id=QMls2CVu autostart=\"viewable\"]</div>\n\n\n\n<p>Plaintiffs have spoken out about the emotional toll the Israel-Hamas war has taken on them and their families. &ldquo;To be honest, it&rsquo;s difficult to revisit all the scenes of the past weeks. They open a door to hell when I recall them,&rdquo; said plaintiff Al-Najjar, a 24-year-old intern physician at Nasser Medical Complex in Khan Younis. &ldquo;I&rsquo;ve lost five relatives, treated too many children who are the sole survivors of their families, received the bodies of my fellow medical students and their families, and seen the hospital turn into a shelter for tens of thousands of people as we all run out of fuel, electricity, food, and water. The U.S. has to stop this genocide. Everyone in the world has to stop this.&rdquo; (Khan Younis, which houses thousands of displaced citizens and health workers, has recently been under attack after Israel Defense Forces increased their military operations in southern Gaza.)&nbsp;</p>\n\n\n\n<p>The legal grounding for the case is based in part on the 1948 Genocide Convention, which the U.S. signed along with 152 other countries. Every signatory to that treaty is obligated to not commit genocide, <a href=\"https://www.un.org/en/genocideprevention/genocide-convention.shtml#:~:text=Status%20of%20membership,have%20yet%20to%20do%20so.\"  target=\"_blank\">as well as</a> punish and prevent genocide. Barry Trachtenberg, one of three genocide scholars who <a href=\"https://ccrjustice.org/sites/default/files/attach/2023/11/Declaration%20Expert%20Historians_w.pdf\"  target=\"_blank\">submitted a declaration</a> in favor plaintiffs&rsquo; motion, will speak at Friday&rsquo;s hearing.&nbsp;</p>\n\n\n\n<p>U.S. officials have previously denounced genocide allegations against Israel, with John Kirby, the strategic communications coordinator for the National Security Council, calling them &ldquo;unfounded.&rdquo;</p>\n\n\n\n<p>&ldquo;That&rsquo;s not a word that ought to be thrown around lightly. And we certainly don&rsquo;t believe that it applies here,&rdquo; Kirby said during a Jan. 11 press briefing.&nbsp;&nbsp;</p>\n\n\n\n<p>As part of its defense, the Biden Administration says Israel is a sovereign nation that controls its own operations. It claims the plaintiffs have not done enough to show that &ldquo;their alleged injuries&rdquo; can be traced specifically<strong> </strong>to U.S. support of Israel. Defendants also note that the U.S. has provided aid &ldquo;while complying with international humanitarian law.&rdquo; One example their filing points to includes the Administration&rsquo;s work to &ldquo;mitigate the humanitarian crisis&rdquo; in Gaza, as U.S. officials helped facilitate a seven-day pause in fighting. The Administration also cites<strong> </strong>the political question doctrine, which limits federal courts ability to answer some questions that are best resolved by the political branches of government.</p>\n\n\n\n<p>Even if the court does decide to throw out the case, it could have political effects rather than legal ones. &ldquo;What really matters is that you make noise, raise the attention and volume,&rdquo; Barnett says. &ldquo;You get the ability to stand in court, and register your overall concerns and make your case.&rdquo;</p>\n\n\n\n<p>Public opinion on U.S. involvement in the war has been controversial. Only 35% of adults approve of the Biden Administration&rsquo;s response to the Israel-Hamas war, <a href=\"https://www.pewresearch.org/politics/2023/12/08/americans-views-of-the-israel-hamas-war/#:~:text=Biden%20administration's%20response%20to%20Israel,and%2024%25%20are%20not%20sure.\"  target=\"_blank\">according to a Pew Research Center</a> survey published in December.&nbsp;</p>\n\n\n\n<p>&ldquo;The fact that the U.S. is being charged with actual complicity in these crimes against its longtime ally and friend, Israel, is extraordinary,&rdquo; Barnett adds. &ldquo;I think it&#8217;s worth pausing and taking in this moment because you&rsquo;re beginning to see American politicians and people in the executive wing begin to reconsider that relationship.&rdquo;</p>\n"},"wfw:commentRss":"https://api.time.com/6588752/biden-lawsuit-israel-palestinian-genocide/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588752"}},{"title":"HP Enterprise Discloses Hack, Suspects Russian Group","link":"https://time.com/6588472/hp-enterprise-hack/","comments":"https://time.com/6588472/hp-enterprise-hack/#respond","dc:creator":{"#cdata-section":"Frank Bajak / AP"},"pubDate":"Thu, 25 Jan 2024 15:58:54 +0000","category":[{"#cdata-section":"Uncategorized"},{"#cdata-section":"wire"}],"guid":{"@isPermaLink":"false","#text":"https://time.com/?p=6588472"},"description":{"#cdata-section":"Hewlett Packard Enterprise said suspected state-backed Russian hackers broke into its cloud-based email system."},"content:encoded":{"#cdata-section":"\n<aside class=\"right-rail__container right-rail__container--ad\"><div class=\"right-rail__ad__wrapper right-rail__module\"><div class=\"right-rail__ad\" id=\"right-rail__ad-6588472\"></div></div>\n<div class=\"OUTBRAIN right-rail__outbrain right-rail__module video-2\" data-src=\"https://time.com/6588472/hp-enterprise-hack/\" data-widget-id=\"SB_4\" data-ob-template=\"timemag\"></div></aside>\n\n<img decoding=\"async\" class=\"wp-block-gutenberg-custom-blocks-featured-media\" src=\"https://api.time.com/wp-content/uploads/2024/01/GettyImages-1258327931.jpg\" alt=\"HP Enterprise discloses hack by suspected state-backed Russian hackers\"/>\n\n\n\n<p>(BOSTON) &mdash; Hewlett Packard Enterprise disclosed Wednesday that suspected state-backed Russian hackers broke into its cloud-based email system and stole data from cybersecurity and other employees.</p>\n\n\n\n<p>The provider of information technology products and services said in a&nbsp;<a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1645590/000164559024000009/hpe-20240119.htm\"  target=\"_blank\">Securities and Exchange Commission regulatory filing</a>&nbsp;that it was informed of the intrusion on Jan. 12. It said it believed the hackers were from Cozy Bear, a unit of Russia&#8217;s SVR foreign intelligence service.</p>\n[time-brightcove not-tgx=&#8221;true&#8221;]\n\n\n\n\n<p>Microsoft reported last week that it also&nbsp;<a href=\"https://msrc.microsoft.com/blog/2024/01/microsoft-actions-following-attack-by-nation-state-actor-midnight-blizzard/\"  target=\"_blank\">discovered</a>&nbsp;an intrusion of its corporate network on Jan. 12. The Redmond, Washington, tech giant said the breach began in late November and also blamed Cozy Bear. It said the Russian hackers accessed accounts of senior Microsoft executives as well as cybersecurity and legal employees.</p>\n\n\n\n<p>Cozy Bear was behind the SolarWinds breach and focuses stealth intelligence-gathering on Western governments, IT service providers and think tanks in the U.S. and Europe.</p>\n\n\n\n<p>&ldquo;Based on our investigation, we now believe that the threat actor accessed and exfiltrated data beginning in May 2023 from a small percentage of HPE mailboxes belonging to individuals in our cybersecurity, go-to-market, business segments, and other functions,&rdquo; HPE, which is based in Spring, Texas, said in the filing.</p>\n\n\n\n<p>Company spokesman Adam R. Bauer, reached by email, would not say who informed HPE of the breach. &ldquo;We&#8217;re not sharing that information at this time.&rdquo; Bauer said the compromised email boxes were running Microsoft software.</p>\n\n\n\n<p>In the filing, HPE said the intrusion was &#8220;likely related to earlier activity by this threat actor, of which we were notified in June 2023, involving unauthorized access to and exfiltration of a limited number of SharePoint files.&rdquo; SharePoint is part of Microsoft&#8217;s 365 suite, formerly known as Office, which includes email, word-processing and spreadsheet apps.</p>\n\n\n\n<p>Bauer said HPE is unable to say whether the breach of its network was related to the hack that Microsoft disclosed last week as &ldquo;we do not have the details of the incident Microsoft disclosed.&rdquo;</p>\n\n\n\n<p>He did not specify the seniority of the HPE employees whose accounts were accessed by the hackers. &ldquo;The total scope of mailboxes and emails accessed remains under investigation.&rdquo; HPE said in the filing that it has so far determined that the hack has had no material impact on its operations or financial health. Both disclosures come a month after a new U.S. Securities and Exchange Commission rule took effect that compels publicly traded companies to disclose breaches that could negatively impact their business. It gives them four days to do so unless they obtain a national-security waiver.</p>\n\n\n\n<p>HPE was spun off in 2015 from the storied Silicon Valley computing company Hewlett-Packard Inc., which is best known today for its printer business.</p>\n"},"wfw:commentRss":"https://api.time.com/6588472/hp-enterprise-hack/feed/","slash:comments":"0","post-id":{"@xmlns":"com-wordpress:feed-additions:1","#text":"6588472"}}]}}}