{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Security @ Cisco Blogs","atom:link":{"@href":"https://blogs.cisco.com/security/feed","@rel":"self","@type":"application/rss+xml"},"link":"https://blogs.cisco.com/security","description":"","lastBuildDate":"Fri, 26 Jan 2024 17:17:16 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=5.9.2","image":{"url":"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2020/03/8c630e69-cropped-b44a9049-cropped-screen-shot-2019-11-08-at-12.24.33-pm-32x32.png","title":"Security @ Cisco Blogs","link":"https://blogs.cisco.com/security","width":"32","height":"32"},"item":[{"title":"Privacy is a Key Enabler of Trust","link":"https://blogs.cisco.com/security/privacy-is-a-key-enabler-of-trust/","comments":"https://blogs.cisco.com/security/privacy-is-a-key-enabler-of-trust/#comments","dc:creator":{"#cdata-section":"Robert Waitman"},"pubDate":"Thu, 25 Jan 2024 12:00:10 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"AI"},{"#cdata-section":"Artificial Intelligence (AI)"},{"#cdata-section":"compliance"},{"#cdata-section":"Generative AI (genAI)"},{"#cdata-section":"privacy"},{"#cdata-section":"trust"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=448000"},"description":{"#cdata-section":"Organizational leaders increasingly recognize that privacy is more than a compliance exercise – it is a business imperative that is tied to customer trust."},"content:encoded":{"#cdata-section":"<p>How important is privacy in building and maintaining trust with customers? While more than 160 countries have omnibus privacy laws today, business leaders recognize that privacy is more than a compliance exercise – it has become a business imperative that is inextricably tied to customer trust.</p>\n<p>As part of Cisco’s recognition of Data Privacy Day on January 28, today we released the <a href=\"https://www.cisco.com/c/en/us/about/trust-center/data-privacy-benchmark-study.html?CCID=cc004881\" target=\"_blank\" rel=\"noopener\">Cisco 2024 Data Privacy Benchmark Study</a>, our seventh annual review of key privacy issues and their impact on business. Drawing on responses from more than 2,600 organizations in 12 geographies, the findings highlight the strong connection between privacy and trust, the positive impact of privacy regulation, the attractive economic returns from privacy investment, and some of the key challenges facing organizations over their use of Artificial Intelligence (AI) and generative AI.</p>\n<h2><span style=\"color: #6abf4b;\"><b>Privacy Enables Customer Trust</b> </span></h2>\n<p>Privacy is critical to the buying process today. Ninety-four percent of respondents said their customers would not buy from them if they did not adequately protect data. And they are looking for demonstrable evidence that the organization can be trusted when it comes to privacy. Ninety-eight percent said that external privacy certifications – like ISO 27701 and the APEC Cross-Border Privacy Rules – are important factors in their buying decisions. And 97% recognize they have a responsibility to use data ethically. Interestingly, for each of these important metrics, the percentages are at the highest levels we’ve seen in our privacy research.</p>\n<h2><span style=\"color: #6abf4b;\"><b>Strong Support for Privacy Laws</b> </span></h2>\n<p>Privacy laws put additional costs and requirements on organizations, including the need to catalog and classify data, implement controls, and respond to user requests. Despite these requirements, organizations continue to overwhelmingly support privacy laws. Eighty percent of respondents said privacy laws have had a positive impact on them, and only 6% said the impact has been negative.</p>\n<p>Why would organizations be so positive about regulations that add cost and effort? Because they recognize the need to reassure their customers about how their data is being used. For years, <a href=\"https://www.cisco.com/c/en/us/about/trust-center/consumer-privacy-survey.html?CCID=cc000742\" target=\"_blank\" rel=\"noopener\">consumer respondents in our research</a> have indicated they want governments to play the leading role when it comes to protecting data. Strong privacy regulation boosts consumer confidence and trust in the organizations that are handling their data.</p>\n<h2><span style=\"color: #6abf4b;\"><b>The Economics of Privacy</b> </span></h2>\n<p>Privacy has continued to provide attractive financial returns for organizations around the world. In this year’s survey, 95% indicated that privacy’s benefits exceed its costs. Additionally, 70% to 80% recognize the specific benefits that come from business drivers such as greater loyalty and trust, mitigating losses from data breaches, achieving operational efficiency, and enabling agility and innovation.</p>\n<p>While privacy budgets have remained roughly flat on average for 2023 at $2.7 million, larger organizations have seen increases in the 7-8% range since last year. The average return on privacy investment was 1.6 times, which means the average organization estimates $160 of benefit for each $100 of privacy investment. Thirty percent of organizations are getting returns of at least 2 times their privacy investment.</p>\n<h2><span style=\"color: #6abf4b;\"><b>Slow Progress on AI and Transparency</b> </span></h2>\n<p>We’ve learned that consumers are concerned about AI use involving their data today, and 60% have already lost trust in organizations over their AI practices. We asked about this in <a href=\"https://www.cisco.com/c/dam/en_us/about/doing_business/trust-center/docs/cisco-privacy-benchmark-study-2023.pdf?CCID=cc000160&amp;DTID=odicdc000016&amp;OID=rptsc030828\" target=\"_blank\" rel=\"noopener\">last year’s Benchmark Study</a>, and 92% of respondents said their organizations needed to do more to reassure their customers that their data was being used only for intended and legitimate purposes in AI. We asked the same question this year, and the percentage had only dropped 1% to 91%, indicating that not much progress has been made.</p>\n<p>When asked what they are doing to build confidence in their AI use, organizations cited several initiatives. Fifty percent are ensuring a human is involved in the process, 50% are trying to be more transparent about the AI applications, and 49% have instituted an AI ethics management program. It often takes time to put in place the necessary elements, as highlighted in Cisco’s recently published <a href=\"https://www.cisco.com/c/m/en_us/solutions/ai/readiness-index.html\" target=\"_blank\" rel=\"noopener\">AI Readiness Index</a>, which showed that only 14% of organizations were fully ready to integrate AI into their businesses.</p>\n<h2><span style=\"color: #6abf4b;\"><b>Concerns with Generative AI</b> </span></h2>\n<p>Generative AI applications have the power to use AI and machine learning to create new content quickly, including text, images, and code. Seventy-nine percent of respondents said they are already getting significant value from generative AI. But this new technology brings risks and challenges, including the protection of personal or confidential data entered into these tools.</p>\n<p>Over two-thirds of respondents indicated they were concerned about the risk of the data being shared with competitors or with the public. Nonetheless, many of them have entered information that could be problematic, including non-public information about the company (48%). Fortunately, many organizations are starting to put in place controls on the tools used or data entered. We will continue to track this novel technology as it evolves.</p>\n<h2><span style=\"color: #6abf4b;\"><b>How to Get More Information</b> </span></h2>\n<p>To learn more, including our recommendations for organizations, check out the <a href=\"https://www.cisco.com/c/en/us/about/trust-center/data-privacy-benchmark-study.html\" target=\"_blank\" rel=\"noopener\">Cisco 2024 Data Privacy Benchmark Study,</a><a href=\"https://www.cisco.com/c/dam/en_us/about/doing_business/trust-center/docs/cisco-privacy-benchmark-study-infographic-2024.pdf?CCID=cc000160&amp;DTID=esootr000515&amp;OID=rptsc032067\" target=\"_blank\" rel=\"noopener\"> Infographic</a>, and our <a href=\"https://www.cisco.com/c/dam/en_us/about/doing_business/trust-center/docs/cisco-responsible-artificial-intelligence-principles.pdf?CCID=cc000742&amp;DTID=odicdc000016\" target=\"_blank\" rel=\"noopener\">Principles for Responsible AI</a>.</p>\n<p>Also, the <a href=\"https://www.cisco.com/c/dam/m/en_us/about/csr/esg-hub/_pdf/purpose-report-2023.pdf\" target=\"_blank\" rel=\"noopener\">Cisco 2023 Purpose Report (Power section) </a>and the <a href=\"https://www.cisco.com/c/m/en_us/about/csr/esg-hub/trust.html\" target=\"_blank\" rel=\"noopener\">ESG Reporting Hub (Integrity and Trust)</a> to see how trustworthiness, transparency, and accountability are keys to Cisco’s approach to security, privacy, and trust.</p>\n<p>All this and more can be found on the <a href=\"https://trust.cisco.com/\" target=\"_blank\" rel=\"noopener\">Cisco Trust Center</a>.</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/privacy-is-a-key-enabler-of-trust/feed","slash:comments":"1"},{"title":"Meet the Nominees for the Cybersecurity Defender of 2024 Award in the EMEA Region","link":"https://blogs.cisco.com/security/meet-the-nominees-for-the-cybersecurity-defender-of-2024-award-in-the-emea-region/","comments":"https://blogs.cisco.com/security/meet-the-nominees-for-the-cybersecurity-defender-of-2024-award-in-the-emea-region/#respond","dc:creator":{"#cdata-section":"Cristina Errico"},"pubDate":"Wed, 24 Jan 2024 13:00:44 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Live"},{"#cdata-section":"security heroes"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=448433"},"description":{"#cdata-section":"Cisco is announcing its Cybersecurity Award in EMEA which recognizes top advocates"},"content:encoded":{"#cdata-section":"<p>In cybersecurity, professionals from all backgrounds come together to protect sensitive data and share their knowledge. It takes dedication, expertise, and unwavering commitment to safeguard critical data from cyber threats. Cisco is proud to recognize and celebrate exceptional cybersecurity advocates in each region with the Cybersecurity Defender of 2024 Award.</p>\n<p>During a special ceremony at Cisco Live in Amsterdam, four outstanding advocates from the EMEA region will be honored, and one will be named the winner. Their stories are remarkable and serve as inspiration to the broader cybersecurity community. We’re grateful for their tireless efforts to safeguard critical data and commitment to keeping the internet safe. Let&#8217;s meet the nominees for the Cybersecurity Defender of 2024 Award in the EMEA region:</p>\n<h2><strong><span style=\"color: #6abf4b;\"><a style=\"color: #6abf4b;\" href=\"https://www.linkedin.com/in/giulia-moschini-9a36bb108/\">Giulia Moschini &#8211; Head of Cybersecurity for Leroy Merlin Italy</a></span></strong></h2>\n<p>Giulia Moschini is a cybersecurity specialist passionate about reducing risk and protecting businesses and clients from threats. She started her career as a consultant before moving into a cybersecurity role at a major retailer. In her current role, Giulia is responsible for managing the company&#8217;s cybersecurity strategy, ensuring it is protected from attack, and helping to educate employees and clients about the importance of cybersecurity.</p>\n<p>Giulia has worked with various cybersecurity solutions throughout her career. She was pivotal in executing the <a href=\"https://blogs.cisco.com/security/cisco-cloud-protection-suite-protect-apps-simplify-multicloud-operations\">digital security strategy and vision</a> designed by Alessio Settaro, Chief Digital Solutions and Digital Transformation Leader at Leroy Merlin Italy. Giulia’s relationship with Cisco and expertise were instrumental in effectively leveraging Cisco Vulnerability Management in support of Alessio’s vision for cloud security across Leroy Merlin.</p>\n<p>Giulia&#8217;s exceptional skills and expertise helped to integrate Cisco&#8217;s Cloud Protection vision into Leroy Merlin&#8217;s cybersecurity infrastructure seamlessly. Giulia’s excellent execution of the strategy helped enhance Leroy Merlin&#8217;s reputation as a leader in cloud security, integrating Alessio’s belief that “Cisco’s Cloud Protection Suite is the complete puzzle for cloud protection, ensuring solutions are in the right ecosystem and communicating.”</p>\n<h2><strong><span style=\"color: #6abf4b;\"><a style=\"color: #6abf4b;\" href=\"https://www.linkedin.com/in/stuart-perkins-441839/\">Stuart Perkins &#8211; Operations Leader for Cyber Prevent at Vodafone</a></span></strong></h2>\n<p>Stuart Perkins is responsible for the Network and Telco domain, which provides protection on the perimeter of the Vodafone Estate. In addition, he is the Operations lead for Cyber Prevent at Vodafone. His role is focused on securing Vodafone infrastructure and bringing value to Vodafone enterprise customers. With a team of over 100 resources, including graduates and apprentices, Stuart is proud of the significant youth cohort within the team.</p>\n<p>Stuart&#8217;s passion for cybersecurity comes from his background in developing secure network solutions. His knowledge of network tools has led him to drive the development of the Device Operational Assurance Tool. The tool monitors the security status of all network devices in Vodafone&#8217;s infrastructure, primarily focusing on Cisco devices, to understand their hardening status as they are deployed. Stuart is proud of the tool his team has developed and its capabilities and sees opportunities to utilize it elsewhere.</p>\n<h2><span style=\"color: #6abf4b;\"><strong><a style=\"color: #6abf4b;\" href=\"https://www.linkedin.com/in/jeremy-couture-3763833/overlay/about-this-profile/\">Jeremy Couture &#8211; Head of SOC for the Paris 2024 Organizing Committee for the Olympic and Paralympic Games</a></strong></span></h2>\n<p>Jeremy Couture is a seasoned cybersecurity professional with over ten years of experience. He currently serves as the Head of SOC for the Paris 2024 Organising Committee for the Olympic and Paralympic Games, where he is responsible for overseeing the security operations center and ensuring the safety of the committee&#8217;s digital assets.</p>\n<p>Jeremy&#8217;s career in cybersecurity began in 2011 when he worked as a Project Manager and Network Architect for the Crédit Agricole Group Infrastructure Platform. He has since managed complex cybersecurity projects and built strong relationships with industry leaders such as Cisco. In addition to his impressive career achievements, Jeremy is a passionate advocate for cybersecurity awareness and education. He regularly participates in conferences and events to share his knowledge and experience with others in the field and works tirelessly to promote its importance.</p>\n<h2><strong><span style=\"color: #6abf4b;\"><a style=\"color: #6abf4b;\" href=\"https://www.linkedin.com/in/jagevall/\">Magnus Jägevall, Network Solution Architect at Volvo Cars</a></span></strong></h2>\n<p>Magnus Jägevall serves as a Network Solutions Architect at Volvo Cars, where he has been providing expert advice to his organization on how to protect their networks and data from cyber threats for over six years. Throughout his career, Magnus has held various roles in cybersecurity, including security analyst, security engineer, and security consultant. He has worked with many clients, from small startups to large corporations.</p>\n<p>Magnus has developed a deep understanding of the unique cybersecurity challenges each client faces. He has provided invaluable feedback about Cisco Secure Access, helping to grow the product to new heights. He has also created a Zero Trust Network Access (ZTNA) fabric in a globally distributed manufacturing environment, demonstrating his innovative approach to cybersecurity. Magnus is an instrumental figure in driving innovation in cybersecurity.</p>\n<p>These four nominees represent the best and brightest in the EMEA region&#8217;s cybersecurity community. Their dedication, expertise, and hard work have made them stand out, and we are proud to recognize them for their contributions to the field.</p>\n<p>I invite you to join us in celebrating these remarkable cybersecurity advocates and the winner of the Cybersecurity Defender of 2024 Award.</p>\n<p>Stay tuned for the winner&#8217;s announcement on the 7th of February on the Cisco Security Blog.</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #6abf4b;\"><a style=\"color: #6abf4b;\" href=\"https://app.smartsheet.com/b/form/7c5725f9e0a74edb84cf3eaf23516a24\"><strong>To participate in the next Cybersecurity Defender of the Year award, complete this form now!</strong></a></span></h2>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/meet-the-nominees-for-the-cybersecurity-defender-of-2024-award-in-the-emea-region/feed","slash:comments":"0"},{"title":"Protect against advanced inbound threats with ingress security from Cisco Multicloud Defense","link":"https://blogs.cisco.com/security/protect-against-advanced-inbound-threats-with-ingress-security-from-cisco-multicloud-defense/","comments":"https://blogs.cisco.com/security/protect-against-advanced-inbound-threats-with-ingress-security-from-cisco-multicloud-defense/#respond","dc:creator":{"#cdata-section":"Anubhav Swami"},"pubDate":"Tue, 23 Jan 2024 13:00:08 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Multicloud Defense"},{"#cdata-section":"Cisco Secure"},{"#cdata-section":"Cisco Security"},{"#cdata-section":"cloud security"},{"#cdata-section":"Multicloud"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=448330"},"description":{"#cdata-section":"Ingress security from Cisco Multicloud Defense gives organizations consistent visibility and control across multicloud environments."},"content:encoded":{"#cdata-section":"<p>Digital transformation and the cloud are driving unprecedented innovation and growth. However, the move to the cloud is expanding threat surfaces out beyond the perimeter – often on endpoints, applications, and cloud services that fall beyond the visibility and control of the organization&#8217;s security team. The lack of visibility and control across multiple clouds, regions, and accounts has created a major security gap for organizations looking to continue to innovate and grow through the scale and power of the cloud.</p>\n<p>Ingress security has always been key to protecting enterprise networks from inbound malicious threats – but the role of ingress security has grown even more important in the multicloud world. Organizations need a more robust ingress security solution that not only provides deep visibility and control to protect against evolving threats, but also applies these controls quickly and evenly across clouds, regions, and accounts as infrastructure scales.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>The importance of ingress security in today’s multicloud world</strong></span></h2>\n<p>The attack chain starts with a threat actor over the internet looking for a way to gain access to the network by various attack techniques. Some of these techniques are evasive enough to get around traditional security controls. Hiding in plain sight, they disguise themselves as legitimate traffic or shroud themselves within encrypted traffic to gain initial access on a vulnerable ingress point. From there, attackers can lie in wait, collecting insights on the now-compromised network while looking for a valuable target. Then, when the timing is right, they can act quickly and execute their attack on the network under the radar.</p>\n<p>Organizations need strong security capabilities across the entire attack chain, but it’s here, at this initial access point, where ingress security can stop these attacks before they enter the network. Unfortunately, traditional security tools are not designed for today’s agile multicloud world. As attack surfaces continue to expand, the number of tools required to protect an organization’s infrastructure grows as well. Suddenly, teams are juggling dozens of management tools – each with their own dashboard and nuances. This multi-tool approach creates complexity for organizations, leading to misconfigurations, wide open threat policies, and other security and networking gaps. Some organizations use homegrown solutions to consolidate tool sprawl, but these require manual configuration and updates every time a new cloud provider is added to an environment – contributing to uncontrollable tech debt and additional vulnerabilities.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Cisco Multicloud Defense simplifies ingress security</strong></span></h2>\n<p>Organizations need strong ingress security that gives them visibility into their expanding attack surfaces and the ability to consistently control traffic entering their environments. Cisco Multicloud Defense provides this consistent visibility and control – helping organizations gain multidirectional protection across their clouds, regions, accounts, and workloads. It can block inbound attacks, prevent lateral movement, and stop data exfiltration by leveraging IDS/IPS, web application firewall, URL filtering, FQDN filtering, data loss prevention (DLP), and antivirus capabilities all baked into a single SaaS solution.</p>\n<p>Multicloud Defense alleviates security complexity across clouds, regions, and accounts with consistent policy controls and deep visibility into workloads – including potentially malicious traffic and unauthorized entities trying to gain access to the cloud infrastructure. Just as critical, security teams can be assured that policies are being applied appropriately and consistently across multiple cloud environments.</p>\n<p>For ingress protection, Multicloud Defense acts as an integrated Web Application Firewall (WAF) and IDS/IPS solution to block threats targeting applications and infrastructure. It also leverages geographic IP and known malicious IP blocking capabilities to identify entities attempting to connect, making an “allow” or “block” decision in real time. And for encrypted traffic flows, Multicloud Defense uses TLS decrypt and reverse proxy capabilities enabling organizations to decrypt and inspect traffic before it enters the cloud infrastructure.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Building powerful multicloud network security across the entire attack chain</strong></span></h2>\n<p>Cisco Multicloud Defense provides security throughout the entire attack chain. Ingress security gives organizations the ability to identify suspicious or abnormal behavior that is trying to gain unauthorized access to the cloud. However, expanding attack surfaces, infrastructure complexity, and increasingly sophisticated threats make it hard to detect, analyze, and stop threat actors with traditional security tools. Cisco Multicloud Defense simplifies security across complex environments while giving organizations the ingress protection they need to stop incoming threats that target their distributed applications and infrastructure. With consistent, unified ingress protection across environments, Multicloud Defense reduces risk for organizations and enables them to remain agile in today’s multicloud world.</p>\n<p>To learn more about Cisco Multicloud Defense:</p>\n<ul>\n<li>Get an overview of Multicloud Defense <a href=\"https://blogs.cisco.com/security/secure-multicloud-infrastructure-with-cisco-multicloud-defense\" target=\"_blank\" rel=\"noopener\">capabilities</a></li>\n<li>Take the Multicloud Defense <a href=\"https://learn-cloudsecurity.cisco.com/multicloud-defense-tour\" target=\"_blank\" rel=\"noopener\">product tour</a></li>\n<li>Request a Multicloud Defense <a href=\"https://www.cisco.com/c/en/us/products/security/multicloud-defense/request-demo.html\" target=\"_blank\" rel=\"noopener\">demo</a></li>\n<li>View <a href=\"https://www.cisco.com/c/en/us/products/collateral/security/multicloud-defense-ag.html\" target=\"_blank\" rel=\"noopener\">architecture guide</a></li>\n<li>Read <a href=\"https://www.cisco.com/c/en/us/products/collateral/security/multicloud-defense-wp.html\" target=\"_blank\" rel=\"noopener\">white paper</a></li>\n</ul>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/protect-against-advanced-inbound-threats-with-ingress-security-from-cisco-multicloud-defense/feed","slash:comments":"0"},{"title":"Using Data Connectors for a Consolidated View of Risk in Cisco Vulnerability Management   ","link":"https://blogs.cisco.com/security/using-data-connectors-for-a-consolidated-view-of-risk-in-cisco-vulnerability-management/","comments":"https://blogs.cisco.com/security/using-data-connectors-for-a-consolidated-view-of-risk-in-cisco-vulnerability-management/#respond","dc:creator":{"#cdata-section":"Tori Burinskiy"},"pubDate":"Tue, 23 Jan 2024 13:00:08 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"IT Cybersecurity"},{"#cdata-section":"vulnerability management"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=448334"},"description":{"#cdata-section":"Rapid7 InsightVM's asset, vulnerability, and fix data is ingested into Cisco Vulnerability Management for data centralization and effective risk prioritization."},"content:encoded":{"#cdata-section":"<p>Protecting your organization against cyber threats is a top priority. It’s no secret that data breaches and security vulnerabilities can wreak havoc on businesses. The key to safeguarding your organization? Understanding your risk landscape and taking proactive measures to protect your assets.</p>\n<p>In this blog post, we’ll dive into Cisco Vulnerability Management’s ability to ingest asset, vulnerability, and fix data from third-party security tools, providing you with a centralized view of risk for effective prioritization and remediation. We’ll also share details on our latest native connector with Rapid7 InsightVM.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Cisco Vulnerability Management: A Brief Overview  </span></strong></h2>\n<p><a href=\"https://www.cisco.com/site/us/en/products/security/vulnerability-management/index.html\" target=\"_blank\" rel=\"noopener\">Cisco Vulnerability Management</a> is a risk-based vulnerability management SaaS solution that enables effective vulnerability prioritization through the transformative power of data science. It can ingest security data from a variety of third-party tools, including scanners, asset discovery tools, web application security tools, static and dynamic application security testing tools, bug bounties, and more. In doing so, Cisco Vulnerability Management ensures you have a consolidated, holistic view of security risk across your organization.</p>\n<p>Using proven data science techniques like machine learning, natural language processing, and predictive modeling, Cisco Vulnerability Management assesses, prioritizes, and even predicts risk. These approaches allow us to dynamically calculate the risk of every vulnerability and group of assets to enable security and IT teams to prioritize the risk in their environments that matters most. Remediation guidance and workflow integrations with ticketing systems like Jira and ServiceNow then help teams efficiently carry out remediation efforts to ultimately reduce risk.</p>\n<h2><strong><span style=\"color: #6abf4b;\">New Connectors for Cisco Vulnerability Management</span></strong></h2>\n<p>Cisco Vulnerability Management offers <a href=\"https://www.cisco.com/c/en/us/products/security/vulnerability-management/technology-integrations.html\" target=\"_blank\" rel=\"noopener\">a variety of native and toolkit connectors</a> to bring security data into one place for effective risk-based vulnerability management.</p>\n<p><strong>Rapid7 InsightVM Connector for Cisco Vulnerability Management </strong></p>\n<p><span data-contrast=\"auto\">Our latest native connector is with the Rapid7 cloud-based vulnerability management solution, InsightVM. Customers of both solutions can use this connector to ingest asset, vulnerability, and fix data from InsightVM into Cisco Vulnerability Management. Combining this ingested data with data from your other security tools in Cisco Vulnerability Management gives you a consolidated view of risk to implement effective prioritization and remediation. For guidance on setting up the InsightVM connector, see </span><a href=\"https://help.kennasecurity.com/hc/en-us/articles/21414424758676-Rapid7-InsightVM-Cloud-Connector\" target=\"_blank\" rel=\"noopener\"><span data-contrast=\"none\">our help documentation.</span></a><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\"> </span></p>\n<p><span data-contrast=\"auto\">Cisco Vulnerability Management already has an established </span><a href=\"https://help.kennasecurity.com/hc/en-us/articles/202325979-Rapid7-Nexpose-InsightVM-Connectors-\" target=\"_blank\" rel=\"noopener\"><span data-contrast=\"none\">connector with Nexpose</span></a><span data-contrast=\"auto\">, Rapid7’s on-premises vulnerability scanner. For customers who are currently using the Nexpose connector, but are planning to migrate to the InsightVM connector, our team has documented </span><a href=\"https://community.cisco.com/t5/security-knowledge-base/migrating-from-a-nexpose-connector-to-insightvm/ta-p/4999955\" target=\"_blank\" rel=\"noopener\"><span data-contrast=\"none\">migration steps</span></a><span data-contrast=\"auto\">.    </span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\"> </span></p>\n<h2><strong><span style=\"color: #6abf4b;\">Benefits of Ingesting Security Data into Cisco Vulnerability Management</span></strong></h2>\n<h3><strong>Gain a Centralized View of Risk</strong></h3>\n<p>Cyber threats evolve rapidly, and your risk landscape changes accordingly. Consolidating your asset and vulnerability data from scanners, vulnerability management tools, asset discovery tools, SAST &amp; DAST tools, bug bounties and pen-test findings into Cisco Vulnerability Management gives you a comprehensive view of your organization’s risk. Having a centralized view not only makes it easier to identify vulnerabilities but also helps you pinpoint the most critical ones. You can assess the potential impact on your organization and prioritize accordingly.</p>\n<h3><strong>Adopt Effective Prioritization</strong></h3>\n<p>Once you have all your data in one place, the next step is to prioritize vulnerabilities that pose the greatest risk to your organization. The Cisco Security Risk Score (formerly Kenna Risk Score) in Cisco Vulnerability Management is assigned to every CVE, CWE, and WASC in your environment.</p>\n<p>Leveraging ground truth telemetry and an extensive amount of internal security data, the Cisco Security Risk Score ties into Cisco Vulnerability Management’s predictive model to algorithmically determine risk scores for each unique vulnerability, ranging from zero (no risk) to 100 (highest risk). And, in concert with asset criticality scores, Cisco Vulnerability Management determines an actionable risk score for each asset and group of assets that ranges from zero (no risk) to 1000 (highest risk).</p>\n<p>The Cisco Security Risk Score takes into account all of the internal and external variables used in the predictive model that are high indicators of risk. Internal risk calculations factor in the number of instances of each vulnerability in your environment, their potential severity, and the criticality of the assets threatened by each vulnerability. External risk calculations factor in more than just the CVSS score of the vulnerability by also including EPSS, threat intelligence information such as whether or not an exploit kit is available for the vulnerability, the volume and velocity of exploits that take advantage of the vulnerability, and the prevalence of the vulnerability seen throughout customer environments. With accurate and quantifiable risk scores, you will understand your organizations’ current risk posture and identify the actions you can take to reduce the greatest amount of risk.</p>\n<h3><strong>Improve the Remediation Process</strong></h3>\n<p>Once you’ve identified the vulnerabilities that pose the greatest risk to your organization, you can work to remediate them. Cisco Vulnerability Management helps align security and IT teams by providing evidence-based prioritization and self-service remediation workflows. Teams can reduce risk fast with Top Fix Groups that guide you on which vulnerabilities should be fixed first and their impact on your risk score. And, of course, integrations with ticketing systems like Jira and ServiceNow help make the remediation process even more efficient by automating some of the tedious work.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Interested in Learning More about Connectors for Cisco Vulnerability Management?</span></strong></h2>\n<p>Check out the <a href=\"https://www.cisco.com/c/en/us/products/security/vulnerability-management/technology-integrations.html\" target=\"_blank\" rel=\"noopener\">Cisco Vulnerability Management Technology Integrations page</a> to see a filterable list of available integrations to help you centralize your data and drive effective risk-based vulnerability management. You can also view our downloadable <a href=\"https://www.cisco.com/c/dam/en/us/products/collateral/security/vulnerability-management/vulnerability-management-integrations-brief.pdf\" target=\"_blank\" rel=\"noopener\">integrations brief</a> for more details!</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/using-data-connectors-for-a-consolidated-view-of-risk-in-cisco-vulnerability-management/feed","slash:comments":"0"},{"title":"New M6 based CSW-Cluster Hardware","link":"https://blogs.cisco.com/security/new-m6-based-csw-cluster-hardware/","comments":"https://blogs.cisco.com/security/new-m6-based-csw-cluster-hardware/#respond","dc:creator":{"#cdata-section":"Abhijeet Nakhate"},"pubDate":"Mon, 22 Jan 2024 13:00:45 +0000","category":{"#cdata-section":"Security"},"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=448225"},"description":{"#cdata-section":"M6 based CSW appliance upgrade is very important for on premises CSW customers as M5 appliance is reaching end of sale and it is essential to understand the upgrade process, benefits and features."},"content:encoded":{"#cdata-section":"<p>This blog is about Cisco Secure Workload on premises platform hardware updates. The cluster hardware comprises of UCS servers and Nexus switches which are required to be upgraded with the EOL cycles of UCS servers and Nexus Switches. In this blog we will discuss about the new M6 hardware platform and its benefits.</p>\n<p>Secure Workload is one of the security solutions from Cisco that offers micro-segmentation and application security across multi-cloud environments, and it is available as SaaS and on prem flavors. There is complete feature parity between both the solutions, and we see that many customers have chosen On-prem cluster over SaaS offerings due to their own requirements driven by their businesses especially in banking and finance, manufacturing verticals. Let us understand Microsegmentation and secure workload hardware cluster role.</p>\n<p>Microsegmentation is being adopted by many enterprises as a preventive tool which is based on zero-trust principle. It helps protect applications and data by preventing lateral movements of bad actors and containing the blast radius during active attack. Deploying zero trust microsegmentation is a very hard task and operation intensive activity. The difficult part is the policy life cycle. The application requirements from the network keep on evolving as you upgrade, patch, or add new features to your applications and without microsegmentation it goes unnoticed because workloads can communicate to each other freely. As a principle of zero trust while deploying microsegmentation you are creating a micro-perimeter around each of these workloads and whitelisting the intended traffic while blocking rest all (Allow list model) then all these evolving changes in network requirement gets blocked unless there is a policy lifecycle mechanism available. Application teams will never be able to provide the exact communication requirements as they keep on changing and hence automatic detection of policies and changes is required.</p>\n<p>Secure workload on prem cluster is available in two form factors small (8U) and large (39U) appliances. The reason Cisco has appliance based on-prem solution is for predictability and performance. In many cases vendors provide VM (Virtual Machine) based appliances with required specifications, but the challenge in VM appliances is that underlying hardware may be shared with other applications and may compromise the performance. Also, troubleshooting for performance related issues becomes challenging, especially for applications with AI/ML processing of large datasets. These appliances come with prebuilt racks with stacks of servers and nexus 9k switches which are hardened. Hence, we know the capacity and the number of workloads supported and other performance parameters can be predicted accurately.</p>\n<p>The release 3.8 software has optimized the appliances performance and supporting 50-100% greater number of workloads on same hardware. This means the existing customers with M5 appliances now can support almost double the number of workloads in the existing investment of their appliances. The TCO (Total Cost of Ownership) for existing customers reduces with the new workload capacity numbers. The new and old numbers of supported workloads are as below.</p>\n<p><img class=\"aligncenter size-large wp-image-448226\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/Screenshot-2024-01-19-at-10.21.05 AM-1024x198.png\" alt=\"\" width=\"640\" height=\"124\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/Screenshot-2024-01-19-at-10.21.05 AM-1024x198.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/Screenshot-2024-01-19-at-10.21.05 AM-300x58.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/Screenshot-2024-01-19-at-10.21.05 AM-768x148.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/Screenshot-2024-01-19-at-10.21.05 AM.png 1182w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>All the current appliances are based on Cisco UCS C-220 M5 Gen 2 series. The M5 series server end of sale/life announcement has been published in May 2023 and M5 based Secure workload cluster has been announced EOS/EOL on 17<sup>th</sup> August 2023 (<a href=\"https://www.cisco.com/c/en/us/products/collateral/security/secure-workload/nexus-9300-switch-c93180yc-c93108tc-fx-eol.html?dtid=osscdc000283\" target=\"_blank\" rel=\"noopener\">link</a>). Even though the M5 cluster will have support for another few years, there are certain benefits of upgrading the cluster to M6.</p>\n<p>Let us understand how the Micro-segmentation policies are detected and enforced in CSW (Cisco Secure Workload). The network telemetry is collected from all agent-based and agentless workloads in CSW. The AI/ML based Application dependency mapping is run on this dataset to detect the policies and changes to policies. The policies per workload are calculated and then pushed to workloads for enforcement leveraging the native OS firewalling capabilities. This is a huge amount of dataset to be handled for policy detection. The AI/ML tools are always CPU intensive and demand high CPU resources for faster processing. The larger the dataset will take longer processing time and require more CPU horsepower in the cluster to get more granular policies. It also needs a fast lane network within the cluster for communication between the nodes as the application is distributed amongst the cluster nodes. All of these performance related requirements of cluster drive the need to have more CPU resources and faster network connectivity. Though the existing hardware configuration is quite sufficient to handle all these requirements, there are going to be new features and functionalities which will be added in future releases and those may also need additional resources. Hence with the new 3.8 release we are launching the support for the new M6 Gen 3 appliance for both 8U and 39U platform. The processing power is based on the latest Cisco C series Gen3 servers with the latest processors from Intel and newer N9k switches. The new Intel processors are powerful with more cores available per processor, hence the total count of processing GHz for cluster is increased, providing more horsepower for AI/ML-based ADM (Application Dependency Mapping) processing. The overall performance of the cluster will be boosted by the additional cores available in the nodes.</p>\n<p>We know that any upgrade of hardware is a difficult IT task. So, to simplify the upgrade task, we have made sure that the migration to M6 from M4/M5 is seamless by qualifying and documenting the complete process step wise in the migration guide. The document also mentions the checks to be carried out before and after migration to confirm that all data has been migrated correctly. All the existing configuration of the cluster with flow data will be backed up using DBR (Data Backup and Restore) functionality and will be restored on the new cluster after migration. This ensures that there is no data loss during the migration. The agents can be configured to re-home automatically to new cluster and reinstallation of agents is not needed.</p>\n<p>As we know in security that the MTTD/MTTR must be as fast as possible, and I think that M6 upgrade will bring in faster threat and policy detection and response reducing MTTD/MTTR.</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/new-m6-based-csw-cluster-hardware/feed","slash:comments":"0"},{"title":"Black Hat Europe 2023 NOC: Threat Hunting","link":"https://blogs.cisco.com/security/black-hat-europe-2023-noc-threat-hunting/","comments":"https://blogs.cisco.com/security/black-hat-europe-2023-noc-threat-hunting/#comments","dc:creator":{"#cdata-section":"Jessica Bair"},"pubDate":"Fri, 19 Jan 2024 13:00:58 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Black Hat"},{"#cdata-section":"Cisco XDR"},{"#cdata-section":"cybersecurity NOC"},{"#cdata-section":"Mobile Device Manager (MDM)"},{"#cdata-section":"security Security Operations Center"},{"#cdata-section":"SOC"},{"#cdata-section":"Talos Meraki"},{"#cdata-section":"Telemetry Broker"},{"#cdata-section":"Umbrella"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=447153"},"description":{"#cdata-section":"Cisco is a longtime partner of the Black Hat NOC and 2023 was our seventh year supporting Black Hat Europe. "},"content:encoded":{"#cdata-section":"<p>Cisco is a longtime partner of the <a href=\"https://www.blackhat.com/eu-23/noc.html\" target=\"_blank\" rel=\"noopener\">Black Hat NOC</a> and 2023 was our seventh year supporting Black Hat Europe. Cisco is the Official Mobile Device Management, Malware Analysis and DNS (Domain Name Service) Provider.</p>\n<p>We work with the other official providers to bring the hardware, software and engineers to build and secure the network, for our joint customer: Black Hat.</p>\n<ul>\n<li><strong>Arista</strong>: Wired and Wireless Network Equipment</li>\n<li><strong>Corelight</strong>: Network Analytics and Detection</li>\n<li><strong>NetWitness</strong>: Threat Detection &amp; Response, Identity</li>\n<li><strong>Palo Alto Networks</strong>: Network Security Platform</li>\n</ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447154\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctvgbhgvfcdr-1024x573.jpg\" alt=\"\" width=\"640\" height=\"358\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctvgbhgvfcdr-1024x573.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctvgbhgvfcdr-300x168.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctvgbhgvfcdr-768x430.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctvgbhgvfcdr.jpg 1375w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>The primary mission in the NOC is network resilience. The partners also provide integrated security, visibility and automation, a SOC inside the NOC.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447155\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xdcfvgbhgvyftcdrxsezaw-1024x579.jpg\" alt=\"\" width=\"640\" height=\"362\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xdcfvgbhgvyftcdrxsezaw-1024x579.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xdcfvgbhgvyftcdrxsezaw-300x170.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xdcfvgbhgvyftcdrxsezaw-768x434.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xdcfvgbhgvyftcdrxsezaw.jpg 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Outside the NOC were partner dashboards for the attendees to view the volume and security of the network traffic.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447156\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvghbjgvftcdrxsez-1024x578.jpg\" alt=\"\" width=\"640\" height=\"361\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvghbjgvftcdrxsez-1024x578.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvghbjgvftcdrxsez-300x169.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvghbjgvftcdrxsez-768x434.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvghbjgvftcdrxsez.jpg 1417w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p><strong>From Malware to Network Visibility</strong></p>\n<p>Cisco was first asked to provide automated malware analysis, back in 2016. Our contributions to the network and security operations evolved, with the needs of the customer.</p>\n<ul>\n<li><a href=\"https://www.cisco.com/c/en/us/products/security/threat-grid/index.html\">Cisco Secure Malware Analytics</a> (Formerly Threat Grid): sandboxing and integrated threat intelligence</li>\n<li><a href=\"https://umbrella.cisco.com/\">Cisco Umbrella</a>: DNS visibility for the conference network and protection for iOS devices</li>\n<li><a href=\"https://www.cisco.com/c/en/us/products/security/security-connector/index.html\">Cisco Security Connector</a>: iOS device security and visibility, managed with <a href=\"https://meraki.cisco.com/products/systems-manager/\">Meraki Systems Manager</a></li>\n<li><a href=\"https://www.cisco.com/c/en/us/products/cloud-systems-management/internet-cloud-intelligence/index.html\">ThousandEyes</a>: Network visibility</li>\n</ul>\n<p>The NOC leaders allowed Cisco (and the other NOC partners) to bring in additional software to make our internal work more efficient and have greater visibility; however, Cisco is not the official provider for Extended Detection and Response, Network Detection and Response or collaboration.</p>\n<ul>\n<li><a href=\"https://www.cisco.com/site/us/en/products/security/xdr/index.html\">Cisco XDR</a>: Threat Hunting / Threat Intelligence Enrichment / Executive dashboards / Automation with Webex</li>\n<li><a href=\"https://www.cisco.com/c/en/us/products/security/stealthwatch-cloud/index.html\">Cisco XDR Analytics</a> (Formerly Secure Cloud Analytics / Stealthwatch Cloud): network traffic visibility and threat detection</li>\n<li><a href=\"https://www.webex.com/\">Cisco Webex</a>: Incident notification and team collaboration</li>\n</ul>\n<p>The Cisco XDR Command Center dashboard tiles made it easy to see the status of each of the connected Cisco Secure technologies, and the status of ThousandEyes agents.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447157\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ergy6t.png\" alt=\"\" width=\"620\" height=\"308\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ergy6t.png 620w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ergy6t-300x149.png 300w\" sizes=\"(max-width: 620px) 100vw, 620px\" /></p>\n<p>When the partners deploy to each conference, we set up a world class network and security operations center in a few days. Our goal remains network up time and creating better integrated visibility and automation. Black Hat has the pick of the security industry tools and no company can sponsor/buy their way into the NOC. It is invitation only, with the intention of diversity in partners, and an expectation of full collaboration. As a NOC team comprised of many technologies and companies, we are continuously innovating and integrating, to provide an overall SOC cybersecurity architecture solution.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447158\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drxcfvgybhuubgvyfctdxr.png\" alt=\"\" width=\"684\" height=\"352\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drxcfvgybhuubgvyfctdxr.png 684w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drxcfvgybhuubgvyfctdxr-300x154.png 300w\" sizes=\"(max-width: 684px) 100vw, 684px\" /></p>\n<p>Below are the Cisco XDR integrations for Black Hat Europe, empowering analysts to investigate Indicators of Compromise (IOC) very quickly, with one search.</p>\n<p>We appreciate <a href=\"https://www.alphamountain.ai/\">alphaMountain.ai</a>, <a href=\"https://pulsedive.com/\">Pulsedive</a> and <a href=\"https://www.recordedfuture.com/\">Recorded Future</a> donating full licenses to Cisco, for use in the Black Hat Europe 2023 NOC.</p>\n<table style=\"margin-left: 40px;\" border=\"0\" cellspacing=\"0\" cellpadding=\"10\">\n<tbody style=\"padding-left: 40px;\">\n<tr style=\"background-color: #0d274d; color: white; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\"></td>\n<td style=\"padding-left: 40px;\"><strong>Cisco Networking and Security</strong></td>\n<td style=\"padding-left: 40px;\"><strong>Third Party</strong></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">1</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://meraki.cisco.com/products/systems-manager/\">Meraki System Manager</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.alphamountain.ai/\">alphaMountain.ai</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">2</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.cisco.com/c/en/us/products/security/security-connector/index.html\">Secure Endpoint for iOS</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.apivoid.com/\">APIVoid</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">3</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.cisco.com/c/en/us/products/security/threat-grid/index.html\">Secure Malware Analytics</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://otx.alienvault.com/\">AlienVault OTX</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">4</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.cisco.com/c/en/us/products/cloud-systems-management/internet-cloud-intelligence/index.html\">ThousandEyes</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"http://cybercrime-tracker.net/about.php\">CyberCrime Tracker</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">5</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://umbrella.cisco.com/\">Umbrella DNS</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://safebrowsing.google.com/\">Google Safe Browsing</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">6</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.webex.com/\">Webex</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.netwitness.com/\">NetWitness</a> / <a href=\"https://github.com/CiscoSecurity/tr-05-serverless-rsa-netwitness\">Custom relay</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">7</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.cisco.com/c/en/us/products/security/stealthwatch-cloud/index.html\">XDR Analytics</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://pulsedive.com/\">Pulsedive</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">8</td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.cisco.com/c/en/us/products/security/telemetry-broker/index.html\">Cisco Telemetry Broker</a></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.recordedfuture.com/\">Recorded Future</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">9</td>\n<td style=\"padding-left: 40px;\"></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.shodan.io/\">Shodan</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">10</td>\n<td style=\"padding-left: 40px;\"></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://console.threatscore.cyberprotect.cloud/\">Threatscore | Cyberprotect</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">11</td>\n<td style=\"padding-left: 40px;\"></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://www.virustotal.com/gui/\">VirusTotal</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">12</td>\n<td style=\"padding-left: 40px;\"></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://slack.com/\">Slack</a></td>\n</tr>\n<tr style=\"background-color: #e7e7e7; padding-left: 40px;\">\n<td style=\"padding-left: 40px;\">13</td>\n<td style=\"padding-left: 40px;\"></td>\n<td style=\"padding-left: 40px;\"><a href=\"https://urlscan.io/\">urlscan</a></td>\n</tr>\n</tbody>\n</table>\n<p>&nbsp;</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447159\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drxctfvygubvyfctdxr.png\" alt=\"\" width=\"592\" height=\"300\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drxctfvygubvyfctdxr.png 592w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drxctfvygubvyfctdxr-300x152.png 300w\" sizes=\"(max-width: 592px) 100vw, 592px\" /></p>\n<p>A core integrated technology in the Black Hat NOC for Cisco is NetWitness sending suspicious files to Threat Grid (now Secure Malware Analytics). We expanded this in Black Hat Asia 2023 with Corelight also submitting samples. Over 4,600 samples were submitted.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447160\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tfyguhibygvtfcr.png\" alt=\"\" width=\"634\" height=\"282\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tfyguhibygvtfcr.png 634w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tfyguhibygvtfcr-300x133.png 300w\" sizes=\"(max-width: 634px) 100vw, 634px\" /></p>\n<p>The NOC analysts also used Malware Analytics to investigate suspicious domains, without the risk of infection. An example was an alert for cryptomining on the network by Umbrella, accessed by a student in a Black Hat training course.</p>\n<p>Rather than going to the website on a corporate or Black Hat assets, we were able to interact with the website in the glovebox, including downloading and installing the website payload.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447161\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvgybhuugvyfctdrx.png\" alt=\"\" width=\"664\" height=\"332\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvgybhuugvyfctdrx.png 664w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvgybhuugvyfctdrx-300x150.png 300w\" sizes=\"(max-width: 664px) 100vw, 664px\" /></p>\n<p>We allowed the payload to make the changes on the virtual machine, as the user experienced.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447162\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcftvgybhubugyvfctdx.png\" alt=\"\" width=\"618\" height=\"336\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcftvgybhubugyvfctdx.png 618w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcftvgybhubugyvfctdx-300x163.png 300w\" sizes=\"(max-width: 618px) 100vw, 618px\" /></p>\n<p>For cryptomining, we allow the activity to occur, but alert the user that their device is being used for that purpose.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447163\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxctfvygubhugyftcdxr.png\" alt=\"\" width=\"680\" height=\"324\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxctfvygubhugyftcdxr.png 680w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxctfvygubhugyftcdxr-300x143.png 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" /></p>\n<p>As the payload was not malicious, we did not notify the user of an infection.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447164\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcftvygubhjhbgvfctdxr.png\" alt=\"\" width=\"718\" height=\"318\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcftvygubhjhbgvfctdxr.png 718w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcftvygubhjhbgvfctdxr-300x133.png 300w\" sizes=\"(max-width: 718px) 100vw, 718px\" /></p>\n<h2><span style=\"color: #6abf4b;\"><strong><u>XDR Analytics</u></strong>, by Abhishek Sha</span></h2>\n<p>XDR Analytics (formerly Secure Cloud Analytics, or Stealthwatch Cloud) allows you to gain the visibility and continuous threat detection needed to secure your public cloud, private network and hybrid environment. XDR Analytics can detect early indicators of compromise in the cloud or on-premises, including insider threat activity and malware, policy violations, misconfigured cloud assets, and user misuse. These NDR (Network Detection and Response) capabilities are native functionality within Cisco XDR. Cisco XDR was available starting July 31<sup>st</sup> 2023, so we had some experience under our belt for employing its capabilities.</p>\n<p>XDR Analytics equipped us with the capability to identify a range of alerts, significantly enhancing our cybersecurity measures at Black Hat.</p>\n<p><strong>Deciphering Cyber Threats: A Black Hat Case Study in XDR Analytics</strong></p>\n<p>While scanning internet hosts is a common practice in cybersecurity, it&#8217;s important to note that the context and target of these scans can significantly impact the seriousness of the situation. If these scans were to shift focus towards other conference participants or, more critically, towards the network infrastructure itself, it would prompt a more serious response.</p>\n<p>This scenario underscores the need for continuous vigilance and a proactive approach in monitoring and responding to potential cyber threats. This is the essence of effective cybersecurity management &#8211; a process that is constantly tested, improved, and fortified in the face of potential threats.</p>\n<p>During our network vigilance at Black Hat, Ivan and I encountered a scenario that clearly highlighted the crucial role of XDR Analytics. XDR Analytics raised an alert when it detected that several internal IP addresses were communicating with certain external IP addresses. Intriguingly, these external IP addresses were on our blocklist for production security environments.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447165\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfyvgubhiugvfcdx-1024x328.png\" alt=\"\" width=\"640\" height=\"205\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfyvgubhiugvfcdx-1024x328.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfyvgubhiugvfcdx-300x96.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfyvgubhiugvfcdx-768x246.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfyvgubhiugvfcdx.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Leveraging the netflow telemetry we were receiving, we employed the Event Viewer feature on XDR Analytics to discern the type of traffic being transmitted to those addresses. On all observed logs, the only protocol was ICMP.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447166\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgbhgvfctd-1024x542.png\" alt=\"\" width=\"640\" height=\"339\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgbhgvfctd-1024x542.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgbhgvfctd-300x159.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgbhgvfctd-768x407.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgbhgvfctd.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>A full search confirmed that no traffic aside from ICMP connected to the external IPs.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447167\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuhyvtcrex-1024x293.png\" alt=\"\" width=\"640\" height=\"183\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuhyvtcrex-1024x293.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuhyvtcrex-300x86.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuhyvtcrex-768x220.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuhyvtcrex.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>By utilizing graphs in XDR Analytics, we gained insights into the volume of traffic sent to the external IP addresses. This proved instrumental in determining whether any potential ICMP tunneling was taking place, based on the size of the overall traffic.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447168\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rdxcftvgybuhihbvgyftcr-1024x442.png\" alt=\"\" width=\"640\" height=\"276\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rdxcftvgybuhihbvgyftcr-1024x442.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rdxcftvgybuhihbvgyftcr-300x129.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rdxcftvgybuhihbvgyftcr-768x331.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rdxcftvgybuhihbvgyftcr.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>We then focused our investigative efforts on these suspicious external IP addresses using Cisco XDR. The examination revealed that this IP was flagged on other blocklists as well.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447169\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fygvuhibgy.png\" alt=\"\" width=\"464\" height=\"440\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fygvuhibgy.png 464w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fygvuhibgy-300x284.png 300w\" sizes=\"(max-width: 464px) 100vw, 464px\" /> <img loading=\"lazy\" class=\"aligncenter size-large wp-image-447170\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gfyytgyuyt.png\" alt=\"\" width=\"482\" height=\"436\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gfyytgyuyt.png 482w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gfyytgyuyt-300x271.png 300w\" sizes=\"(max-width: 482px) 100vw, 482px\" /> <img loading=\"lazy\" class=\"aligncenter size-large wp-image-447171\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fdtfygu.png\" alt=\"\" width=\"452\" height=\"275\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fdtfygu.png 452w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fdtfygu-300x183.png 300w\" sizes=\"(max-width: 452px) 100vw, 452px\" /></p>\n<p>Further analysis on the Cisco XDR graph disclosed a network of other endpoints that had also been interacting with these dubious IP addresses. This revelation exposed the far-reaching influence of these IPs and enabled us to visualize the various interconnected activities.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447172\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tyvuhuihygt.png\" alt=\"\" width=\"508\" height=\"512\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tyvuhuihygt.png 508w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tyvuhuihygt-298x300.png 298w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tyvuhuihygt-150x150.png 150w\" sizes=\"(max-width: 508px) 100vw, 508px\" /></p>\n<p>Lastly, we resolved the IP addresses on Umbrella and deduced that these IP addresses were associated with a “Private Internet Access VPN&#8221;. It appeared that the endpoint was testing the reachability of all these relays hosted in different locations.</p>\n<p>Despite this traffic being innocuous, we capitalized on XDR and XDR Analytics to gain a better understanding and context of this incident. This experience underscores the efficacy of these tools in enhancing cybersecurity defenses.</p>\n<p><strong>Mastering Threat Detection with Attack Chains</strong></p>\n<p>XDR Attack Chain is a feature that allows us to correlate multiple alerts into a larger investigation. We use extracted alert meta data to determine what the alerts have in common, which we refer to as common indicators. Common indicators include devices, IP addresses, host names, and usernames. We then follow the MITRE ATT&amp;CK® framework to further identify the tactics, techniques, and procedures (TTPs) to model the sequencing of actions and threat behaviors which could be early indications of an attack.</p>\n<p>In this instance, we&#8217;re observing an attack chain comprising several &#8220;Suspected Port Abuse (External)&#8221; events. Typically, without an attack chain, each of these events would need to be investigated individually, a process that could be time-consuming and potentially less effective.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447173\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/vyubhgvyfc-1024x276.png\" alt=\"\" width=\"640\" height=\"173\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/vyubhgvyfc-1024x276.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/vyubhgvyfc-300x81.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/vyubhgvyfc-768x207.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/vyubhgvyfc.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>However, the beauty of an attack chain lies in its ability to consolidate multiple alerts into a singular, interconnected event. This method provides a holistic overview of the various alerts, the devices involved, and their respective roles, all within the framework of a single combined event.</p>\n<p>The power of this approach is that it eliminates the need for an exhaustive investigation of each separate alert. Instead, it presents a comprehensive, contextualized view of the situation, enabling a more efficient and effective response to potential threats.</p>\n<p>With this information, we were able to work with the threat hunters of NetWitness, Palo Alto Networks and Corelight, to determine the risk to the network and attendees. Activities involving malware what would be blocked on a corporate network must be allowed, within the confines of <a href=\"https://www.blackhat.com/code-of-conduct.html\">Black Hat Code of Conduct</a>.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447174\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trfyvgutfr-1024x525.png\" alt=\"\" width=\"640\" height=\"328\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trfyvgutfr-1024x525.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trfyvgutfr-300x154.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trfyvgutfr-768x394.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trfyvgutfr.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p><strong>Black Hat Insights: Cisco Telemetry Broker</strong></p>\n<p>Cisco Telemetry Broker (CTB) acts as a foundational pillar for the intelligent telemetry plane, thereby future-proofing the telemetry architecture. It enhances visibility and context into the telemetry that drives the products that rely on it, facilitating telemetry brokering, filtering, and sharing. The Telemetry Broker is the culmination of years of management, troubleshooting, transforming, and sharing telemetry to empower Security and Network Analytics products.</p>\n<p>At the Black Hat event, we employed the Telemetry Broker to process a SPAN (Switched Port Analyzer is a dedicated port on a switch that takes a mirrored copy of network traffic from within the switch to be sent to a destination) of all network traffic, along with the Netflow generated from Palo Alto Networks firewalls. This was part of our NOC collaboration and integrations. We then made all this data available to the threat hunters in Cisco XDR.</p>\n<p>A typical Telemetry Broker deployment necessitates both a broker node and a manager node. To minimize our on-premises footprint, we chose to manage the broker node through XDR Analytics. This functionality was activated by the XDR Analytics Engineering team on our Black Hat XDR Analytics portal from the backend, as it is currently in beta. This enabled us to manage the broker node and review the metrics directly from the cloud.</p>\n<p>We also installed an additional plugin known as the Flow Generator Plugin. This plugin enabled us to generate Netflow telemetry from the ingested SPAN traffic. With the beta code, we were fortunate to have the support of the engineering team to test the latest and most advanced technology Cisco has to offer. A special shoutout to the engineering team for their invaluable support.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447175\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctrytvutfrct-1024x564.png\" alt=\"\" width=\"640\" height=\"353\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctrytvutfrct-1024x564.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctrytvutfrct-300x165.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctrytvutfrct-768x423.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctrytvutfrct.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p><strong>Unleashing the Power of Cisco XDR Automate at Black Hat Europe</strong></p>\n<p>With the ever-evolving technological landscape, automation stands as a cornerstone in achieving XDR outcomes. It&#8217;s indeed a testament to the prowess of Cisco XDR that it boasts a fully integrated, robust automation engine.</p>\n<p>Cisco XDR Automation embodies a user-friendly, no-to-low code platform with a drag-and-drop workflow editor. This innovative feature empowers your Security Operations Center (SOC) to speed up its investigative and response capabilities. You can tap into this potential by importing workflows straight from Cisco or by flexing your creative muscles and crafting your own.</p>\n<p><img loading=\"lazy\" class=\"size-large wp-image-447176 alignleft\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctyvgubhgvfc-333x1024.png\" alt=\"\" width=\"333\" height=\"1024\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctyvgubhgvfc-333x1024.png 333w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctyvgubhgvfc-98x300.png 98w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctyvgubhgvfc.png 480w\" sizes=\"(max-width: 333px) 100vw, 333px\" /></p>\n<p>Cisco XDR introduces a trailblazing concept known as Automation Rules. This fresh take on automation promises to revolutionize the way you interact with the system. During the Black Hat Europe event, we flexed our inventive muscles and brought to life an XDR Automate workflow. This workflow was designed to spring into action whenever XDR Analytics posted an incident. The workflow would delve into the heart of the alert, extracting crucial details such as the alert description, publish time, entity groups, and observations. The parsed results were then broadcasted on Webex Teams via a message and simultaneously posted on Slack. This ensured that other threat hunters could readily consume the information. Furthermore, the workflow will be shared on GitHub, encouraging a wider audience to understand and appreciate the automation process.</p>\n<p>The automation output is below. In the realm of cybersecurity, Cisco XDR Automate is pushing the boundaries, redefining how we perceive automation and its limitless possibilities.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447177\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctyvgubhgvft.png\" alt=\"\" width=\"506\" height=\"310\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctyvgubhgvft.png 506w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fctyvgubhgvft-300x184.png 300w\" sizes=\"(max-width: 506px) 100vw, 506px\" /></p>\n<h2><span style=\"color: #6abf4b;\"><strong><u>&#8220;Collaboration&#8221; and &#8220;Continuity&#8221; &#8211; for successful threat hunting</u></strong>, by Ivan Berlinson</span></h2>\n<p>During Black Hat, the NOC opens early before the event and closes later after the trainings/briefings complete for the day. This means that every analyst position must be covered by a physical, uninterrupted presence for about 11 hours per day. Even with the utmost dedication to your role, sometimes you need a break, and a new potential incident doesn&#8217;t wait until you&#8217;ve finished the previous one.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447178\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygbuh-1024x578.jpg\" alt=\"\" width=\"640\" height=\"361\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygbuh-1024x578.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygbuh-300x169.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygbuh-768x433.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygbuh.jpg 1402w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Abhishek and I shared the role of Cisco XDR analyst, with morning and afternoon shifts. We have worked closely together to handle incidents or alerts from Cisco XDR analytics and to actively hunt threats. It was a great collaboration! It was important that we didn&#8217;t work in silos and that we acted as a team to make sure we maximized all our efforts. To do this, we of course needed good communication, but we also needed a platform that would support us and enable us to document and share information quickly and easily (the incident we&#8217;re currently working on, what we&#8217;ve found, what we&#8217;ve done&#8230;).</p>\n<p>The Cisco XDR incident manager and ribbons (with its browser extension) were a great help and saved us a lot of time. Let&#8217;s quickly see how we used them in a typical investigation.</p>\n<p>While I was performing a threat hunt based on a Malware Analytics (Threat Grid) report showing phishing indicators, XDR analytics alerted us about multiple communications to destinations on a list of countries to be monitored and using a non-standard protocol/port combination.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447179\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygubhugfc.png\" alt=\"\" width=\"368\" height=\"720\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygubhugfc.png 368w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dctfvygubhugfc-153x300.png 153w\" sizes=\"(max-width: 368px) 100vw, 368px\" /> <img loading=\"lazy\" class=\"aligncenter size-large wp-image-447180\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuin.png\" alt=\"\" width=\"504\" height=\"720\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuin.png 504w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rctvybuin-210x300.png 210w\" sizes=\"(max-width: 504px) 100vw, 504px\" /></p>\n<p style=\"text-align: center;\"><em>Cisco XDR – Incident summary</em></p>\n<p>I took a quick look at the incident, and thanks to XDR attack chain and automatic enrichment, I had an instant view of the assets impacted and the multiple destinations involved.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447181\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfygvuhb-1024x528.png\" alt=\"\" width=\"640\" height=\"330\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfygvuhb-1024x528.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfygvuhb-300x155.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfygvuhb-768x396.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfygvuhb.png 1521w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p style=\"text-align: center;\"><em>Cisco XDR – Incident main view (with auto-enrichment)</em></p>\n<p>Telemetry from the NetWitness integration enriched the incident and confirmed the traffic, but the integrated threat intelligence sources did not provide any malicious verdicts or threat indicators related to these IP addresses. Further investigation was required to confirm this potential incident.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447182\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gvyubhjnk-1024x564.png\" alt=\"\" width=\"640\" height=\"353\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gvyubhjnk-1024x564.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gvyubhjnk-300x165.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gvyubhjnk-768x423.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/gvyubhjnk.png 1375w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p style=\"text-align: center;\"><em>Investigation with telemetry from NetWitness</em></p>\n<p>I added a note to the incident as part of the “Confirm Incident” step of the response plan, but as I was already on another activity, I asked Abhishek to get into the game.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447183\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdtcfyvgu.png\" alt=\"\" width=\"430\" height=\"240\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdtcfyvgu.png 430w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdtcfyvgu-300x167.png 300w\" sizes=\"(max-width: 430px) 100vw, 430px\" /> <img loading=\"lazy\" class=\"aligncenter size-large wp-image-447184\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/sxdcfgvhbj.png\" alt=\"\" width=\"640\" height=\"443\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/sxdcfgvhbj.png 776w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/sxdcfgvhbj-300x208.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/sxdcfgvhbj-768x531.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/sxdcfgvhbj-770x533.png 770w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p style=\"text-align: center;\"><em>Cisco XDR – Guided Response</em></p>\n<p>Abhishek was able to further investigate communication to those IPs in the raw network flows collected by XDR analytics and collaborate with the NetWitness team, who can look deep inside packet. But he doesn&#8217;t need to write down the IPs on paper or memorize them, we can use the Cisco XDR ribbon integrated in our browser to in one-click extract any observables in a web page.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447185\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/yvuyihuhyt-1024x543.png\" alt=\"\" width=\"640\" height=\"339\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/yvuyihuhyt-1024x543.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/yvuyihuhyt-300x159.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/yvuyihuhyt-768x408.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/yvuyihuhyt.png 1387w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p style=\"text-align: center;\"><em>Add observables to casebook using Cisco XDR ribbon (browser-plugin)</em></p>\n<p>We can then add them to a casebook shared automatically between us and available everywhere.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447186\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfvygbuhi-1024x530.png\" alt=\"\" width=\"640\" height=\"331\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfvygbuhi-1024x530.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfvygbuhi-300x155.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfvygbuhi-768x398.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrdctfvygbuhi.png 1393w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p style=\"text-align: center;\"><em>Casebook available for Abhishek in the XDR Analytics console</em></p>\n<p>A few minutes later, I had finished with my previous file and was confident about going to lunch, knowing that Abhishek was on the case and had all the information he needed.</p>\n<p>With the help of the Palo Alto analyst, it was confirmed that the traffic was legitimate (QUIC &#8211; HTTP/3).</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447187\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgvbhnj.png\" alt=\"\" width=\"913\" height=\"770\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgvbhnj.png 913w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgvbhnj-300x253.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgvbhnj-768x648.png 768w\" sizes=\"(max-width: 913px) 100vw, 913px\" /></p>\n<p style=\"text-align: center;\"><em>Confirmation from Palo Alto</em></p>\n<p>Here are the browser extensions for your own SOC use:</p>\n<ul>\n<li>Firefox: <a href=\"https://cs.co/CiscoXDR_Firefox\">https://cs.co/CiscoXDR_Firefox</a></li>\n<li>Chrome: <a href=\"https://cs.co/CiscoXDR_Chrome\">https://cs.co/CiscoXDR_Chrome</a></li>\n</ul>\n<h2><span style=\"color: #6abf4b;\"><strong><u>Network Visibility with ThousandEyes</u></strong>, by Adam Kilgore and Alicia Garcia Sastre</span></h2>\n<p>Black Hat Europe 2023 is the third consecutive conference with a ThousandEyes (TE) presence, following a proof of concept in Black Hat Asia 2023 and an initial deployment at Black Hat USA 2023. Building upon our first full deployment in Vegas, we were focused on making improvements to deployment process, data baselining, and monitoring procedures.</p>\n<p><strong>Hardware and Deployment Process</strong></p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447188\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trcyvubi-1024x726.jpg\" alt=\"\" width=\"640\" height=\"454\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trcyvubi-1024x726.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trcyvubi-300x213.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trcyvubi-768x545.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/trcyvubi.jpg 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p style=\"text-align: center;\"><em>Some of the hardware we brought to the conference</em></p>\n<p>Just like Black Hat USA 2023, we deployed 10 TE agents on Raspberry Pi’s. However, since ExCel London is a smaller venue, we had the same number of agents to spread across a smaller area—we still didn’t feel like we had a full Thousand Eyes, but definitely more visibility. We spread that visibility across core switching, Registration, the Business Hall, two- and four-day training rooms, and Keynote areas.</p>\n<p>We also added a few accessories from lessons learned in Vegas. Deploying TE agents on micro-SDs is a time-consuming process which requires connecting the micro-SD to a laptop using a USB adapter. We invested in two adapters that can connect four USB adapters at once for more streamlined deployment and scaling.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447189\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cftvygbuhnij-1024x757.jpg\" alt=\"\" width=\"640\" height=\"473\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cftvygbuhnij-1024x757.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cftvygbuhnij-300x222.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cftvygbuhnij-768x568.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cftvygbuhnij.jpg 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p style=\"text-align: center;\"><em>Economies of scale</em></p>\n<p>At BH USA, we also developed a method for deploying TE agents wirelessly on Raspberry Pi (as covered in this <a href=\"https://blogs.cisco.com/security/thousandeyes-pi4-wireless-deployment-at-black-hat-usa\">blog post</a>), even though this functionality isn’t technically supported. At BH Europe, our intention was to rely on wired Pi agents for the bulk of the monitoring; however, the wireless access points shipped to the conference did not have a free ethernet port. Because of this we ended up doing a primarily wireless deployment again, plus two wired agents connected to switching infrastructure. The new wireless deployment revealed some documentation and process improvements to roll into the prior blog post.</p>\n<p>Enabling wireless on the ThousandEyes Pi image also makes the Pi more susceptible to overheating. The server room in London ExCel where we did our initial provisioning had a cooling problem and reached 28 degrees Celsius (82 F) at one point. The heat in the room caused a very fast failure of the wireless adapter, which initially made it appear that the wireless was not working at all. However, we eventually untangled the documentation and heat related problems and got all the Pi’s deployed, where they functioned stably throughout the conference, with only a few overheating incidents.</p>\n<p>Changes in available personnel and hardware also necessitated a change in the Linux platform for configuring the scripts for persistent wireless deployment. We went with Ubuntu via VMWare Fusion on Mac laptops, which provided a smooth deployment sequence.</p>\n<p><strong>Monitoring, Alerting, and Baselining</strong></p>\n<p>The wireless network at BH Europe had less latency variation than BH USA, which required tuning of alert thresholds to reduce noise. At BH USA, we deployed a rule that fired when the latency on any agent exceeded two standard deviations above baseline. However, in BH Europe this alert was firing on latency changes that were statistically significant, but very minor in real world terms. For example, the alert below fired when latency increased 5.4ms+ above a 7.3ms baseline.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447190\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgbhj-1024x241.png\" alt=\"\" width=\"640\" height=\"151\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgbhj-1024x241.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgbhj-300x70.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgbhj-768x180.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fgbhj.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>To control for smaller variations, we added a minimum threshold of 30ms change above baseline. This resulted in a much smaller set of more useful alerts, while still maintaining visibility into changing latency conditions before latency reached noticeably degraded levels.</p>\n<p><strong>Trains, Planes, and Wireless Access Points</strong></p>\n<p>On the last day of the conference, NOC morning staff found the wireless network was inaccessible 30 minutes before the conference opened for the day. Nothing gets the blood pumping like a network failure right before business hours. However, an expedited investigation revealed that only the NOC was affected, and not the broader conference wireless infrastructure.</p>\n<p>Troubleshooting revealed that the SSID was available, but most of the endpoints could not detect it. A quick collaboration with our friends at Arista revealed that the endpoints trying to connect to 5 GHz were having issues, while the endpoints that were connected at 6 GHz were all fine—an important detail.</p>\n<p>This was consistent with what we saw in the ThousandEyes portal. There was one engineer with a ThousandEyes endpoint agent running before the outage occurred. We jumped to agent views to check Wi-Fi stats.</p>\n<p>While we were investigating, the SSID came back at 5 GHz.</p>\n<p>Reviewing the TE endpoint logs, we found that the endpoint was connected to wireless channel 116 before the outage.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447191\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fcghvbjn.png\" alt=\"\" width=\"910\" height=\"462\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fcghvbjn.png 910w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fcghvbjn-300x152.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fcghvbjn-768x390.png 768w\" sizes=\"(max-width: 910px) 100vw, 910px\" /></p>\n<p>After recovery the endpoint was connected to channel 124.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447192\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fvhgbjnk.png\" alt=\"\" width=\"910\" height=\"462\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fvhgbjnk.png 910w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fvhgbjnk-300x152.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/fvhgbjnk-768x390.png 768w\" sizes=\"(max-width: 910px) 100vw, 910px\" /></p>\n<p>During the outage the endpoint was not capable of connecting to the Wi-Fi, creating a gap in the logs where no channel or signal strength was available. The channel change was indicative of the SSID coming back up and recalculating the best channel to advertise the SSID.</p>\n<p>So why did the wireless channel of the SSID change and what was the trigger? Here comes the interesting part: The Black Hat conference is hosted at ExCeL London, less than four km away from the London City airport. Remember the initial channel of the SSID? It was 116, which is a Dynamic Frequency Selection (DFS) channel. These channels share the spectrum with weather radar and radar systems.</p>\n<p>To share the use of these channels in Wi-Fi, a mechanism was put in place by regulators to prioritise radar usage, and this is exactly what DFS does. Wi-Fi devices will listen for radar events and either stop using the channels or automatically move off these channels when they detect radar events.</p>\n<p>As we are so close to the airport, is not rare that one DFS event occurred. We are just lucky it didn&#8217;t happen more often.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447193\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcyvgbuhinj-1024x492.jpg\" alt=\"\" width=\"640\" height=\"308\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcyvgbuhinj-1024x492.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcyvgbuhinj-300x144.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcyvgbuhinj-768x369.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcyvgbuhinj.jpg 1100w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Do you want to see the whole analysis for yourself? Thanks to a very handy feature of ThousandEyes, you can. All the information of this mini outage was captured in a <a href=\"https://apkmixrtepybajbbrzqyotxhhnfzrtop.share.thousandeyes.com/view/endpoint-agent/?roundId=1701934200&amp;metric=loss&amp;scenarioId=eyebrowNetworkTest&amp;testId=242555&amp;page=0,0&amp;grouping=BY_AGENT\">web accessible report</a>. Feel free to click around and find all the relevant information for yourself. The outage started at 7.31 am. The most insightful view can be found at Scheduled tests -&gt; Network -&gt; Click on the dotted lines to expose all the nodes in the path visualization and see metrics more clearly.</p>\n<h2><span style=\"color: #6abf4b;\"><strong><u>Meraki Systems Manager</u></strong>, by Paul Fidler and Connor Loughlin</span></h2>\n<p>Our eighth deployment of Meraki Systems Manager as the official Mobile Devices Management platform went very smoothly, and we introduced a new caching operation to update iOS devices on the local network, for speed and efficiency. Going into the event, we planned for the following number of devices and purposes:</p>\n<ul>\n<li>iPhone Lead Scanning Devices: 68</li>\n<li>iPads for Registration: 9</li>\n<li>iPads for Session Scanning: 12</li>\n<li>Number of devices planned in total: 89</li>\n</ul>\n<p>We registered the devices in advance of the conference. Upon arrival, we turned each device on.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447194\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfyvtgubhijo-1024x577.jpg\" alt=\"\" width=\"640\" height=\"361\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfyvtgubhijo-1024x577.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfyvtgubhijo-300x169.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfyvtgubhijo-768x433.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfyvtgubhijo.jpg 1240w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Then we ensured Location Services enabled, always on.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447195\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cdtfvygbuhinj.png\" alt=\"\" width=\"618\" height=\"312\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cdtfvygbuhinj.png 618w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cdtfvygbuhinj-300x151.png 300w\" sizes=\"(max-width: 618px) 100vw, 618px\" /></p>\n<p>Instead of using a mass deployment technology, like Apple’s Automated Device Enrollment, the iOS devices are “prepared” using Apple Configurator. This includes uploading a Wi-Fi profile to the devices as part of that process. In Las Vegas, this Wi-Fi profile <strong><em>wasn’</em></strong><em>t</em> set to auto join the Wi-Fi, resulting in the need to manually change this on 1,000 devices. Furthermore, 200 devices weren’t reset or prepared, so we had those to reimage as well.</p>\n<p>Black Hat Europe 2023 was different. We took the lessons from US and coordinated with the contractor to prepare the devices. Now, if you’ve ever used Apple Configurator, there’s several steps needed to prepare a device. However, all of these can be actions can be combined into a Blueprint.</p>\n<p>For Black Hat Europe, this included:</p>\n<ul>\n<li>Wi-Fi profile</li>\n<li>Enrollment, including supervision</li>\n<li>Whether to allow USB pairing</li>\n<li>Setup Assistant pane skipping</li>\n</ul>\n<p>In Meraki Systems Manager, we controlled the applications by the assigned use, designated by <em>Tags</em>. When we came in on the first morning of the Briefings, three iPhones needed to be changed from lead scanning in the Business Hall, to Session Scanning for the Keynote, so the attendees could fill the hall faster. Reconfiguring was as simple as updating the <em>Tags</em> on each device. Moments later, they were ready for the new mission&#8230;which was important as the Keynote room filled to capacity and had to go to an overflow room.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447196\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcyvtubinom-1024x364.jpg\" alt=\"\" width=\"640\" height=\"228\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcyvtubinom-1024x364.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcyvtubinom-300x107.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcyvtubinom-768x273.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcyvtubinom.jpg 1408w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>We also were able to confirm the physical location of each device, if wiping was required due to loss or theft.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447197\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrtcyvtuybhi-1024x371.jpg\" alt=\"\" width=\"640\" height=\"232\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrtcyvtuybhi-1024x371.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrtcyvtuybhi-300x109.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrtcyvtuybhi-768x279.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrtcyvtuybhi.jpg 1329w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Below you can see page one of four pages of Restrictions imposed by Meraki Systems Manager.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447198\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgybuhnij-1024x768.jpg\" alt=\"\" width=\"640\" height=\"480\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgybuhnij-1024x768.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgybuhnij-300x225.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgybuhnij-768x576.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dcfvgybuhnij.jpg 1100w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>When it was time for the attendees to register, they just displayed their QR code from their personal phone, as received in email from Black Hat. Their badge was instantly printed, with all personal details secured.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447199\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfyvgubhin-1024x580.jpg\" alt=\"\" width=\"640\" height=\"363\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfyvgubhin-1024x580.jpg 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfyvgubhin-300x170.jpg 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfyvgubhin-768x435.jpg 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcfyvgubhin.jpg 1100w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>This goes without saying, but the iOS devices (Registration, Lead Capture and Session Scanning) do have access to personal information. To ensure the security of the data, devices are wiped at the end of the conference, which can be completed remotely through Meraki Systems Manager.<strong> </strong></p>\n<p><strong>Content Caching</strong></p>\n<p>One of the biggest problems affecting the iOS devices in BH USA 2023 was the immediate need to both update the iOS device’s OS due to a patch to fix a zero-day vulnerability and to update the Black Hat iOS app on the devices. There were hundreds of devices, so this was a challenge for each to download and install. So, I took the initiative into looking into Apple’s Content Caching service built into macOS.</p>\n<p>Now, just to be clear, this wasn’t caching EVERYTHING&#8230; Just Apple App store updates and OS updates.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447200\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfvygbuhi.png\" alt=\"\" width=\"720\" height=\"300\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfvygbuhi.png 720w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctfvygbuhi-300x125.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></p>\n<p>This is turned on withing System Setting and starts working immediately.</p>\n<p>I’m not going to get into the weeds of setting this up, because there’s so much to plan for. But, I’d suggest that you start <a href=\"https://support.apple.com/en-gb/guide/deployment/depe9b5c1aab/1/web/1.0\">here.</a> The setting I did change was:</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447201\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cfyvgubhijnok.png\" alt=\"\" width=\"720\" height=\"276\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cfyvgubhijnok.png 720w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/cfyvgubhijnok-300x115.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></p>\n<p>I checked to see that we had one point of egress from Black Hat to the Internet. Apple doesn’t go into too much detail as to how this all works, but I’m assuming that the caching server registers with Apple and when devices check in for App store / OS update queries, they are then told where to look on the network for the caching server.</p>\n<p>Immediately after turning this on, you can see the default settings and metrics:</p>\n<p><em>% AssetCacheManagerUtil settings</em></p>\n<p><em>Content caching settings:</em></p>\n<p><em>    AllowPersonalCaching: true</em></p>\n<p><em>    AllowSharedCaching: true</em></p>\n<p><em>    AllowTetheredCaching: true</em></p>\n<p><em>    CacheLimit: 150 GB</em></p>\n<p><em>    DataPath: /Library/Application Support/Apple/AssetCache/Data</em></p>\n<p><em>    ListenRangesOnly: false</em></p>\n<p><em>    LocalSubnetsOnly: true</em></p>\n<p><em>    ParentSelectionPolicy: round-robin</em></p>\n<p><em>    PeerLocalSubnetsOnly: true</em></p>\n<p>And after having this run for some time:</p>\n<p><em>% AssetCacheManagerUtil settings</em></p>\n<p><em>Content caching status:</em></p>\n<p><em>Activated: true</em></p>\n<p><em>    Active: true</em></p>\n<p><em>    ActualCacheUsed: 528.2 MB</em></p>\n<p><em>    CacheDetails: (1)</em></p>\n<p><em>        Other: 528.2 MB</em></p>\n<p><em>    CacheFree: 149.47 GB</em></p>\n<p><em>    CacheLimit: 150 GB</em></p>\n<p><em>    CacheStatus: OK</em></p>\n<p><em>    CacheUsed: 528.2 MB</em></p>\n<p><em>    MaxCachePressureLast1Hour: 0%</em></p>\n<p><em>    Parents: (none)</em></p>\n<p><em>    Peers: (none)</em></p>\n<p><em>    PersonalCacheFree: 150 GB</em></p>\n<p><em>    PersonalCacheLimit: 150 GB</em></p>\n<p><em>    PersonalCacheUsed: Zero KB</em></p>\n<p><em>    Port: 49180</em></p>\n<p><em>    PrivateAddresses: (1)</em></p>\n<p><em>        x.x.x.x</em></p>\n<p><em>    PublicAddress: 86.28.74.239</em></p>\n<p><em>    RegistrationStatus: 1</em></p>\n<p><em>    RestrictedMedia: false</em></p>\n<p><em>    ServerGUID: xxxxxxxxxxxxxxxxxx</em></p>\n<p><em>    StartupStatus: OK</em></p>\n<p><em>    TetheratorStatus: 1</em></p>\n<p><em>    TotalBytesAreSince: 2023-12-01 13:35:10</em></p>\n<p><em>    TotalBytesDropped: Zero KB</em></p>\n<p><em>    TotalBytesImported: Zero KB</em></p>\n<p><em>    TotalBytesReturnedToClients: 528.2 MB</em></p>\n<p><em>    TotalBytesStoredFromOrigin: 528.2 MB</em></p>\n<p>Now, helpfully, Apple also pop this data periodically into a database located at:</p>\n<p>Library/Application Support/Apple/AssetCache/Metrics/Metrics.db in a table called ZMETRICS</p>\n<p><strong>Visualising this data: Reading from macOS Metrics.db</strong></p>\n<p>Inspired by a <a href=\"https://redlinetech.wordpress.com/2022/06/20/macos-content-caching-metrics/\">blog I read</a> (inspired because I couldn’t get the ruby script to work) I set off to try and create a front end to this using Grafana. After installing a SQLIte plug in into Grafana, I could eventually see data in Grafana, which was great, but the Unix date seemed VERY from 1993. I spent two hours trying to wrangle the data into something usable and viewable on a graph to no end, so I gave up.</p>\n<p>However, it’s amazing the difference a day makes. I went back to Grafana and the SQLite db, and had some success:</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447202\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcryvubi.png\" alt=\"\" width=\"720\" height=\"554\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcryvubi.png 720w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcryvubi-300x231.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></p>\n<p>This diagram shows the cache vs usage of cache. Bear in mind that there was a single OS update, and only a handful of applications on the managed iOS devices (as well as updates for the Mac Mini that caching server is running on).</p>\n<p>I also perservered with a history of cache usage:</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447203\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrctvyubin.png\" alt=\"\" width=\"720\" height=\"570\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrctvyubin.png 720w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xrctvyubin-300x238.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></p>\n<p>Try as I might, I could not find a way to show the dates across the X Axis. I will persevere with this for Black Hat Asia 2024.</p>\n<p><strong>Visualising this data: Reading from my own database</strong></p>\n<p>Firstly, I reused some of the simple code to manipulate the data from the AssetCacheManagerUtil settings command. I then created a script that first created a SQLite database, and then, every 900 seconds, put the data into it. The code to do this is here on <a href=\"https://github.com/woggledog/Black%20Hat/blob/main/macOS_Caching-Pullstats.zsh\">GitHub</a>.</p>\n<p>After working with the data in here, it seems incomplete. I’ll endeavor to work on this so that the data is more believable for Singapore. In principal, however, this looks like a better way to store the data. Cache Pressure, for example, does not appear in the database.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Domain Name Service Statistics and Streamlining NOC Threat Hunting </strong>by Alex Calaoagan</span></h2>\n<p>Since 2017, we have been tracking DNS stats at the Black Hat conferences, and year over year (except over the course of the pandemic), the show has continued to grow. That growth is reflected in the DNS traffic that we capture.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447204\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctvyubino.png\" alt=\"\" width=\"922\" height=\"524\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctvyubino.png 922w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctvyubino-300x170.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ctvyubino-768x436.png 768w\" sizes=\"(max-width: 922px) 100vw, 922px\" /></p>\n<p>With over 38M DNS requests made, BH Europe 2023 has been, by far, the largest London show on record. The huge jump in DNS requests can be attributed not just to growth, but also to the visibility advancements we made at BH Asia 2023, earlier this year in Singapore.</p>\n<p><em>*Quick reminder from </em><a href=\"https://blogs.cisco.com/security/black-hat-asia-2023-noc-xdr-extended-detection-and-response-in-action\"><em>Singapore</em></a><em>: Working with Palo Alto Networks, we forced attendees, via a firewall redirect initiated by Palo Alto Networks, to use our resolvers. Without this change, Umbrella would not see the traffic at all, as these machines with hardcoded DNS, whether it was 1.1.1.1 (Cloudflare) or 8.8.8.8 (Google), were able to bypass our Virtual Appliances.</em></p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447205\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxrctfvygbuhnijom-1024x494.png\" alt=\"\" width=\"640\" height=\"309\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxrctfvygbuhnijom-1024x494.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxrctfvygbuhnijom-300x145.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxrctfvygbuhnijom-768x371.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/dxrctfvygbuhnijom.png 1405w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>The Activity volume view from Umbrella gives a top-level level glance of activities by category, which we can drill into for deeper threat hunting. On trend with the previous BH Europe events, the top Security categories were Malware and Newly Seen Domains.</p>\n<p>In a real-world environment, of the 38M requests that Umbrella saw, over 6,000 of them would have been blocked by our default security policies. However, since this is a place for learning, we typically let everything fly (more on that later).</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447206\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxdctfvygbuin-1024x306.png\" alt=\"\" width=\"640\" height=\"191\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxdctfvygbuin-1024x306.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxdctfvygbuin-300x90.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxdctfvygbuin-768x229.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxdctfvygbuin.png 1430w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>App Discovery in Umbrella gives us a quick snapshot of the cloud apps in use at the show. In line with Black Hat’s growth over the years, the number of cloud apps in play has steadily risen. This number tends to follow attendance levels, so no surprise here.</p>\n<p>2021: 2,162 apps</p>\n<p>2022: 4,159 apps</p>\n<p>2023: 4,340 apps</p>\n<p><img loading=\"lazy\" class=\"alignleft wp-image-447207 size-medium_large\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xctyvubin-768x404.png\" alt=\"\" width=\"640\" height=\"337\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xctyvubin-768x404.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xctyvubin-300x158.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/xctyvubin.png 800w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Interested in what apps attendees hit the most? Here you go. The only surprises were Slack (WhatsApp being the incumbent&#8230;we are in Europe, right?) and Nine Chronicles (who knew Block Chain MMORPG gaming was a thing? I certainly did not).<img loading=\"lazy\" class=\"aligncenter size-large wp-image-447208\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rftgyhuijo-1024x475.png\" alt=\"\" width=\"640\" height=\"297\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rftgyhuijo-1024x475.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rftgyhuijo-300x139.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rftgyhuijo-768x356.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rftgyhuijo.png 1408w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>Umbrella also identifies risky cloud applications. Should the need arise, we can block any application via DNS, such as Generative AI apps, Wi-Fi Analyzers, or anything else that has suspicious undertones. Again, this is not something we would normally do on our General Wi-Fi network, but there are exceptions. For example, every so often, an attendee will learn a cool hack in one of the Black Hat courses or in the Arsenal lounge AND try to use said hack at the conference itself. That is obviously a ‘no-no’ and, in many cases, very illegal. If things go too far, we will take the appropriate action.</p>\n<p>A useful Cisco XDR Automate workflow, deployed by Adi Sankar and updated by Abhishek Sha (as mentioned in a post above), helps streamline our threat hunting efforts via a Webex plugin that feeds alerts into our collaboration platform, significantly improving threat response times. Do you have several product user interfaces and threat intelligence sources to log-in to? Integration and enhancing intelligence delivery helps ease the overhead of combing through mountains of data.</p>\n<p>Applying this plug-in to our NOC threat hunting duties, we were able to quickly identify a device that was beaconing out to multiple known malicious sites.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447209\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drtcfyvgubhinj.jpg\" alt=\"\" width=\"596\" height=\"284\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drtcfyvgubhinj.jpg 596w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/drtcfyvgubhinj-300x143.jpg 300w\" sizes=\"(max-width: 596px) 100vw, 596px\" /></p>\n<p>After further investigation and searching DNS records for *hamster*, we found that another user was a little distracted on their device during the conference. You can also see below how we allow Training rooms to connect to new (and potentially malicious) domains for educational purposes.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447210\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcvygbuhijnhgvfc.jpg\" alt=\"\" width=\"612\" height=\"256\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcvygbuhijnhgvfc.jpg 612w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/ftcvygbuhijnhgvfc-300x125.jpg 300w\" sizes=\"(max-width: 612px) 100vw, 612px\" /></p>\n<p>Digging into the issue of the user repeatedly connecting to several known malicious sites, using yet another visibility enhancement we made at Black Hat Singapore 2023, we identified each network zone the user traversed during the show. Again, if this were a corporate environment and a real threat was identified, this data could be used to zero on specific compromised devices, giving the network team a map of how to respond and potentially quarantine in the event a threat has spread. We can even use this to help determine “Patient Zero,” or the origin of the compromise itself.</p>\n<p><em><img loading=\"lazy\" class=\"size-full wp-image-447211 alignleft\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcvybunij.png\" alt=\"\" width=\"702\" height=\"604\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcvybunij.png 702w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/tcvybunij-300x258.png 300w\" sizes=\"(max-width: 702px) 100vw, 702px\" />*Quick reminder: We mapped out every Black Hat network zone at the ExCel center in Umbrella to help us identify what areas of the show floor requests originated from.</em></p>\n<p>Going even deeper, using Cisco Secure Cloud Analytics, we found the device to likely be an iPhone. With this new information in hand, it is a safe assumption that the device was already compromised before the attendee walked in the building. The NOC leaders authorized Palo Alto Networks to put up a captive portal to warn the user that the machine was infected.</p>\n<p>As I mentioned above, Umbrella would normally block these known malicious requests and porn visits (if your network admin deemed necessary) in the real world, right off the bat. Here at Black Hat however, because this is a learning environment, we normally allow all requests. To help educate and serve the conference attendees better, rather than kicking them off the network, we give them notification via a captive portal. If the attendee disregards our warning (such as conducting unlawful activities), we will again take the appropriate action.</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447212\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxctrvybuin-1024x578.png\" alt=\"\" width=\"640\" height=\"361\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxctrvybuin-1024x578.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxctrvybuin-300x169.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxctrvybuin-768x434.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rxctrvybuin.png 1417w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<p>All in all, we are very proud of the collaborative efforts made here at Black Hat Europe by both the Cisco team and all the participating vendors in the NOC. Great work everybody!</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447213\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rexctvybuin.png\" alt=\"\" width=\"600\" height=\"358\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rexctvybuin.png 600w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2023/12/rexctvybuin-300x179.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></p>\n<p><a href=\"https://www.blackhat.com/asia-24/\">Black Hat Asia</a> will be in April 2024, at the Marina Bay Sands, Singapore…hope to see you there!</p>\n<h2><strong><u>Acknowledgments</u></strong></h2>\n<p>Thank you to the Cisco NOC team:</p>\n<ul>\n<li><strong>Cisco Security</strong>: Ivan Berlinson, Abhishek Sha, Alejo Calaoagan, Adam Kilgore and Alicia Garcia Sastre</li>\n<li><strong>Meraki Systems Manager:</strong> Paul Fidler and Connor Loughlin</li>\n<li><strong>Additional Support and Expertise</strong>: Adi Sankar, Ryan Maclennan, Robert Harris, Jordan Chapian, Junsong Zhao, Vadim Ivlev and Ajit Thyagarajan</li>\n</ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-447819\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/sedrcftvgbyhu.png\" alt=\"\" width=\"612\" height=\"368\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/sedrcftvgbyhu.png 612w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/sedrcftvgbyhu-300x180.png 300w\" sizes=\"(max-width: 612px) 100vw, 612px\" /></p>\n<p>Also, to our NOC partners <strong>NetWitness </strong>(especially David Glover, Iain Davidson and Alessandro Zatti), <strong>Palo Alto Networks</strong> (especially James Holland), <strong>Corelight </strong>(especially Dustin Lee), <strong>Arista Networks </strong>(especially Jonathan Smith), and the entire <strong>Black Hat / Informa Tech </strong>staff (especially Grifter ‘Neil Wyler’, Bart Stump, Steve Fink, James Pope, Michael Spicer, Jess Stafford and Steve Oldenbourg).</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-447820\" src=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/wxerctvybghun-1024x580.png\" alt=\"\" width=\"640\" height=\"363\" srcset=\"https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/wxerctvybghun-1024x580.png 1024w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/wxerctvybghun-300x170.png 300w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/wxerctvybghun-768x435.png 768w, https://storage.googleapis.com/blogs-images/ciscoblogs/1/2024/01/wxerctvybghun.png 1320w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></p>\n<h2><span style=\"color: #6abf4b;\"><strong>About Black Hat</strong></span></h2>\n<p>For over 25 years, Black Hat has provided attendees with the very latest in information security research, development, and trends. These high-profile global events and trainings are driven by the needs of the security community, striving to bring together the best minds in the industry. Black Hat inspires professionals at all career levels, encouraging growth and collaboration among academia, world-class researchers, and leaders in the public and private sectors. Black Hat Briefings and Trainings are held annually in the United States, Europe and USA. More information is available at: <a href=\"https://blackhat.com/\">Black Hat.com</a>. Black Hat is brought to you by Informa Tech.</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/black-hat-europe-2023-noc-threat-hunting/feed","slash:comments":"1"},{"title":"Cisco Secure Equipment Access wins “IoT Security Innovation of the Year” in the 2024 IoT Breakthrough Awards","link":"https://blogs.cisco.com/security/cisco-secure-equipment-access-wins-iot-security-innovation-of-the-year-in-the-2024-iot-breakthrough-awards/","comments":"https://blogs.cisco.com/security/cisco-secure-equipment-access-wins-iot-security-innovation-of-the-year-in-the-2024-iot-breakthrough-awards/#respond","dc:creator":{"#cdata-section":"Ruben Lobo"},"pubDate":"Thu, 18 Jan 2024 13:00:44 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Cybersecurity"},{"#cdata-section":"Cisco Duo Security"},{"#cdata-section":"Featured"},{"#cdata-section":"Multi Factor Authentication MFA"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=447991"},"description":{"#cdata-section":"Cisco SEA wins “IoT Security Innovation of the Year” for simplifying secure remote access with zero trust network access (ZTNA) purpose-built for OT. "},"content:encoded":{"#cdata-section":"<p>We are thrilled to announce that Cisco Secure Equipment Access was named “IoT Security Innovation of the Year” in the <a href=\"https://www.globenewswire.com/news-release/2024/01/11/2808087/0/en/Cisco-Recognized-for-IoT-Security-and-Smart-Manufacturing-Innovation-in-2024-IoT-Breakthrough-Awards-Program.html\" target=\"_blank\" rel=\"noopener\">2024 <u>IoT Breakthrough Awards</u></a>.</p>\n<p>As customers are modernizing their industrial networks, they are also increasing their exposure to cyber threats. As more devices are connected to automate industrial processes, more suppliers and contractors need access to the network to help configure, maintain, and troubleshoot these advanced systems.</p>\n<p>In many organizations, machine builders, maintenance contractors, or the operations teams themselves have installed their own remote access solutions: cellular gateways or remote access software that IT is not controlling. On the other hand, Virtual Private Networks (VPN) have drawbacks of being always-on solutions with all-or-nothing access to OT assets and requiring complex firewall rules or additional tools to control what remote users have access to.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>The shift to zero trust network access for OT</strong></span></h2>\n<p>With Secure Equipment Access (SEA), Cisco is bringing much needed innovations to meet the critical needs for more secure and simpler industrial remote access. Cisco SEA brings the benefits of Zero Trust Network Access (ZTNA) solutions that enterprises are now widely adopting, to industrial workflows.</p>\n<p>ZTNA is a security service that verifies users and grants access only to specific resources at specific times. Policy definition and enforcement across all sites are done in a central Cloud service, greatly simplifying remote access management to empower operations administrators to easily create credentials and avoid delays that could impact production uptime.</p>\n<p class=\"p1\"><span class=\"s1\">In a ZTNA architecture</span>, the gateway establishes a connection to a Trust Broker that enforces access policy. Cisco SEA embeds the gateway software into Cisco industrial switches and routers, massively reducing deployment costs and complexity. There is no point gateway hardware to source, install, and manage. Enabling remote access is just a software feature to activate in your Cisco industrial network equipment.</p>\n<p>Check out the first blog in the ZTNA series to learn more about how this unique ZTNA architecture is addressing the specific constraints of remote access in industrial networks. <a href=\"https://blogs.cisco.com/internet-of-things/distributed-ztna-enables-simple-and-scalable-secure-remote-access-to-ot-assets\" target=\"_blank\" rel=\"noopener\">Read the blog</a>.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Control the who, what, how, and when of remote access</strong></span></h2>\n<p>As a ZTNA solution, Cisco SEA starts with a default deny posture and grants access only to specific resources at specific times based on identity and context policies. In addition to restricting access to specific assets and schedules, it can also restrict the access method remote technicians can use to log into an OT asset. If full IP access is needed, Cisco SEA triggers Cisco Duo to verify the computer’s compliance to security policies.</p>\n<p>To learn how Cisco SEA enforces least-privilege access and allows native IP access to OT assets without having to maintain a VPN infrastructure, read the <a href=\"https://blogs.cisco.com/internet-of-things/ot-remote-access-can-you-trust-your-technicians-laptop?dtid=oblgblg001259\" target=\"_blank\" rel=\"noopener\">second blog</a> in the ZTNA series.</p>\n<h2><strong><span style=\"color: #6abf4b;\">Take control back</span> </strong></h2>\n<p>It’s not enough to verify users and restrict what they can access. You also need to know what they are doing once connected. This is key for cybersecurity compliance, governance, incident investigation, and the ability to stop and recover from breaches. Cisco SEA provides a complete audit trail of past and active sessions. It even gives you the ability to join a live session to watch what’s happening and terminate the session. You can also choose to record sessions to critical assets to enrich the audit trail and help troubleshooting.</p>\n<p>Read the latest blog in the series to learn how Cisco SEA gives you full control over remote access sessions <a href=\"https://blogs.cisco.com/internet-of-things/gain-control-over-ot-remote-access-with-session-monitoring-recording-and-termination\" target=\"_blank\" rel=\"noopener\">here</a>.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Dive into modern secure remote access for OT</strong></span></h2>\n<p class=\"p1\">If you&#8217;re ready to learn about our award-winning solution, you can <a href=\"https://www.cisco.com/c/en/us/solutions/internet-of-things/schedule-one-on-one-secure-equipment-access-demo.html?ccid=cc002176&amp;oid=dmoit031860&amp;dtid=odicdc000509\" target=\"_blank\" rel=\"noopener\"><span class=\"s1\">schedule a one-on-one demo</span></a> to learn how you can benefit from ZTNA to drive secure remote access in your industrial network, or watch this <a href=\"https://www.cisco.com/site/us/en/products/security/industrial-security/secure-equipment-access/demos.html?socialshare=video-sea-demo\" target=\"_blank\" rel=\"noopener\"><span class=\"s1\">on-demand demonstration</span></a> of how to maintain remote connected assets with Cisco SEA at scale.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Related links:</strong></span></h2>\n<p><a href=\"https://www.globenewswire.com/news-release/2024/01/11/2808087/0/en/Cisco-Recognized-for-IoT-Security-and-Smart-Manufacturing-Innovation-in-2024-IoT-Breakthrough-Awards-Program.html\" target=\"_blank\" rel=\"noopener\">Cisco Recognized for IoT Security and Smart Manufacturing Innovation in 2024</a></p>\n<p><a href=\"https://www.cisco.com/c/en/us/solutions/internet-of-things/promotions-free-trials/secure-remote-access-for-industrial-operations.html?ccid=cc002176&amp;oid=porit031858&amp;dtid=odicdc000509\" target=\"_blank\" rel=\"noopener\">Secure Remote Access for OT Promotion</a></p>\n<p><a href=\"https://www.cisco.com/site/us/en/products/security/industrial-security/secure-equipment-access/index.html\" target=\"_blank\" rel=\"noopener\">Cisco Secure Equipment Access</a></p>\n<p><a href=\"https://www.cisco.com/c/en/us/products/security/zero-trust-network-access.html\" target=\"_blank\" rel=\"noopener\">What Is Zero Trust Network Access?</a></p>\n<p><a href=\"https://www.cisco.com/site/us/en/products/security/industrial-security/index.html\" target=\"_blank\" rel=\"noopener\">Cisco Industrial IoT Security</a></p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/cisco-secure-equipment-access-wins-iot-security-innovation-of-the-year-in-the-2024-iot-breakthrough-awards/feed","slash:comments":"0"},{"title":"February 1, 2024: A Date All Email Senders Should Care About","link":"https://blogs.cisco.com/security/february-1-2024-a-date-all-email-senders-should-care-about/","comments":"https://blogs.cisco.com/security/february-1-2024-a-date-all-email-senders-should-care-about/#respond","dc:creator":{"#cdata-section":"Bradley Anstis"},"pubDate":"Tue, 09 Jan 2024 13:00:55 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"email security"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=447615"},"description":{"#cdata-section":"On February 1st, important changes will be made for bulk emails going to Google and Yahoo mailboxes. Find out why DMARC is such an important part of this guidance."},"content:encoded":{"#cdata-section":"<p>For any organization sending bulk email or high email volumes to <a href=\"https://blog.google/products/gmail/gmail-security-authentication-spam-protection/\" target=\"_blank\" rel=\"noopener\">Google</a> and <a href=\"https://blog.postmaster.yahooinc.com/post/730172167494483968/more-secure-less-spam\" target=\"_blank\" rel=\"noopener\">Yahoo</a> accounts, there’s one date you should have flagged on your calendar. On February 1<sup>st</sup>, guidance indicates you’ll need to pay attention if you are sending over 5000 emails a day into Google and Yahoo mailboxes.</p>\n<h2><strong><span style=\"color: #6abf4b;\">So, What Is the Issue?</span></strong></h2>\n<p>On that day, any email domain sending more than 5000 emails on a daily basis will need to meet a minimum set of email authentication standards along with other controls in order for email to get delivered. Those who don’t meet those standards will see their emails rejected or bouncing back. (It’s also a good time to consider how your organization deals with email bounce backs!). The standards that Google and Yahoo are asking you to meet in order to send email to their users are email authentication protocols, also known as being <a href=\"https://www.cisco.com/c/en/us/products/security/what-is-dmarc.html#:~:text=DMARC%2520or%2520Domain%2520Based%2520Message,protocols%2520to%2520verify%2520email%2520senders.\" target=\"_blank\" rel=\"noopener\">DMARC compliant</a>. So many organizations are not compliant or doing a bad job when it comes to email authentication, that it’s easily allowing threat actors and scammers to spoof their domains to successfully send unwanted and malicious email to their victims, which can include employees, customers, and partners.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>How Do I Become Compliant?</strong></span></h2>\n<p>So, what is email authentication and how do you become DMARC compliant?  First, email authentication refers to any technique that helps detect when messages don&#8217;t actually originate from the Internet domain they claim to have been sent from. Some examples include DomainKeys Identified Message (DKIM) and Sender Policy Framework (SPF).  To be DMARC compliant means that you are publishing a DMARC policy via DNS records across all your organization’s domains and that your sending sources are correctly authenticated and aligned. DMARC passes or fails a message based on how closely the message From: header matches the sending domain specified by either SPF or DKIM. This is called alignment. A DMARC policy allows a sender to indicate that their messages are authenticated with SPF and/or DKIM and tells a receiving mail gateway what to do if neither of those authentication methods passes – such as junk or reject the message.</p>\n<p>DMARC removes guesswork from the receiver’s handling of these failed messages, limiting or eliminating the user’s exposure to potentially fraudulent and harmful messages. DMARC also provides a way for the email receiver to report back to the sender about messages that pass and/or fail DMARC evaluation, enabling them to quickly see any instances of unauthorized usage of their domains.</p>\n<p>Besides working with your IT team and third party senders to authenticate your email traffic with SPF and DKIM and ensuring a DMARC record with at least a policy of “none”, there are other steps you should take as outlined by Google and Yahoo; such as ensuring your sending servers have valid forward and reverse DNS; that the connections are secured with TLS 1.2 or later; that your complaint rates stay low; and that your marketing platform supports one-click unsubscribe and includes a clearly visible unsubscribe link in the message body.</p>\n<p>While email authentication and becoming DMARC compliant might sound complex, once you understand the basic concepts it can be more straightforward, especially if you are using a DMARC implementation and reporting service like the domain protection from Cisco’s SolutionsPlus partner Red Sift. These types of tools make the entire process much simpler and with Red Sift OnDMARC, it also includes AI capabilities that help you get to your goal of being DMARC compliant much faster than other platforms. This is a project that needs to be done carefully, for example if you forget to configure any of your authorized email senders then their email could be inadvertently blocked. These issues can be eliminated when you follow a solid project plan and use a respected platform.</p>\n<h2><strong><span style=\"color: #6abf4b;\">What Are the Benefits of These Changes?</span></strong></h2>\n<p>From a market viewpoint, this is great news because with Google and Yahoo enforcing these new requirements, more organizations will be forced to become DMARC compliant. This will reduce spam and unwanted email by helping to defeat exact domain impersonation attacks. While Microsoft has not yet imposed similar guidelines, they are <a href=\"https://techcommunity.microsoft.com/t5/exchange-team-blog/authenticate-outbound-email-to-improve-deliverability/ba-p/3947623\" target=\"_blank\" rel=\"noopener\">recommending that their customers follow Google and Yahoo’s guidance</a>.</p>\n<p>For email receivers, this means that the email getting into their customer’s mailboxes should be more trustworthy. This won’t eliminate all spoofing issues as you may still see scams being sent from domain typo squatting, which is where a solution like Cisco’s <a href=\"http://cisco.com/go/etd\" target=\"_blank\" rel=\"noopener\">Secure Email Threat Defense</a> can provide additional protection.</p>\n<p>The biggest benefit is for the email sender, as being DMARC compliant provides much better chances of your authenticated email successfully making it to the users you want it to get to. Plus, with the DMARC reports coming back to your organization from receiving email servers, you can identify unauthorized domain usage much more quickly, so you can react appropriately.</p>\n<h2><strong><span style=\"color: #6abf4b;\">How Can Cisco Help Me Get Started?</span></strong></h2>\n<p>We are now offering a 30-day free trial of domain protection from Red Sift OnDMARC that includes a consultation at no cost. This is a great first step for any organization looking to start their journey towards DMARC compliance and meet the minimum requirements for Google and Yahoo.</p>\n<p>Start your <a href=\"https://iam.redsift.cloud/signup?product=domain-protection\" target=\"_blank\" rel=\"noopener\">Cisco Domain Protection free trial</a> today.</p>\n<p>&nbsp;</p>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/february-1-2024-a-date-all-email-senders-should-care-about/feed","slash:comments":"0"},{"title":"Egress Security: Part of a Holistic, Multidirectional Security Strategy for Today’s Multicloud World","link":"https://blogs.cisco.com/security/egress-security-part-of-a-holistic-multidirectional-security-strategy-for-todays-multicloud-world/","comments":"https://blogs.cisco.com/security/egress-security-part-of-a-holistic-multidirectional-security-strategy-for-todays-multicloud-world/#comments","dc:creator":{"#cdata-section":"Vishal Jain"},"pubDate":"Tue, 09 Jan 2024 13:00:36 +0000","category":[{"#cdata-section":"Security"},{"#cdata-section":"Cisco Secure"},{"#cdata-section":"Cisco Security"},{"#cdata-section":"cloud security"},{"#cdata-section":"Multicloud"},{"#cdata-section":"multicloud defense"}],"guid":{"@isPermaLink":"false","#text":"https://blogs.cisco.com/?p=447551"},"description":{"#cdata-section":"Cisco Multicloud Defense allows security teams to detect, analyze, and protect workload traffic outside the organization with simplified egress security."},"content:encoded":{"#cdata-section":"<p>Cloud transformation has given rise to a new era of business innovation and growth. According to <a href=\"https://www.techtarget.com/esg-global/survey-results/complete-survey-results-distributed-cloud-series-the-state-of-infrastructure-modernization-across-the-distributed-cloud/\" target=\"_blank\" rel=\"noopener\">Enterprise Strategy Group</a>, more than half of production workloads will be running on public cloud infrastructure within the next two years, positioning cloud computing center-stage as the best practice for solving critical business issues and enabling agility. However, the unforeseen by-product of this evolution is complexity, and complexity is the enemy of security.</p>\n<p>Decentralized IT infrastructure, expanding attack surfaces, and a lack of visibility and control have made it more difficult than ever to secure enterprise workloads in the cloud. Organizations need to employ a holistic security approach that targets the entire threat chain from initial access to external connectivity and data exfiltration.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>The importance of egress security in today’s multicloud world</strong></span></h2>\n<p>Today’s threat actors operate under a variety of motives. They may attempt to steal customer information or other proprietary data. They may hijack IT resources for nefarious use. They may take control over critical systems in an attempt to disrupt operations or extract a ransom payment. And they may do several of these things, together, all at once.</p>\n<p>The point is—attacks do not stop when the initial breach is made, or the final target has been compromised. Once inside, threat actors or their malicious applications often have to connect with external systems or networks outside the organization to communicate critical telemetry and counterintelligence information and, eventually, extract data. Making things more difficult is the fact that sometimes the threats can communicate with trusted websites or platforms such as GitHub to deliver malware. However, this communication is an opportunity for security teams to detect, identify, and stop malicious activity before real damage has been done.</p>\n<p>Egress security often acts as the last line of defense before workloads reach the public Internet or other unauthorized networks. Egress security was rarely an issue when everything sat in a hardened data center behind robust firewalls and applications rarely tried to communicate with outside entities on the public Internet. But what happens when your entire business model relies on continuous, ubiquitous connectivity to tens of thousands of distributed endpoints, web applications, and Software as a Service (SaaS) platforms across multiple public and private cloud environments? Suddenly, egress security gets very real and very complicated.</p>\n<p>Unfortunately, existing multicloud security solutions were designed for a world that doesn’t exist anymore and haven’t kept up with the acceleration of cloud transformation. Ensuring data loss prevention (DLP) policies are applied appropriately and consistently across multiple cloud environments is virtually impossible, requiring manual intervention and control using a variety of tools and solutions. Teams across the organization are left on their own for harmonizing the delicate balance between securing users and applications, connecting correct users to the correct applications across multicloud environments, and securely mitigating complexity as they scale. They often have to deploy multiple management consoles and policy management tools while adding yet another tool for log analytics. This multi-tool approach creates disparity, complexity, and confusion—leading to higher risk and cost for organizations. Some organizations use homegrown solutions to consolidate this tool sprawl, but these require manual configuration and updates every time a new cloud provider is added – contributing to uncontrollable tech debt.</p>\n<p>Specifically, tool sprawl leads to unwieldy change control processes that are magnified by dynamic environments that limit business agility. This is creating friction between NetOps, SecOps, and cloud teams who find themselves working in silos, separate from each other, the opposite of harmony. The inability to work cohesively is making it hard to achieve high availability, scalability, and resilience in cloud infrastructure.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Cisco Multicloud Defense simplifies egress security</strong></span></h2>\n<p>Cisco Multicloud Defense helps security teams gain multidirectional protection across multiple clouds and workloads to block inbound attacks, prevent lateral movement and stop data exfiltration – and it allows you to do this all from a single SaaS platform. Cisco Multicloud Defense alleviates security complexity across public and private cloud environments with consistent policy controls and deep visibility into workloads – including potentially-malicious and unauthorized traffic flowing out of the network such as command and control communications and data exfiltration. Just as critical, security teams can be assured that policies are being applied appropriately and consistently across multiple cloud environments through tag-based policies.</p>\n<p>Cisco Multicloud Defense enables egress security through advanced domain and URL filtering capabilities combined with DLP. Working together in a single solution provides unparalleled visibility into all cloud workloads, allowing organizations to automatically detect and analyze outbound communications, identify malicious intent and risk, and block unauthorized connectivity and data exfiltration.</p>\n<p style=\"padding-left: 40px;\"><strong><u>Command &amp; Control</u></strong>: Threat actors need to communicate back to an owned server to confirm a breach, receive further instructions and control affected systems. Cisco Multicloud Defense uses artificial intelligence (AI) and machine learning (ML) to identify these unauthorized communications, alert security teams of the breach, and automatically apply policies that severe connectivity.</p>\n<p style=\"padding-left: 40px;\"><strong><u>Data exfiltration</u></strong>: Traditional DLP solutions rely on several technologies to identify and block critical data flowing out of the organization. Cisco Multicloud Defense integrates these DLP capabilities with egress filtering to stop the loss of information before it is too late.</p>\n<h2><span style=\"color: #6abf4b;\"><strong>Keeping multicloud environments secure without impacting productivity or agility</strong></span></h2>\n<p>Cisco Multicloud Defense provides security throughout the entire threat chain – from initial breach to data exfiltration. Egress security gives organizations the ability to identify suspicious or abnormal behavior that may alter the controlled flow of data inside and outside of the network. However, expanding threat surfaces and IT complexity in today’s environments make it hard to detect, analyze, and eventually stop unauthorized external connectivity and data exfiltration using traditional means. Cisco Multicloud Defense greatly simplifies security across complex environments, ensuring that organizations can take full advantage of the ever-evolving multicloud world.</p>\n<p>To learn more about Cisco Multicloud Defense:</p>\n<ul>\n<li>Take the <a href=\"https://learn-cloudsecurity.cisco.com/multicloud-defense-tour\">Multicloud Defense product tour</a></li>\n<li>Request a <a href=\"https://www.cisco.com/c/en/us/products/security/multicloud-defense/request-demo.html\">Multicloud Defense demo</a></li>\n</ul>\n<hr />\n<p style=\"text-align: center;\"><em>We’d love to hear what you think. Ask a Question, Comment Below, and Stay Connected with Cisco Security on social!</em></p>\n<p style=\"text-align: center;\"><strong>Cisco Security Social Channels</strong></p>\n<p style=\"text-align: center;\"><strong><a href=\"https://www.instagram.com/CiscoSecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a></strong><br />\n<strong><a href=\"https://www.facebook.com/ciscosecure/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a></strong><br />\n<strong><a href=\"https://twitter.com/CiscoSecure\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a></strong><br />\n<strong><a href=\"https://www.linkedin.com/showcase/cisco-secure\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a></strong></p>\n"},"wfw:commentRss":"https://blogs.cisco.com/security/egress-security-part-of-a-holistic-multidirectional-security-strategy-for-todays-multicloud-world/feed","slash:comments":"1"}]}}}