{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"","atom:link":{"@href":"https://cryptoid.com.br/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://cryptoid.com.br/","description":"Tudo sobre o universo da identificação digital","lastBuildDate":"Fri, 26 Jan 2024 23:52:30 +0000","language":"pt-BR","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","item":[{"title":"Como a Inteligência Artificial está mudando o mundo online","link":"https://cryptoid.com.br/inteligencia-artificial/como-a-inteligencia-artificial-esta-mudando-o-mundo-online/","dc:creator":{"#cdata-section":"Lyvia Lira"},"pubDate":"Sat, 27 Jan 2024 15:00:00 +0000","category":[{"#cdata-section":"Destaques"},{"#cdata-section":"IA"},{"#cdata-section":"Notícias"},{"#cdata-section":"apostas"},{"#cdata-section":"transformação digital"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=126275"},"description":{"#cdata-section":"<p>Cada vez mais, a Inteligência Artificial (IA) está se tornando parte integrante do mundo online. Veja como ela está mudando o mundo.</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/inteligencia-artificial/como-a-inteligencia-artificial-esta-mudando-o-mundo-online/\">Como a Inteligência Artificial está mudando o mundo online</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>Cada vez mais, a Inteligência Artificial (IA) está se tornando parte integrante do mundo online. Veja como ela está mudando o mundo</em></p>\n\n\n\n<p>A Inteligência Artificial (IA) está revolucionando o mundo online. Com ela, surgem novas possibilidades e desafios. A IA está mudando a forma como interagimos, fazemos negócios e vivemos nossas vidas diárias. </p>\n\n\n\n<p>Ela está nos permitindo criar e experimentar o mundo de maneira completamente nova. E isso é só o começo. Vamos explorar como a IA está moldando o nosso mundo online.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-exemplos-de-adocao-de-ia\"><strong>Exemplos de adoção de IA</strong></h3>\n\n\n\n<p>Agora, vamos revisar alguns exemplos de como a IA está sendo aplicada no mundo online:</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-adocao-de-ia-em-jogos-de-cassino-e-plataformas-de-apostas\"><strong>Adoção de IA em jogos de cassino e plataformas de apostas</strong></h4>\n\n\n\n<p>A IA está rapidamente transformando a indústria de jogos de cassino. Um exemplo notável de jogo de cassino é a evolução do <a href=\"https://casinoonlinedinheiroreal.com/jogos/crazy-time-ao-vivo\" target=\"_blank\" rel=\"noreferrer noopener\">Crazy Time</a> pela Evolution Gaming. Este jogo incorpora elementos de IA para criar uma experiência de jogo imersiva e dinâmica.</p>\n\n\n\n<p>Além disso, a IA também já muda como interagimos com as plataformas de apostas. Por exemplo, alguns sites de cassino já estão empregando IA para oferecer opções de depósito mais flexíveis. </p>\n\n\n\n<p>Um bom exemplo é o casino mínimo deposito 1 euro, como encontramos em <a href=\"https://casinobussola.com/deposito-minimo-1-euro\" target=\"_blank\" rel=\"noreferrer noopener\">https://casinobussola.com/deposito-minimo-1-euro</a>, que utiliza tecnologia de IA para facilitar transações seguras e eficientes. A adoção de IA por essas plataformas está mudando a forma como jogamos e apostamos online, tornando a experiência mais personalizada e acessível.</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-chatbots-para-atendimento-ao-cliente\"><strong>Chatbots para atendimento ao cliente</strong></h4>\n\n\n\n<p>Os chatbots estão se tornando uma parte comum do atendimento ao cliente online. Com a IA, os chatbots podem fornecer suporte e assistência em tempo real para os clientes, melhorando a eficiência e reduzindo o tempo de espera. Eles também são capazes de aprender com cada interação, tornando-se mais inteligentes.</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-recomendacoes-personalizadas\"><strong>Recomendações personalizadas</strong></h4>\n\n\n\n<p>Graças à IA, podemos desfrutar de recomendações personalizadas em sites de compras, streaming e mídia social. A IA analisa nossos dados e comportamentos para sugerir produtos, músicas ou conteúdos que possam nos interessar. Isso torna a experiência online mais relevante e agradável.</p>\n\n\n\n<p>Isso é visto em plataformas de streaming, como Netflix e Spotify. Elas usam algoritmos de IA para sugerir conteúdo relevante.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-desafios-da-ia-no-mundo-online\"><strong>Desafios da IA no mundo online</strong></h3>\n\n\n\n<p>Com a IA coletando e analisando muitos dados dos usuários, surgem preocupações sobre o armazenamento e uso desses dados.</p>\n\n\n\n<p>Outro desafio é o impacto da IA no mercado de trabalho.&nbsp;Com a automação de tarefas, muitos empregos podem ser substituídos por IA. Isso pode levar a uma maior desigualdade e necessidade de requalificação profissional.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-o-futuro-da-ia-no-mundo-online\"><strong>O futuro da IA no mundo online</strong></h3>\n\n\n\n<p>A Inteligência Artificial (IA) está reformulando o mundo de várias maneiras, e a internet não é exceção. Com a ajuda das tecnologias de aprendizado de máquina, o futuro da busca online está se transformando rapidamente. </p>\n\n\n\n<p>As ferramentas de IA generativas estão revolucionando a produção de conteúdo e moldando o futuro da internet e do trabalho.</p>\n\n\n\n<p>No Brasil, com quase 156 milhões de usuários de internet, a discussão sobre o futuro da IA tornou-se proeminente, levando até a projetos legislativos.</p>\n\n\n\n<p>A IA está impactando o mundo de várias maneiras. Em termos de fraude online, a IA provou ser uma ferramenta crucial na prevenção de fraudes. </p>\n\n\n\n<p>O futuro da IA é cada vez mais discutido à medida que seu uso continua a transformar o mercado, e seu impacto continuará a crescer.</p>\n\n\n\n<p>O conceito de IA Generativa afirma que o futuro está aqui. Está se tornando uma fonte primária de referência para aqueles que querem saber mais sobre tendências e inovações tecnológicas e de negócios no mundo.</p>\n\n\n\n<p>A intersecção do Metaverso e da IA oferece um vislumbre do futuro da realidade virtual. Essas tecnologias estão moldando nossa experiência virtual. </p>\n\n\n\n<p>Alguns argumentam que a IA será para o futuro o que a internet é para nós hoje, afetando a todos, em todos os setores da indústria.</p>\n\n\n\n<p>Compreender o momento atual da IA significa avançar para o futuro através de inteligência artificial responsável. Isso traz grandes oportunidades para melhorar o mundo. A IA pode impactar positivamente a produtividade e estimulará o crescimento econômico.</p>\n\n\n\n<p>Em resumo, o futuro da IA no mundo online é promissor e tem um grande potencial para mudar a forma como interagimos com a internet e uns com os outros.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-conclusao\"><strong>Conclusão</strong></h3>\n\n\n\n<p>A IA está mudando o mundo online em todos os aspectos, desde jogos de cassino até chatbots e recomendações personalizadas. </p>\n\n\n\n<p>Entretanto, junto com as possibilidades, surgem desafios a serem enfrentados. É importante discutir e regulamentar o uso da IA para garantir sua responsabilidade e ética. </p>\n\n\n\n<p>O futuro da IA no mundo online é emocionante e promissor, e cabe a nós utilizá-lo de forma responsável para melhorar o nosso mundo online.&nbsp;Então, vamos aproveitar as vantagens dessa tecnologia em constante evolução e ver o que o futuro nos reserva!&nbsp;</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/o-impacto-da-inteligencia-artificial-nas-empresas-e-nas-carreiras/\" target=\"_blank\" rel=\"noreferrer noopener\">O impacto da Inteligência Artificial nas empresas e nas carreiras</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/como-o-uso-da-inteligencia-artificial-esta-revolucionando-o-customer-success-no-setor-financeiro/\" target=\"_blank\" rel=\"noreferrer noopener\">Como o uso da Inteligência Artificial está revolucionando o Customer Success no setor financeiro</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/a-importancia-do-conhecimento-especifico-na-era-da-inteligencia-artificial/\" target=\"_blank\" rel=\"noreferrer noopener\">A importância do conhecimento específico na era da Inteligência Artificial</a></p>\n\n\n\n<p class=\"has-text-color\" style=\"color:#000000b5\">INTELIGÊNCIA ARTIFICIAL</p>\n\n\n\n<p>Confira <a href=\"https://cryptoid.com.br/categoria/inteligencia-artificial/\" target=\"_blank\" rel=\"noreferrer noopener\">aqui </a>o maior conteúdo disponível no Brasil sobre a IA.</p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://cryptoid.com.br/contato-patrocinio-anunciar/\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" fetchpriority=\"high\" width=\"728\" height=\"90\" src=\"https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1.png\" alt=\"\" class=\"wp-image-126390\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1.png 728w, https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1-310x38.png 310w\" sizes=\"(max-width: 728px) 100vw, 728px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/inteligencia-artificial/como-a-inteligencia-artificial-esta-mudando-o-mundo-online/\">Como a Inteligência Artificial está mudando o mundo online</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"Fraudes em 2024: tendências e como se proteger","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/fraudes-em-2024-tendencias-e-como-se-proteger/","dc:creator":{"#cdata-section":"ISADORA LAVIOLA"},"pubDate":"Sat, 27 Jan 2024 13:45:00 +0000","category":[{"#cdata-section":"Destaques"},{"#cdata-section":"Notícias"},{"#cdata-section":"fraudes"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127157"},"description":{"#cdata-section":"<p>Fraudadores utilizarão táticas cada vez mais elaboradas, por isso, empresas precisam investir em ações para proteger seus negócios e clientes</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/fraudes-em-2024-tendencias-e-como-se-proteger/\">Fraudes em 2024: tendências e como se proteger</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>Fraudadores utilizarão táticas cada vez mais elaboradas, por isso, empresas precisam investir em ações para proteger seus negócios e clientes</em></p>\n\n\n\n<p>Por <strong><a href=\"https://www.linkedin.com/in/thiagobertacchini/\" target=\"_blank\" rel=\"noreferrer noopener\">Thiago Bertacchini</a></strong></p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img decoding=\"async\" width=\"400\" height=\"400\" src=\"https://cryptoid.com.br/wp-content/uploads/2024/01/image-18.png\" alt=\"\" class=\"wp-image-127158\" style=\"width:310px\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2024/01/image-18.png 400w, https://cryptoid.com.br/wp-content/uploads/2024/01/image-18-310x310.png 310w, https://cryptoid.com.br/wp-content/uploads/2024/01/image-18-80x80.png 80w\" sizes=\"(max-width: 400px) 100vw, 400px\" /><figcaption class=\"wp-element-caption\"><strong><a href=\"https://www.linkedin.com/in/thiagobertacchini/\" target=\"_blank\" rel=\"noreferrer noopener\">Thiago Bertacchini</a></strong>, Desenvolvimento de Negócios Sênior da Nethone</figcaption></figure></div>\n\n\n<p>À medida que a tecnologia avança, os criminosos encontram novas maneiras de explorá-la para cometer fraudes. </p>\n\n\n\n<p>As tendências emergentes para o próximo ano indicam um aumento preocupante nas táticas utilizadas pelos fraudadores, exigindo ações proativas das empresas para proteger os seus negócios e clientes.</p>\n\n\n\n<p>A evolução da engenharia social impulsionada pela Inteligência Artificial está transformando o cenário das fraudes financeiras, tornando cada vez mais complexo o combate a esses crimes cibernéticos. </p>\n\n\n\n<p>As projeções para 2024, conforme aponta a Kaspersky, indicam que a IA será uma ferramenta fundamental para os criminosos criarem golpes cada vez mais sofisticados.</p>\n\n\n\n<p>A utilização de IA para criar conteúdos falsos, como anúncios, e-mails e websites, é uma tendência preocupante. Essas ferramentas permitirão uma imitação quase perfeita de canais de comunicação legítimos, dificultando a distinção entre o que é genuíno e o que é fraudulento. </p>\n\n\n\n<p>Isto não só aumentará o potencial de fraude, mas também levará a uma proliferação de campanhas de baixa qualidade à medida que a barreira à entrada de criminosos diminui.</p>\n\n\n\n<p>Além disso, sistemas de pagamento direto, como o PIX no Brasil, tornam-se alvos de novos golpes direcionados. A expectativa é que surjam malwares bancários específicos para esses sistemas, com o objetivo de explorar suas facilidades para cometer fraudes. </p>\n\n\n\n<p>A automatização da fraude, especialmente no mobile banking com o ATS (Automated Transfer System), representa um desafio adicional, permitindo que os golpes aumentem sem a necessidade de intervenção manual dos criminosos.</p>\n\n\n\n<p>Para o cenário empresarial em 2024, a preparação antecipada e a adoção de soluções de segurança avançadas serão essenciais. </p>\n\n\n\n<p>Estar um passo à frente na detecção e prevenção destas tendências de fraude será crucial para proteger clientes e empresas.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-confira-as-cinco-principais-tendencias-de-fraudes-para-2024-e-saiba-como-se-proteger\"><strong>Confira as cinco principais tendências de fraudes para 2024 e saiba como se proteger</strong></h3>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>1. Deep Fake e Chat Bots em Engenharia Social</strong></h4>\n\n\n\n<p>A conscientização sobre golpes de engenharia social tem aumentado, mas os fraudadores estão se adaptando. O uso de deep fakes e chatbots para criar áudio convincente e persuasivo é uma ameaça iminente. Soluções como o FraudGPT estão sendo exploradas para organizar ataques cada vez mais sofisticados.</p>\n\n\n\n<p>Para as empresas digitais é importante investir em sistemas avançados de detecção de fraudes, treinar equipes para identificar sinais de manipulação e educar os clientes sobre novas formas de ataques será essencial.</p>\n\n\n\n<p>A tecnologia baseada em IA contribui para o desenvolvimento de métodos avançados de autenticação biométrica, como reconhecimento facial baseado em aprendizagem profunda e sistemas de reconhecimento de voz. </p>\n\n\n\n<p>Além disso, a IA generativa pode auxiliar em análises comportamentais mais precisas e granulares que as empresas podem usar para criar perfis de usuário detalhados e analisar padrões de comportamento do usuário.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>2. Ferramentas de fraude e acesso remoto</strong></h4>\n\n\n\n<p>Os criminosos adotam ferramentas tecnológicas para mascarar a sua identidade e obter acesso remoto aos dispositivos das vítimas. Setores sensíveis, como o bancário e os de pagamentos, correm um risco substancial com esta tendência.</p>\n\n\n\n<p>Os decisores precisam implementar medidas de autenticação robustas, como ferramentas que possibilitem a identificação deste modus operandi, monitorar continuamente atividades suspeitas e reforçar a segurança dos dados.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>3. Ataques de Bots e Device Farm</strong></h4>\n\n\n\n<p>Os fraudadores estão expandindo o uso de bots e farms de dispositivos complexos para ataques direcionados e difíceis de detectar. </p>\n\n\n\n<p>É necessário desenvolver estratégias avançadas de detecção de ferramentas de automação, como analisar detalhadamente ocomportamento e identificar padrões incomuns.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>4. Fraude de afiliados em marketing digital</strong></h4>\n\n\n\n<p>O marketing digital, especialmente no Brasil, corre risco com o aumento de fraudes por afiliados falsos em busca de comissões indevidas. </p>\n\n\n\n<p>As empresas devem encontrar formas eficazes de verificar a autenticidade dos afiliados, adotar ferramentas de monitoramento de tráfego e estabelecer protocolos rigorosos para identificar tráfego suspeito.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>5. Fraude em Criptoativos e Investimentos</strong></h4>\n\n\n\n<p>O mercado de criptoativos é alvo atrativo para fraudadores, que visam roubar saldos e criar contas falsas para lavagem de dinheiro. </p>\n\n\n\n<p>Portanto, para 2024, vale a pena reforçar as medidas de segurança nas plataformas de investimento, como uma autenticação robusta no login e o monitoramento constante das transações, o que é crucial para mitigar esses riscos.</p>\n\n\n\n<p>Para se manterem à frente da fraude no próximo ano, as empresas devem criar estratégias em três áreas principais: um sistema de deteção de riscos capaz de descobrir até as táticas mais obscuras utilizadas pelos fraudadores para ocultar a sua identidade e detalhes do dispositivo, modelos de machine learning e deep learning que se adaptam continuamente às ameaças emergentes, insights da dark web para se manter atualizado sobre as novas tendências e comportamentos de fraude para medidas proativas.</p>\n\n\n\n<p>A evolução do ransomware também é preocupante, pois os ataques serão mais seletivos, visando instituições financeiras e estruturas criminosas mais fluidas, dificultando ainda mais o combate a estes crimes.</p>\n\n\n\n<p>Por fim, a exploração de vulnerabilidades em programas de código aberto e a migração para “ataques de um dia” indicam uma mudança na estratégia dos criminosos, tornando mais desafiador identificar e combater estes ataques. </p>\n\n\n\n<p>Neste contexto, as corporações precisam se preparar para a evolução da IA, pois ela aumenta consideravelmente a sofisticação desses ataques, exigindo melhoria constante nas medidas de segurança, lançando mão de tecnologias Know Your Customer e digital fingerprinting, além de conscientização por parte das empresas e dos usuários finais.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/como-a-inovacao-pode-contribuir-para-a-prevencao-de-fraudes-nas-empresas/\" target=\"_blank\" rel=\"noreferrer noopener\">Como a inovação pode contribuir para a prevenção de fraudes nas empresas</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/as-principais-aplicacoes-de-ia-no-combate-as-fraudes-financeiras/\" target=\"_blank\" rel=\"noreferrer noopener\">As principais aplicações de IA no combate às fraudes financeiras</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/ia-impulsionara-deepfake-e-envenenamento-de-dados-em-2024-preve-lumu/\" target=\"_blank\" rel=\"noreferrer noopener\">IA impulsionará deepfake e envenenamento de dados em 2024, prevê Lumu</a></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://linktr.ee/portalcryptoid\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"468\" height=\"60\" src=\"https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1.jpg\" alt=\"\" class=\"wp-image-93470\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1.jpg 468w, https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1-310x40.jpg 310w\" sizes=\"(max-width: 468px) 100vw, 468px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/fraudes-em-2024-tendencias-e-como-se-proteger/\">Fraudes em 2024: tendências e como se proteger</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"Consulta Pública – Modernização da ICP-Brasil","link":"https://cryptoid.com.br/icp-brasil/consulta-publica-modernizacao-da-icp-brasil/","dc:creator":{"#cdata-section":"Regina Tupinambá"},"pubDate":"Fri, 26 Jan 2024 23:52:28 +0000","category":[{"#cdata-section":"CERTIFICADO DIGITAL"},{"#cdata-section":"Destaques"},{"#cdata-section":"ICP-BRASIL"},{"#cdata-section":"Notícias"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127269"},"description":{"#cdata-section":"<p>A consulta pública que estará aberta para sugestões da sociedade entre os dias 26/01/2024 e 12/02/2024.</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/icp-brasil/consulta-publica-modernizacao-da-icp-brasil/\">Consulta Pública &#8211; Modernização da ICP-Brasil</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><strong>Consulta Pública 01/2024, Modernização da ICP-Brasil</strong></p>\n\n\n\n<p>O Instituto Nacional de Tecnologia da Informação (ITI) lança consulta pública que estará aberta para sugestões da sociedade entre os dias <strong>26/01/2024 e 12/02/2024.</strong></p>\n\n\n\n<p>A&nbsp;iniciativa&nbsp;objetiva o alinhamento com a prática internacional e visa simplificar e deixar mais claro o perfil dos diferentes tipos de certificado da ICP-Brasil.</p>\n\n\n\n<p>A ação institui o certificado do tipo <strong>Selo Eletrônico, </strong>em substituição ao certificado de pessoa jurídica, com o propósito de garantir autenticidade e origem de documentos, mantendo os certificados com propósito de assinatura exclusivamente para pessoa física; institui os certificados de Aplicações Especiais em Software e em Hardware, bem como o tipo de certificado SSL/TLS Webtrust; e, ainda, extingue os certificados de Sigilo (S1 a S4) e o certificado A1.</p>\n\n\n\n<p>Com a presente consulta pública, o ITI busca promover a ampla divulgação da proposta normativa, bem como possibilitar a manifestação de órgãos e entidades representativas, pessoas físicas e pessoas jurídicas interessadas no tema.</p>\n\n\n\n<p><strong>1. <a href=\"https://www.gov.br/iti/pt-br/assuntos/consulta-publica/consultas-atuais/01-2024-modernizacao-da-icp-brasil/consulta_publica_01_2024_contextualizacao.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Contextualização da proposta<br></a>2. <a href=\"https://forms.gle/mCTdgksUWYrxPqvW6\" target=\"_blank\" rel=\"noreferrer noopener\">Clique aqui e encaminhe sua colaboração</a><br><br>OBSERVAÇÕES IMPORTANTES<br>As contribuições devem ser feitas diretamente no campo específico de cada bloco, clicando no campo &#8220;sua resposta&#8221;.</strong></p>\n\n\n\n<p></p>\n\n\n\n<p>Fonte: ITI </p>\n\n\n\n<p></p>\n\n\n\n<p><strong>Sobre o ITI    </strong></p>\n\n\n<div class=\"wp-block-image is-style-default\">\n<figure class=\"alignleft size-medium is-resized\"><img decoding=\"async\" loading=\"lazy\" width=\"310\" height=\"207\" src=\"https://cryptoid.com.br/wp-content/uploads/2022/07/ITI-logo-peq-310x207.jpg\" alt=\"\" class=\"wp-image-96166\" style=\"width:217px;height:145px\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2022/07/ITI-logo-peq-310x207.jpg 310w, https://cryptoid.com.br/wp-content/uploads/2022/07/ITI-logo-peq.jpg 633w\" sizes=\"(max-width: 310px) 100vw, 310px\" /></figure></div>\n\n\n<p id=\"block-bb8ffef8-1655-41b6-b86b-8c0ad40ae8f9\">O&nbsp;<strong><a href=\"https://www.gov.br/iti/pt-br\" target=\"_blank\" rel=\"noreferrer noopener\">Instituto Nacional de Tecnologia da Informação</a> –&nbsp;ITI</strong>&nbsp;é uma autarquia federal, vinculada a Casa Civil da Presidência da República, que tem por missão manter e executar as políticas da Infraestrutura de Chaves Públicas Brasileira – ICP-Brasil. Ao ITI compete ainda ser a primeira autoridade da cadeia de certificação digital – AC Raiz.</p>\n\n\n\n<p>Leia a coluna<a href=\"https://cryptoid.com.br/categoria/icp-brasil/\" target=\"_blank\" rel=\"noreferrer noopener\"> exclusiva sobre a ICP-Brasil</a>!</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/icp-brasil/publicado-decreto-com-novas-atribuicoes-para-o-iti/\" target=\"_blank\" rel=\"noreferrer noopener\">Publicado decreto com novas atribuições para o ITI</a></p>\n\n\n\n<p></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/icp-brasil/consulta-publica-modernizacao-da-icp-brasil/\">Consulta Pública &#8211; Modernização da ICP-Brasil</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"A influência da inteligência artificial no mercado de trabalho","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/a-influencia-da-inteligencia-artificial-no-mercado-de-trabalho/","dc:creator":{"#cdata-section":"ISADORA LAVIOLA"},"pubDate":"Fri, 26 Jan 2024 17:45:00 +0000","category":[{"#cdata-section":"Destaques"},{"#cdata-section":"IA"},{"#cdata-section":"Notícias"},{"#cdata-section":"mercado de trabalho"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127151"},"description":{"#cdata-section":"<p>As empresas estão se adaptando cada vez mais à IA e a tendência é que trabalhos manuais sejam substituídos</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/a-influencia-da-inteligencia-artificial-no-mercado-de-trabalho/\">A influência da inteligência artificial no mercado de trabalho</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>As empresas estão se adaptando cada vez mais à IA e a tendência é que trabalhos manuais sejam substituídos</em></p>\n\n\n\n<p>A influência da inteligência artificial (IA) no mercado de trabalho tem moldado a dinâmica profissional em diversas áreas. </p>\n\n\n\n<p>Ao longo dos anos, testemunhamos a evolução tecnológica, desde a digitalização de documentos até a era do big data. </p>\n\n\n\n<p>Guilherme Seabra, especialista em Tecnologia da Informação, esclarece que a IA não apenas acessa dados, mas também gera conteúdo valioso para organizações, impulsionando a eficiência e a inovação.</p>\n\n\n\n<p><em>&#8220;A chegada da inteligência artificial, especialmente a IA generativa tem deixado sua marca em diversos setores. Desenvolvedores utilizam IA para gerar código, enquanto profissionais de marketing exploram suas capacidades na criação de campanhas inovadoras. Da tecnologia ao setor de pessoas, a inteligência artificial generativa oferece oportunidades de cocriação, beneficiando amplamente os campos ligados à tecnologia”</em>, relata o especialista.</p>\n\n\n\n<p>As empresas estão se adaptando rapidamente com as inteligências artificiais, utilizando-as cada vez mais na rotina de trabalho. </p>\n\n\n\n<p>Guilherme explica que os Departamentos de Tecnologia da Informação integram IA em interfaces de desenvolvimento, enquanto setores de negócios aproveitam personas criadas por IA para solucionar problemas gerenciais. </p>\n\n\n\n<p>Ferramentas de chat com IA e treinamentos personalizados de modelos tornam-se práticas comuns, ajustando-se aos padrões internos das organizações.</p>\n\n\n\n<p>Os benefícios da IA refletem em funcionários mais produtivos e criativos, com maior capacidade de resolução de problemas. </p>\n\n\n\n<p>Entretanto, a qualidade dos dados de pesquisa torna-se crucial para extrair o máximo dessas ferramentas. “<em>É essencial que as pessoas preparem perguntas de alta qualidade para obter resultados significativos</em>”, afirma.</p>\n\n\n\n<p>Apesar das diversas vantagens, empregos manuais e repetitivos, desde a agropecuária até tarefas de escritório, estão se tornando cada vez mais substituíveis pela IA. </p>\n\n\n\n<p>“<em>Com isso, novas oportunidades de emprego surgem, especialmente nas áreas de manutenção de IA, segurança cibernética e inovação</em>”, alega Seabra.</p>\n\n\n\n<p>É importante ressaltar que diante das inovações, adaptar-se a um mundo cada vez mais tecnológico é crucial. “<em>A IA não busca diminuir áreas de trabalho, mas otimizar fluxos para que os humanos possam ser mais produtivos e inovadores em diversas áreas</em>”, defende.</p>\n\n\n\n<p>“<em>A revolução da IA está redefinindo não apenas o mercado de trabalho, mas também a forma como as organizações adotam a tecnologia na rotina de trabalho</em>”, finaliza Guilherme.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/o-impacto-da-inteligencia-artificial-nas-empresas-e-nas-carreiras/\" target=\"_blank\" rel=\"noreferrer noopener\">O impacto da Inteligência Artificial nas empresas e nas carreiras</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/o-impacto-transformador-da-inteligencia-artificial-nas-empresas-de-tecnologia-por-roni-franco/\" target=\"_blank\" rel=\"noreferrer noopener\">O Impacto Transformador da Inteligência Artificial nas Empresas de Tecnologia – Por Roni Franco</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/a-importancia-do-conhecimento-especifico-na-era-da-inteligencia-artificial/\" target=\"_blank\" rel=\"noreferrer noopener\">A importância do conhecimento específico na era da Inteligência Artificial</a></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://mailchi.mp/07b7d0c23d7c/untitled-page\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"468\" height=\"60\" src=\"https://cryptoid.com.br/wp-content/uploads/2021/11/banners-newsletter-crypto-id-468x60-1.jpg\" alt=\"\" class=\"wp-image-85698\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2021/11/banners-newsletter-crypto-id-468x60-1.jpg 468w, https://cryptoid.com.br/wp-content/uploads/2021/11/banners-newsletter-crypto-id-468x60-1-310x40.jpg 310w\" sizes=\"(max-width: 468px) 100vw, 468px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/a-influencia-da-inteligencia-artificial-no-mercado-de-trabalho/\">A influência da inteligência artificial no mercado de trabalho</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"3 tecnologias para otimizar o varejo em 2024","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/3-tecnologias-para-otimizar-o-varejo-em-2024/","dc:creator":{"#cdata-section":"ISADORA LAVIOLA"},"pubDate":"Fri, 26 Jan 2024 14:15:00 +0000","category":[{"#cdata-section":"Cloud"},{"#cdata-section":"Destaques"},{"#cdata-section":"IA"},{"#cdata-section":"Notícias"},{"#cdata-section":"VAREJO"},{"#cdata-section":"automação"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127045"},"description":{"#cdata-section":"<p>Neogrid esteve presente na NRF e destaca IA, cloud e automação de processos como fortes tendências do setor para este ano </p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/3-tecnologias-para-otimizar-o-varejo-em-2024/\">3 tecnologias para otimizar o varejo em 2024</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>Neogrid esteve presente na NRF e destaca IA, cloud e automação de processos como fortes tendências do setor para este ano</em> </p>\n\n\n\n<p>Durante a NRF’s Retail Big Show 2024, maior evento do varejo mundial realizado em Nova York (EUA), amplas discussões aconteceram sobre o futuro do setor. </p>\n\n\n\n<p>Com grandes mudanças no segmento nos últimos anos &#8211; como a crescente competitividade, necessidade de investimento na melhora da experiência do consumidor nos ambientes online e offline e aumento na busca por produtos com melhor relação custo-benefício e que sejam sustentáveis &#8211; o que fazer para conquistar e fidelizar cada vez mais clientes continua na pauta de empreendedores, lojistas, empresários e dirigentes industriais.</p>\n\n\n\n<p>Executivos da Neogrid, ecossistema de tecnologia e inteligência de dados que desenvolve soluções para a gestão da cadeia de consumo, estiveram presente no NRF e destacam temas como experiência do cliente, retail media, omnicanalidade, ESG e inovação como os pontos altos da feira.</p>\n\n\n\n<p>Com base no que foi visto no evento, listamos três tecnologias que a Neogrid já disponibiliza ao mercado e que vão ajudar o varejo a se modernizar ainda mais em 2024:</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-inteligencia-artificial-ia\"><strong>Inteligência artificial (IA)</strong></h4>\n\n\n\n<p>Apesar de já ter sido bastante falada nos anos anteriores, a IA continua sendo uma forte tendência para 2024. Isso porque agora ela pode ter diferentes usos, como a automatização do processo de precificação e a otimização da margem de lucro dos produtos, que são proporcionadas pela solução Predify, da Neogrid, ou até mesmo a integração do processo de gestão de estoque e de promoções, aliando algoritmos de precificação para gerar uma experiência mais completa ao varejo, oferecida pelo Novo DRP, da Neogrid.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Cloud</strong></h4>\n\n\n\n<p>Ao criarem ambientes colaborativos na nuvem, as empresas conseguem tornar mais prático seus processos. A ferramenta Winn, da Neogrid, por exemplo, oferece um ambiente único no qual o varejo gerencia, em parceria com os fornecedores, a entrega dos pedidos efetuados, acompanhando status, nível de serviço e performance de cada indústria ou distribuidor.</p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Automação de processos</strong></h4>\n\n\n\n<p>Para facilitar as tarefas empresariais, ferramentas de automação de processos já estão disponíveis no mercado. A Neogrid, por exemplo, oferece o EDI para realização da troca eletrônica de documentos de transporte entre fabricantes, varejos, operadores logísticos e distribuidores de forma automática e padronizada. </p>\n\n\n\n<p>A companhia também disponibiliza o Strategic Sourcing, um portal de fornecedores e gerenciamento de contratos que possibilita às empresas maior produtividade em compras complexas. </p>\n\n\n\n<p>Com os dados das cotações compilados em um único lugar e análises automáticas que facilitam a tomada de decisão, a solução diminui o esforço operacional da equipe, liberando os profissionais para ações mais estratégicas.</p>\n\n\n\n<p>Ciente das necessidades específicas do setor, a Neogrid criou um novo planejamento estratégico que contempla uma unidade de negócio exclusiva para a execução do varejo. </p>\n\n\n\n<p>Nela, estão inseridas tecnologias para apoiar os desafios do dia a dia de quem opera no segmento de forma colaborativa, como a Smarket &#8211; sistema para gestão de ofertas e trade que organiza dados complexos para que as escolhas se tornem mais seguras e certeiras no quesito gestão de promoções.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/como-a-biometria-esta-transformando-o-varejo/\" target=\"_blank\" rel=\"noreferrer noopener\">Como a biometria está transformando o varejo?</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/a-inteligencia-artificial-potencializa-as-tomadas-de-decisao-no-varejo/\" target=\"_blank\" rel=\"noreferrer noopener\">A inteligência artificial potencializa as tomadas de decisão no varejo</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/inteligencia-artificial/tecnologia-no-varejo-como-o-uso-de-ia-generativa-pode-otimizar-tempo-e-dinheiro-nas-empresas/\" target=\"_blank\" rel=\"noreferrer noopener\">Tecnologia no varejo: como o uso de IA generativa pode otimizar tempo e dinheiro nas empresas</a></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://mailchi.mp/07b7d0c23d7c/untitled-page\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"468\" height=\"60\" src=\"https://cryptoid.com.br/wp-content/uploads/2021/11/banners-newsletter-crypto-id-468x60-1.jpg\" alt=\"\" class=\"wp-image-85698\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2021/11/banners-newsletter-crypto-id-468x60-1.jpg 468w, https://cryptoid.com.br/wp-content/uploads/2021/11/banners-newsletter-crypto-id-468x60-1-310x40.jpg 310w\" sizes=\"(max-width: 468px) 100vw, 468px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/3-tecnologias-para-otimizar-o-varejo-em-2024/\">3 tecnologias para otimizar o varejo em 2024</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"Dispositivos IoT estão transformando a saúde, desde wearables que monitoram sinais vitais até a gestão inteligente de medicamentos","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/dispositivos-iot-estao-transformando-a-saude-desde-wearables-que-monitoram-sinais-vitais-ate-a-gestao-inteligente-de-medicamentos/","dc:creator":{"#cdata-section":"ISADORA LAVIOLA"},"pubDate":"Thu, 25 Jan 2024 17:15:00 +0000","category":[{"#cdata-section":"Destaques"},{"#cdata-section":"IoT"},{"#cdata-section":"Notícias"},{"#cdata-section":"SAÚDE"},{"#cdata-section":"wearables"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127053"},"description":{"#cdata-section":"<p>A IoT está redefinindo o cenário da saúde, proporcionando uma abordagem mais personalizada e eficaz para a prestação de cuidados</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/dispositivos-iot-estao-transformando-a-saude-desde-wearables-que-monitoram-sinais-vitais-ate-a-gestao-inteligente-de-medicamentos/\">Dispositivos IoT estão transformando a saúde, desde wearables que monitoram sinais vitais até a gestão inteligente de medicamentos</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>A IoT está redefinindo o cenário da saúde, proporcionando uma abordagem mais personalizada e eficaz para a prestação de cuidados</em></p>\n\n\n\n<p>A adoção de dispositivos IoT no setor da saúde tem proporcionado avanços, desde <em>wearables</em> que monitoram sinais vitais até soluções de gestão inteligente de medicamentos e equipamentos médicos.</p>\n\n\n\n<p>Segundo Paulo Spaccaquerche, presidente da Associação Brasileira de Internet das Coisas (ABINC), a Internet das Coisas está redefinindo o cenário da saúde, proporcionando uma abordagem mais personalizada e eficaz para a prestação de cuidados. </p>\n\n\n\n<p><em>“Os dispositivos IoT que monitoram constantemente a saúde facilitam a administração de medicamentos e otimizam a gestão de equipamentos médicos. Espera-se que esse seja um setor mais eficiente, orientado por dados”</em>, sinaliza.</p>\n\n\n\n<p>De acordo com um relatório do Mordor Intelligence, a Internet das Coisas (IoT) no mercado de Saúde foi avaliada em US$ 183,4 bilhões no ano de 2022. </p>\n\n\n\n<p>Esperou-se registrar um CAGR de 18,74% durante o período de 2023, de forma que a previsão é atingir US$ 293,1 bilhões nos próximos cinco anos. Como um exemplo desse impacto, em março de 2023, a Microsoft anunciou a introdução do Dragon Ambient eXperience (DAX) Express, buscando automatizar a documentação clínica em larga escala. </p>\n\n\n\n<p>O DAX Express é um aplicativo integrado aos fluxos de trabalho automatizados de documentação clínica, combinando pela primeira vez a comprovada inteligência artificial de conversação com o ambiente avançado de raciocínio e as capacidades de linguagem natural provenientes do GPT-4 da OpenAI. </p>\n\n\n\n<p>Um dos aspectos mais visíveis é a ascensão dos <em>wearables</em> de saúde. Relógios inteligentes, pulseiras e outros dispositivos agora são capazes de coletar dados em tempo real sobre a saúde dos usuários. </p>\n\n\n\n<p>Eles monitoram continuamente sinais vitais como frequência cardíaca, pressão arterial, qualidade do sono e níveis de atividade física. </p>\n\n\n\n<p>Esses dados, quando integrados a aplicativos de saúde, possibilitam uma avaliação mais abrangente, permitindo que os usuários monitorem e melhorem seu bem-estar.</p>\n\n\n\n<p>A gestão inteligente de equipamentos médicos é outro campo que a IoT está impactando de forma positiva. Dispositivos hospitalares, como bombas de infusão e monitores de pacientes, agora podem ser conectados a uma rede, permitindo o monitoramento remoto em tempo real. </p>\n\n\n\n<p>Paulo Spaccaquerche aponta que isso não só agiliza a detecção de possíveis problemas, como também otimiza a manutenção preventiva, garantindo que os equipamentos estejam sempre em condições ideais de funcionamento.</p>\n\n\n\n<p>Dispositivos inteligentes conectados à internet auxiliam pacientes na adesão correta à medicação, emitindo lembretes e fornecendo informações personalizadas sobre dosagem. Os profissionais de saúde também se beneficiam dessa tecnologia, pois podem monitorar remotamente a conformidade dos pacientes e ajustar as prescrições conforme necessário, melhorando os resultados clínicos.</p>\n\n\n\n<p>Para Paulo Barbosa, líder do Comitê de Saúde da ABINC, há um enorme potencial da inteligência artificial generativa para fornecer suporte na área médica, abordando, por exemplo, a integração de sensores e redes conectadas, que desempenha um papel fundamental nisso. </p>\n\n\n\n<p><em>“A IoT é essencial para tornar essa IA mais responsiva, pois na área da saúde, essa tecnologia precisa ser altamente contextual”</em>, complementa.</p>\n\n\n\n<p>Paulo Barbosa enfatiza que o desafio é garantir maior responsividade em tempo real, especialmente ao integrar a inteligência artificial com dados de saúde gerados instantaneamente por sensores, como os usados em uma UTI, por exemplo. </p>\n\n\n\n<p><em>“Fica evidente como a IA pode unir essas informações de forma clara e fornecer respostas mais precisas. Essa realização, no entanto, só se torna possível por meio da integração com a IoT”</em>, finaliza.</p>\n\n\n\n<p>Entretanto, o presidente da ABINC ressalta que o aumento da conectividade também traz consigo desafios, como preocupações com a segurança dos dados e a privacidade do paciente. </p>\n\n\n\n<p><em>“À medida que a IoT na saúde continua a evoluir, é necessário desenvolver protocolos para proteger as informações sensíveis e garantir que os sistemas sejam resistentes a possíveis ameaças cibernéticas”</em>, finaliza.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/iot-aumenta-eficiencia-para-a-area-de-saude/\" target=\"_blank\" rel=\"noreferrer noopener\">IoT aumenta eficiência para a área de saúde</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/solucoes-de-iot-podem-ajudar-a-equacionar-problemas-do-setor-de-saude-na-america-latina/\" target=\"_blank\" rel=\"noreferrer noopener\">Soluções de IoT podem ajudar a equacionar problemas do setor de saúde na América Latina</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/iot-tem-tudo-para-revolucionar-a-saude-mundial/\" target=\"_blank\" rel=\"noreferrer noopener\">IoT tem tudo para revolucionar a saúde mundial</a></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://www.linkedin.com/company/crypto-id\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"600\" height=\"100\" src=\"https://cryptoid.com.br/wp-content/uploads/2022/09/banner-linkedin-2-1.jpg\" alt=\"\" class=\"wp-image-101187\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2022/09/banner-linkedin-2-1.jpg 600w, https://cryptoid.com.br/wp-content/uploads/2022/09/banner-linkedin-2-1-310x52.jpg 310w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a></figure>\n\n\n\n<p>Você quer acompanhar nosso conteúdo? Então siga nossa página no <a href=\"https://www.linkedin.com/company/crypto-id/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>LinkedIn</strong></a>!</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/dispositivos-iot-estao-transformando-a-saude-desde-wearables-que-monitoram-sinais-vitais-ate-a-gestao-inteligente-de-medicamentos/\">Dispositivos IoT estão transformando a saúde, desde wearables que monitoram sinais vitais até a gestão inteligente de medicamentos</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"97% dos líderes de marketing consideram a IA Generativa essencial para o setor","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/97-dos-lideres-de-marketing-consideram-a-ia-generativa-essencial-para-o-setor/","dc:creator":{"#cdata-section":"ISADORA LAVIOLA"},"pubDate":"Thu, 25 Jan 2024 13:00:00 +0000","category":[{"#cdata-section":"Destaques"},{"#cdata-section":"IA"},{"#cdata-section":"Notícias"},{"#cdata-section":"IA generativa"},{"#cdata-section":"marketing"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127036"},"description":{"#cdata-section":"<p>Inteligência Artificial Generativa otimiza trabalhos repetitivos e permite mais foco no core business da companhia</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/97-dos-lideres-de-marketing-consideram-a-ia-generativa-essencial-para-o-setor/\">97% dos líderes de marketing consideram a IA Generativa essencial para o setor</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>Inteligência Artificial Generativa otimiza trabalhos repetitivos e permite mais foco no core business da companhia</em></p>\n\n\n\n<p>A Inteligência Artificial Generativa representa um grande avanço em todas as companhias do Brasil. Por ser capaz de gerar textos, imagens e outras mídias apenas com solicitações de linguagem comum, ela caiu nas graças de todos. </p>\n\n\n\n<p>Tanto isso é verdade que um estudo da Adecco aponta que 76% dos profissionais brasileiros já utilizam esse tipo de tecnologia no trabalho. E com o segmento de Marketing Digital não é diferente. </p>\n\n\n\n<p>Um levantamento da Canva aponta que 97% dos líderes de marketing e criação consideram a ferramenta essencial para eliminar trabalhos repetitivos, sendo que 80% diz que isso permite foco em tarefas mais importantes do dia a dia.</p>\n\n\n\n<p>De acordo com Guilherme Lippert, cofundador da V4 Company, assessoria de Marketing Digital referência no país, um bom exemplo do uso da tecnologia no setor se dá no processo de vendas, que acaba mais assertivo com a solução. </p>\n\n\n\n<p><em>“Normalmente, essa etapa demora um pouco por conta da necessidade de uma coleta precisa de muitas informações tanto sobre o interlocutor quanto da empresa em si, o que demanda horas de conversa. Com o assistente de Inteligência Artificial Generativa esse tempo se economiza, pois a solução é capaz de manter o diálogo e coletar os dados de forma primorosa, mantendo uma interação natural com o indivíduo do outro lado”</em>, explica.</p>\n\n\n\n<p>O executivo complementa que a tecnologia serve como um copiloto do profissional de marketing, já que é um assistente que domina diversas línguas e tem acesso a uma gama de informações em tempo real na internet. </p>\n\n\n\n<p><em>“Assim, temos ao nosso lado um colega virtual com um QI altíssimo que nos ajuda a realizar diversos desafios pertinentes à área, como na confecção de textos, pesquisa e até mesmo ideias de campanhas”</em>, complementa. </p>\n\n\n\n<p>Lippert, no entanto, reforça que por mais que a IA Generativa ajude os profissionais, ela não deve substituir a força humana no segmento. </p>\n\n\n\n<p><em>“Mesmo que ela auxilie bastante,  a solução ainda precisa de um bom input feito por um profissional de marketing. O que pode acontecer, de repente, é o colaborador adepto desse tipo de tecnologia substituindo aquele que não a utiliza. Mesmo o ser humano sendo mais criativo do que uma máquina, podemos dizer que o trabalho conjunto entre ambos traz resultados mais relevantes do que o convencional”</em>, pontua.</p>\n\n\n\n<p>O mercado global de IA deve movimentar, segundo a consultoria Grand View Research, 733 bilhões de dólares até 2027. </p>\n\n\n\n<p>Já de acordo com a McKinsey, o modelo de IA Generativa deve injetar cerca de 4 trilhões de dólares anualmente na economia mundial até 2032.</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-sobre-a-v4-company\"><strong>Sobre a V4 Company</strong></h4>\n\n\n\n<p>A V4 Company, maior assessoria de marketing digital do Brasil, forma uma rede de franquias responsável por implementar e otimizar toda a jornada de vendas, potencializando o impacto comercial dos negócios. Fundada em 2012 e com matriz localizada em São Leopoldo, no Rio Grande do Sul, contabiliza, atualmente, mais de 5 mil clientes, 240 unidades franqueadas distribuídas pelo país e 3 mil pessoas na operação. Já gerou mais de R$ 2 bilhões em faturamento aos clientes. </p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/como-a-ia-generativa-vai-influenciar-o-marketing-em-2024/\" target=\"_blank\" rel=\"noreferrer noopener\">Como a IA generativa vai influenciar o marketing em 2024</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/seguranca-x-marketing-a-era-do-open-finance-e-a-privacidade-de-dados/\" target=\"_blank\" rel=\"noreferrer noopener\">Segurança X Marketing: A Era do Open Finance e a Privacidade de Dados</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/transformando-o-marketing-imobiliario-com-inovacao-em-inteligencia-artificial/\" target=\"_blank\" rel=\"noreferrer noopener\">Transformando o marketing imobiliário com inovação em Inteligência Artificial</a></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://linktr.ee/portalcryptoid\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"468\" height=\"60\" src=\"https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1.jpg\" alt=\"\" class=\"wp-image-93470\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1.jpg 468w, https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1-310x40.jpg 310w\" sizes=\"(max-width: 468px) 100vw, 468px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/97-dos-lideres-de-marketing-consideram-a-ia-generativa-essencial-para-o-setor/\">97% dos líderes de marketing consideram a IA Generativa essencial para o setor</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"Microsoft e SoulCode lançam Bootcamp para inclusão digital e empregabilidade de pessoas com deficiência","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/microsoft-e-soulcode-lancam-bootcamp-para-inclusao-digital-e-empregabilidade-de-pessoas-com-deficiencia/","dc:creator":{"#cdata-section":"ISADORA LAVIOLA"},"pubDate":"Wed, 24 Jan 2024 19:24:03 +0000","category":[{"#cdata-section":"Carreiras"},{"#cdata-section":"Destaques"},{"#cdata-section":"Eventos"},{"#cdata-section":"Notícias"},{"#cdata-section":"inclusão digital"},{"#cdata-section":"PCD"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127250"},"description":{"#cdata-section":"<p>Iniciativa faz parte do Microsoft Conecta+ e visa preparar os participantes para o mercado de trabalho em Tecnologia</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/microsoft-e-soulcode-lancam-bootcamp-para-inclusao-digital-e-empregabilidade-de-pessoas-com-deficiencia/\">Microsoft e SoulCode lançam Bootcamp para inclusão digital e empregabilidade de pessoas com deficiência</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>Iniciativa faz parte do Microsoft Conecta+ e visa preparar os participantes para o mercado de trabalho em Tecnologia</em></p>\n\n\n\n<p>O mercado de trabalho mudou drasticamente nos últimos anos. Novas profissões surgiram, outras deixaram de existir e as exigências por qualificação aumentaram, principalmente na área de tecnologia. </p>\n\n\n\n<p>Para a Microsoft, ter uma força de trabalho bem-preparada é essencial, não apenas para garantir a empregabilidade, como também para promover a inovação e o desenvolvimento econômico do Brasil. </p>\n\n\n\n<p>Com base nessa premissa a empresa se uniu a SoulCode, edtech de inclusão digital, para lançar um Bootcamp focado na capacitação de Pessoas com Deficiência em Conceitos de Nuvem e Inteligência Artificial na Nuvem da Microsoft. </p>\n\n\n\n<p>Após a conclusão da trilha de conhecimento, os alunos terão a possibilidade de serem contratados pela Microsoft. O curso, totalmente online e gratuito, focado nas carreiras de Analistas em Tecnologia Nuvem e IA da Microsoft, tem previsão de início em março e conclusão em junho de 2024. </p>\n\n\n\n<p>As inscrições podem ser feitas 22 de janeiro e 07 de março de 2024, por meio do link: <a href=\"https://soulcode.com/bootcampinclusaodigital\" target=\"_blank\" rel=\"noreferrer noopener\">https://soulcode.com/bootcampinclusaodigital</a></p>\n\n\n\n<p>Nesta primeira etapa, está prevista a capacitação de 30 alunos Pessoas com Deficiência, em aulas 100% online, de segunda a sexta-feira, em período integral, das 8h às 18h, durante aproximadamente 12 semanas. </p>\n\n\n\n<p>Além da formação técnica, a capacitação inclui mentoria de profissionais da Microsoft, desenvolvimento de habilidades comportamentais e 1 hora de aula de inglês diariamente para cada participante por meio da plataforma Tech English.</p>\n\n\n\n<p><em>“A parceria com a SoulCode está em linha com o objetivo da Microsoft de capacitar a população brasileira em tecnologia e ter em seu quadro de funcionários um time diverso, que traga diferentes perspectivas para o negócio e inove a partir das suas experiências individuais”</em>, diz Cristiane Carvalho, diretora de recursos humanos da Microsoft Brasil.</p>\n\n\n\n<p>Esta iniciativa integra o Microsoft Conecta+, portal que reúne todos os programas de capacitação e recapacitação gratuitos da empresa, disponibilizados para o público em geral, incluindo iniciativas realizadas em conjunto com outras empresas e entidades. </p>\n\n\n\n<p>Na plataforma, também é possível encontrar cursos do Microsoft Reactor, treinamentos exclusivos para mulheres, cursos da Escola do Trabalhador 4.0, em parceria com o Ministério do Trabalho e Emprego, além de trilhas de aprendizagem do LinkedIn Learning. </p>\n\n\n\n<p>Os conteúdos disponíveis atendem a todos os níveis de conhecimento em tecnologia e tem como objetivo oferecer as principais competências exigidas pelo mercado de trabalho, em diferentes níveis, ou seja, desde a alfabetização digital a módulos mais avançados como computação em nuvem, Inteligência Artificial, ciência de dados e cibersegurança.</p>\n\n\n\n<p>A SoulCode já impactou mais de 100 mil pessoas na sua plataforma de educação digital, e cerca de 2000 através de bootcamps imersivos que foram inseridas no mercado de trabalho, em 25 estados brasileiros. </p>\n\n\n\n<p>De acordo com a edtech, os beneficiados têm idade entre 18 e 66 anos, 52% são mulheres, 35% LGBTQIA+ e 14% Pessoas com Deficiência. Além disso, 49% se declararam pretos e pardos e 3% orientais.</p>\n\n\n\n<p><em>“A Microsoft é uma das empresas mais admiradas e inovadoras do mundo, para nós uma honra e grande responsabilidade esta parceria com o propósito de capacitar em tecnologia as pessoas com deficiência, e aumentar as chances de empregabilidade&#8221;</em> Carmela Borst, sócia-fundadora e CEO da SoulCode Academy.</p>\n\n\n\n<p>Todos os programas de capacitação e recapacitação integram o Microsoft Mais Brasil, um plano abrangente lançado pela companhia em outubro de 2020, que visa reforçar o&nbsp;compromisso de longo prazo da Microsoft com o país, que já dura 35 anos, e tem como um dos pilares incentivar o acesso à educação, capacitação profissional e empreendedorismo.&nbsp;</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-sobre-microsoft\"><strong>Sobre Microsoft </strong>&nbsp;</h4>\n\n\n\n<p>A Microsoft (Nasdaq “MSFT” @microsoft) tem como missão empoderar cada pessoa e cada organização do planeta a conquistar mais. Presente em 190 países, com 122 subsidiárias, a empresa é líder em inovação e no desenvolvimento de tecnologias promissoras, como a Inteligência Artificial (IA) e aplicações em nuvem. No Brasil há 35 anos, a Microsoft possui um ecossistema de mais de 25 mil parceiros. </p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Sobre a SoulCode Academy</strong></h4>\n\n\n\n<p>A SoulCode Academy é uma edtech brasileira que tem como propósito a educação tecnológica, iniciação e inclusão digital, impacto social, diversidade e empregabilidade. Temos uma metodologia diferenciada que capacita em carreiras de tecnologia, com tripé educacional que inclui aulas de inglês, hard skills e soft skills e aprendizado ágil e acelerado com apoio de inteligência artificial.</p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/inclusao-digital-necessidade-mazela-ou-salvacao/\" target=\"_blank\" rel=\"noreferrer noopener\">Inclusão digital: necessidade, mazela ou salvação?</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/carreiras-tecnologia/precisamos-combinar-as-skills-por-daniel-fabre-afonso/\" target=\"_blank\" rel=\"noreferrer noopener\">Precisamos combinar as skills. Por Daniel Fabre Afonso</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/as-habilidades-necessarias-para-profissionais-de-tecnologia-em-2024/\" target=\"_blank\" rel=\"noreferrer noopener\">As habilidades necessárias para&nbsp;profissionais de tecnologia&nbsp;em 2024&nbsp;&nbsp;</a></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://linktr.ee/portalcryptoid\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"468\" height=\"60\" src=\"https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1.jpg\" alt=\"\" class=\"wp-image-93470\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1.jpg 468w, https://cryptoid.com.br/wp-content/uploads/2022/05/BANNER-IDVERSO-468x60-1-310x40.jpg 310w\" sizes=\"(max-width: 468px) 100vw, 468px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/microsoft-e-soulcode-lancam-bootcamp-para-inclusao-digital-e-empregabilidade-de-pessoas-com-deficiencia/\">Microsoft e SoulCode lançam Bootcamp para inclusão digital e empregabilidade de pessoas com deficiência</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"Pesquisa da Palo Alto Networks detecta aumento nas atividades de ransomware Medusa","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/pesquisa-detecta-aumento-nas-atividades-de-ransomware-medusa-e-revelam-estrategias-de-multiextorsao/","dc:creator":{"#cdata-section":"Giovanna Garcia"},"pubDate":"Wed, 24 Jan 2024 17:05:55 +0000","category":[{"#cdata-section":"Cibersegurança"},{"#cdata-section":"Destaques"},{"#cdata-section":"Notícias"},{"#cdata-section":"ransomware"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127245"},"description":{"#cdata-section":"<p>O grupo propaga seu ransomware através da exploração de serviços vulneráveis e do sequestro de contas legítimas</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/pesquisa-detecta-aumento-nas-atividades-de-ransomware-medusa-e-revelam-estrategias-de-multiextorsao/\">Pesquisa da Palo Alto Networks detecta aumento nas atividades de ransomware Medusa</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>O grupo propaga seu ransomware através da exploração de serviços vulneráveis e do sequestro de contas legítimas</em></p>\n\n\n\n<p>O ransomware Medusa, recentemente destacado pelos analistas da Unit 42, unidade de pesquisa da Palo Alto Networks, é uma ameaça em ascensão no cenário de segurança cibernética. Este grupo malicioso, conhecido pela família Medusa, ganhou notoriedade ao introduzir o Medusa Blog no início de 2023, marcando uma mudança nas suas táticas de extorsão.</p>\n\n\n\n<p>A família Medusa já tinha um histórico de sucesso com o MedusaLocker em anos anteriores, mas agora, com o ransomware Medusa, eles estão emergindo como uma ameaça proeminente desde o início de 2023.</p>\n\n\n\n<p>Esse malware é altamente perigoso e pode impedir a restauração do sistema. Uma vez que os dados são sequestrados, o grupo Medusa exige o pagamento de um resgate para liberar as informações. Em caso de não conformidade, todas as informações roubadas são publicadas em um vídeo feito pelo grupo, intensificando a pressão sobre as vítimas.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"800\" src=\"https://cryptoid.com.br/wp-content/uploads/2024/01/1629805963153.jpeg\" alt=\"\" class=\"wp-image-127246\" style=\"width:310px\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2024/01/1629805963153.jpeg 800w, https://cryptoid.com.br/wp-content/uploads/2024/01/1629805963153-310x310.jpeg 310w, https://cryptoid.com.br/wp-content/uploads/2024/01/1629805963153-80x80.jpeg 80w, https://cryptoid.com.br/wp-content/uploads/2024/01/1629805963153-768x768.jpeg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" /><figcaption class=\"wp-element-caption\">Marcos Oliveira, Country Manager da Palo Alto Networks no Brasil.</figcaption></figure></div>\n\n\n<p>“<em>Utilizando o Medusa Blog como plataforma, o grupo Medusa adotou uma estratégia de multiextorsão. As vítimas que se recusam a atender às exigências do grupo têm a opção de escolher entre diferentes alternativas, como prorrogação do prazo, exclusão seletiva de dados ou o download completo das informações comprometidas, cada uma associada a um preço variável</em>”, afirma Marcos Oliveira, Country Manager da Palo Alto Networks no Brasil.</p>\n\n\n\n<p>Além disso, o grupo utiliza o canal público no Telegram chamado &#8220;suporte de informações&#8221; para compartilhar arquivos de organizações comprometidas, tornando-os mais acessíveis do que as tradicionais plataformas da dark web.</p>\n\n\n\n<p>Em resposta a um incidente de ransomware Medusa, os pesquisadores da Unit 42 identificou as táticas, ferramentas e procedimentos empregados pelo grupo. </p>\n\n\n\n<p>“<em>Os clientes da Palo Alto Networks podem contar com a proteção do Cortex XDR e dos serviços de segurança da nuvem WildFire para mitigar as ameaças representadas pelo grupo Medusa. Essas medidas são cruciais para defender organizações contra as atividades maliciosas desse grupo e proteger dados sensíveis contra potenciais sequestros</em>”, completa Oliveira.</p>\n\n\n\n<p><strong>Visão Geral do Ransomware Medusa as a Service</strong></p>\n\n\n\n<p>Medusa emergiu como uma plataforma de Ransomware as a Service (RaaS) no final de 2022, ganhando notoriedade em 2023 ao direcionar principalmente ambientes Windows. Diferentemente do MedusaLocker, presente desde 2019, a análise da Unit 42 concentra-se no ransomware Medusa, que impacta organizações que usam Windows.</p>\n\n\n\n<p>O grupo propaga seu ransomware através da exploração de serviços vulneráveis e do sequestro de contas legítimas, empregando intermediários de acesso inicial. A equipe da Unit 42 observou uma escalada nas atividades, marcada pelo lançamento do Medusa Blog em 2023, intensificando as táticas de multiextorsão.</p>\n\n\n\n<p>Também foi observado que o ransomware Medusa implementa a técnica <a href=\"https://www.malwarebytes.com/blog/business/2023/04/living-off-the-land-lotl-attacks-detecting-ransomware-gangs-hiding-in-plain-sight\" target=\"_blank\" rel=\"noreferrer noopener\">living-off-the-land</a> (vivendo fora da terra, tradução livre), utilizando software legítimo para fins maliciosos, o que muitas vezes pode se misturar com tráfego e comportamento regulares, tornando mais difícil identificar essas atividades.</p>\n\n\n\n<p>“<em>Com base no Medusa Blog, identificamos que o ransomware impactou cerca de 74 organizações globalmente em 2023, afetando setores como alta tecnologia, educação e manufatura. A análise técnica revelou estratégias de exploração diferenciadas, incluindo o uso de webshells, que são programas maliciosos que permitem a invasores controlar servidores web e executar comandos não autorizados”</em>, conclui o executivo. </p>\n\n\n\n<p><strong>Sobre a <a href=\"https://www.paloaltonetworks.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Palo Alto Networks</a></strong></p>\n\n\n\n<p>A Palo Alto Networks é líder mundial em cibersegurança. Inovamos para superar as ameaças cibernéticas, para que as organizações possam adotar a tecnologia com confiança. Fornecemos segurança cibernética de última geração para milhares de clientes em todo o mundo, em todos os setores. Nossas melhores plataformas e serviços de segurança cibernética são apoiados por inteligência de ameaças líder do setor e fortalecidos por automação de última geração. </p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/palo-alto-networks-antecipa-impactos-da-nova-politica-nacional-de-ciberseguranca-pnciber-no-brasil-para-2024/\" target=\"_blank\" rel=\"noreferrer noopener\">Palo Alto Networks antecipa impactos da nova Política Nacional de Cibersegurança (PNCiber) no Brasil para 2024</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/o-impacto-do-abuso-de-cupons-na-estrategia-de-prevencao-a-fraude-e-incentivos-a-aquisicao-e-fidelizacao-de-clientes/\" target=\"_blank\" rel=\"noreferrer noopener\">O impacto do abuso de cupons na estratégia de prevenção à fraude e incentivos à aquisição e fidelização de clientes</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/identidade-digital-destaques/ataques-ciberneticos-em-ascensao-prejuizo-anual-pode-chegar-a-usd105-trilhoes-previsto-ate-2025/\" target=\"_blank\" rel=\"noreferrer noopener\">Ataques cibernéticos em ascensão: prejuízo anual pode chegar a USD$10,5 trilhões previsto até 2025</a></p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://cryptoid.com.br/contato-patrocinio-anunciar/\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"728\" height=\"90\" src=\"https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1.png\" alt=\"\" class=\"wp-image-126390\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1.png 728w, https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1-310x38.png 310w\" sizes=\"(max-width: 728px) 100vw, 728px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/pesquisa-detecta-aumento-nas-atividades-de-ransomware-medusa-e-revelam-estrategias-de-multiextorsao/\">Pesquisa da Palo Alto Networks detecta aumento nas atividades de ransomware Medusa</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}},{"title":"Especialista destaca a importância do Dia Internacional da Proteção de Dados","link":"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/especialista-destaca-a-importancia-do-dia-internacional-da-protecao-de-dados/","dc:creator":{"#cdata-section":"ISADORA LAVIOLA"},"pubDate":"Wed, 24 Jan 2024 15:00:00 +0000","category":[{"#cdata-section":"Destaques"},{"#cdata-section":"Notícias"},{"#cdata-section":"Proteção de dados"},{"#cdata-section":"dia internacional da privacidade de dados"}],"guid":{"@isPermaLink":"false","#text":"https://cryptoid.com.br/?p=127146"},"description":{"#cdata-section":"<p>Data tem como objetivo conscientizar pessoas e organizações sobre a importância de saber como os dados pessoais devem ser tratados</p>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/especialista-destaca-a-importancia-do-dia-internacional-da-protecao-de-dados/\">Especialista destaca a importância do Dia Internacional da Proteção de Dados</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p class=\"caps\"><em>Data tem como objetivo conscientizar pessoas e organizações sobre a importância de saber como os dados pessoais devem ser tratados</em></p>\n\n\n\n<p>Dia <strong>28 de janeiro</strong> é comemorado o <strong>Dia Internacional da Proteção de Dados</strong>. A data foi criada com o intuito de aumentar a conscientização sobre boas práticas no tratamento e proteção de dados pessoais. </p>\n\n\n\n<p>De acordo com a <a href=\"https://materiais.idesp.com.br/pesquisa-protecao-e-privacidade-de-dados\" target=\"_blank\" rel=\"noreferrer noopener\">Pesquisa Nacional de Privacidade e Proteção de Dados</a>, realizada no final de 2022 pelo Grupo DARYUS, referência em consultoria e educação em gestão de riscos, cibersegurança, proteção de dados e segurança da informação, 80% das empresas no Brasil ainda não estão completamente adequadas à Lei. O estudo revelou ainda que apenas 20% das empresas estão completamente adequadas à lei.</p>\n\n\n\n<p><em>“A data é importante para conscientizar pessoas e empresas quanto ao tratamento dos dados pessoais. Com o avanço de novas tecnologias, temos que considerar também o aumento de possíveis ataques cibernéticos, por isso é fundamental abordar o tema. Ainda temos um longo caminho pela frente e cabe as empresas se adequarem para garantir a devida segurança dos dados dos titulares”</em>, destaca Cláudio Dodt, sócio-gerente e líder de prática na área de cibersegurança da Daryus Consultoria.</p>\n\n\n\n<p>No Brasil, a Lei Geral de Proteção de Dados Pessoais (LGPD), Lei nº 13.709/2018, foi sancionada em agosto de 2018 e entrou em vigor em setembro de 2020. </p>\n\n\n\n<p>No ano passado, a Autoridade Nacional de Proteção de Dados (ANPD) impôs sua primeira multa de R$ 14,4 mil a uma microempresa de telecomunicações. </p>\n\n\n\n<p>O episódio ressaltou a importância da LGPD, além da prontidão da ANPD em aplicar sanções a empresas que não estão em conformidade com a lei.</p>\n\n\n\n<p><em>“O mau uso de dados corporativos ou pessoais pode causar um impacto negativo na organização, por isso é necessário manter-se atualizado para implementar as normas exigidas pela LGPD. Contar com uma consultoria especializada ou com um profissional encarregado pelos dados (DPO) pode contribuir para o processo de adequação”</em>, enfatiza Dodt.</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-sobre-a-daryus-consultoria\"><strong>Sobre a Daryus Consultoria</strong></h4>\n\n\n\n<p>O Grupo Daryus possui mais de 17 anos de atuação no mercado nacional e é referência em consultoria e educação no tema. A Daryus Consultoria atua em Continuidade de Negócios, Gestão de Riscos, Segurança e Privacidade da Informação e Cibersegurança, para empresas nacionais e multinacionais líderes em diversos segmentos. </p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/protecao-de-dados/na-europa-os-proximos-anos-apresentaram-maior-cobranca-investigacao-e-posicionamento-das-empresas-nos-incidentes-de-seguranca-de-dados/\" target=\"_blank\" rel=\"noreferrer noopener\">A relevância da comemoração nacional do dia da proteção de dados e as tecnologias emergentes</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/entenda-as-principais-leis-de-protecao-de-dados-na-america-latina/\" target=\"_blank\" rel=\"noreferrer noopener\">Entenda as principais leis de proteção de dados na América Latina</a></p>\n\n\n\n<p><a href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/anpd-faz-balanco-da-lei-geral-de-protecao-de-dados-e-aponta-perspectivas-regulatorias-para-2024/\" target=\"_blank\" rel=\"noreferrer noopener\">ANPD faz balanço da Lei Geral de Proteção de Dados e aponta perspectivas regulatórias para 2024</a></p>\n\n\n\n<p>SOBRE CRYPTO ID</p>\n\n\n\n<p>Somos o maior portal brasileiro sobre Criptografia e Identificação Digital.</p>\n\n\n\n<div class=\"wp-block-media-text is-stacked-on-mobile\" style=\"grid-template-columns:41% auto\"><figure class=\"wp-block-media-text__media\"><img decoding=\"async\" loading=\"lazy\" width=\"400\" height=\"266\" src=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg\" alt=\"\" class=\"wp-image-125655 size-full\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE.jpg 400w, https://cryptoid.com.br/wp-content/uploads/2023/12/CRYPTO-ID-SOBRE-310x206.jpg 310w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></figure><div class=\"wp-block-media-text__content\">\n<p>Desde 2014 levamos as melhores e mais atualizadas informações sobre o mercado brasileiro e internacional de segurança digital para mais de 2 milhões de usuários únicos por ano.</p>\n\n\n\n<p>As empresas que nos apoiam contribuem para a construção de um mundo digital mais seguro, confiável e tranquilo. </p>\n</div></div>\n\n\n\n<p>Acompanhe o Crypto ID nas redes sociais!</p>\n\n\n\n<ul class=\"wp-block-social-links has-large-icon-size is-layout-flex wp-block-social-links-is-layout-flex\"><li class=\"wp-social-link wp-social-link-facebook  wp-block-social-link\"><a href=\"https://facebook.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12 2C6.5 2 2 6.5 2 12c0 5 3.7 9.1 8.4 9.9v-7H7.9V12h2.5V9.8c0-2.5 1.5-3.9 3.8-3.9 1.1 0 2.2.2 2.2.2v2.5h-1.3c-1.2 0-1.6.8-1.6 1.6V12h2.8l-.4 2.9h-2.3v7C18.3 21.1 22 17 22 12c0-5.5-4.5-10-10-10z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Facebook</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-twitter  wp-block-social-link\"><a href=\"https://twitter.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M22.23,5.924c-0.736,0.326-1.527,0.547-2.357,0.646c0.847-0.508,1.498-1.312,1.804-2.27 c-0.793,0.47-1.671,0.812-2.606,0.996C18.324,4.498,17.257,4,16.077,4c-2.266,0-4.103,1.837-4.103,4.103 c0,0.322,0.036,0.635,0.106,0.935C8.67,8.867,5.647,7.234,3.623,4.751C3.27,5.357,3.067,6.062,3.067,6.814 c0,1.424,0.724,2.679,1.825,3.415c-0.673-0.021-1.305-0.206-1.859-0.513c0,0.017,0,0.034,0,0.052c0,1.988,1.414,3.647,3.292,4.023 c-0.344,0.094-0.707,0.144-1.081,0.144c-0.264,0-0.521-0.026-0.772-0.074c0.522,1.63,2.038,2.816,3.833,2.85 c-1.404,1.1-3.174,1.756-5.096,1.756c-0.331,0-0.658-0.019-0.979-0.057c1.816,1.164,3.973,1.843,6.29,1.843 c7.547,0,11.675-6.252,11.675-11.675c0-0.178-0.004-0.355-0.012-0.531C20.985,7.47,21.68,6.747,22.23,5.924z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Twitter</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-instagram  wp-block-social-link\"><a href=\"https://instagram.com/portalcryptoid\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M12,4.622c2.403,0,2.688,0.009,3.637,0.052c0.877,0.04,1.354,0.187,1.671,0.31c0.42,0.163,0.72,0.358,1.035,0.673 c0.315,0.315,0.51,0.615,0.673,1.035c0.123,0.317,0.27,0.794,0.31,1.671c0.043,0.949,0.052,1.234,0.052,3.637 s-0.009,2.688-0.052,3.637c-0.04,0.877-0.187,1.354-0.31,1.671c-0.163,0.42-0.358,0.72-0.673,1.035 c-0.315,0.315-0.615,0.51-1.035,0.673c-0.317,0.123-0.794,0.27-1.671,0.31c-0.949,0.043-1.233,0.052-3.637,0.052 s-2.688-0.009-3.637-0.052c-0.877-0.04-1.354-0.187-1.671-0.31c-0.42-0.163-0.72-0.358-1.035-0.673 c-0.315-0.315-0.51-0.615-0.673-1.035c-0.123-0.317-0.27-0.794-0.31-1.671C4.631,14.688,4.622,14.403,4.622,12 s0.009-2.688,0.052-3.637c0.04-0.877,0.187-1.354,0.31-1.671c0.163-0.42,0.358-0.72,0.673-1.035 c0.315-0.315,0.615-0.51,1.035-0.673c0.317-0.123,0.794-0.27,1.671-0.31C9.312,4.631,9.597,4.622,12,4.622 M12,3 C9.556,3,9.249,3.01,8.289,3.054C7.331,3.098,6.677,3.25,6.105,3.472C5.513,3.702,5.011,4.01,4.511,4.511 c-0.5,0.5-0.808,1.002-1.038,1.594C3.25,6.677,3.098,7.331,3.054,8.289C3.01,9.249,3,9.556,3,12c0,2.444,0.01,2.751,0.054,3.711 c0.044,0.958,0.196,1.612,0.418,2.185c0.23,0.592,0.538,1.094,1.038,1.594c0.5,0.5,1.002,0.808,1.594,1.038 c0.572,0.222,1.227,0.375,2.185,0.418C9.249,20.99,9.556,21,12,21s2.751-0.01,3.711-0.054c0.958-0.044,1.612-0.196,2.185-0.418 c0.592-0.23,1.094-0.538,1.594-1.038c0.5-0.5,0.808-1.002,1.038-1.594c0.222-0.572,0.375-1.227,0.418-2.185 C20.99,14.751,21,14.444,21,12s-0.01-2.751-0.054-3.711c-0.044-0.958-0.196-1.612-0.418-2.185c-0.23-0.592-0.538-1.094-1.038-1.594 c-0.5-0.5-1.002-0.808-1.594-1.038c-0.572-0.222-1.227-0.375-2.185-0.418C14.751,3.01,14.444,3,12,3L12,3z M12,7.378 c-2.552,0-4.622,2.069-4.622,4.622S9.448,16.622,12,16.622s4.622-2.069,4.622-4.622S14.552,7.378,12,7.378z M12,15 c-1.657,0-3-1.343-3-3s1.343-3,3-3s3,1.343,3,3S13.657,15,12,15z M16.804,6.116c-0.596,0-1.08,0.484-1.08,1.08 s0.484,1.08,1.08,1.08c0.596,0,1.08-0.484,1.08-1.08S17.401,6.116,16.804,6.116z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">Instagram</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-linkedin  wp-block-social-link\"><a href=\"https://linkedin.com/company/crypto-id\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M19.7,3H4.3C3.582,3,3,3.582,3,4.3v15.4C3,20.418,3.582,21,4.3,21h15.4c0.718,0,1.3-0.582,1.3-1.3V4.3 C21,3.582,20.418,3,19.7,3z M8.339,18.338H5.667v-8.59h2.672V18.338z M7.004,8.574c-0.857,0-1.549-0.694-1.549-1.548 c0-0.855,0.691-1.548,1.549-1.548c0.854,0,1.547,0.694,1.547,1.548C8.551,7.881,7.858,8.574,7.004,8.574z M18.339,18.338h-2.669 v-4.177c0-0.996-0.017-2.278-1.387-2.278c-1.389,0-1.601,1.086-1.601,2.206v4.249h-2.667v-8.59h2.559v1.174h0.037 c0.356-0.675,1.227-1.387,2.526-1.387c2.703,0,3.203,1.779,3.203,4.092V18.338z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">LinkedIn</span></a></li>\n\n<li class=\"wp-social-link wp-social-link-youtube  wp-block-social-link\"><a href=\"https://www.youtube.com/@PortalCryptoID\" class=\"wp-block-social-link-anchor\"><svg width=\"24\" height=\"24\" viewBox=\"0 0 24 24\" version=\"1.1\" xmlns=\"http://www.w3.org/2000/svg\" aria-hidden=\"true\" focusable=\"false\"><path d=\"M21.8,8.001c0,0-0.195-1.378-0.795-1.985c-0.76-0.797-1.613-0.801-2.004-0.847c-2.799-0.202-6.997-0.202-6.997-0.202 h-0.009c0,0-4.198,0-6.997,0.202C4.608,5.216,3.756,5.22,2.995,6.016C2.395,6.623,2.2,8.001,2.2,8.001S2,9.62,2,11.238v1.517 c0,1.618,0.2,3.237,0.2,3.237s0.195,1.378,0.795,1.985c0.761,0.797,1.76,0.771,2.205,0.855c1.6,0.153,6.8,0.201,6.8,0.201 s4.203-0.006,7.001-0.209c0.391-0.047,1.243-0.051,2.004-0.847c0.6-0.607,0.795-1.985,0.795-1.985s0.2-1.618,0.2-3.237v-1.517 C22,9.62,21.8,8.001,21.8,8.001z M9.935,14.594l-0.001-5.62l5.404,2.82L9.935,14.594z\"></path></svg><span class=\"wp-block-social-link-label screen-reader-text\">YouTube</span></a></li></ul>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://cryptoid.com.br/contato-patrocinio-anunciar/\" target=\"_blank\" rel=\"noreferrer noopener\"><img decoding=\"async\" loading=\"lazy\" width=\"728\" height=\"90\" src=\"https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1.png\" alt=\"\" class=\"wp-image-126390\" srcset=\"https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1.png 728w, https://cryptoid.com.br/wp-content/uploads/2024/01/cryptoid-banner-728x90-1-310x38.png 310w\" sizes=\"(max-width: 728px) 100vw, 728px\" /></a></figure>\n<p>O post <a rel=\"nofollow\" href=\"https://cryptoid.com.br/criptografia-identificacao-digital-id-biometria/especialista-destaca-a-importancia-do-dia-internacional-da-protecao-de-dados/\">Especialista destaca a importância do Dia Internacional da Proteção de Dados</a> apareceu primeiro em <a rel=\"nofollow\" href=\"https://cryptoid.com.br\"></a>.</p>\n"}}]}}/*
Performance optimized by W3 Total Cache. Learn more: https://www.boldgrid.com/w3-total-cache/

Page Caching using disk: enhanced (Page is feed) 

Served from: cryptoid.com.br @ 2024-01-28 02:31:28 by W3 Total Cache
*/}