{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@version":"2.0","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:media":"http://search.yahoo.com/mrss/","channel":{"title":"Raw Story - Celebrating 19 Years of Independent Journalism","link":"https://www.rawstory.com/","description":"Raw Story - Celebrating 19 Years of Independent Journalism","atom:link":{"@href":"https://www.rawstory.com/feeds/world.rss","@rel":"self"},"language":"en-us","lastBuildDate":"Sat, 27 Jan 2024 20:25:47 -0000","image":{"url":"https://www.rawstory.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNDk4MDQwMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwODk2ODc0NH0.CAuDKCrYnLogkIrRCoHwZj7vOQ_5oq7DyFBijbdG0dE/image.jpg?width=210","link":"https://www.rawstory.com/","title":"Raw Story - Celebrating 19 Years of Independent Journalism"},"item":[{"title":"Biden, Germany's Scholz to meet at White House on Feb. 9","link":"https://www.rawstory.com/biden-germany-s-scholz-to-meet-at-white-house-on-feb-9/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51202165&width=980\"/><br/><br/><p>WASHINGTON/BERLIN — President Joe Biden will meet with German Chancellor Olaf Scholz in Washington on Feb. 9 in a bid to rally support for additional assistance for Ukraine, the White House said on Saturday. </p><p>The two leaders will use their White House meeting to reaffirm their strong support for Ukraine after Russia’s invasion, the White House said in a statement.</p>"},"pubDate":"Sat, 27 Jan 2024 14:37:28 +0000","guid":"https://www.rawstory.com/biden-germany-s-scholz-to-meet-at-white-house-on-feb-9/","category":["Olaf scholz","Germany","Joe biden"],"dc:creator":"Reuters","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51202165&width=980"}},{"title":"Venezuela's highest court upholds ban on opposition presidential candidate Machado","link":"https://www.rawstory.com/venezuela-s-highest-court-upholds-ban-on-opposition-presidential-candidate-machado/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/venezuelan-opposition-presidential-candidate-maria-corina-machado-addresses-supporters-during-an-event-in-caracas-venezuela-on.jpg?id=51201785&width=1200&height=600&coordinates=0%2C0%2C0%2C57\"/><br/><br/><p>The prospect of a free presidential election in Venezuela was dealt a heavy blow Friday when the country’s highest court upheld a ban on the candidacy of María Corina Machado, a longtime government foe and winner of the primary held by the opposition faction backed by the United States.</p><p>The ruling came months after President <a href=\"https://www.france24.com/en/tag/nicolas-maduro/\" rel=\"noopener noreferrer\" target=\"_blank\">Nicolás Maduro</a> and the <a href=\"https://www.france24.com/en/tag/usa/\" rel=\"noopener noreferrer\" target=\"_blank\">U.S.</a>-backed opposition <a href=\"https://www.france24.com/en/live-news/20231018-venezuela-government-opposition-agree-on-2024-elections\" rel=\"noopener noreferrer\" target=\"_blank\">reached an agreement</a> aimed at leveling the playing field ahead of the election later this year. The deal led Washington to ease economic sanctions on Maduro’s government.</p><p>Machado, a former lawmaker, won the opposition’s independently run presidential primary in October with more than 90% of the votes. Her victory came despite the government announcing a 15-year ban on her running for office just days after she formally entered the race in June. </p><p>She was able to participate in the primary election because the effort was organized by a commission independent of Venezuela’s electoral authorities. She insisted throughout the campaign that she never received an official notification of the ban, and said that voters, not ruling-party loyalists, are the rightful decision-makers of her candidacy.</p><p>After the court issued its ruling, Machado tweeted that her campaign's “fight to conquer <a href=\"https://www.france24.com/en/tag/democracy/\" rel=\"noopener noreferrer\" target=\"_blank\">democracy</a> through free and fair elections” is not over. </p><p>“Maduro and his criminal system chose the worst path for them: fraudulent <a href=\"https://www.france24.com/en/tag/elections/\" rel=\"noopener noreferrer\" target=\"_blank\">elections</a>,” she wrote. “That’s not gonna happen.”</p><p>She did not offer any details of her next steps, and her campaign declined to comment.</p><p>Machado had filed a claim with <a href=\"https://www.france24.com/en/tag/venezuela/\" rel=\"noopener noreferrer\" target=\"_blank\">Venezuela</a>'s Supreme Tribunal of Justice in December arguing the ban was null and void and seeking an injunction to protect her political rights.</p><p>Instead, the court upheld the ban, which alleges fraud and tax violations and accuses her of seeking the economic sanctions the U.S. imposed on Venezuela last decade. </p><p>The U.S. <a href=\"https://www.france24.com/en/americas/20231019-us-says-will-ease-venezuela-oil-gas-sanctions-after-election-deal\" rel=\"noopener noreferrer\" target=\"_blank\">eased some of the sanctions</a> on Venezuela’s oil, gas and mining industries in October after Maduro's government and the opposition group known as the Unitary Platform signed the agreement addressing electoral conditions. The accord also led to a swap of prisoners between Washington and Caracas in December. </p><p>The deal signed on the Caribbean island of Barbados narrowed the scheduling of the presidential election to the second half of 2024 and called on both sides to “promote the authorization of all presidential candidates and political parties” to participate as long as they comply with the law. The latter provision prompted the government to allow candidates to appeal their bans.</p><p>The administration of U.S. President <a href=\"https://www.france24.com/en/tag/joe-biden/\" rel=\"noopener noreferrer\" target=\"_blank\">Joe Biden</a> has threatened to reverse some of the sanctions relief if Maduro’s government fails to lift bans preventing Machado and others from running for office, and if it fails to release <a href=\"https://www.france24.com/en/tag/political-prisoners/\" rel=\"noopener noreferrer\" target=\"_blank\">political prisoners</a>.</p><p>The U.S. State Department did not immediately comment on the court's action.</p><p>Geoff Ramsey, senior analyst on Venezuela at the Atlantic Council think tank, said Maduro’s government was never going to let Machado be a presidential candidate because “her popularity makes her too much of a threat.”</p><p>“The timing of this will make it almost impossible for the U.S. government to ignore,” he said. “The problem for Washington is that it’s essentially run out of ways to pressure Maduro. How do you threaten a regime that’s already endured multiple coup attempts and years of crippling sanctions?”</p><p>The harshest sanctions were imposed after Venezuela's last presidential election, which was widely considered a sham and cost Maduro international recognition as the country's legitimate leader. </p><p>The U.S.-backed opposition stunned its allies and adversaries when more than 2.4 million people voted in the primary, including in neighborhoods long considered strongholds of the governing party. The high turnout came amid Venezuela's continuing economic struggles and despite government efforts to discourage participation.</p><p>After the vote, Maduro and his allies called the opposition's primary fraudulent. Attorney General Tarek William Saab opened criminal investigations against some of the organizers and later issued arrest warrants for some of Machado's collaborators.</p><p>Over the past two weeks, Maduro, Saab and Jorge Rodriguez, the leader of the National Assembly and the government's chief negotiator, have linked opposition supporters and people close to Machado to a number of alleged conspiracies they claim were devised to assassinate the president and his inner circle.</p><p>Rodríguez, without mentioning Machado, tweeted Friday that “despite the serious threats from far-right sectors against the peace of the Republic,” referring to the alleged conspiracies, “the mechanism established within the framework of the Barbados Agreements has been met.”</p><p>Rodríguez vowed to hold the presidential election this year. Maduro will be seeking to add six more years to his decade-long presidency marked in its entirety by political, social and economic crisis. Under Maduro's watch, millions of Venezuelans have fallen into poverty and more than 7.4 million have migrated.</p><p>A U.N.-backed panel investigating <a href=\"https://www.france24.com/en/tag/human-rights/\" rel=\"noopener noreferrer\" target=\"_blank\">human rights</a> abuses in Venezuela in September determined that Maduro’s government has intensified efforts to curtail democratic freedoms ahead of the 2024 election. That includes subjecting some politicians, human rights defenders and other opponents to detention, surveillance, threats, defamatory campaigns and arbitrary criminal proceedings.</p><p>Election campaigns in Venezuela typically involve handouts of free food, home appliances and other goods on behalf of governing party candidates, who also get favorable state media coverage. Opposition candidates and their supporters struggle to find places to gather without harassment from government activists and to get fuel to travel across the country.</p><p>A common government practice for sidelining adversaries is to ban them from public office, and it is not limited to presidential contests. </p><p>Such a ban was used retroactively in 2021 to remove gubernatorial candidate Freddy Superlano when he was ahead of a sibling of the late President <a href=\"https://www.france24.com/en/tag/hugo-chavez/\" rel=\"noopener noreferrer\" target=\"_blank\">Hugo Chávez</a> but had not yet been declared the winner. Superlano's substitute was also kept off the ballot via a ban. </p><p>The court on Friday also upheld a ban on former governor and two-time presidential candidate <a href=\"https://www.france24.com/en/tag/henrique-capriles/\" rel=\"noopener noreferrer\" target=\"_blank\">Henrique Capriles</a>, who dropped out of the primary race before the vote.</p><p>“What they will never be able to ban is the Venezuelans’ desire for CHANGE,” Capriles tweeted. “... Today more than ever, let nothing and no one take us off the electoral route.\"</p><p><em>(AP)</em></p>"},"pubDate":"Sat, 27 Jan 2024 12:19:59 +0000","guid":"https://www.rawstory.com/venezuela-s-highest-court-upholds-ban-on-opposition-presidential-candidate-machado/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/venezuelan-opposition-presidential-candidate-maria-corina-machado-addresses-supporters-during-an-event-in-caracas-venezuela-on.jpg?id=51201785&width=980"}},{"title":"Klimt painting lost for nearly a century resurfaces in Austria, to be auctioned","link":"https://www.rawstory.com/klimt-painting-lost-for-nearly-a-century-resurfaces-in-austria-to-be-auctioned/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/a-cameraman-films-the-painting-bildnis-fraeulein-lieser-portrait-of-miss-lieser-by-austrian-artist-gustav-klimt-at-the-kinsk.jpg?id=51195990&width=1200&height=600&coordinates=0%2C34%2C0%2C46\"/><br/><br/><p>A late painting by Austrian artist Gustav Klimt has resurfaced in a private collection and will be sold in April, Viennese auction house Kinsky said Thursday.</p><p>\"Bildnis Fraeulein Lieser\" (Portrait of Miss Lieser) was commissioned by a wealthy Jewish industrialist's family and painted by Klimt in 1917 shortly before he died.</p><p>The well-preserved <a href=\"https://www.france24.com/en/tag/painting/\" rel=\"noopener noreferrer\" target=\"_blank\">painting</a>, which shows a dark-haired woman, was presented to the public in Vienna for the first time on Thursday.</p><p>It is due to be <a href=\"https://www.france24.com/en/tag/auctions/\" rel=\"noopener noreferrer\" target=\"_blank\">auctioned</a> off on April 24 on behalf of the current <a href=\"https://www.france24.com/en/tag/austria/\" rel=\"noopener noreferrer\" target=\"_blank\">Austrian</a> owners and the legal successors of the Lieser family on the basis of an agreement in accordance with the Washington Principles.</p><p>That 1998 international agreement set out the procedure for returning <a href=\"https://www.france24.com/en/tag/art/\" rel=\"noopener noreferrer\" target=\"_blank\">art</a> stolen by the <a href=\"https://www.france24.com/en/tag/nazis/\" rel=\"noopener noreferrer\" target=\"_blank\">Nazis</a>.</p><p><img alt=\"A cameraman films the painting 'Bildnis Fraeulein Lieser' (Portrait of Miss Lieser) by Austrian artist Gustav Klimt at the Kinsky Art Auction House in Vienna, Austria on January 25, 2024.\" src=\"https://s.france24.com/media/display/9130cd02-bc62-11ee-aacc-005056a90284/000_34GT3RY.jpg\"/>The painting 'Bildnis Fraeulein Lieser' (Portrait of Miss Lieser) by Austrian artist Gustav Klimt. © Roland Schlager, AFP</p><p>The work was last seen at a Viennese exhibition in 1925, documented by a black-and-white photo cited as the only previous proof of its existence.</p><p>The photo identifies the last owner of the painting as a member of the Lieser family, who lived at Vienna's \"Argentinierstrasse 20\".</p><p>Henriette Lieser, who had remained in Vienna despite the Nazi rule, was deported in 1942 and murdered in Auschwitz in 1943.</p><p>The unfinished portrait re-emerged when the current owner sought legal advice from lawyer and art <a href=\"https://www.france24.com/en/tag/law/\" target=\"_blank\">law</a> expert Ernst Ploil before inheriting it.</p><h2>Tracing its provenance</h2><p>Despite extensive <a href=\"https://www.france24.com/en/tag/research/\" target=\"_blank\">research</a>, it remained unclear how the family of the current owner, who has possessed the artwork since the 1960s, obtained it, Ploil told journalists Thursday.</p><p>\"We have a gap between 1925 and the 1960s,\" he added.</p><p>But he stressed that they had found no evidence that the work had been looted, stolen or unlawfully seized before or during the Second World War.</p><p>The back of the painting is \"completely untouched\" and has \"no stamps, no stickers, nothing\", Ploil said.</p><p>\"There are no indications of any illegal confiscation during the Nazi era, i.e. the usual stamps from the Gestapo or a shipping house where looted <a href=\"https://www.france24.com/en/tag/art/\" rel=\"noopener noreferrer\" target=\"_blank\">art</a> was stored,\" he added.</p><p>No claims have yet been made by the descendants of the Lieser family, but some of them have travelled to Vienna to see the painting.</p><p>Klimt portraits rarely come on to the open market. </p><p>The Kinsky auction house estimates its value at 30 to 50 million euros ($33-55 million), but considering recent Klimt auctions, higher sums are conceivable.</p><p>Last June, Klimt's \"Dame mit Faecher\" (Lady with a Fan) was sold in <a href=\"https://www.france24.com/en/tag/london/\" rel=\"noopener noreferrer\" target=\"_blank\">London</a> for £74 million ($94.3 million at the time), setting a new European art auction record.</p><p>The previous auction record for an artwork sold in <a href=\"https://www.france24.com/en/tag/europe/\" rel=\"noopener noreferrer\" target=\"_blank\">Europe</a> was for Alberto Giacometti's \"Walking Man I\", which went for £65 million in February 2010.</p><p><em>(AFP) </em></p>"},"pubDate":"Fri, 26 Jan 2024 17:14:26 +0000","guid":"https://www.rawstory.com/klimt-painting-lost-for-nearly-a-century-resurfaces-in-austria-to-be-auctioned/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/a-cameraman-films-the-painting-bildnis-fraeulein-lieser-portrait-of-miss-lieser-by-austrian-artist-gustav-klimt-at-the-kinsk.jpg?id=51195990&width=980"}},{"title":"Israel must prevent genocidal acts in Gaza: U.N. court","link":"https://www.rawstory.com/israel-must-prevent-genocidal-acts-in-gaza-u-n-court/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/international-court-of-justice-icj-president-joan-donoghue-c-speaks-at-the-icj-prior-to-the-announcement-of-an-initial-rulin.jpg?id=51194585&width=1200&height=600&coordinates=0%2C59%2C0%2C0\"/><br/><br/><p>The UN top court on Friday said Israel must prevent genocidal acts in Gaza and facilitate \"urgently needed\" humanitarian aid into the besieged territory, handing down rulings in a case that has drawn global attention.</p><p>The court urged Israel to refrain from any possible genocidal acts as it presses its military operation in the Gaza Strip, but stopped short of ordering a ceasefire.</p><p>Israel must take \"immediate and effective measures to enable the provision of urgently needed basic services and humanitarian assistance to address the adverse conditions of life faced by Palestinians,\" the court said.</p><p>At this stage, the ICJ was not considering whether Israel is actually committing genocide in Gaza -- that process will take several years.</p><p>But the court warned Israel to \"take all measures in its power to prevent\" acts that could fall under the UN Genocide Convention, set up in 1948 as the world reeled from the horrors of the Nazi Holocaust.</p><p>It also said Israel should \"prevent and punish\" any incitement to genocide.</p><p>The case was brought by South Africa, which has accused Israel of breaching the UN Genocide Convention.</p><p>Over two days of hearings earlier this month in the gilded hall of the Peace Palace, where the ICJ sits, lawyers from both sides battled it over the interpretation of this Convention.</p><p>South Africa accused Israel of \"genocidal\" acts that were intended to cause the \"destruction of a substantial part of the Palestinian national, racial and ethnical group.\"</p><p>It urged the court to order Israel to \"immediately suspend\" its military operations in Gaza and allow humanitarian aid to reach the civiilians there.</p><h2>'Grossly distorted'</h2><p>Israel dismissed the case as a \"grossly distorted story\" and said that if any genocidal acts had been carried out, they had been executed against Israel during the October 7 Hamas attacks.</p><p>\"What Israel seeks by operating in Gaza is not to destroy a people, but to protect a people, its people, who are under attack on multiple fronts,\" said Tal Becker, Israel's top lawyer.</p><p>The question now is whether the court's rulings will be obeyed.</p><p>Although its rulings are legally binding, it has no mechanism to enforce them and they are sometimes completely ignored -- it has ordered Russia to stop its invasion of Ukraine for example.</p><p>Prime Minister Benjamin Netanyahu has already hinted Israel would not abide by any ruling saying \"no one will stop us\", not even a verdict in The Hague.</p><p>But experts believe that aside from the significant symbolic impact of the ruling, there could be tangible consequences on the ground.</p><p>\"It makes it much harder for other states to continue to support Israel in the face of a neutral third party finding there is a risk of genocide,\" said Juliette McIntyre, international law expert from the University of South Australia.</p><p>\"States may withdraw military or other support for Israel in order to avoid this,\" she added.</p><p>The October 7 Hamas attack resulted in the death of around 1,140 people in Israel, most of them civilians, according to an AFP tally based on official Israeli figures.</p><p>At least 26,083 Palestinians, around 70 percent of them women, young children and adolescents, have been killed in the Gaza Strip in Israeli bombardments and ground offensive since then, according to the Hamas government's health ministry.</p><p>© 2024 AFP</p>"},"pubDate":"Fri, 26 Jan 2024 14:09:17 +0000","guid":"https://www.rawstory.com/israel-must-prevent-genocidal-acts-in-gaza-u-n-court/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/international-court-of-justice-icj-president-joan-donoghue-c-speaks-at-the-icj-prior-to-the-announcement-of-an-initial-rulin.jpg?id=51194585&width=980"}},{"title":"Tears and fears for the man planning Paris Olympics show","link":"https://www.rawstory.com/tears-and-fears-for-the-man-planning-paris-olympics-show/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/thomas-jolly-said-he-was-overcome-when-he-was-asked-to-direct-the-ambitious-paris-olympics-opening-ceremony-on-the-river-seine-c.jpg?id=51193426&width=1200&height=600&coordinates=0%2C0%2C0%2C189\"/><br/><br/><p>The theatre director responsible for the most ambitious Olympics opening ceremony in history in Paris this July was so overwhelmed by the task when first asked to do it that he rang his mother in tears.</p><p>Thomas Jolly, one of France's most talented young directors, experienced \"a feeling of vertigo\" when approached to be artistic director for the open-air parade on the river Seine in front of a TV audience of billions.</p><p>His task: design a ceremony that will see thousands of athletes sail six kilometers (four miles) down the river in a flotilla, the first time a Summer Olympics has begun outside the main stadium.</p><p>The modest 42-year-old prodigy needed not only to develop a spectacular concept, but has also been dealing with a range of security, budget, architectural and even wildlife constraints.</p><p>\"There's the issue of the Seine which is not the same depth in one place as another,\" he told AFP in an interview this week. \"The bridges don't have the same strength, nor do the banks of the river.</p><p>\"The wind doesn't blow in the same way depending on where you are. There are places where fish spawn too, because we are trying not to disturb the natural environment.\"</p><p>Once the vertigo subsided, he set about assembling a team of creatives to develop plans which were submitted for review in July last year to a range of stakeholders from the police to the Olympic organising committee.</p><p>\"All of these reviews were done to see if we could turn our dream into reality,\" he said.</p><p>\"They all agreed pretty unanimously on around 90 percent, so I have around 10 percent left of the project that I need to re-adapt.\"</p><p><img alt=\"The river parade will finish opposite the Eiffel Tower\" src=\"https://s.france24.com/media/display/c10de918-bc0f-11ee-968b-005056a97e36/0d30def9c29fcd4fb2464e159da0ae2648206e58.jpg\"/>The river parade will finish opposite the Eiffel Tower © MIGUEL MEDINA / AFP</p><p>There is another major constraint that would keep most theatre directors awake at night, even for a small production.</p><p>\"What's unique about this show is that you can't rehearse it on location. Actually you can't rehearse it even once in advance,\" explained Jolly, who is known for his work with Shakespeare as well as the hit musical \"Starmania\".</p><p>Parts of his show will be rehearsed individually inside giant hangars, while boat captains will practice at a sailing center.</p><p>- Diversity on show -</p><p>The idea of the open-air ceremony fits with the overall grandiose vision for the July 26-August 8 Paris Olympics, which organizers have promised will be \"iconic\" and \"revolutionary\".</p><p>When President Emmanuel Macron first heard about the river parade idea with nearly 200 boats, he said he thought it was \"madness\" -- before quickly endorsing it.</p><p><img alt=\"Thomas Jolly poses in front of the rebuilding works at Notre Dame Cathedral, which was damaged by fire in 2019\" src=\"https://s.france24.com/media/display/c167a890-bc0f-11ee-be20-005056bf30b7/9a83cef31c0961e89cc02ad08b2d672f76fc5f4c.jpg\"/>Thomas Jolly poses in front of the rebuilding works at Notre Dame Cathedral, which was damaged by fire in 2019 © JOEL SAGET / AFP</p><p>The 2008 Beijing Olympics ceremony is generally considered to be the most spectacular in history while the 2012 London ceremony, overseen by \"Trainspotting\" director Danny Boyle, won rave reviews for showcasing Britain’s quirky side.</p><p>The sport in Paris is also set to play out against a backdrop of historic monuments including the Eiffel Tower, the Concorde square and the Chateau of Versailles.</p><p>As well as hosting the opening ceremony, the Seine will be used for the triathlon and open-water swimming -- water quality permitting.</p><p>As expected, Jolly was tightlipped about what he is planning when the eyes of the world -- and those of up to 600,000 live spectators -- will be riven on his work.</p><p>But he offered some broad clues, suggesting he will celebrate the modern diversity of France, both musically and culturally.</p><p>\"France is Edith Piaf... it's also opera, it's rap, it's a whole range of musical styles,\" he told AFP.</p><p>\"France is cheese, but it's also the bretzel (a snack in the German-influenced east). And it's also the couscous,\" he added. \"The idea is not to project a fixed identity.\"</p><h2>Quirks of weather</h2><p>As a result, he looks certain to avoid the same criticism that was leveled at Jean Dujardin, the Oscar-winning actor from \"The Artist\", who oversaw the opening ceremony of the Rugby World Cup last September.</p><p><img alt=\"The river Seine is being cleaned up ahead of the Games in order to host swimming events\" src=\"https://s.france24.com/media/display/c20bd6a4-bc0f-11ee-bdf3-005056bf30b7/b553e6524a34aa8eb0d93211691d3ba7ba02dcf2.jpg\"/>The river Seine is being cleaned up ahead of the Games in order to host swimming events © Miguel MEDINA / AFP</p><p>Featuring baguettes, berets, a miniature Eiffel Tower, and dancers in 1950s costumes, the show was panned by many critics as an outdated and trite representation of France.</p><p>Jolly also revealed that his three-hour ceremony would intertwine the speech-making, parade and entertainment rather than making them separate segments, as is customary.</p><p>Asked about speculation that the show might have to be moved from the Seine for security reasons, he denied it.</p><p>But he is working on how to adapt the format, if necessary, adding further complexity to his head-spinning task.</p><p>\"There are all sorts of risks: a weather issue, a security issue,\" he said. \"There might be a heatwave, or a summer storm,\" he said. \"There are lots of plans.\"</p><p>© 2024 AFP</p>"},"pubDate":"Fri, 26 Jan 2024 11:35:25 +0000","guid":"https://www.rawstory.com/tears-and-fears-for-the-man-planning-paris-olympics-show/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/thomas-jolly-said-he-was-overcome-when-he-was-asked-to-direct-the-ambitious-paris-olympics-opening-ceremony-on-the-river-seine-c.jpg?id=51193426&width=980"}},{"title":"'He knows nothing about me': Trump lashes out at Mitt Romney over border comment","link":"https://www.rawstory.com/trump-romney-border/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=27611419&width=1200&height=600&coordinates=0%2C18%2C0%2C19\"/><br/><br/><p>Donald Trump on Thursday lashed out against departing lawmaker Mitt Romney, saying the former GOP presidential nominee knows \"nothing about\" the former president.</p><p>Trump was apparently responding to Romney, who recently slammed the ex-president for purportedly sabotaging a border deal in order to hurt Joe Biden's reelection bid. Trump took to his own social media network, Truth Social, to craft a reply.</p><p>\"In response to the Statement made by Pierre Delecto, I haven’t spoken to him (Mitt Romney!) in years, and he knows nothing about me, or my views,\" Trump said, referencing a pseudonym Romney used in the past. \"Fortunately, he will permanently be leaving the Senate soon, and our Country will be a better place for it.\"</p><p><strong>ALSO READ: </strong><a href=\"https://www.rawstory.com/raw-investigates/trump-maga-political-violence/\" target=\"_self\">Few Trumpers who embrace political violence understand its endgame</a></p><p>He continued:</p><p>\"But, that being said, we need a Strong, Powerful, and essentially 'PERFECT' Border and, unless we get that, we are better off not making a Deal, even if that pushes our Country to temporarily 'close up' for a while, because it will end up closing anyway with the unsustainable Invasion that is currently taking place - A DEATH WISH for the U.S.A.!\"</p><p>In a follow-up post, Trump claimed that our country \"is in serious trouble.\"</p><p>\"A Border Deal now would be another Gift to the Radical Left Democrats. They need it politically, but don’t care about our Border,\" Trump wrote. \"What is currently being worked on in the Senate will be meaningless in terms of Border Security and Closure. Four years ago we had the Safest and Most Secure Border in the History of our Country, and now we have the WORST, probably anywhere in the World. In any event, if you want to have a really Secure Border, your ONLY HOPE is to vote for TRUMP2024!\"</p>"},"pubDate":"Thu, 25 Jan 2024 23:20:22 +0000","guid":"https://www.rawstory.com/trump-romney-border/","category":["Mitt romney","Border","Trump"],"dc:creator":"David McAfee","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=27611419&width=980"}},{"title":"Trump encourages all states to send their troops to Texas to help Greg Abbott","link":"https://www.rawstory.com/trump-send-troops-abbott/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/donald-trump.jpg?id=33335463&width=1200&height=600&coordinates=0%2C312%2C0%2C313\"/><br/><br/><p>In a two-part rant on Truth Social Thursday evening, former President Donald Trump called on Republican-controlled states to send National Guard troops to Texas to help Gov. Greg Abbott repel a supposed \"invasion.\"</p><p>\"When I was President, we had the most secure Border in History,\" <a href=\"https://truthsocial.com/@realDonaldTrump/posts/111818563903625038\" target=\"_blank\">wrote</a> Trump. \"Joe Biden has surrendered our Border, and is aiding and abetting a massive Invasion of millions of Illegal Migrants into the United States. Instead of fighting to protect our Country from this onslaught, Biden is, unbelievably, fighting to tie the hands of Governor Abbott and the State of Texas, so that the Invasion continues unchecked. In the face of this National Security, Public Safety, and Public Health Catastrophe, Texas has rightly invoked the Invasion Clause of the Constitution, and must be given full support to repel the Invasion.…\"</p><p><strong>ALSO READ:</strong> <a href=\"https://www.rawstory.com/raw-investigates/trump-maga-political-violence/\" rel=\"noopener noreferrer\" target=\"_self\">Few Trumpers who embrace political violence understand its endgame</a></p><p>\"We encourage all willing States to deploy their guards to Texas to prevent the entry of Illegals, and to remove them back across the Border,\" he <a href=\"https://truthsocial.com/@realDonaldTrump/posts/111818563406841830\" target=\"_blank\">continued</a>. \"All Americans should support the commonsense measures by Texas authorities to protect the Safety, Security, and Sovereignty of Texas, and of the American people. When I am President, on Day One, instead of fighting Texas, I will work hand in hand with Governor Abbott and other Border States to Stop the Invasion, Seal the Border, and Rapidly Begin the Largest Domestic Deportation Operation in History.\"</p><p>\"Those Biden has let in should not get comfortable because they will be going home,\" he added in warning.</p><p>The Border Patrol under the Biden administration has clashed with Texas, which is installing razor wire along the border as its own form of deterring migrants from attempting to cross. Federal agents have warned this is obstructing them from doing the actual work of safely apprehending and processing migrants.</p><p>Earlier this week, a divided Supreme Court <a href=\"https://www.rawstory.com/biden-razor-wire/#:~:text=Supreme%20Court%20justices%20handed%20President,border%20by%20Texas%20state%20officials.\" target=\"_blank\">allowed</a> the Border Patrol to clear away razor wire as needed, in a rebuke to the Texas efforts. Abbott, however, has continued to have the National Guard install more obstructions as they come down, and <a href=\"https://www.rawstory.com/abbott-shredded-defying-scotus-letter/\" target=\"_blank\">issued a letter</a> proclaiming the migrants to be an act of war against his state and vowing not to back down. Since that letter emerged, most Republican governors have signaled their support for Texas.</p>"},"pubDate":"Thu, 25 Jan 2024 21:39:18 +0000","guid":"https://www.rawstory.com/trump-send-troops-abbott/","category":["Greg abbott","Texas","Donald trump"],"dc:creator":"Matthew Chapman","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/donald-trump.jpg?id=33335463&width=980"}},{"title":"French court scraps large parts of hardline immigration law as unconstitutional","link":"https://www.rawstory.com/french-court-scraps-large-parts-of-hardline-immigration-law-as-unconstitutional/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/the-entrance-of-frances-conseil-constitutionnel-in-paris-photo-taken-on-january-22-2024-c-stephane-de-sakutin-afp.jpg?id=51186354&width=1200&height=600&coordinates=0%2C36%2C0%2C36\"/><br/><br/><p>France’s highest constitutional authority on Thursday rejected more than a third of the articles in a contentious immigration bill adopted under pressure from the right and far right.</p><p>The Constitutional Council ruling notably rejected measures in the bill toughening access to social benefits and family reunification, as well as the introduction of immigration quotas set by parliament.</p><p>It upheld much of the bill initially presented by President Emmanuel Macron’s government, but censured contentious additions made under pressure from the right and far right.</p><p>Among the measures rejected were those making it harder for immigrants to bring their families to France, and limiting their access to social welfare. The bill also strengthens France’s ability to deport foreigners considered undesirable.</p><p>Interior Minister Gerard Darmanin hailed the ruling.</p><p>“The Constitutional Council has approved all the government’s text,” he wrote on X, formally Twitter.</p><p>But Jordan Bardella, president of the far-right National Rally party, criticised what he said was a “coup by the judges, with the backing of the president”.</p><p>He called for a referendum on immigration as the “only solution”.</p><p>Despite the court dismissing the more hardline amendments, they could still be accepted at a later stage as part of different legislation.</p><h2>Macron's 'gift' to the far right</h2><p>Groups who see the law as <a href=\"https://www.france24.com/en/france/20231221-macron-accused-of-doing-far-right-s-bidding-with-passage-of-stricter-immigration-law\" rel=\"noopener noreferrer\" target=\"_blank\">contrary to French values</a> — and as a gift to the increasingly influential far right — protested ahead of the ruling outside the Constitutional Council across from the Louvre Museum in central Paris. Other protests were also planned, and Paris police deployed special security measures for the day.</p><p>The demonstrators accused the government of caving into pressure from Marine Le Pen’s far-right National Rally party to get the law through parliament. About 75,000 people protested across France on Sunday over the legislation, urging Macron not to sign it into law.</p><p>The dispute comes amid tensions across Europe around migration and as anti-immigration parties on the far right are rising in popularity ahead of European Parliament elections in June.</p><p><a href=\"https://www.france24.com/en/france/20231220-fiercely-contested-immigration-law-is-a-shield-that-we-needed-macron-says\" rel=\"noopener noreferrer\" target=\"_blank\">Macron has moved increasingly to the right</a>, notably on security and immigration issues, since rising to office on a pro-business, centrist platform.</p><p><em>(FRANCE 24 with AFP and AP)</em></p>"},"pubDate":"Thu, 25 Jan 2024 18:09:04 +0000","guid":"https://www.rawstory.com/french-court-scraps-large-parts-of-hardline-immigration-law-as-unconstitutional/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/the-entrance-of-frances-conseil-constitutionnel-in-paris-photo-taken-on-january-22-2024-c-stephane-de-sakutin-afp.jpg?id=51186354&width=980"}},{"title":"Ravers flock to dance floor in Saudi's gateway to Mecca","link":"https://www.rawstory.com/ravers-flock-to-dance-floor-in-saudi-s-gateway-to-mecca/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/people-party-late-into-the-night-at-balad-beast-str.jpg?id=51183232&width=1200&height=600&coordinates=0%2C0%2C0%2C143\"/><br/><br/><p>On a stage inside the historical centre of Jeddah, the main gateway for Muslim pilgrims heading to Mecca, rapper Ty Dolla $ign asked his screaming Saudi fans a few questions.</p><p>\"Where the hot girls at?\" the dreadlocked 41-year-old American (real name: Tyrone William Griffin Jr) bellowed into the microphone during his set at the Balad Beast music festival.</p><p>\"How many of you trying to get lit after the show tonight? How many of you trying to get faded?\"</p><p>It was an eyebrow-raising scene in conservative Saudi Arabia, which first allowed large-scale mixed-gender festivals only about five years ago, and maintains a strict no-alcohol policy.</p><p>Yet Ty Dolla $ign's performance in Jeddah's oldest neighborhood, known as Al-Balad, alongside artists like Wu-Tang Clan and Major Lazer underscored efforts to revamp the UNESCO World Heritage site, expanding its allure for young Saudis and foreigners.</p><p>Under Vision 2030, Crown Prince Mohammed bin Salman's ambitious plan to develop a post-oil economy in the world's biggest crude exporter, authorities are targeting 3,000 new hotel rooms in Al-Balad as they try to attract millions more tourists.</p><p>Beyond events such as Balad Beast, the 2.5-square-kilometer (nearly one square mile) area is being transformed by an influx of cafes, museums, performance spaces and workshops for artists and craftspeople.</p><p>Jeddah residents acknowledge some anxiety about the changes in a neighborhood strongly associated with the annual hajj pilgrimage and traditional Ramadan markets.</p><p>But that was hard to glean from the droves of ravers who crowded the four stages at Balad Beast, some with glittery face paint and glow sticks. Most of the women had their hair and faces uncovered.</p><p>\"Every time I come to Saudi, it's a vibe,\" Ty Dolla $ign said at one point, inserting an expletive for emphasis.</p><p>- Historic city, modern vibes -</p><p>Al-Balad came to prominence in the seventh century as a hub for pilgrims and traders.</p><p>Saudi Arabia's founding ruler King Abdulaziz conquered Jeddah in the 1920s, and in 1947 fast growth prompted authorities to tear down the walls surrounding Al-Balad, the city's heart.</p><p>Some of the gates still stand, however, as do Al-Balad's distinctive coral stone buildings, many with balconies built from latticed teak wood.</p><p>UNESCO granted Al-Balad World Heritage site status in 2014, and in 2018 \"revitalization\" efforts overseen by the culture ministry began in earnest.</p><p>Today, green barricades erected by the ministry protect restoration work on centuries-old villas, mosques and markets, known as souks.</p><p>The ever-expanding calendar of festivals and art exhibitions has enlivened the neighbourhood, attracting people who might otherwise have little interest in it, said Ali Assi Loush, a Lebanese DJ who has lived in Jeddah for 20 years.</p><p>\"If Balad didn't have Balad Beast, or whatever events it has now, none of the new generation would come to Balad. They'd go to the beach,\" he said.</p><p>\"They're not interested in those old shops.\"</p><p>For some elderly residents, though, the new additions can be jarring, he said, likening this wariness to that of a grandmother who refuses to part with a beloved, if battered, chair.</p><p>\"She would never let you remove it, throw it away, even though it's broken into pieces... No, it's her chair. It's the same thing,\" Loush said.</p><p>Abir Abusulayman, a Saudi tour guide, said most people were enthusiastic about Al-Balad's future, and that there was a clear solution for those who were not.</p><p>\"They can stay at home,\" she said. \"Easy and simple.\"</p><p>- 'Extraordinary' -</p><p>The debate about what's happening in Al-Balad is partly fuelled by broader changes in Jeddah, where an ongoing $20-billion redevelopment project stands to displace half a million people.</p><p>Authorities pitch the project as an upgrade that can replace \"slums\" with amenities like a stadium, an oceanarium and an opera house.</p><p>But some affected residents have complained they don't know how to seek compensation, and seethe about official portrayals of their neighborhoods as dens of drugs and crime.</p><p>Abusulayman, the tour guide, said she did not mourn the neighborhoods that have been razed –- most of them far from Al-Balad –- predicting they would be replaced by something better.</p><p>\"I'm very happy that they are gone. These were unplanned districts... no schools, no gardens, no clinics, and some people just built their houses without having the land,\" she said.</p><p>Instead she preferred to focus on new features of life in Al-Balad, as did those who partied late into the night during Balad Beast.</p><p>\"Personally I like to dress in a vintage style and this is the same thing, it's the same vibe,\" said Abdulrahman Alhabshi, 20, as images of the performers were projected on nearby walls.</p><p>Adnan Manjal, a Jeddah-born DJ known as AZM, was similarly effusive about Al-Balad's evolution.</p><p>\"To see it transform not only into a UNESCO heritage site but also a dance floor,\" he said, \"is just extraordinary.\"</p>"},"pubDate":"Thu, 25 Jan 2024 11:40:46 +0000","guid":"https://www.rawstory.com/ravers-flock-to-dance-floor-in-saudi-s-gateway-to-mecca/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/people-party-late-into-the-night-at-balad-beast-str.jpg?id=51183232&width=980"}},{"title":"Anti-Semitic acts nearly quadrupled last year in France, says Jewish organization","link":"https://www.rawstory.com/anti-semitic-acts-nearly-quadrupled-last-year-in-france-says-jewish-organization/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/demonstrators-holding-placards-that-say-against-all-religious-racisms-l-and-against-anti-semitism-racism-and-political-exp.jpg?id=51183214&width=1200&height=600&coordinates=0%2C48%2C0%2C0\"/><br/><br/><p>Anti-Semitic acts in France nearly quadrupled in 2023 compared with the previous year, a Jewish organization said Wednesday, reflecting a surge in discrimination since the October 7 attack by Hamas on Israel.</p><p>Citing figures from the French interior ministry and a French-Jewish security watchdog, the Council of Jewish Institutions in <a href=\"https://www.france24.com/en/tag/france/\" rel=\"noopener noreferrer\" target=\"_blank\">France</a> (CRIF) said there were 1,676 anti-Semitic acts last year compared to 436 the year prior. </p><p>Nearly 60 percent of those acts were attacks involving physical violence, threatening words or menacing gestures, CRIF said in its report. </p><p>Worryingly, nearly 13 percent of anti-Semitic acts last year took place in schools, most of them in junior high schools. </p><p>\"We are witnessing a rejuvenation of the perpetrators of anti-Semitic acts. Schools are no longer a sanctuary of the Republic,\" the report said. </p><p>The spike in <a href=\"https://www.france24.com/en/tag/anti-semitism/\" rel=\"noopener noreferrer\" target=\"_blank\">anti-Semitism</a> is the worst on record, according to CRIF, which has figures dating back to 2012.</p><p>The organization cautioned that its tally reflects only acts \"that have been the subject of a complaint or a report to the police\". </p><p>France is home to Europe's largest <a href=\"https://www.france24.com/en/tag/jews/\" rel=\"noopener noreferrer\" target=\"_blank\">Jewish</a> community and the largest number of <a href=\"https://www.france24.com/en/tag/muslims/\" rel=\"noopener noreferrer\" target=\"_blank\">Muslims</a> on the continent, although no precise figures are available as the country's census does not include religious identity.</p><p>According to CRIF, the bloodshed in the Middle East has unleashed a wave of anti-Semitic vitriol.</p><p>In the three months following <a href=\"https://www.france24.com/en/tag/hamas-attack-on-israel/\" rel=\"noopener noreferrer\" target=\"_blank\">Hamas' October 7 attack</a> and Israel's subsequent invasion of Gaza, the number of anti-Semitic incidents \"equalled that of the previous three years combined\", according to the report. </p><p>A third of the acts glorified jihadism, according to CRIF, and a quarter were \"calls to murder\". </p><p>France has seen previous surges of anti-Semitism, including after a 2012 attack on a Jewish school in Toulouse and a 2015 attack on a kosher supermarket in Paris.</p><p><em>(AFP)</em> </p>"},"pubDate":"Thu, 25 Jan 2024 11:34:19 +0000","guid":"https://www.rawstory.com/anti-semitic-acts-nearly-quadrupled-last-year-in-france-says-jewish-organization/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/demonstrators-holding-placards-that-say-against-all-religious-racisms-l-and-against-anti-semitism-racism-and-political-exp.jpg?id=51183214&width=980"}},{"title":"Giant waves flood key U.S. military base on Marshall Islands","link":"https://www.rawstory.com/giant-waves-flood-key-u-s-military-base-on-marshall-islands/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/this-handout-from-the-u-s-army-garrison-kwajalein-atoll-in-the-marshall-islands-shows-the-steeple-of-the-roi-namur-church-resti.jpg?id=51183147&width=1200&height=600&coordinates=0%2C68%2C0%2C69\"/><br/><br/><p>A clean-up operation was underway Thursday after giant waves flooded a key U.S. military base on the Marshall Islands in the heart of the South Pacific.</p><p>Huge breakers pummelled the US garrison at Kwajalein Atoll last weekend on Roi-Namur island, where some of America's most sophisticated space and missile tracking equipment is housed.</p><p>Video footage from inside the garrison showed surging water from the waves knocked over bystanders, smashed open glass doors and shattered windows.</p><p>Around 80 of the 120 personnel had to be evacuated, the US military said, and a 60-strong team was assessing damage and restoring basic services.</p><p>Aerial photos showed extensive damage to the island's infrastructure after the waves left several areas underwater.</p><p>\"Clearing the runway on Roi-Namur and assessing its safety is our top priority,\" garrison commander Colonel Drew Morgan said in a statement.</p><p>\"Once the runway is open, we can move people and equipment back and forth to start the recovery process.\"</p><p>It could take months to fix the damaged garrison, the US Army said, after seawater swamped the accommodation, dining, transport and entertainment buildings.</p><p>The Marshall Islands are a sprawling chain of volcanic islands and coral atolls halfway between Hawaii and Australia.</p>"},"pubDate":"Thu, 25 Jan 2024 11:29:23 +0000","guid":"https://www.rawstory.com/giant-waves-flood-key-u-s-military-base-on-marshall-islands/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/this-handout-from-the-u-s-army-garrison-kwajalein-atoll-in-the-marshall-islands-shows-the-steeple-of-the-roi-namur-church-resti.jpg?id=51183147&width=980"}},{"title":"State media: North Korea claims to have tested new type of cruise missile","link":"https://www.rawstory.com/state-media-n-korea-claims-to-have-tested-new-type-of-cruise-missile-2667082238/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51179937&width=980\"/><br/><br/><p>North Korea has claimed to have tested a new type of cruise missile, state media reported on Thursday. Pyongyang on Wednesday tested a new type of strategic cruise missile, the Bulhwasal-3-31, which is under development, the state-controlled media outlet KCNA said. Pyongyang's pursuit of nuclear weapons has made it the subject of wide-ranging international sanctions. UN resolutions prohibit North Korea from testing ballistic missiles of any range, some of which are capable of carrying a nuclear warhead. Tests of cruise missiles are not subject to sanctions against Pyongyang. Such weapons, howe...</p>"},"pubDate":"Thu, 25 Jan 2024 07:42:30 +0000","guid":"https://www.rawstory.com/state-media-n-korea-claims-to-have-tested-new-type-of-cruise-missile-2667082238/","category":"Koreas","dc:creator":"DPA International","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51179937&width=980"}},{"title":"'You should be in cuffs': Greg Abbott shredded over 'hogwash' letter defying Supreme Court","link":"https://www.rawstory.com/abbott-shredded-defying-scotus-letter/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/greg-abbott.jpg?id=29869055&width=1200&height=600&coordinates=0%2C33%2C0%2C34\"/><br/><br/><p>The state of Texas <a href=\"https://www.rawstory.com/biden-razor-wire/\" target=\"_blank\">lost</a> in its clash with the Border Patrol at the Supreme Court, with the justices allowing federal agents to clear away razor wire the state National Guard unilaterally installed to impede border agents from apprehending migrants in favor of its own blockade. But in a <a href=\"https://x.com/GregAbbott_TX/status/1750235544951349275?s=20\" target=\"_blank\">one-page letter</a> issued shortly after, Gov. Greg Abbott flouted the court's ruling, proclaiming the migrants at the border to be an \"invasion\" and invoking Texas' \"right to self-defense\" as supreme over federal immigration laws.</p><p>Abbott's statement swiftly earned cheers from Trump-supporting voters and lawmakers — but it also triggered scorn bordering on downright horror from attorneys and legal observers.</p><p><strong>Also read: </strong><a href=\"https://www.rawstory.com/trump-campaign-events/\" target=\"_self\"><strong>Trump is making his donors travel to him for fundraisers: report</strong></a></p><p>\"<span style=\"background-color: initial;\">MAGA now has the wedge to incite a civil war and war with Mexico it has long sought. It’s all so obvious it seems inevitable and the fact that ACB is the deciding vote is [laughing emoji],\" <a href=\"https://twitter.com/ZaleskiLuke/status/1750247918060101842\" target=\"_blank\">wrote</a> Conde Nast legal affairs editor Luke Zaleski.</span> \"When Putin finally gets his North America fracture thanks to MAGA can we admit the insurrection happened?\"</p><p>\"Did John Calhoun write this?\" <a href=\"https://twitter.com/AnthonyMKreis/status/1750258951466209524\" target=\"_blank\">wrote</a> Georgia State law professor Anthony Michael Kreis.</p><p>\"This is, to be blunt, hogwash. Article I, Section 10 of the Constitution does not give Texas a right to carry out immigration law. Here's what it says. Texas is not being 'actually invaded' and laying razor wire is not 'engaging in war' — which anyone with two brain cells can see,\" <a href=\"https://twitter.com/ReichlinMelnick/status/1750258059740430371\" target=\"_blank\">wrote</a> immigration attorney and policy strategist Aaron Reichlin-Melnick, noting that other states have tried this argument in court decades ago and been smacked down. \"If Texas is actually 'waging war' under the Constitution, as Abbott suggests here, then someone should demand that he answer whether Texas is following the Geneva Conventions and treating migrants as full-blown prisoners of war. The entire idea is stupid.\"</p><p>\"I read this in the original Confederate,\" <a href=\"https://twitter.com/ElieNYC/status/1750263461374783885\" target=\"_blank\">wrote</a> <em>The Nation</em> justice correspondent Elie Mystal.</p><p>\"Your dissatisfaction, (or, more to the point, politically based contrivances) do not, in any way, confer upon the State of Texas the power to usurp Federal Authority, and the policing of the Border is solely under the jurisdiction of the US Government,\" <a href=\"https://twitter.com/RaymondMollica/status/1750270033232633952\" target=\"_blank\">wrote</a> attorney Raymond J. Mollica. \"You should be in cuffs.\"</p><p>Even Ken Cuccinelli, an immigration hardliner who served in the Department of Homeland Security in the Trump administration, pointed out that Abbott's actions here are all politics and no legal substance.</p><p>\"I read the TX brief in the razor wire case,\" <a href=\"https://twitter.com/KenCuccinelli/status/1750266808081211735\" target=\"_blank\">wrote</a> Cuccinelli. \"Texas literally doesn't EVER - that is not a typo - cite Art. I, Sec. 10. So this is a really tough sounding letter, but Texas is not making this case in court. Actions speak louder than words.\"</p>"},"pubDate":"Wed, 24 Jan 2024 23:12:03 +0000","guid":"https://www.rawstory.com/abbott-shredded-defying-scotus-letter/","category":["Border","Letter","Scotus","Greg abbott"],"dc:creator":"Matthew Chapman","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/greg-abbott.jpg?id=29869055&width=980"}},{"title":"Pressure on Paris Games 'to kickstart new Olympic golden era'","link":"https://www.rawstory.com/pressure-on-paris-games-to-kickstart-new-olympic-golden-era/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/paris-olympics-2024-afp.jpg?id=33208551&width=1200&height=600&coordinates=0%2C21%2C0%2C22\"/><br/><br/><p>The Paris Games has the chance to \"kickstart a resurgence of the Olympic brand\" following the last two Covid-affected editions and the doping-blighted 2014 Sochi Winter Games, former IOC marketing executive Terrence Burns has told AFP.</p><p>With just six months to go to the opening ceremony in the French capital, organisers face plenty of hurdles if they are to seize this opportunity.</p><p>Chief among them are security concerns over the revolutionary opening ceremony and a first ever digital ticketing system.</p><p>Displaying typical French artistic flair, the ceremony will take place on the river Seine as opposed to in a stadium.</p><p>Burns, who since leaving the IOC has played a key role in five successful Olympic bid city campaigns, admits \"the world has changed dramatically\" since the ceremony plan was given the thumbs-up.</p><p>\"I know Etienne (Thobois, director general of the organizing committee) and Tony (Estanguet, head of the organizing committee) and I am sure that they realise that this issue, security, can make or break their Games depending on the outcome,\" Burns told AFP.</p><p>\"They are serious and prudent.\"</p><p>Burns says Paris has a huge opportunity in hosting the July 26-August 11 showpiece.</p><p>\"I think Paris 24 realizes how important these Games are to the (Olympic) movement and to the world,\" he said.</p><p>He said Paris would be the first Games since London in 2012 \"to reach any sense of comparative opportunity\".</p><p>Tokyo 2020 and the 2022 Beijing Winter Olympics were excellent but \"their global impact was muted beyond their own borders,\" due to the strict Covid protocols in place, he said.</p><p>Rio in 2016, meanwhile, \"was beset by a host of organizational problems which led to unending negative reportage\" and Sochi \"struggled with doping\" and a controversy over the respect of the LGBTQ community in Russia.</p><p>- 'Never mundane' -</p><p>Thus the onus falls on Paris to reboot the image of the Games, which represents a formidable challenge.</p><p>\"The fervent hope is that Paris 24 will shine brilliantly and help kickstart a resurgence of the Olympic brand and Games around the world,\" Burns told AFP.</p><p>\"Beautiful, wonderful things that inspire us are usually rare and difficult to achieve; if they were easy, they would be mundane.</p><p>\"The Games are never mundane.\"</p><p>Ticketing will be a crucial test of whether Paris can host a successful Games.</p><p>The French organisers will want to avoid a repeat of the debacle at the 2022 Champions League final which left French officials red-faced having pointed the finger at Liverpool fans when in fact the police were to blame.</p><p>World Athletics President Sebastian Coe is unhappy about the ticket prices but for Michael Payne, the IOC's former head of marketing, the nerves may be jangling more over the all-new system.</p><p>\"This time ticketing will be digital –- a first,\" the 65-year-old Irishman told AFP.</p><p>\"I hope that they have tested, and retested the systems, with full loading, as if for any reason the system goes down, or it cannot take the load, then a massive problem is on hand.\"</p><p>Coe compared the prices unfavorably to those of the 2012 London Olympics which he organized.</p><p>However, his view is not shared by British Olympic Association chair Hugh Robertson, who was the government minister responsible for delivering the London Games.</p><p>\"I think above all it's important to have tickets available at a range of price points so that the Games can remain both accessible and sustainable for years to come,\" Robertson told AFP.</p><p>\"The organizing committee have done well to strike a balance -- for Paris, general ticket prices begin at 24 euros ($26) and almost half are 50 euros or less -– and they've already sold over seven million of them.\"</p><p>The war in Ukraine has inevitably cast a shadow over Paris, but Burns, Payne and Robertson agreed that if Ukraine boycott the Games in protest at the presence of even a limited number of Russian competitors, it would only hurt the athletes.</p><p>\"I think it would be a great shame –- (Ukraine) can make a far bigger statement by competing than by not being there,\" said Payne, who in two decades at the IOC was credited with overhauling its brand and finances through sponsorship.</p><p>Burns thinks the IOC criteria that Russians must meet -- no team sports, no athletes with military or security connections and no athlete who has supported the war -- could make Ukraine's threat superfluous.</p><p>\"Given the Russian NOC and government has already stated it will not support an athlete that 'meets' the IOC criteria for participation, this (Ukraine boycott) may indeed be a moot point,\" he said.</p>"},"pubDate":"Wed, 24 Jan 2024 11:39:00 +0000","guid":"https://www.rawstory.com/pressure-on-paris-games-to-kickstart-new-olympic-golden-era/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/paris-olympics-2024-afp.jpg?id=33208551&width=980"}},{"title":"Thai court clears, reinstates reformist ex-PM candidate Pita as lawmaker","link":"https://www.rawstory.com/thai-court-clears-reinstates-reformist-ex-pm-candidate-pita-as-lawmaker/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/former-thai-prime-ministerial-candidate-and-ex-move-forward-party-leader-pita-limjaroenrat-speaks-to-the-media-as-he-arrives-at.jpg?id=51171525&width=1200&height=600&coordinates=0%2C0%2C0%2C107\"/><br/><br/><p>Thailand's Constitutional Court on Wednesday cleared reformist political leader Pita Limjaroenrat in a case that could have seen him banned from parliament, and reinstated him as an MP.</p><p>The 43-year-old led the progressive Move Forward Party (MFP) to win the most votes in last year's general election, but was <a href=\"https://www.france24.com/en/asia-pacific/20230713-thai-lawmakers-set-to-choose-a-new-prime-minister\" rel=\"noopener noreferrer\" target=\"_blank\">blocked from becoming prime minister</a> after he was suspended as an MP in July.</p><p>His party was excluded from the governing coalition after the powerful establishment was spooked by the MFP's calls to reform the kingdom's strict royal insult laws, the military and business monopolies.</p><p>The Constitutional Court on Wednesday ruled by eight votes to one that Pita had not broken rules banning members of parliament from owning shares in media companies. </p><p>The case revolved around shares in the long-defunct ITV television station, which Pita says he inherited from his father when he died. </p><p>\"ITV was not operating as media company on the day the party submitted the respondent's name for election,\" judge Punya Udchachon said in reading the court's verdict in the case.</p><p>\"Holding the shares did not violate the law. The court has ruled his MP status has not ended.\"</p><p>There were jubilant scenes outside the court as dozens of MFP supporters wearing the party's orange colours cheered and chanted \"PM Pita\".</p><p>As he arrived for the hearing earlier, Pita said he was confident of the outcome and thanked MFP supporters.</p><p>\"No matter the result I will still be working for the people,\" he said.</p><p>\"It's only a detour. Regardless of the verdict we will continue fighting.\"</p><p>Even before the ruling, the media-savvy politician insisted he would run for office again -- but if the court had ruled against him, he would have faced disqualification from parliament altogether.</p><p>He reiterated in an interview with AFP late last year that he would take another tilt at the premiership, saying he was \"not giving up\".</p><h2>Establishment fightback </h2><p>Pita's case bore similarities to a 2019 case, when popular progressive Thai politician Thanathorn Juangroongruangkit was disqualified as an MP for holding media shares.</p><p>Thanathorn's Future Forward party, the predecessor of the MFP, was later dissolved by the courts in a separate case which led to massive pro-democracy demonstrations.</p><p>During the 2023 election campaign, Pita re-energised young and urban Thais exhausted after the dwindling protest movement and weary of a near-decade of military rule.</p><p>Mostly written off by commentators, MFP surprised the establishment when they beat the Pheu Thai party of veteran political playmaker and former premier <a href=\"https://www.france24.com/en/tag/thaksin-shinawatra/\" rel=\"noopener noreferrer\" target=\"_blank\">Thaksin Shinawatra</a> into second place in May.</p><p>MFP's pledges to reform <a href=\"https://www.france24.com/en/tag/thailand/\" rel=\"noopener noreferrer\" target=\"_blank\">Thailand</a>'s strict royal insult laws, as well as plans to break up business monopolies and take on the military's influence in politics, spurred the kingdom's elites into action behind the scenes.</p><p>Pita was blocked by senators -- appointed by the last junta -- from becoming prime minister, and Pheu Thai formed a coalition that included pro-military parties but shut MFP out of government.</p><p>Educated in Thailand and at Harvard, the former Grab executive was drawn into politics in 2018 when he joined Future Forward. He stepped down as MFP leader in September.</p><p>Another challenge looms for his former party next week when the Constitutional Court will consider a petition arguing that the MFP's pledge to reform <a href=\"https://www.france24.com/en/asia-pacific/20230926-thai-protest-leader-handed-4-year-prison-term-on-charges-of-insulting-the-king\" rel=\"noopener noreferrer\" target=\"_blank\">Lèse-majesté laws</a> amounted to an attempt to overthrow the democratic government with the king as a head of state.</p><p><em>(AFP)</em></p>"},"pubDate":"Wed, 24 Jan 2024 11:35:48 +0000","guid":"https://www.rawstory.com/thai-court-clears-reinstates-reformist-ex-pm-candidate-pita-as-lawmaker/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/former-thai-prime-ministerial-candidate-and-ex-move-forward-party-leader-pita-limjaroenrat-speaks-to-the-media-as-he-arrives-at.jpg?id=51171525&width=980"}},{"title":"Plane carrying 65 Ukrainian POWs crashes in Belgorod border region, Russia says","link":"https://www.rawstory.com/plane-carrying-65-ukrainian-pows-crashes-in-belgorod-border-region-russia-says/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/file-photo-a-handout-picture-taken-on-march-16-2016-and-released-by-the-russian-defence-ministry-shows-a-russian-il-76-transpo.jpg?id=51171463&width=1200&height=600&coordinates=0%2C6%2C0%2C7\"/><br/><br/><p>Russia said Wednesday that an IL-76 military transport plane carrying 65 Ukrainian prisoners of war had crashed in the western Belgorod region, bordering Ukraine.</p><p>Unverified videos on social media showed a large plane, purportedly in the <a href=\"https://www.france24.com/en/tag/russia/\" rel=\"noopener noreferrer\" target=\"_blank\">Belgorod region</a>, falling from the sky on its side before crashing in a fireball.</p><p>\"At around 11 am <a href=\"https://www.france24.com/en/tag/moscow/\" rel=\"noopener noreferrer\" target=\"_blank\">Moscow</a> time (0800 GMT), an IL-76 aircraft crashed in the Belgorod region during a routine flight,\" Moscow's defence ministry told Russian news agencies.</p><p>\"On board were 65 captured Ukrainian army servicemen being transported to the Belgorod region for exchange, six crew members and three escorts,\" it said.</p><p>AFP was not able to immediately verify Russia's claim, and the fate of the passengers was not immediately clear.</p><p>Vyacheslav Volodin, the top lawmaker in Russia's lower house of parliament, said the plane had been \"shot down\" by <a href=\"https://www.france24.com/en/tag/kyiv/\" rel=\"noopener noreferrer\" target=\"_blank\">Kyiv</a> and blamed Western missiles.</p><p>\"They shot their own soldiers in the air. Their own,\" Volodin told lawmakers in a plenary session. \"Our pilots, who were carrying out a humanitarian mission, were shot down.\"</p><p>The crash occurred in the Korochansky district, northeast of the region's capital, regional governor Vyacheslav Gladkov said on Telegram.</p><p>\"Now an investigation team and emergency services are working on the site. I have changed my working schedule and travelled to the district,\" Gladkov said.</p><p>Gladkov had earlier announced a missile alert over the region, but it was not clear if the two events were connected.</p><p>In Kyiv, local media initially cited sources in the Ukrainian military as saying that its army downed the plane, and that it was transporting missiles.</p><p>But that claim was later retracted.</p><p>The issue of prisoners of war is sensitive in both countries.</p><p>In 2022, Russia and Ukraine <a href=\"https://www.france24.com/en/live-news/20220729-russia-ukraine-trade-blame-over-strike-on-pow-jail\" rel=\"noopener noreferrer\" target=\"_blank\">accused each other</a> of carrying out deadly bombardments on a jail holding dozens of captured Ukrainian servicemen in Kremlin-controlled Olenivka, in eastern Ukraine's <a href=\"https://www.france24.com/en/tag/donetsk/\" rel=\"noopener noreferrer\" target=\"_blank\">Donetsk</a> region.</p><p>Both Moscow and Kyiv blamed each other for the incident, which President <a href=\"https://www.france24.com/en/tag/volodymyr-zelensky/\" rel=\"noopener noreferrer\" target=\"_blank\">Volodymyr Zelensky</a> called a \"Russian war crime\".</p><h2>Strikes on Ukraine </h2><p>Moscow and Kyiv have also recently accused each other of a sharp escalation in attacks on civilian areas over the past two months.</p><p>Russian strikes wounded nine people in the eastern Ukrainian region of Kharkiv, the region's governor said Wednesday.</p><p>Regional governor Oleg Sinegubov said Moscow's forces had fired S-300 surface-to-air missiles at the city, which lies next to Ukraine's border with Russia. </p><p>Russian forces had aimed to wrest control of Kharkiv, Ukraine's second-largest city, early in their invasion, launched in February 2022.</p><p>But Ukrainian forces pushed back Moscow's army, which has been routinely shelling the city since.</p><p>Separately, the governor of the southern <a href=\"https://www.france24.com/en/tag/kherson/\" rel=\"noopener noreferrer\" target=\"_blank\">Kherson</a> region said Russian forces had killed a total of five residents of his region over the course of the day before.</p><p>Six more people were wounded across the region, which the Kremlin claims is part of Russia, the governor, Oleksandr Prokudin, said on social media.</p><p>Both Russian and Ukraine have stepped up strikes on each others' cities and critical infrastructure. </p><p>Kyiv has urged its allies to help bolster its air defense systems to ward off Russian attacks.</p>"},"pubDate":"Wed, 24 Jan 2024 11:30:45 +0000","guid":"https://www.rawstory.com/plane-carrying-65-ukrainian-pows-crashes-in-belgorod-border-region-russia-says/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/file-photo-a-handout-picture-taken-on-march-16-2016-and-released-by-the-russian-defence-ministry-shows-a-russian-il-76-transpo.jpg?id=51171463&width=980"}},{"title":"Japan gives goalkeeper 'full support' after racist abuse","link":"https://www.rawstory.com/japan-gives-goalkeeper-full-support-after-racist-abuse/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/japan-s-goalkeeper-zion-suzuki-in-action-at-the-asian-cup-hector-retamal.jpg?id=51157584&width=1200&height=600&coordinates=0%2C0%2C0%2C184\"/><br/><br/><p>Zion Suzuki has \"the full support\" of Japan's squad at the Asian Cup after the goalkeeper was racially abused online, their coach said on Tuesday.</p><p>The 21-year-old Suzuki, whose father is Ghanaian-American and mother Japanese, said he had been racially abused on social media following Japan's shock 2-1 defeat to Iraq in Doha.</p><p>It comes after two instances of racist abuse directed at players in <a href=\"https://sports.yahoo.com/soccer/teams/italy-women/\" rel=\"noopener noreferrer\" target=\"_blank\">Italy</a> and <a href=\"https://sports.yahoo.com/soccer/teams/england-women/\" rel=\"noopener noreferrer\" target=\"_blank\">England</a> during matches.</p><p>Ahead of Japan's game against Indonesia on Wednesday, coach Hajime Moriyasu said that racism was \"something that just cannot happen\".</p><p>\"Zion is an important player for Japan and I strongly object to the people who violated his human rights and racially abused him,\" he said.</p><p>\"If it has caused Zion stress or harm then he has the full support of the whole team.</p><p>\"I want him to feel comfortable and to be able to fully concentrate on his football.\"</p><p>FIFA president Gianni Infantino called for worldwide stadium bans for fans and \"automatic forfeits\" for teams whose supporters hurl racist abuse, following the incidents in Italy and England at the weekend.</p><p>Fans aimed monkey chants at France goalkeeper <a href=\"https://sports.yahoo.com/soccer/players/374269/\" rel=\"noopener noreferrer\" target=\"_blank\">Mike Maignan</a> during <a href=\"https://sports.yahoo.com/soccer/teams/milan/\" rel=\"noopener noreferrer\" target=\"_blank\">AC Milan</a>'s dramatic 3-2 win at <a href=\"https://sports.yahoo.com/soccer/teams/udinese/\" rel=\"noopener noreferrer\" target=\"_blank\">Udinese</a>, with the game temporarily halted.</p><p>Coventry midfielder Kasey Palmer accused Sheffield Wednesday fans of doing the same to him during their Championship clash, which his team won 2-1 on Saturday.</p><p>\"Football is a sport that can connect countries and people,\" said Moriyasu.</p><p>\"It has a shared language that can bring people with different values together.\"</p><p>Comments still appeared to have been disabled on Suzuki's Instagram account on Tuesday.</p><p>The goalkeeper said on Monday that he accepted criticism of his performances but \"would like people to stop making racist comments\".</p><p>\"I'm not about to let it beat me,\" he said.</p>"},"pubDate":"Tue, 23 Jan 2024 11:45:59 +0000","guid":"https://www.rawstory.com/japan-gives-goalkeeper-full-support-after-racist-abuse/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/japan-s-goalkeeper-zion-suzuki-in-action-at-the-asian-cup-hector-retamal.jpg?id=51157584&width=980"}},{"title":"France fines Amazon €32 million over employee surveillance","link":"https://www.rawstory.com/france-fines-amazon-eur32-million-over-employee-surveillance/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/amazon-warehouse.jpg?id=29651686&width=1200&height=600&coordinates=0%2C66%2C0%2C67\"/><br/><br/><p>France's data protection agency said Tuesday that it had fined Amazon's French warehouses unit 32 million euros ($34.9 million) for an \"excessively intrusive\" surveillance system to keep track of staff performance.</p><p><a href=\"https://www.france24.com/en/tag/amazon-inc/\" rel=\"noopener noreferrer\" target=\"_blank\">Amazon</a> France Logistique monitored the <a href=\"https://www.france24.com/en/tag/working-conditions/\" rel=\"noopener noreferrer\" target=\"_blank\">work of employees</a> in particular through data from scanners used by the staff to process packages, according to the agency, known by its initials CNIL.</p><p>Scanners alerted management of inactivity exceeding 10 minutes or the handling of packages and parcels \"right up to the second\", the CNIL said in a statement.</p><p>One surveillance method targeted by CNIL was the use of so-called \"stow machine guns\" to note if an article was scanned \"too fast\", or in less than 1.25 seconds.</p><p>It said workers were under constant pressure and had to regularly justify absences. Even the time between the employees' entry into the warehouse and the start of work was monitored.</p><p>The agency added that they were not adequately informed about the surveillance, with the data kept for 31 days.</p><p>The surveillance was deemed in contravention with the EU's general <a href=\"https://www.france24.com/en/tag/privacy/\" rel=\"noopener noreferrer\" target=\"_blank\">data protection</a> regulation (GDPR), which imposes strict rules on companies for obtaining consent on how personal information is used.</p><p>The fine was equivalent to about three percent of the annual revenue at Amazon France Logistique, which reached 1.1 billion euros in 2021, for a net profit of 58.9 million euros.</p><p>Several thousand employees were affected by the systems, said the CNIL, which had opened its inquiry in 2019 following media articles and complaints by workers.</p><p>The watchdog said the fine was \"nearly unprecedented\" and not far from the CNIL's maximum four percent of revenue.</p><h2>'Quality and efficiency'</h2><p>An Amazon spokesman said the company rejected the findings as \"factually incorrect and we reserve the right to appeal\", adding that such systems were needed \"to guarantee security, quality and efficiency\".</p><p>The company employs around 20,000 people overall on permanent contracts in <a href=\"https://www.france24.com/en/tag/france/\" rel=\"noopener noreferrer\" target=\"_blank\">France</a>, with the warehouse workers spread over eight massive distribution centers.</p><p>David Lewkowitz, president of Amazon France Logistique, told AFP during a visit at its warehouse near Douai in northern France this month that the management tools were necessary for the precise handling of the tens of thousands of packages that move through the centres each day.</p><p>The \"stow machine guns\", for example, aim to ensure that employees are properly checking items for damage or other problems before they are scanned for shipping \"in a manner that conforms with safety rules, in particular by ensuring proper postures\", Amazon said in its statement.</p><p>Measuring \"idle time\", meanwhile, was not to control a worker's every movement but to ensure that any supply chain anomaly is quickly investigated and rectified.</p><p>But Amazon said that in response to the CNIL's findings it would deactivate the ability of the \"stow machine guns\" to signal handling speeds, and extend the \"idle time\" warnings to 30 minutes from 10.</p><p><em>(AFP)</em></p>"},"pubDate":"Tue, 23 Jan 2024 11:14:53 +0000","guid":"https://www.rawstory.com/france-fines-amazon-eur32-million-over-employee-surveillance/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/amazon-warehouse.jpg?id=29651686&width=980"}},{"title":"Taliban restricting unmarried women’s access to work and travel, UN report says","link":"https://www.rawstory.com/taliban-restricting-unmarried-womens-access-to-work-and-travel-un-report-says/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/a-taliban-fighter-stands-guard-as-women-wait-to-receive-food-rations-distributed-by-a-humanitarian-aid-group-in-kabul-afghanist.jpg?id=51148440&width=1200&height=600&coordinates=0%2C0%2C0%2C55\"/><br/><br/><p>The Taliban are restricting Afghan women’s access to work, travel and healthcare if they are unmarried or don’t have a male guardian, according to a U.N report published Monday.</p><p>In one incident, officials from the Vice and Virtue Ministry advised a woman to get married if she wanted to keep her job at a health care facility, saying it was inappropriate for an unwed woman to work, it said.</p><p>The <a href=\"https://www.france24.com/en/tag/taliban/\" rel=\"noopener noreferrer\" target=\"_blank\">Taliban</a> have barred <a href=\"https://www.france24.com/en/tag/women/\" rel=\"noopener noreferrer\" target=\"_blank\">women</a> from most areas of public life and stopped girls from going to school <a href=\"https://www.france24.com/en/asia-pacific/20221220-taliban-forbids-university-education-for-afghan-girls-nationwide\" rel=\"noopener noreferrer\" target=\"_blank\">beyond the sixth grade</a> as part of harsh measures they imposed after taking power in 2021, despite initially promising more moderate rule. </p><p>They have also shut down beauty parlors and started enforcing a dress code, arresting women who don't comply with their interpretation of hijab, or <a href=\"https://www.france24.com/en/tag/islamic-veil/\" rel=\"noopener noreferrer\" target=\"_blank\">Islamic headscarf</a>. In May 2022, the Taliban <a href=\"https://www.france24.com/en/asia-pacific/20220507-taliban-chief-orders-all-afghan-women-to-wear-burqa\" rel=\"noopener noreferrer\" target=\"_blank\">issued a decree</a> calling for women to only show their eyes and recommending they wear the head-to-toe burqa, similar to restrictions during the Taliban’s previous rule between 1996 and 2001.</p><p>In its latest quarterly report, covering October to December last year, the U.N. Assistance Mission in <a href=\"https://www.france24.com/en/tag/afghanistan/\" rel=\"noopener noreferrer\" target=\"_blank\">Afghanistan</a> said the Taliban are cracking down on Afghan women who are single or don't have a male guardian, or mahram, accompanying them.</p><p>There are no official laws about male guardianship in Afghanistan, but the Taliban have said women cannot move around or travel a certain distance without a man who is related to her by blood or marriage.</p><p>Three female health care workers were detained last October because they were going to work without a mahram. They were released after their families signed a written guarantee that they would not repeat the act, the report said.</p><p>In Paktia province, the Vice and Virtue Ministry has stopped women without mahrams from accessing health facilities since December. It visits health facilities in the province to ensure compliance.</p><p>The ministry, which serves as the Taliban's morality <a href=\"https://www.france24.com/en/tag/police/\" rel=\"noopener noreferrer\" target=\"_blank\">police</a>, is also enforcing hijab and mahram requirements when women visit public places, offices and <a href=\"https://www.france24.com/en/tag/education/\" rel=\"noopener noreferrer\" target=\"_blank\">education</a> institutes through checkpoints and inspections.</p><p>In December, in <a href=\"https://www.france24.com/en/tag/kandahar/\" rel=\"noopener noreferrer\" target=\"_blank\">Kandahar</a> province, ministry officials visited a bus terminal to ensure women were not traveling long distances without mahrams and instructed bus drivers not to permit women to board without one, the U.N. said.</p><p>Women have also been arrested for buying contraceptives, which the Taliban have not officially banned.</p><p>The Taliban’s chief spokesman, Zabihullah Mujahid, said the <a href=\"https://www.france24.com/en/tag/united-nations/\" rel=\"noopener noreferrer\" target=\"_blank\">U.N.</a> report was based mostly on misunderstandings and accused the mission of ignoring or criticizing Islamic law, or Shariah.</p><p>With an Islamic government in power in Afghanistan, it must \"fully implement all aspects of Shariah for both men and women,” Mujahid said in a statement.</p><p>This means enforcing rules for the hijab, male guardianship and gender segregation for women in education and <a href=\"https://www.france24.com/en/tag/employment/\" rel=\"noopener noreferrer\" target=\"_blank\">employment</a>, he said. </p><p>\"If UNAMA criticizes these cases or considers explicit Islamic rulings as an act against <a href=\"https://www.france24.com/en/tag/human-rights/\" rel=\"noopener noreferrer\" target=\"_blank\">human rights</a>, then it is an insult to the beliefs of a people,” he said.</p><p><em>(AP)</em></p>"},"pubDate":"Mon, 22 Jan 2024 17:09:17 +0000","guid":"https://www.rawstory.com/taliban-restricting-unmarried-womens-access-to-work-and-travel-un-report-says/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/a-taliban-fighter-stands-guard-as-women-wait-to-receive-food-rations-distributed-by-a-humanitarian-aid-group-in-kabul-afghanist.jpg?id=51148440&width=980"}},{"title":"Five Olympic stars to watch in Paris","link":"https://www.rawstory.com/five-olympic-stars-to-watch-in-paris/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/simone-biles-lionel-bonaventure-afp.jpg?id=51146339&width=1200&height=600&coordinates=0%2C95%2C0%2C32\"/><br/><br/><p>When the Paris Olympics open in six months' time on July 26, these five stars will be expected to light up the venues, delighting spectators and a TV audience of billions:</p><p><strong>SIMONE BILES (USA, gymnastics)</strong></p><p>After a two-year hiatus US gymnastics superstar Simone Biles vaults into Paris as potentially the biggest headline act of the 2024 Games.</p><p>The four-time Olympic gold medallist was meant to be the poster star of the last Summer Olympics in Tokyo, only to dramatically pull out of most of her events suffering from a debilitating temporary spatial awareness condition known as 'the twisties'.</p><p>The pint-sized bundle of brilliance -- who has five moves named after her -- made an explosive return to the international stage at the world gymnastics championships last October, scooping four golds.</p><p>The 26-year-old's multi-million strong army of social media followers, and sports fans everywhere, will hope to see her trademark smile shine down from the top step of the podium for the first time at an Olympics since Rio 2016.</p><p><strong>FAITH KIPYEGON (Kenya, athletics)</strong></p><p>No track athlete had a more remarkable 2023 than Kipyegon, who set world records at three distances and took two golds at the world championships.</p><p>Having won one gold at the 2016 Rio Olympics and five years later in Tokyo, the Kenyan, voted Woman Athlete of the Year in 2023, could bag several titles in Paris.</p><p>Her country, whose status as an athletics superpower has been tarnished by a string of doping scandals, badly needs her to succeed.</p><p><strong>TEDDY RINER (France, judo)</strong></p><p>If the hosts are to meet President Macron's target of making the top five in the medals table, they need their stars to shine and no one is more brilliant in his field than judoka Teddy Riner.</p><p>Riner, who will be 35 when the Games start, has won gold in each of the last three Olympics, twice in the heavyweight 100+ category and once in Tokyo in the mixed team. He also has two bronze medals.</p><p>He appears to be in good shape as he prepares for Paris. He won his 11th world championship title last May before taking a long break.</p><p>When he returned in December at a meeting in Belgrade, he won all three of his bouts, signalling that, in spite his age, the native of Guadeloupe is in the mood for a fourth successive gold medal.</p><p>\"It's not just about showing off,\" he said after he was selected for Paris. \"It's about performing and bringing home the most beautiful of medals.\"</p><p><strong>NOAH LYLES (USA, athletics)</strong></p><p>The engaging American can put behind him the disappointment of the 2020 Tokyo Games and prove once and for all he is the heir to Usain Bolt by landing the sprint double in Paris.</p><p>The 26-year-old, who could only manage 200m bronze in Tokyo three years ago, is keen to go one better than Bolt as he bids for a remarkable four golds -- the 100m, 200m plus the 4x100m and 4x400m relays.</p><p>Lyles has already shown he is capable of three titles having been the star of last year's world championships, taking the sprint double and the 4x100m relay.</p><p><strong>ORLA KHARLAN (Ukraine, fencing)</strong></p><p>Should Kharlan finally secure the individual sabre gold that has eluded her in her stellar career it could bring down the roof on the Grand Palais in response to the suffering her family and compatriots have experienced since the Russian invasion of her country in February 2022.</p><p>The 33-year-old, who already has two individual Olympic bronzes and a team gold and team silver, has been guaranteed a place in Paris thanks to an intervention by IOC President Thomas Bach when she was disqualified at the world championships for refusing to shake hands with her Russian opponent.</p><p>Kharlan is one of a growing number of Ukrainian athletes who would prefer not to boycott of the Games -- they would rather beat their Russian opponents.</p><p>Kharlan said the war has put her Olympic ambitions in perspective.</p><p>\"It is not my dream, that would be the war ending, but it is my goal to be in Paris, and my family to be there watching,\" she told AFP last July.</p>"},"pubDate":"Mon, 22 Jan 2024 11:43:34 +0000","guid":"https://www.rawstory.com/five-olympic-stars-to-watch-in-paris/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/simone-biles-lionel-bonaventure-afp.jpg?id=51146339&width=980"}},{"title":"India’s Modi inaugurates flashpoint temple seen as triumph for Hindu nationalism","link":"https://www.rawstory.com/indias-modi-inaugurates-flashpoint-temple-seen-as-triumph-for-hindu-nationalism/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/people-flock-to-the-opening-of-the-hindu-temple-in-ayodhya-india-on-january-22-2024-the-controversial-hindu-temple-was-built.jpg?id=51146250&width=1200&height=600&coordinates=0%2C54%2C0%2C54\"/><br/><br/><p>Prime Minister Narendra Modi said the opening of a temple Monday heralded a \"new era\" for India, in a ceremony that embodies the triumph of his muscular Hindu nationalist politics and is seen as an unofficial start to his re-election campaign this year.</p><p>\"January 22, 2024 is not merely a date in the calendar but heralds the advent of a new era,\" <a href=\"https://www.france24.com/en/tag/narendra-modi/\" rel=\"noopener noreferrer\" target=\"_blank\">Modi</a> said, speaking outside the temple to the Hindu deity Ram, built on grounds where a mosque stood for centuries before it was torn down in 1992 by Hindu zealots incited by members of his party.</p><p>That demolition triggered the worst religious riots since independence – killing 2,000 people, most of them Muslims – and shook the foundations of <a href=\"https://www.france24.com/en/tag/india/\" rel=\"noopener noreferrer\" target=\"_blank\">India</a>'s officially secular political order.</p><p>Tens of thousands of chanting and dancing devotees waving flags, honking horns and beating drums have converged on the northern town of Ayodhya, with roads clogged, trains packed full and the rest marching in on foot.</p><p>Few members of Ayodhya's Muslim community were seen joining the jubilant street party. </p><p>But for Modi's ruling Bharatiya Janata Party (BJP), the opening of the Ram Mandir temple is a landmark moment in a decades-long campaign to <a href=\"https://www.france24.com/en/tag/hindu-nationalist/\" target=\"_blank\">align the country's governance</a> with its majority faith.</p><p>\"The Lord has made me an instrument to represent all the people of India\", Modi said when he launched an 11-day ritual fast ahead of the \"auspicious\" opening.</p><h2>Tycoons, cricketers and actors</h2><p>Excitement has reached a fever pitch, with thousands of Hindu believers dancing in packed streets as giant loudspeakers blast out religious tunes.</p><p>Vijay Kumar, 18, took four days to reach the town after walking and hitchhiking 600 kilometres (370 miles).</p><p>\"We just wanted to be here,\" Kumar said. \"We just wish to see the temple before we leave.\"</p><p>About 2,500 musicians are expected to perform on over 100 stages for the crowds of pilgrims, desperate to see the elaborate temple, built at an estimated $240 million that the project's backers say was sourced from public donations.</p><p>The 140 kilometers (87 miles) between the town and Uttar Pradesh state capital Lucknow is a seemingly endless stream of billboards of blue-skinned Ram with bow and arrow – as well as of Modi and the region's chief minister, the saffron-robed Hindu monk Yogi Adityanath.</p><p>Bukesh Rajiybng, 54, travelled for three days in a jam-packed train to attend the celebration.</p><p>\"It's a moment we have all dreamed of for decades,\" he said. \"I think the people and Ram will definitely bless Modi for this.\"</p><p>Other attendees jetted in to the newly built international airport and will stay at a crop of hotels built to cater to the millions of pilgrims expected to visit each year. </p><p>Among the celebrity guests at the opening are Indian tycoons, former national cricket captain Virat Kohli and Bollywood titan Amitabh Bachchan.</p><h2>'Death and destruction'</h2><p>Modi and the BJP have sought to bring the Hindu faith to the forefront of public life since sweeping to power a decade ago.</p><p>Party luminaries regularly condemn earlier eras of Islamic rule over parts of India as a time of \"slavery\" when their own religion was oppressed, with Ayodhya a key plank in their narrative.</p><p>Devout Hindus believe Ram, one of the most revered Hindu gods, was born in the town more than 7,000 years ago, but that the Babri mosque was built over his birthplace by a 16th-century Muslim emperor.</p><p>The BJP played an instrumental role in public campaigning that eventually led to the mosque's demolition.</p><p>The destruction presaged the rise of the BJP and Modi as unstoppable electoral juggernauts, displacing the secularist Congress party that had governed India almost without interruption since independence from Britain.</p><p>Modi's consecration of the temple alongside Hindu priests will again project him as a defender of the faith ahead of a general election expected to begin in April.</p><p>The BJP is heavily favored to win a third successive landslide victory, in part because of Modi's appeals to Hindu nationalism, and opposition parties are boycotting the temple ceremony, saying the event will be a thinly veiled campaign rally.</p><p>But many of India's 200 million Muslims, already anxious in a climate of increased sectarian tensions, have watched the clamour around the temple with trepidation.</p><p>Mohammed Shahid, 52, speaking to AFP last month in Ayodhya, recounted how his father was burned alive by a mob.</p><p>\"For me, the temple symbolizes nothing but death and destruction\", he said.</p><p><em>(FRANCE 24 with AFP)</em></p>"},"pubDate":"Mon, 22 Jan 2024 11:30:41 +0000","guid":"https://www.rawstory.com/indias-modi-inaugurates-flashpoint-temple-seen-as-triumph-for-hindu-nationalism/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/people-flock-to-the-opening-of-the-hindu-temple-in-ayodhya-india-on-january-22-2024-the-controversial-hindu-temple-was-built.jpg?id=51146250&width=980"}},{"title":"Musk to address anti-Semitism online in Poland","link":"https://www.rawstory.com/musk-to-address-anti-semitism-online-in-poland/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/elon-musk.jpg?id=29989419&width=1200&height=600&coordinates=0%2C82%2C0%2C82\"/><br/><br/><p>Billionaire entrepreneur Elon Musk was Monday due to address anti-Semitism online at an event in Poland just weeks after sparking a firestorm by endorsing an anti-Semitic conspiracy theory.</p><p>The conference, hosted by the European Jewish Association, comes after Musk in November repeated a tweet on the theory and declared it the \"actual truth\" -- before apologizing.</p><p>The tech tycoon has also faced accusations of a proliferation of hate speech on X, formerly Twitter, since his $44-billion takeover of the social media site in October 2022.</p><p>Senior political figures from European countries and Musk will meet in Krakow \"to discuss and find solutions to the astronomical rises in anti-Semitism affecting Europe,\" the European Jewish Association said.</p><p>\"This troubling trend\" had been escalating since the war in Gaza, it said.</p><p>The conflict erupted when Hamas militants launched unprecedented October 7 attacks on Israel, resulting in the death of about 1,140 people in Israel, most of them civilians, according to an AFP tally based on official figures.</p><p>Militants also seized about 250 hostages during the attacks, around 132 of whom Israel says remain in Gaza.</p><p>Israel has responded with a relentless bombardment and ground offensive has killed at least 25,105 people, mostly women and children, according to figures from the health ministry in Hamas-run Gaza.</p><p>Musk was due to speak on a panel at 4:00 pm local time (1500 GMT) alongside right-wing political commentator Ben Shapiro.</p><p>The symposium comes shortly before the 79th anniversary of the liberation of the Auschwitz-Birkenau death camp on January 27, a date that has become Holocaust Memorial Day.</p><p>One million European Jews died at the camp build by Nazi Germany in occupied Poland between 1940 and 1945, along with more than 100,000 non-Jews.</p><p>A visit to the site of the former death camp is planned for conference participants on Tuesday.</p><p>- 'Example to others' -</p><p>During a live discussion broadcast on X in September, European Jewish Association chairman Rabbi Menachem Margolin invited Musk to visit Auschwitz.</p><p>Margolin said it would be \"a very strong statement\" and \"could contribute a lot to Holocaust awareness and the struggle to combat anti-Semitism\".</p><p>Musk agreed that it could be \"helpful... as an example to others\".</p><p>Elsewhere in the discussion, Musk described himself as \"aspirationally Jewish\" and said he had attended Hebrew pre-school.</p><p>\"It's absurd to be accused of something when all the evidence points the other direction and my entire life story is in fact pro-semitic,\" he added at the time.</p><p>Musk has threatened to file suit against the Anti-Defamation League, a Jewish advocacy group, over its claims that problematic and racist speech has soared on the site since his takeover.</p><p>X Corp is also currently suing non-profit Media Matters on the grounds that it has driven away advertisers by portraying the site as rife with anti-Semitic content.</p><p>- 'Huge role to play' -</p><p>In a November comment on X, Musk called a post \"the actual truth\" that said Jewish communities advocated a \"dialectical hatred against whites\".</p><p>The post was criticized as echoing a longtime conspiracy theory among White supremacists.</p><p>Musk's statement prompted a flood of departures from X of major advertisers and the White House accused him of \"abhorrent promotion\" of anti-Semitism.</p><p>The social media titan later apologized for what he called \"literally the worst and dumbest post that I've ever done\".</p><p>He said it had been misinterpreted and that he had sought to clarify the remark in subsequent posts to the thread.</p><p>After the controversy, the SpaceX founder visited Israel but said the trip had been planned earlier and was not an \"apology tour\".</p><p>Israel's figurehead President Isaac Herzog told the tech mogul he has \"a huge role to play\" to combat anti-Semitism.</p><p>\"We need to fight it together because on the platforms which you lead, unfortunately, there's a harbouring of a lot of... anti-Semitism,\" Herzog said.</p>"},"pubDate":"Mon, 22 Jan 2024 11:26:08 +0000","guid":"https://www.rawstory.com/musk-to-address-anti-semitism-online-in-poland/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/elon-musk.jpg?id=29989419&width=980"}},{"title":"Looming six-day German train strike to cause massive disruptions","link":"https://www.rawstory.com/looming-six-day-german-train-strike-to-cause-massive-disruptions-2667023146/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51145667&width=980\"/><br/><br/><p>German national railway Deutsche Bahn has warned of massive travel disruptions after the train drivers' union GDL announced a six-day strike against the railway. The strike will begin on Wednesday at 2 am (0100 GMT) and continue until 6 pm on Monday the following week, GDL said in a statement released in the early hours of Monday. Union members at DB Cargo, which is responsible for freight transport, had already been called to strike from 6 pm on Tuesday. Deutsche Bahn said an extremely limited emergency timetable of long-distance trains and local commuter S-Bahn rail service would continue th...</p>"},"pubDate":"Mon, 22 Jan 2024 09:42:51 +0000","guid":"https://www.rawstory.com/looming-six-day-german-train-strike-to-cause-massive-disruptions-2667023146/","category":"Deutschebahn","dc:creator":"DPA International","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51145667&width=980"}},{"title":"Acid attack survivor fronts fashion book in new awareness campaign","link":"https://www.rawstory.com/acid-survivor-fronts-fashion-book-in-new-awareness-campaign/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51144336&width=980\"/><br/><br/><p>By Johnny Cotton and Marie-Louise Gumuchian NIVELLES, Belgium/LONDON (Reuters) - Sitting at her home in the Belgian town of Nivelles, acid attack survivor and campaigner Patricia Lefranc flicks through a sleek book of pictures of her shot by British fashion photographer Rankin. In one, she holds a photo of herself before the devastating 2009 attack by an ex. Others show her in different poses throughout the lookbook, a photo catalogue typically used by fashion brands. “I have learnt to see myself after (the attack). If I had seen this photo of myself five or six years ago I would have been in ...</p>"},"pubDate":"Mon, 22 Jan 2024 00:08:36 +0000","guid":"https://www.rawstory.com/acid-survivor-fronts-fashion-book-in-new-awareness-campaign/","dc:creator":"Reuters UK","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51144336&width=980"}},{"title":"Netanyahu rejects Hamas conditions for hostage deal which include 'outright surrender'","link":"https://www.rawstory.com/netanyahu-rejects-hamas-conditions-for-hostage-deal-which-include-outright-surrender/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51144148&width=980\"/><br/><br/><p>By Emily Rose JERUSALEM (Reuters) -Israeli Prime Minister Benjamin Netanyahu on Sunday rejected conditions presented by Hamas to end the war and release hostages that would include Israel's complete withdrawal and leaving Hamas in power in Gaza. As Israeli planes resumed bombing Khan Younis in the southern Gaza Strip, senior Hamas official Sami Abu Zuhri told Reuters the Israeli leader's refusal to end the military offensive in Gaza \"means there is no chance for the return of the (Israeli) captives.\" \"In exchange for the release of our hostages, Hamas demands the end of the war, the withdrawal...</p>"},"pubDate":"Sun, 21 Jan 2024 21:49:35 +0000","guid":"https://www.rawstory.com/netanyahu-rejects-hamas-conditions-for-hostage-deal-which-include-outright-surrender/","dc:creator":"Reuters UK","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51144148&width=980"}},{"title":"Gaza deaths surpass 25,000, officials say, in ongoing Israeli strikes","link":"https://www.rawstory.com/gaza-deaths-surpass-25000-officials-say-in-ongoing-israeli-strikes-2667018719/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51144055&width=980\"/><br/><br/><p>The number of Palestinians killed in the Gaza Strip since the war between Israel and Hamas erupted on October 7 has passed 25,000, the health officials in the territory said on Sunday. </p><p>The number killed now stands at 25,105 and the number of injured at more than 62,680, the Hamas-run Health Ministry said. </p><p>Within 24 hours, 178 people had been killed in Israeli ground and air attacks on the coastal strip. The figures make no distinction between civilians and fighters. Around 70% of those killed in Gaza are women and children, the ministry said. The figures cannot be independently verified.</p>"},"pubDate":"Sun, 21 Jan 2024 21:12:38 +0000","guid":"https://www.rawstory.com/gaza-deaths-surpass-25000-officials-say-in-ongoing-israeli-strikes-2667018719/","category":["Hamas","Israel","Palestine","Gaza"],"dc:creator":"DPA International","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51144055&width=980"}},{"title":"Russia suspends operations at gas export terminal after suspected Ukrainian drone attack","link":"https://www.rawstory.com/russia-suspends-operations-at-gas-export-terminal-after-suspected-ukrainian-drone/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51143267&width=980\"/><br/><br/><p>\\Novatek, Russia's largest liquefied natural gas producer, said on Sunday it had been forced to suspend some operations at a huge Baltic Sea export terminal due to a fire started by what Ukrainian media said was a drone attack. </p><p>The giant Ust-Luga complex, located on the Gulf of Finland about 170 km (110 miles) west of St. Petersburg, is used to ship oil and gas products to international markets. </p><p>It processes stable gas condensate into light and heavy naphtha, jet fuel, fuel oil and gasoil, according to Novatek's website.</p>"},"pubDate":"Sun, 21 Jan 2024 16:52:22 +0000","guid":"https://www.rawstory.com/russia-suspends-operations-at-gas-export-terminal-after-suspected-ukrainian-drone/","category":["Ukraine","Russia"],"dc:creator":"Reuters","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51143267&width=980"}},{"title":"French warship treats around 1,000 injured Gazans off Egyptian shore","link":"https://www.rawstory.com/french-warship-treats-around-1000-injured-gazans-off-egyptian-shore/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51143186&width=1200&height=600&coordinates=0%2C328%2C0%2C328\"/><br/><br/><p>AL-ARISH, Egypt — About 1,000 people from Gaza have been treated in a French field hospital aboard a ship off the coast of Egypt, its captain said, providing care for some as health infrastructure in the war-devastated enclave collapses. </p><p>The Dixmude, a French helicopter carrier, has been docked in the Egyptian port of al-Arish, 50 km (30 miles) west of the Gaza Strip, since November. </p><p>The vessel is equipped with wards, operating theatres and 70 medical staff.</p>"},"pubDate":"Sun, 21 Jan 2024 15:01:56 +0000","guid":"https://www.rawstory.com/french-warship-treats-around-1000-injured-gazans-off-egyptian-shore/","category":["Gaza","Egypt","France"],"dc:creator":"Reuters UK","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51143186&width=980"}},{"title":"Huge fire erupts at Wild West-themed amusement park in Germany","link":"https://www.rawstory.com/huge-fire-erupts-at-wild-west-themed-amusement-park-in-germany-2667016857/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/image.jpg?id=51142618&width=980\"/><br/><br/><p>A major fire broke out at a Wild West-themed amusement park in southern Germany, injuring two people and causing millions of euros worth of damage, police said. Several wooden buildings went up in flames on Main Street at the Pullman City amusement park in Eging am See, in Bavaria, police said on Sunday. The cause of the early morning fire was not immediately known. About 200 people, including around 180 overnight guests, were able to escape to safety. Pullman City, which fashions itself on the horseback-riding cowboys of the 19th-century American West, covers around 200,000 square metres in E...</p>"},"pubDate":"Sun, 21 Jan 2024 13:12:29 +0000","guid":"https://www.rawstory.com/huge-fire-erupts-at-wild-west-themed-amusement-park-in-germany-2667016857/","category":"Leisure","dc:creator":"DPA International","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/image.jpg?id=51142618&width=980"}},{"title":"Iran-backed militants strike U.S.-led coalition base in Iraq","link":"https://www.rawstory.com/iran-backed-militants-strike-u-s-led-coalition-base-in-iraq/","description":{"#cdata-section":"\n<img src=\"https://www.rawstory.com/media-library/al-asad-airbase-in-iraq-s-anbar-province-photographed-on-july-8-2021-c-ayman-henna-afp-file.jpg?id=51142503&width=1200&height=600&coordinates=0%2C48%2C0%2C49\"/><br/><br/><p>Iran-backed militants launched ballistic missiles at a base hosting U.S. forces in western Iraq, causing one Iraqi and possible American casualties, the US Central Command said Saturday.</p><p>\"Multiple ballistic missiles and rockets were launched by Iranian-backed militants in western Iraq targeting al-Assad Airbase,\" CENTCOM said in a social media post, which placed the time of the attack at 6:30 pm Baghdad time (1530GMT) Saturday evening.</p><p>Most of the projectiles were intercepted by the base's air defense systems but \"others impacted on the base,\" the statement said.</p><p>\"A number of US personnel are undergoing evaluation for traumatic brain injuries. At least one Iraqi service member was wounded,\" it added.</p><p>Since mid-October, there have been dozens of attacks on US and coalition forces in Iraq and Syria, deployed there to fight jihadists of the Islamic State group.</p><p>Most have been claimed by \"Islamic Resistance in Iraq,\" a loose alliance of Iran-linked armed groups that oppose US support for Israel in the Gaza conflict.</p><p>The group said in a press release Saturday that it had carried out the latest attack.</p><p>The use of ballistic missiles marks an escalation in the attacks on US forces in Iraq and Syria, who had previously been targeted with lower-tech rockets and drones.</p><p>Saturday's air base attack comes amid soaring tensions in the Middle East following the outbreak of the Israel-Hamas war on October 7.</p><p>Five members of Iran's Islamic Revolutionary Guard Corps were also killed in a strike Saturday in Damascus that Tehran blamed on Israel, threatening reprisals.</p><p>Last Monday evening, Iran itself launched a deadly strike in northern Iraq's autonomous Kurdistan region, saying it had targeted a site used by \"spies of the Zionist regime (Mossad).\"</p><p>Washington has on several occasions launched strikes of its own, which it has said were to impede further assaults or to prevent imminent attacks.</p><p>According to the Pentagon, dozens of US personnel have been lightly wounded in previous attacks since late October.</p><p>There are roughly 2,500 American troops in Iraq and some 900 in Syria.</p>"},"pubDate":"Sun, 21 Jan 2024 12:42:34 +0000","guid":"https://www.rawstory.com/iran-backed-militants-strike-u-s-led-coalition-base-in-iraq/","dc:creator":"Agence France-Presse","media:content":{"@medium":"image","@type":"image/jpeg","@url":"https://www.rawstory.com/media-library/al-asad-airbase-in-iraq-s-anbar-province-photographed-on-july-8-2021-c-ayman-henna-afp-file.jpg?id=51142503&width=980"}}]}}}