{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:media":"http://search.yahoo.com/mrss/","channel":{"title":"NDTV News-World-news","link":"https://www.ndtv.com","lastBuildDate":{"#cdata-section":"Sun, 28 Jan 2024 10:23:13 +0530"},"language":"en","image":{"title":"NDTV News-World-news","url":"https://www.ndtv.com/common/header/images/ndtv_logo_black.gif","link":"https://www.ndtv.com"},"description":"NDTV.com provides the latest information from and in-depth coverage of India and the world. Find breaking news, India news, top stories, elections, politics, business, cricket, movies, lifestyle, health, live TV, videos, photos and more.","item":[{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/us-presidential-candidate-nikki-haley-recent-target-of-swatting-attack-heres-what-it-means-4945807"},"title":{"#cdata-section":"Nikki Haley Recent Target Of 'Swatting' Attack. Here's What It Means"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/us-presidential-candidate-nikki-haley-recent-target-of-swatting-attack-heres-what-it-means-4945807"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 09:26:06 +0530"},"description":{"#cdata-section":"Swatting is the act of contacting police with a false report of an emergency."},"content:encoded":{"#cdata-section":"<p>The South Carolina home of Republican presidential candidate Nikki Haley was the target of a \"swatting\" incident at the end of last month, a new report has said. According to <em>Reuters</em>, a man claimed to have shot a woman and threatened to harm himself at Ms. Haley's home in Kiawah Island on December 30. Ms Haley, who previously served as South Carolina's governor, and her family were not home at the time of the call. It was later deemed as a fake emergency.&nbsp;</p>\r\n\r\n<p>South Carolina state police, the FBI, and Ms Haley's security team were informed of the event. Meanwhile, law enforcement agencies are yet to publicly identify a suspect in the case or make any arrests.&nbsp;</p>\r\n\r\n<h3><strong>What is Swatting?</strong></h3>\r\n\r\n<p>Swatting is the act of contacting police with a false report of an emergency. It involves&nbsp;anonymous people using the addresses of public figures when calling 911 to report fake violent incidents, like murder, and shootings.&nbsp;The goal of the false police report is to elicit a SWAT team response by the police to the target's home.</p>\r\n\r\n<p>The incident is the latest in a string of 'swatting' attempts targeting high-profile national figures.&nbsp;Rep. <a href=\"https://www.nbcnews.com/politics/congress/police-confirm-christmas-swatting-incident-marjorie-taylor-greenes-hou-rcna131131\">Marjorie Taylor Greene </a>was also targeted by a swatting attempt on Christmas, just days before Ms Haley's home was reportedly targeted.&nbsp;<a href=\"https://www.nytimes.com/2024/01/01/us/shenna-bellows-politicians-swatting.html\">Shenna Bellows</a>, Maine's secretary of state who barred Trump from the state's Republican primary ballot, was also singled out in a similar incident.&nbsp;</p>\r\n\r\n<p>Law enforcement experts see 'swatting' as a form of intimidation or harassment that is increasingly being used to target political figures and officials involved in the civil and criminal cases against Trump. As per Reuters, there have been at least 27 swatting incidents of politicians, prosecutors, election officials, and judges since November 2023. Authorities fear more such incidents will occur ahead of this year's presidential election.</p>\r\n\r\n<h3><strong>Nikki Haley vs Donald Trump</strong></h3>\r\n\r\n<p>Notably, Ms Haley is the last standing rival to front-runner Donald Trump in the race to secure the party's nomination to challenge President Joe Biden in November's election.&nbsp;She has lost the first two Republican nominating contests, in Iowa and New Hampshire, but has refused to drop out of the race.&nbsp;</p>\r\n\r\n<p>In recent days, Ms Haley has accused former Trump of being confused and has questioned his ability to be president at his age. Reacting to her attack, Trump on Saturday said he feels \"sharper now than I did 20 years ago.'' The former US President and his allies have also begun a campaign to force Ms Haley out of the race before the next major vote in the primary race, in her home state of South Carolina on February 24.&nbsp;</p>\r\n\r\n<p>According to the&nbsp;<a href=\"https://www.washingtonpost.com/politics/2024/01/22/trump-leads-new-hampshire-post-monmouth-poll/\"><em>Washington Post</em></a>&nbsp;polls, Donald Trump commands a significant lead with 52% support, while former South Carolina Governor Nikki Haley trails at 34% in the presidential race.</p>\r\n\r\n<p></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2018-09/e2vph3o8_nikki-haley-reuters_625x300_21_September_18.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The case remains under investigation"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/pak-ex-pm-imran-khans-party-to-hold-major-power-show-today-after-may-9-violence-4945805"},"title":{"#cdata-section":"Imran Khan's Party To Hold Major 'Power Show' Today After May 9 Violence"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/pak-ex-pm-imran-khans-party-to-hold-major-power-show-today-after-may-9-violence-4945805"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 09:23:49 +0530"},"description":{"#cdata-section":"Pakistan Tehreek-e-Insaf (PTI) will hold its first countrywide 'power show', after May 9, today on Sunday, on the call of incarcerated Prime Minister and party founder Imran Khan, Dawn reported."},"content:encoded":{"#cdata-section":"<p>Pakistan Tehreek-e-Insaf (PTI) will hold its first countrywide 'power show', after May 9, today on Sunday, on the call of incarcerated Prime Minister and party founder Imran Khan, Dawn reported.</p>\r\n\r\n<p>\"We have given clear directions to ticket holders to come out at 2 pm and hold rallies and public meetings in their constituencies. They will address the voters and give a message that PTI will not allow anyone to take its space,\" the party's Central Information Secretary Raoof Hasan said.</p>\r\n\r\n<p>The party will also launch its 158-page manifesto covering all major issues of Pakistan on Sunday.</p>\r\n\r\n<p>Earlier this week, founding chairman Imran Khan directed all the ticket holders to come out to the streets and roads on Sunday across the country. He warned that the tickets of those who will not hold rallies will be cancelled, as reported by Dawn.</p>\r\n\r\n<p>Later, the former prime minister's sister also spoke to media people and conveyed the message to party workers and ticket holders through the media.</p>\r\n\r\n<p>The announcement triggered panic among a number of ticket holders, as they were already hiding at different places to avoid their arrest. They fear that a number of them will be arrested on Sunday.</p>\r\n\r\n<p>However, Mr Hasan said that a message had been conveyed to all the leadership to hold rallies across the country without fear of arrest.</p>\r\n\r\n<p>\"They might be arrested but we believe that it will not affect their election campaign. In fact, they may get more votes [of sympathy] as voters will be observing all that is happening with the PTI. We have also released a video message in that regard,\" he said.</p>\r\n\r\n<p>Replying to a question, Mr Hasan agreed that although Section 144 was not imposed since other parties were holding public meetings, PTI workers might be arrested.</p>\r\n\r\n<p>On May 9, last year, PTI workers held protests across the country after the arrest of Imran Khan from the Islamabad High Court. The protest, however, turned into riots with some mobs found attacking military installations.</p>\r\n\r\n<p>On Saturday, PTI ticket holders held a virtual convention and suggested the masses cast their votes in their favour.</p>\r\n\r\n<p>Throughout the convention, efforts were made to reach the masses on how they could learn about the symbol and candidate supported by the PTI in their constituency after the party had been deprived of its symbol 'bat' and all the ticket holders had been contesting election as independent candidates.</p>\r\n\r\n<p>The convention was moderated by PTI social media heads Jibran Ilyas and Ali Malik. At around 8:30 pm, around 2,400 persons were watching the convention on PTI's official YouTube channel. At 9 pm, their number rose to 3,400, and 4,000 at 10:30 pm, Dawn reported.</p>\r\n\r\n<p>Mr Khan's message was also run during the convention. He said the dream was to make a state like 'Riyasat-i-Madina', where there should be justice in the country. He said that if justice and merit were ensured, no one would have to go out of the country to find jobs.</p>\r\n\r\n<p></p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/5gkcbqjg_imran-khan_625x300_23_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The party will also launch its 158-page manifesto covering all major issues of Pakistan (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/revolutionary-changes-taking-place-in-india-us-relation-outgoing-envoy-taranjit-singh-sandhu-4945796"},"title":{"#cdata-section":"\"Revolutionary Changes Taking Place In India-US Relation\": Outgoing Envoy"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/revolutionary-changes-taking-place-in-india-us-relation-outgoing-envoy-taranjit-singh-sandhu-4945796"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 09:21:23 +0530"},"description":{"#cdata-section":"Revolutionary changes are taking place in the India-US relationship, the outgoing Indian Ambassador here, Taranjit Singh Sandhu has said, stressing that the bilateral ties have only covered the tip of the iceberg and are going to go far and wide."},"content:encoded":{"#cdata-section":"<p>Revolutionary changes are taking place in the India-US relationship, the outgoing Indian Ambassador here, Taranjit Singh Sandhu has said, stressing that the bilateral ties have only covered the tip of the iceberg and are going to go far and wide.</p>\r\n\r\n<p>Addressing a gathering of Indian Americans at the Republic Day celebration here, Mr Sandhu said it is important that their second generation remains connected to India.</p>\r\n\r\n<p>\"I only wanted to tell you that today revolutionary changes are taking place in India, also in US-India relations,\" he said, \"And therefore it is important that your children and your families are aware of India, stay connected with India,\" Mr Sandhu, who retires later this month from the foreign service after more than 35 years, said As international capital and multinational companies move into India, all the young Indian Americans will be uniquely placed to get most of those job opportunities, Mr Sandhu said.</p>\r\n\r\n<p>\"So therefore, not only for emotional, cultural, and so many other reasons but also for economic and commercial reasons, pay attention, stay connected with India,\" Mr Sandhu said.</p>\r\n\r\n<p>The event in McLean, Virginia was organised by the National Council of Asian Indian Associations. The outgoing ambassador was also felicitated by the community leaders for his role in strengthening the India-US relationship.</p>\r\n\r\n<p>Mr Sandhu speaking at another farewell reception organised by the Indian American Business Impact Group said that the India-US relationship has so far only touched the tip of an iceberg.</p>\r\n\r\n<p>\"The fact is, we have only covered the tip of the iceberg. In all these sectors, this relationship is going to go far and wide,\" he said.</p>\r\n\r\n<p>\"We are already hearing about AI, the different dimensions of AI (Artificial intelligence). India is going to play a very, very important and critical role. Look at any of the International Monetary Fund or World Bank projections, the recovery of the world economy, India will be playing a very critical role,\" he said.</p>\r\n\r\n<p>Mr Sandhu reiterated that for the career prospects, jobs and growth of their kids, Indian Americans should remain connected to India.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2023-04/dt2hbjvg_taranjit-singh-sandhuindias-ambassador-to-the-us-_625x300_10_April_23.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Mr Sandhu said it is important that their second generation remains connected to India."}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/seoul-says-north-korea-fires-multiple-cruise-missiles-4945632"},"title":{"#cdata-section":"Seoul Says North Korea Fired Multiple Cruise Missiles Amid Rising Tensions"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/seoul-says-north-korea-fires-multiple-cruise-missiles-4945632"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 08:37:47 +0530"},"description":{"#cdata-section":"North Korea fired several cruise missiles on Sunday, Seoul's military said, the latest in a series of tension-raising moves by the nuclear-armed state."},"content:encoded":{"#cdata-section":"<p>North Korea fired several cruise missiles on Sunday, Seoul's military said, the latest in a series of tension-raising moves by the nuclear-armed state.</p>\r\n\r\n<p>The launch comes just days after Pyongyang fired multiple cruise missiles toward the Yellow Sea, which it said was a first test of a new generation of strategic cruise missiles.</p>\r\n\r\n<p>Pyongyang has accelerated weapons testing in the new year, including tests of what it called an \"underwater nuclear weapon system\" and a solid-fuelled hypersonic ballistic missile.</p>\r\n\r\n<p>\"Our military detected several unidentified cruise missiles fired near waters around North Korea's Sinpo area at 8:00 am (2300 GMT) today,\" the Joint Chiefs of Staff said in a statement.</p>\r\n\r\n<p>The JCS said the launch was under analysis by South Korean and US intelligence authorities, adding it was \"closely monitoring North Korea's additional movements and activities.\"</p>\r\n\r\n<p>Unlike their ballistic counterparts, the testing of cruise missiles is not banned under current UN sanctions against Pyongyang.</p>\r\n\r\n<p>Cruise missiles tend to be jet-propelled and fly at a lower altitude than more sophisticated ballistic missiles, making them harder to detect and intercept.</p>\r\n\r\n<p>On Thursday, North Korea said it had carried out its first test of a new generation of strategic cruise missiles it is developing, the Pulhwasal-3-31 a day earlier.</p>\r\n\r\n<p>The test was \"a process of constant updating of the weapon system and a regular and obligatory activity,\" the state news agency KCNA said. It did not specify how many missiles were fired.</p>\r\n\r\n<p>\"The test-fire had no impact on the security of neighboring countries and has nothing to do with the regional situation,\" the agency said.</p>\r\n\r\n<h2>Deteriorating ties</h2>\r\n\r\n<p>Recent months have seen a sharp deterioration in ties between the two Koreas, with both sides jettisoning key tension-reducing agreements, ramping up frontier security, and conducting live-fire drills along the border.</p>\r\n\r\n<p>Earlier this month, North Korean leader Kim Jong Un declared the South his country's \"principal enemy\", jettisoned agencies dedicated to reunification and outreach and threatened war over \"even 0.001 mm\" of territorial infringement.</p>\r\n\r\n<p>In Seoul, President Yoon Suk Yeol told his cabinet that should the nuclear-armed North carry out a provocation, South Korea would hit back with a response \"multiple times stronger\", pointing to his military's \"overwhelming response capabilities\".</p>\r\n\r\n<p>At Pyongyang's year-end policy meetings, Kim threatened a nuclear attack on the South and called for a build-up of his country's military arsenal ahead of armed conflict he warned could \"break out any time\".</p>\r\n\r\n<p>In January, the North launched a solid-fuel hypersonic missile, just days after Pyongyang staged live-fire exercises near the country's tense maritime border with South Korea, which prompted counter-exercises and evacuation orders for some border islands belonging to the South.</p>\r\n\r\n<p>Kim also successfully put a spy satellite into orbit late last year, after receiving what Seoul said was Russian help, in exchange for arms transfers for Moscow's war in Ukraine.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2022-02/57lrbkek_north-korea-missile-generic_625x300_07_February_22.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190"}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/los-alerces-national-park-fire-out-of-control-fire-breaks-out-in-argentinas-unesco-world-heritage-site-park-4945066"},"title":{"#cdata-section":"\"Out Of Control\" Fire Breaks Out In Argentina's Los Alerces National Park"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/los-alerces-national-park-fire-out-of-control-fire-breaks-out-in-argentinas-unesco-world-heritage-site-park-4945066"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 05:16:51 +0530"},"description":{"#cdata-section":"Firefighters in Argentina were battling an \"out of control\" blaze in a national park in Patagonia on Saturday, struggling to keep it from reaching two nearby towns."},"content:encoded":{"#cdata-section":"<p>Firefighters in Argentina were battling an \"out of control\" blaze in a national park in Patagonia on Saturday, struggling to keep it from reaching two nearby towns.</p>\r\n\r\n<p>The fire in Los Alerces National Park -- a UNESCO World Heritage Site -- has already charred about 600 hectares (1500 acres).</p>\r\n\r\n<p>\"The fire is out of control,\" said Mario Cardenas, head of the park's fire, communications and emergency department.</p>\r\n\r\n<p>Conditions are \"unfavorable because we still have a lot of wind and high temperatures. This makes our work very difficult,\" he said.</p>\r\n\r\n<p>Temperatures in Patagonia, a normally cold and windy region in Argentina's far south, have topped 40 degrees Celsius (104 Fahrenheit) in the southern hemisphere summer, with two provinces declaring states of emergency due to fire risk until April.</p>\r\n\r\n<p>Chubut province rescue workers were trying to block flames from reaching the towns of Esquel and Trevelin, about 2,000 kilometers (1,242 miles) southwest of Buenos Aires.</p>\r\n\r\n<p>Los Alerces Park features glacier-carved landscapes including rivers and lakes, and pristine forests of alerce trees, the second-longest living tree species in the world.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/v0gdt4oo_los-alerces-national-park-fire_625x300_28_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Rescue workers were trying to block flames from reaching the towns of Esquel and Trevelin"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/amid-war-with-russia-ukraine-uncovers-40-million-fraud-in-weapons-procurement-4945065"},"title":{"#cdata-section":"Amid War, Ukraine Uncovers $40 Million Fraud In Weapons Procurement"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/amid-war-with-russia-ukraine-uncovers-40-million-fraud-in-weapons-procurement-4945065"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 05:11:46 +0530"},"description":{"#cdata-section":"Ukraine's SBU security service said on Saturday it had uncovered a corruption scheme in the purchase of arms by the country's military totalling the equivalent of about $40 million."},"content:encoded":{"#cdata-section":"<p>Ukraine's SBU security service said on Saturday it had uncovered a corruption scheme in the purchase of arms by the country's military totalling the equivalent of about $40 million.</p>\r\n\r\n<p>The announcement of mass procurement fraud, confirmed by Ukraine's Defence Ministry, will have a huge resonance in a country beleaguered by Russia's nearly two-year-old invasion.</p>\r\n\r\n<p>The fight to root out endemic corruption remains a major issue as Ukraine presses its bid to secure membership in the European Union.</p>\r\n\r\n<p>The SBU said an investigation had \"exposed officials of the Ministry of Defence and managers of arms supplier Lviv Arsenal, who stole nearly 1.5 billion hryvnias in the purchase of shells.\"</p>\r\n\r\n<p>\"According to the investigation, former and current high-ranking officials of the Ministry of Defence and heads of affiliated companies are involved in the embezzlement.\"</p>\r\n\r\n<p>The embezzlement, it said, involved the purchase of 1,00,000 mortar shells for the military.</p>\r\n\r\n<p>The SBU said a contract for the shells was clinched with Lviv Arsenal in August 2022 - six months into the war - and payment was made in advance, with some funds transferred abroad.</p>\r\n\r\n<p>But no arms were ever provided, the statement said, with some funds then moved to other foreign accounts.</p>\r\n\r\n<p>The statement said five individuals had been served \"notices of suspicion\" - the first stage in Ukrainian legal proceedings - both in the ministry and the arms supplier. One suspect, it said, was detained while trying to cross the Ukrainian border.</p>\r\n\r\n<p>Corruption within the military has been a particularly sensitive issue in Ukraine as it tries to maintain wartime public morale and present its case to join the 27-nation EU.</p>\r\n\r\n<p>Defence Minister Oleksii Reznikov was dismissed last September over various corruption cases despite enjoying a solid reputation in representing Ukraine in its discussions with Western allies.</p>\r\n\r\n<p>Although he was not alleged to have engaged personally in corruption, several cases hit the military under his stewardship, one for supplying troops with food, another over procuring suitable clothing for servicemen.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/2rcgb0fg_ukraine-weapons-_625x300_28_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The embezzlement involved the purchase of 1,00,000 mortar shells for the military (Representational)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/france-farmers-protests-french-farmers-vow-paris-siege-in-pay-conditions-battle-4944841"},"title":{"#cdata-section":"French Farmers Vow Paris 'Siege' In Pay, Conditions Battle"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/france-farmers-protests-french-farmers-vow-paris-siege-in-pay-conditions-battle-4944841"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 03:54:59 +0530"},"description":{"#cdata-section":"Farmers' leaders in the Paris region on Saturday promised to mount a \"siege\" on the French capital next week to pressure the government into meeting their demands on pay, tax and regulations."},"content:encoded":{"#cdata-section":"<p>Farmers' leaders in the Paris region on Saturday promised to mount a \"siege\" on the French capital next week to pressure the government into meeting their demands on pay, tax and regulations.</p>\r\n\r\n<p>On Monday afternoon, farmers from all the regions around Paris belonging to the FNSEA farmers' union or the Jeunes Agriculteurs (\"Young Farmers\"), \"will begin an indefinite siege of the capital,\" they announced.</p>\r\n\r\n<p>The two unions represent most farmers throughout the country.</p>\r\n\r\n<p>\"All the major roads leading to the capital will be occupied by farmers\", they added.</p>\r\n\r\n<p>Farmers from the Lot-et-Garonne, one of the hotspots of the protest movement in southern France, had already announced their intention to \"go to Paris\" on Monday.</p>\r\n\r\n<p>They intend to block the massive Rungis wholesale food market south of the capital.</p>\r\n\r\n<p>French farmers are furious at what they say is a squeeze on purchase prices for produce by supermarket and industrial buyers, as well as complex environmental regulations.</p>\r\n\r\n<p>But the last straw for many was the phasing out of a tax break on diesel for farm equipment.</p>\r\n\r\n<p>Saturday's announcement came the day after French Prime Minister Gabriel Attal announced a number of concessions after farmers blockaded major routes into Paris and in the south of the country.</p>\r\n\r\n<p>\"You wanted to send a message, and I've received it loud and clear,\" said Attal, who is facing his first major crisis as prime minister.</p>\r\n\r\n<p>Attal said the government would \"put an end\" to the rising cost of diesel fuel used for farming machinery, a consequence of tax breaks on the fuel having been phased out.</p>\r\n\r\n<p>There would also be an emergency fund to help cattle farmers battle illnesses among their livestock.</p>\r\n\r\n<p>Early on Saturday, some roadblocks were being lifted and traffic began running normally on motorways.</p>\r\n\r\n<p>But the latest union announcement puts the pressure back on Attal.</p>\r\n\r\n<p>Attal's announcement Friday \"has not calmed the anger, we need to go further\", said FNSEA President Arnaud Rousseau.</p>\r\n\r\n<p>\"We have a government that doesn't care about its farmers,\" said Lucie Delbarre, general secretary of the Pas-de-Calais FDSEA branch.</p>\r\n\r\n<p>\"As you can see, it's a pressure cooker ready to explode.\"</p>\r\n\r\n<p>The demonstrators have also attacked free trade agreements between the European Union and food exporters, especially a deal with the South American bloc Mercosur that is still in the works.</p>\r\n\r\n<p>But farmers appeared to be divided over whether Attal's concessions were enough.</p>\r\n\r\n<p>Farmers across France, the European Union's leading agricultural power, have expressed a mixture of anger and despair.</p>\r\n\r\n<p>One group of protesters hung an effigy of a farmer in overalls from a mock gallows by the A10 motorway west of Paris.</p>\r\n\r\n<p>As the unions made their announcement, Attal's office said the prime minister would visit a cattle farm in the western France region of Indre-et-Loire on Sunday morning.</p>\r\n\r\n<p>The government has been trying to keep discontent among farmers from spreading just months ahead of European Parliament elections, which are seen as a key test for President Emmanuel Macron's government.</p>\r\n\r\n<p>Francois Ruffin, a lawmaker with the left-wing France Unbowed (LFI) party, said the government needed to \"set a course for French agriculture.&nbsp;</p>\r\n\r\n<p>\"We need to tell it what it should be doing: is its aim to compete with factory farms in Brazil or Ukraine, or is its aim to feed the French properly?\" he added.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/j5ku0i68_france-farmers-protests_625x300_28_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Farmers said they \"will begin an indefinite siege\" of Paris on Monday"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/israel-hamas-war-shocking-un-palestinian-agency-after-countries-halt-funds-amid-claims-staff-involved-in-hamas-attack-4944815"},"title":{"#cdata-section":"Countries Halt Funding To UN Agency Amid Claim Staff Helped In Hamas Attack"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/israel-hamas-war-shocking-un-palestinian-agency-after-countries-halt-funds-amid-claims-staff-involved-in-hamas-attack-4944815"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 03:46:26 +0530"},"description":{"#cdata-section":"Six European countries paused funding for the U.N. refugee agency for Palestinians (UNRWA) on Saturday, following allegations that some of its staff were involved in the October 7 Hamas attacks on Israel."},"content:encoded":{"#cdata-section":"<p>Six European countries paused funding for the U.N. refugee agency for Palestinians (UNRWA) on Saturday, following allegations that some of its staff were involved in the October 7 Hamas attacks on Israel.</p>\r\n\r\n<p>Britain, Germany, Italy, the Netherlands, Switzerland and Finland on Saturday joined the United States, Australia and Canada in pausing funding to the aid agency, a critical source of support for people in Gaza, after the allegations by Israel.</p>\r\n\r\n<p>\"Palestinians in Gaza did not need this additional collective punishment,\" Philippe Lazzarini, UNRWA commissioner-general, said on X. \"This stains all of us.\"</p>\r\n\r\n<p>The agency said on Friday it had opened an investigation into several employees and severed ties with those people.</p>\r\n\r\n<p>Encouraging more donor suspensions, Israeli Foreign Minister Israel Katz said UNRWA should be replaced once fighting in the enclave dies down and accused it of ties to Islamist militants in Gaza.</p>\r\n\r\n<p>\"In Gaza's rebuilding, @UNRWA must be replaced with agencies dedicated to genuine peace and development,\" he added on X.</p>\r\n\r\n<p>Deputy U.N. spokesperson Farhan Haq, asked about Katz's remarks, said: \"We are not responding to rhetoric. UNRWA overall had had a strong record, which we have repeatedly underscored.\"</p>\r\n\r\n<p>Lazzarini said the decision by the nine countries threatened its humanitarian work across the region, especially in Gaza.</p>\r\n\r\n<p>\"It is shocking to see a suspension of funds to the Agency in reaction to allegations against a small group of staff, especially given the immediate action that UNRWA took by terminating their contracts and asking for a transparent independent investigation,\" he said in a statement.</p>\r\n\r\n<p>The Palestinian foreign ministry criticised what it described as an Israeli campaign against UNRWA, and Hamas condemned the termination of employee contracts \"based on information derived from the Zionist enemy\".</p>\r\n\r\n<p>UNRWA was set up to help refugees of the 1948 war at Israel's founding and provides education, health and aid services to Palestinians in Gaza, the West Bank, Jordan, Syria, and Lebanon. It helps about two thirds of Gaza's 2.3 million population and has played a pivotal aid role during the war that Israel launched to eliminate Hamas after the Oct. 7 attacks.</p>\r\n\r\n<p>Announcing the investigation, Lazzarini said on Friday that he had decided to terminate the contracts of some staff members to protect the agency's ability to deliver humanitarian assistance.</p>\r\n\r\n<p>Lazzarini did not disclose the number of employees allegedly involved in the attacks, nor the nature of their alleged involvement. He said, however, that \"any UNRWA employee who was involved in acts of terror\" would be held accountable, including through criminal prosecution.</p>\r\n\r\n<p>During weeks of Israeli bombardment of the Palestinian enclave, UNRWA has repeatedly said its capacity to render humanitarian assistance to people in Gaza is on the verge of collapse.</p>\r\n\r\n<p>Hussein al-Sheikh, head of the Palestinians' umbrella political body the Palestine Liberation Organization (PLO), said cutting support to the agency brought major political and relief risks.</p>\r\n\r\n<p>\"We call on countries that announced the cessation of their support for UNRWA to immediately reverse their decision,\" he said on X.</p>\r\n\r\n<p>The Foreign Ministry in Germany, a major donor to UNRWA, welcomed UNRWA's investigation, saying it was deeply concerned about the allegations raised against agency employees.</p>\r\n\r\n<p>\"We expect Lazzarini to make it clear within UNRWA's workforce that all forms of hatred and violence are totally unacceptable and will not be tolerated,\" it said on X.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/smt101bg_gaza-aid_625x300_28_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Six European countries have paused funding for the UN refugee agency for Palestinians"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/us-begins-talks-with-iraq-on-withdrawing-foreign-troops-4944736"},"title":{"#cdata-section":"US Begins Talks With Iraq On Withdrawing Foreign Troops"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/us-begins-talks-with-iraq-on-withdrawing-foreign-troops-4944736"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 03:20:08 +0530"},"description":{"#cdata-section":"Iraq and the United States on Saturday held a first round of talks on the future of American and other foreign troops in the country, with Baghdad expecting discussions to lead to a timeline for reducing their presence."},"content:encoded":{"#cdata-section":"<p>Iraq and the United States on Saturday held a first round of talks on the future of American and other foreign troops in the country, with Baghdad expecting discussions to lead to a timeline for reducing their presence.</p>\r\n\r\n<p>Roughly 2,500 US troops are still deployed in Iraq as part of the anti-Islamic State group international coalition formed in 2014 -- the year the jihadist group overran swathes of Iraq and neighbouring Syria.</p>\r\n\r\n<p>But after the Israel-Hamas war began in October US-led coalition forces in Iraq and Syria have faced frequent attacks by Iran-aligned groups, leading to US retaliatory strikes and Iraqi complaints of American \"aggression\" against its territory.</p>\r\n\r\n<p>The volatile situation has pushed Iraq's prime minister -- whose government relies on the support of Iran-aligned parties -- to call for the coalition to leave, although talks had been planned since an initial meeting in Washington in August.</p>\r\n\r\n<p>On Saturday a \"one-way drone attack\" targeted the Ain al-Assad base, where coalition troops are stationed in Iraq's western Anbar province, a US military official told AFP.</p>\r\n\r\n<p>An Iraqi security official confirmed the drone attack, with the US official saying it was not immediately clear whether it had led to any casualties or damage.</p>\r\n\r\n<p>Earlier the office of Prime Minister Mohamed Shia al-Sudani issued a photograph of him with top-ranking officials from both the Iraqi armed forces and the US-led coalition.</p>\r\n\r\n<p>Their joint commission \"started its work today, in Baghdad, to review the mission of the Global Coalition against Daesh,\" Sudani's office said in a statement, using an Arabic acronym for IS. &nbsp;</p>\r\n\r\n<p>\"Military experts will oversee ending the military mission of the Global Coalition against Daesh, a decade after its initiation and after its successful achievement of its mission in partnership with Iraqi security and military forces.\"</p>\r\n\r\n<p>Sudani's foreign affairs adviser, Farhad Alaaldin, told AFP that the talks \"and whatever progress made will determine the length of these negotiations.&nbsp;</p>\r\n\r\n<p>\"Iraq is engaging the other countries taking part in the international coalition for bilateral agreements that serves the best interest of Iraq and these countries,\" Alaaldin said.</p>\r\n\r\n<p>The US-led coalition said in a statement that Saturday's meeting was part of the process to \"assess progress in the coalition's primary Defeat-Daesh mission, as well as discuss future adjustments to the coalition's mission and presence in Iraq\".</p>\r\n\r\n<p>The joint military commission \"will work to set the conditions to transition the mission in Iraq\", it added.</p>\r\n\r\n<p>On Thursday, Washington had said it agreed with Baghdad on the launch of \"expert working groups of military and defence professionals\" as part of the joint commission set up in agreement with Baghdad.</p>\r\n\r\n<p>The three working groups would examine \"the level of threat posed by ISIS, operational and environmental requirements, and strengthening the growing capabilities of the Iraqi security forces,\" Sudani's office said.&nbsp;</p>\r\n\r\n<p>US Pentagon deputy press secretary Sabrina Singh had acknowledged that the US military footprint in Iraq \"will certainly be part of the conversations as it goes forward\".</p>\r\n\r\n<p>Iraq's foreign ministry sees the eventual formulation of \"a specific and clear timeline... and to begin the gradual reduction of its (the coalition's) advisers on Iraqi soil\".</p>\r\n\r\n<p>There have been more than 150 attacks targeting coalition troops since mid-October, many of them claimed by the Islamic Resistance in Iraq, a loose alliance of Iran-linked groups that oppose US support for Israel in its war with Hamas in Gaza.</p>\r\n\r\n<p>In 2014, IS declared a \"caliphate\" which they ruled with brutality before their defeat in Iraq in late 2017 by Iraqi forces backed by the US-led coalition. However, jihadist cells still stage sporadic attacks on the army and police.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/1rno2l0o_usiraq-troops-talks_625x300_28_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Iraq PM held talks with top-ranking officials from both the Iraqi armed forces and the US-led coalition"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/india-has-become-incredibly-dynamic-philanthropic-market-bill-and-melinda-gates-foundation-ceo-mark-suzman-4944506"},"title":{"#cdata-section":"India Has Become Incredibly Dynamic Philanthropic Market: Gates Foundation"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/india-has-become-incredibly-dynamic-philanthropic-market-bill-and-melinda-gates-foundation-ceo-mark-suzman-4944506"},"pubDate":{"#cdata-section":"Sun, 28 Jan 2024 01:58:24 +0530"},"description":{"#cdata-section":"CEO of the Bill and Melinda Gates Foundation Mark Suzman has said that India has become an incredible exception in economic growth and dynamic philanthropic market."},"content:encoded":{"#cdata-section":"<p>CEO of the Bill and Melinda Gates Foundation Mark Suzman has said that India has become an incredible exception in economic growth and dynamic philanthropic market.</p>\r\n\r\n<p>In an exclusive interview with the news agency ANI, CEO Suzman said, \"We have a range of other partners in India as well, and India has become an incredibly dynamic philanthropic market. It's another area that's seen growth. I think the annual growth in philanthropic giving outpaces overall economic growth, which is great to see. We hope that can happen at an even greater scale, because we think it is an incredible model to the world, and it's been very encouraging.\"</p>\r\n\r\n<p>He said that this time, the investment will be twofold.</p>\r\n\r\n<p>He said, \"The focus is twofold. One is essentially announcing our new budget of $8.6 billion, but announcing it in the context of the big, growing global needs. India these days is an exception in terms of the economic growth and dynamism that is underway and the significant improvements we've been seeing in healthcare and poverty reduction. In fact, many other parts of the world are getting poorer, and have not yet recovered their per capita income to their pre-COVID levels.\"</p>\r\n\r\n<p>\"A big part of my letter is a call to action to increase the spending and resources on interventions, health interventions, AI interventions, and agricultural interventions. It's specifically a call not just on governments, but also on philanthropists because one group of people that have done comparatively well over the last decade are the world's billionaires,\" Mark Suzman added.</p>\r\n\r\n<p>According to the Bill and Melinda Gates Foundation website, it works to help all people lead healthy, productive lives, guided by the belief that every life has equal value.</p>\r\n\r\n<p>In developing countries, it focuses on improving people's health and giving them the chance to lift themselves out of hunger and extreme poverty.</p>\r\n\r\n<p>Based in Seattle, Washington, the foundation is led by CEO Mark Suzman, under the direction of co-chairs Bill Gates and Melinda French Gates and the board of trustees.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/mingrnig_mark-suzman_625x300_28_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190"}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/on-camera-rahat-fateh-ali-khan-thrashes-student-with-shoe-then-clarifies-4944151"},"title":{"#cdata-section":"On Camera, Rahat Fateh Ali Khan Thrashes Student With Shoe, Then Clarifies"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/on-camera-rahat-fateh-ali-khan-thrashes-student-with-shoe-then-clarifies-4944151"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 23:55:07 +0530"},"description":{"#cdata-section":"Iconic Pakistani singer Rahat Fateh Ali Khan today sought to play down a viral video that purportedly showed him mercilessly thrashing a man with his shoe, who he claimed was his disciple."},"content:encoded":{"#cdata-section":"<p>Iconic Pakistani singer Rahat Fateh Ali Khan today sought to downplay a viral video that purportedly showed him mercilessly thrashing a man with his shoe, who he claimed was his disciple.</p>\r\n\r\n<p>The video shows the popular Qawwali singer repeatedly hitting and slapping him while enquiring about a \"bottle\". The man is seen pleading with the singer, saying he has no idea about it. In another scene, some people were seen trying to pull the singer away to save the student.</p>\r\n\r\n<p>Samaa TV, a Pakistani broadcaster, identified the man as his employee and said such violent behaviour among singers is a worrying trend.</p>\r\n\r\n<blockquote class=\"twitter-tweet\">\r\n<p dir=\"ltr\" lang=\"en\">Pakistani singer Rahat Fateh Ali khan was caught abusing his servant. Later, he gave an explanation. <a href=\"https://t.co/PC0DawSEsq\">pic.twitter.com/PC0DawSEsq</a></p>\r\n— Брат (@B5001001101) <a href=\"https://twitter.com/B5001001101/status/1751302493043384698?ref_src=twsrc%5Etfw\">January 27, 2024</a></blockquote>\r\n\r\n<p>Mr Khan, nephew of legendary Qawwali singer Nusrat Fateh Ali Khan, later clarified that it was a personal matter between an \"<em>ustad </em>and his <em>shagird </em>(teacher and disciple)\". He posted a video featuring the man who was seen being beaten up, as well as his father, to clarify his actions.</p>\r\n\r\n<p>\"This is about a personal issue between an <em>ustad </em>and <em>shagird</em>. He is like my son. This is how the relation is between a teacher and his disciple. If a disciple does something good, I shower my love on him. If he does something wrong, he is punished,\" he said in the video.</p>\r\n\r\n<p>Rahat Fateh Ali Khan said he had also apologised to him after the incident.</p>\r\n\r\n<p>In the clarification video, the man who was beaten admitted he had misplaced a bottle containing holy water - which led to the incident, but clarified there was no ill-intention behind his actions. \"He's like my father. He loves us a lot. Whoever spread this video is trying to defame my <em>ustad</em>,\" he added.</p>\r\n\r\n<p>His father also supported Mr Khan, highlighting the relation between the '<em>ustad </em>and <em>shagird</em>' in the field of Qawwali.</p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/1sn0e8no_rahat-fateh-ali-khan-beats-student_625x300_27_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Rahat Fateh Ali Khan said the man who was seen being beaten was like his son."}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/pakistan-general-election-nawaz-sharif-promises-message-of-peace-to-india-in-party-manifesto-4943961"},"title":{"#cdata-section":"Nawaz Sharif Promises \"Message Of Peace\" To India In Party Manifesto"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/pakistan-general-election-nawaz-sharif-promises-message-of-peace-to-india-in-party-manifesto-4943961"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 23:03:12 +0530"},"description":{"#cdata-section":"Focus on bringing Pakistan's economy back on track, the message of peace to India, a vow to combat climate change, and zero-tolerance towards terrorism are the highlights of  manifesto unveiled by former prime minister Nawaz Sharif's party."},"content:encoded":{"#cdata-section":"<p>Focus on bringing Pakistan's economy back on track, the message of peace to India, a vow to combat climate change, and zero-tolerance towards terrorism are the highlights of the manifesto unveiled by former prime minister Nawaz Sharif's party on Saturday.</p>\r\n\r\n<p>With less than two weeks before the February 8 general elections, Nawaz Sharif's Pakistan Muslim League-Nawaz's (PML-N) manifesto promises to send a \"message of peace\" to other countries, including India, on the condition that New Delhi revert its August 2019 action on Kashmir, Dawn.com reported, quoting the manifesto.</p>\r\n\r\n<p>India has told Pakistan that Jammu and Kashmir is an inalienable and integral part of the country. Article 370, which was abrogated by India's Parliament in 2019, is entirely a matter of India as well as its Constitution, the Ministry of External Affairs has reiterated previously.</p>\r\n\r\n<p>The manifesto also vows to combat the impacts of climate change and a \"zero-tolerance policy\" towards terrorism, it said.</p>\r\n\r\n<p>The other agendas on the PML-N's table include a \"secured water future\" and \"add life to the economy through exports\".</p>\r\n\r\n<p>Released at a special event here in the provincial capital of Punjab, the PML-N later shared the detailed manifesto titled 'Pakistan ko Nawaz do' on its official X account.</p>\r\n\r\n<p>\"If voted to power, the party vowed to provide the public with cheap and increased electricity as well as speedy development. Its promises include a 20 to 30 per cent reduction in power bills, a 15,000 megawatt-increase in electricity production, and a 10,000 MW production of solar energy,\" the Dawn newspaper reported.</p>\r\n\r\n<p>The party has vowed to ensure youth representation in national politics through parliament, and provincial and local governments and also said, it aims to restore student unions, expand the National Youth Scheme, allocate funds for IT start ups and increase youth entrepreneurship.</p>\r\n\r\n<p>It also promised to establish Pakistan's first sports university and 250 stadiums and academies along with youth skills development.</p>\r\n\r\n<p>A plan to bring constitutional, legal, judicial and administrative reforms; combating violence against minorities; modernising agriculture, and making women independent apart from introducing a new labour policy to ensure their rights were also mentioned in the document.</p>\r\n\r\n<p>The other promises include the abolition of the National Accountability Bureau and bringing in comprehensive amendments to the Civil Procedure Code, 1908, and Criminal Procedure Code, 1898 to standardise the procedural laws.</p>\r\n\r\n<p>The manifesto also said court proceedings will be telecast live if the party is elected, according to The News International newspaper.</p>\r\n\r\n<p>Nawaz Sharif termed it a \"strange coincidence\" that despite him being ousted as the prime minister in 2017 and \"political vendettas\" against the PML-N, his party members were once again \"preparing to contest elections and presenting their manifesto.\" The former three-time prime minister also added that he neither intended to \"express his grievances\" nor was \"in a mood to complain today.\" In an indirect reference to former prime minister Imran Khan, he said, \"If I was there in the previous government instead of the person who you saw, I would have never done what he did.\" Criticising the Pakistan Tehreek-e-Insaf party that formed a government following the 2018 elections, Nawaz Sharif said Imran Khan's regime broke the poor people's back through inflation and cut off the electricity. Nawaz Sharif claimed that electricity was never cut off during his rule.</p>\r\n\r\n<p>Nawaz Sharif also recalled the PML-N's previous tenures, saying there was \"no inflation\" back then.</p>\r\n\r\n<p>Pakistan is in economic ruin and awaiting a monumental financial default without long overdue structural reforms sought by global creditors such as the IMF and the World Bank, along with bilateral partners like China and the UAE.</p>\r\n\r\n<p>The primary reason behind Pakistan's economic issues is its staggering debt levels, which, as of 2023, amount to nearly USD 125 billion owed to external creditors, with approximately one-third to China.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2019-07/tvnofip8_nawaz-sharif-reuters_625x300_07_July_19.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The other agendas on the PML-N's table include a \"secured water future\" (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/top-boeing-executive-stan-deal-apologises-over-max-9-problem-promises-fixes-4943595"},"title":{"#cdata-section":"Top Boeing Executive Apologises Over MAX 9 Problem, Promises Fixes"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/top-boeing-executive-stan-deal-apologises-over-max-9-problem-promises-fixes-4943595"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 21:47:05 +0530"},"description":{"#cdata-section":"A top Boeing executive has apologized for the problems highlighted by the mid-flight blowout of a door plug on an Alaska Airlines flight and vowed to regain the trust of customers and regulators."},"content:encoded":{"#cdata-section":"<p>A top Boeing executive has apologized for the problems highlighted by the mid-flight blowout of a door plug on an Alaska Airlines flight and vowed to regain the trust of customers and regulators.</p>\r\n\r\n<p>The comments from Stan Deal, CEO of Boeing's commercial plane unit came Friday, just as Alaska began returning its 737 MAX 9 planes to service, weeks after the mid-air emergency focused intense scrutiny on the huge aviation firm.</p>\r\n\r\n<p>\"Our long-term focus is on improving our quality so that we can regain the confidence of our customers, our regulator, and the flying public,\" Deal wrote in a note to staff. \"Frankly, we have disappointed and let them down. We are deeply sorry for the significant disruption and frustration for our customers.</p>\r\n\r\n<p>He added: \"We have to deliver perfect airplanes each and every time.\"</p>\r\n\r\n<p>In the weeks since the incident, Deal said several steps had been taken \"to strengthen quality assurance and controls.\"</p>\r\n\r\n<p>They included adding new levels of quality checks and appointing a retired navy admiral, Kirkland Donald, to oversee an independent review of Boeing's safety and quality practices.</p>\r\n\r\n<p>This week, 10,000 Boeing employees working on 737 MAX production paused their work for a day to discuss ways of improving safety practices, \"a quality stand-down at a scale we have not done before,\" according to Deal.</p>\r\n\r\n<p>Deal added that following Alaska Airlines, United Airlines, Aeromexico, and Turkish Airlines are also set to return their 737 MAX9s to service \"in the coming days.\"</p>\r\n\r\n<p>The US Federal Aviation Administration grounded 171 MAX 9 planes after the January 5 incident, in which a door plug blew out mid-flight.</p>\r\n\r\n<p>While nobody was seriously injured, inspectors have said the episode could have been catastrophic.</p>\r\n\r\n<p>The US Transportation Safety Board (NTSB) has been investigating the incident and is expected to report on its findings next week.</p><p><i>(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/l5q13kco_alaska-airlines-boeing-737-max-9-afp_625x300_25_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"Alaska has begun returning its Boeing 737 MAX 9 planes to service (Representational)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/social-media-post-sparks-renewed-interest-in-nepals-ancient-mustang-caves-4943460"},"title":{"#cdata-section":"Online Post Sparks Renewed Interest In Nepal's Ancient 'Mustang Caves'"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/social-media-post-sparks-renewed-interest-in-nepals-ancient-mustang-caves-4943460"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 21:16:13 +0530"},"description":{"#cdata-section":"Nepal's Mustang Caves, ancient cliff-side dwellings linked to Tibetan Buddhism. These 10,000 caves, perched 150 feet above, hold mysteries of ascetic practices and breathtaking views."},"content:encoded":{"#cdata-section":"<p>High in the Himalayas, nestled within the Mustang district of Nepal, lies a trove of ancient mysteries: the Mustang Caves. Also known as \"Sky Caves,\" these roughly 10,000 enigmatic dwellings cling precariously to cliff faces, some soaring 150 feet above the valley floor. Their inaccessibility has long kept their secrets shrouded in shadows, accessible only to professional climbers and intrepid explorers.</p>\r\n\r\n<p>A recent social media post by user @hiteshbindas reignited curiosity about these archaeological wonders, prompting questions about their origins, purpose, and the potential revelations they hold.</p>\r\n\r\n<blockquote class=\"instagram-media\" data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/Cd7hJn3Mfm9/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"14\" style=\" background:#FFF; border:0; border-radius:3px; box-shadow:0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width:540px; min-width:326px; padding:0; width:99.375%; width:-webkit-calc(100% - 2px); width:calc(100% - 2px);\">\r\n<div style=\"padding:16px;\">\r\n<div style=\" display: flex; flex-direction: row; align-items: center;\">\r\n<div style=\"background-color: #F4F4F4; border-radius: 50%; flex-grow: 0; height: 40px; margin-right: 14px; width: 40px;\"></div>\r\n\r\n<div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center;\">\r\n<div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 100px;\"></div>\r\n\r\n<div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; width: 60px;\"></div>\r\n</div>\r\n</div>\r\n\r\n<div style=\"padding: 19% 0;\"></div>\r\n\r\n<div style=\"display:block; height:50px; margin:0 auto 12px; width:50px;\"><a href=\"https://www.instagram.com/p/Cd7hJn3Mfm9/?utm_source=ig_embed&amp;utm_campaign=loading\" style=\" background:#FFFFFF; line-height:0; padding:0 0; text-align:center; text-decoration:none; width:100%;\" target=\"_blank\"><svg height=\"50px\" version=\"1.1\" viewbox=\"0 0 60 60\" width=\"50px\" xmlns=\"https://www.w3.org/2000/svg\" xmlns:xlink=\"https://www.w3.org/1999/xlink\"><g fill=\"none\" fill-rule=\"evenodd\" stroke=\"none\" stroke-width=\"1\"><g fill=\"#000000\" transform=\"translate(-511.000000, -20.000000)\"><g><path d=\"M556.869,30.41 C554.814,30.41 553.148,32.076 553.148,34.131 C553.148,36.186 554.814,37.852 556.869,37.852 C558.924,37.852 560.59,36.186 560.59,34.131 C560.59,32.076 558.924,30.41 556.869,30.41 M541,60.657 C535.114,60.657 530.342,55.887 530.342,50 C530.342,44.114 535.114,39.342 541,39.342 C546.887,39.342 551.658,44.114 551.658,50 C551.658,55.887 546.887,60.657 541,60.657 M541,33.886 C532.1,33.886 524.886,41.1 524.886,50 C524.886,58.899 532.1,66.113 541,66.113 C549.9,66.113 557.115,58.899 557.115,50 C557.115,41.1 549.9,33.886 541,33.886 M565.378,62.101 C565.244,65.022 564.756,66.606 564.346,67.663 C563.803,69.06 563.154,70.057 562.106,71.106 C561.058,72.155 560.06,72.803 558.662,73.347 C557.607,73.757 556.021,74.244 553.102,74.378 C549.944,74.521 548.997,74.552 541,74.552 C533.003,74.552 532.056,74.521 528.898,74.378 C525.979,74.244 524.393,73.757 523.338,73.347 C521.94,72.803 520.942,72.155 519.894,71.106 C518.846,70.057 518.197,69.06 517.654,67.663 C517.244,66.606 516.755,65.022 516.623,62.101 C516.479,58.943 516.448,57.996 516.448,50 C516.448,42.003 516.479,41.056 516.623,37.899 C516.755,34.978 517.244,33.391 517.654,32.338 C518.197,30.938 518.846,29.942 519.894,28.894 C520.942,27.846 521.94,27.196 523.338,26.654 C524.393,26.244 525.979,25.756 528.898,25.623 C532.057,25.479 533.004,25.448 541,25.448 C548.997,25.448 549.943,25.479 553.102,25.623 C556.021,25.756 557.607,26.244 558.662,26.654 C560.06,27.196 561.058,27.846 562.106,28.894 C563.154,29.942 563.803,30.938 564.346,32.338 C564.756,33.391 565.244,34.978 565.378,37.899 C565.522,41.056 565.552,42.003 565.552,50 C565.552,57.996 565.522,58.943 565.378,62.101 M570.82,37.631 C570.674,34.438 570.167,32.258 569.425,30.349 C568.659,28.377 567.633,26.702 565.965,25.035 C564.297,23.368 562.623,22.342 560.652,21.575 C558.743,20.834 556.562,20.326 553.369,20.18 C550.169,20.033 549.148,20 541,20 C532.853,20 531.831,20.033 528.631,20.18 C525.438,20.326 523.257,20.834 521.349,21.575 C519.376,22.342 517.703,23.368 516.035,25.035 C514.368,26.702 513.342,28.377 512.574,30.349 C511.834,32.258 511.326,34.438 511.181,37.631 C511.035,40.831 511,41.851 511,50 C511,58.147 511.035,59.17 511.181,62.369 C511.326,65.562 511.834,67.743 512.574,69.651 C513.342,71.625 514.368,73.296 516.035,74.965 C517.703,76.634 519.376,77.658 521.349,78.425 C523.257,79.167 525.438,79.673 528.631,79.82 C531.831,79.965 532.853,80.001 541,80.001 C549.148,80.001 550.169,79.965 553.369,79.82 C556.562,79.673 558.743,79.167 560.652,78.425 C562.623,77.658 564.297,76.634 565.965,74.965 C567.633,73.296 568.659,71.625 569.425,69.651 C570.167,67.743 570.674,65.562 570.82,62.369 C570.966,59.17 571,58.147 571,50 C571,41.851 570.966,40.831 570.82,37.631\"></path></g></g></g></svg></a></div>\r\n\r\n<div style=\"padding-top: 8px;\">\r\n<div style=\" color:#3897f0; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:550; line-height:18px;\"><a href=\"https://www.instagram.com/p/Cd7hJn3Mfm9/?utm_source=ig_embed&amp;utm_campaign=loading\" style=\" background:#FFFFFF; line-height:0; padding:0 0; text-align:center; text-decoration:none; width:100%;\" target=\"_blank\">View this post on Instagram</a></div>\r\n</div>\r\n\r\n<div style=\"padding: 12.5% 0;\"></div>\r\n\r\n<div style=\"display: flex; flex-direction: row; margin-bottom: 14px; align-items: center;\">\r\n<div>\r\n<div style=\"background-color: #F4F4F4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(0px) translateY(7px);\"></div>\r\n\r\n<div style=\"background-color: #F4F4F4; height: 12.5px; transform: rotate(-45deg) translateX(3px) translateY(1px); width: 12.5px; flex-grow: 0; margin-right: 14px; margin-left: 2px;\"></div>\r\n\r\n<div style=\"background-color: #F4F4F4; border-radius: 50%; height: 12.5px; width: 12.5px; transform: translateX(9px) translateY(-18px);\"></div>\r\n</div>\r\n\r\n<div style=\"margin-left: 8px;\">\r\n<div style=\" background-color: #F4F4F4; border-radius: 50%; flex-grow: 0; height: 20px; width: 20px;\"></div>\r\n\r\n<div style=\" width: 0; height: 0; border-top: 2px solid transparent; border-left: 6px solid #f4f4f4; border-bottom: 2px solid transparent; transform: translateX(16px) translateY(-4px) rotate(30deg)\"></div>\r\n</div>\r\n\r\n<div style=\"margin-left: auto;\">\r\n<div style=\" width: 0px; border-top: 8px solid #F4F4F4; border-right: 8px solid transparent; transform: translateY(16px);\"></div>\r\n\r\n<div style=\" background-color: #F4F4F4; flex-grow: 0; height: 12px; width: 16px; transform: translateY(-4px);\"></div>\r\n\r\n<div style=\" width: 0; height: 0; border-top: 8px solid #F4F4F4; border-left: 8px solid transparent; transform: translateY(-4px) translateX(8px);\"></div>\r\n</div>\r\n</div>\r\n\r\n<div style=\"display: flex; flex-direction: column; flex-grow: 1; justify-content: center; margin-bottom: 24px;\">\r\n<div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; margin-bottom: 6px; width: 224px;\"></div>\r\n\r\n<div style=\" background-color: #F4F4F4; border-radius: 4px; flex-grow: 0; height: 14px; width: 144px;\"></div>\r\n</div>\r\n\r\n<p style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; line-height:17px; margin-bottom:0; margin-top:8px; overflow:hidden; padding:8px 0 7px; text-align:center; text-overflow:ellipsis; white-space:nowrap;\"><a href=\"https://www.instagram.com/p/Cd7hJn3Mfm9/?utm_source=ig_embed&amp;utm_campaign=loading\" style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:normal; line-height:17px; text-decoration:none;\" target=\"_blank\">A post shared by Hitesh Bindas (@hiteshbindas)</a></p>\r\n</div>\r\n</blockquote>\r\n<script async src=\"//www.instagram.com/embed.js\"></script>\r\n\r\n<p>As reported by <a href=\"https://edition.cnn.com/travel/article/nepal-tibetan-kingdom-mustang/index.html\"><em>CNN</em></a>, reaching Nepal's Mustang region is often likened to discovering the mythical valley of Shangri-La for many travelers. Situated on the edge of the Tibetan plateau, Mustang has been a part of Nepal since the 18th century. Despite its integration, the region has preserved its traditional Tibetan culture in isolation. Formerly known as the independent Kingdom of Lo, Mustang, or Upper Mustang, is characterized by its high-altitude desert with vibrant red and ocher landscapes, deep gorges, and an expansive blue sky. Limited access to the region for travelers was granted in 1991.</p>\r\n\r\n<p>The news portal further mentioned that for centuries, traveling ascetics of the oldest school of Tibetan Buddhism have wandered the valleys of Mustang, using its caves to perform advanced tantric yoga. The deep gorges of Mustang are the perfect setting for those wanting to practice tummo, a form of Tibetan breathing that allows a person to generate heat at high altitude or tackle negative emotions.</p>\r\n\r\n<p>Visitors can hike along narrow cliffs, climb into a cave, and absorb the silence and mesmerizing views of the sky and mountains. Most caves are empty, but some have frescoes and statues inside. Some cave entrances are locked and must be opened by a caretaker from a nearby village. Formerly a vibrant center of Buddhist scholarship and art, Mustang's temples also feature amazing Tibetan art.</p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/4mo78ong_mustang-caves-_625x300_27_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The enigmatic Mustang Caves in Nepal's Mustang region."}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/countries-pause-un-funds-for-gaza-amid-claims-staff-involved-in-october-7-attack-4943420"},"title":{"#cdata-section":"Nations Pause UN Funds For Gaza Amid Claims Staff Involved In Oct 7 Attack"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/countries-pause-un-funds-for-gaza-amid-claims-staff-involved-in-october-7-attack-4943420"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 21:09:06 +0530"},"description":{"#cdata-section":"Britain, Italy, and Finland on Saturday became the latest countries to pause funding for the United Nations refugee agency for Palestinians (UNRWA), following allegations its staff were involved in the Oct. 7 Hamas attacks on Israel."},"content:encoded":{"#cdata-section":"<p>Britain, Italy, and Finland on Saturday became the latest countries to pause funding for the United Nations refugee agency for Palestinians (UNRWA), following allegations its staff were involved in the Oct. 7 Hamas attacks on Israel.</p>\r\n\r\n<p>Set up to help refugees of the 1948 war at Israel's founding, UNRWA provides education, health, and aid services to Palestinians in Gaza, the West Bank, Jordan, Syria, and Lebanon. It helps about two-thirds of Gaza's 2.3 million population and has played a pivotal aid role during the current war.</p>\r\n\r\n<p>The United States, Australia, and Canada had already paused funding to the aid agency after Israel said 12 UNRWA employees were involved in the cross-border attack. The agency has opened an investigation into several employees and severed ties with them.</p>\r\n\r\n<p>The Palestinian foreign ministry criticised what it described as an Israeli campaign against UNRWA, and the Hamas militant group condemned the termination of employee contracts \"based on information derived from the Zionist enemy.\"</p>\r\n\r\n<p>The UK Foreign Office said it was temporarily pausing funding for UNRWA while the accusations were reviewed and noted London had condemned the Oct. 7 attacks as \"heinous\" terrorism.</p>\r\n\r\n<p>\"The Italian government has suspended financing of the UNRWA after the atrocious attack on Israel on October 7,\" Foreign Minister Antonio Tajani said on social media platform X.</p>\r\n\r\n<p>Finland also said it suspended funding.</p>\r\n\r\n<p>Hussein al-Sheikh, head of the Palestinians' umbrella political body the Palestine Liberation Organization (PLO), said cutting support brought major political and relief risks.</p>\r\n\r\n<p>\"We call on countries that announced the cessation of their support for UNRWA to immediately reverse their decision,\" he said on X.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/ddhkvei_gaza_625x300_22_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The UNRWA played a pivotal aid role in Israel's current war on Hamas in Gaza (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/china-says-talks-with-us-in-bangkok-candid-substantive-4942983"},"title":{"#cdata-section":"China Says Talks With US In Bangkok \"Candid, Substantive\""},"link":{"#cdata-section":"https://www.ndtv.com/world-news/china-says-talks-with-us-in-bangkok-candid-substantive-4942983"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 19:35:58 +0530"},"description":{"#cdata-section":"China on Saturday said that top diplomat Wang Yi and US National Security Advisor Jake Sullivan held \"candid, substantive and fruitful\" talks in Thailand's capital Bangkok, where issues including Taiwan were discussed."},"content:encoded":{"#cdata-section":"<p>China on Saturday said that top diplomat Wang Yi and US National Security Advisor Jake Sullivan held \"candid, substantive and fruitful\" talks in Thailand's capital Bangkok, where issues including Taiwan were discussed.</p>\r\n\r\n<p>Beijing and Washington have clashed in recent years on flashpoint issues from technology and trade to human rights, as well as over the self-ruled island and competing claims in the South China Sea.</p>\r\n\r\n<p>In a bid to improve some of the worst relations in decades, US President Joe Biden met Chinese counterpart Xi Jinping in San Francisco in November for talks that both sides described as a qualified success.</p>\r\n\r\n<p>Wang and Sullivan \"had candid, substantive and fruitful strategic communication on implementing the consensus reached at the San Francisco meeting... and on properly handling important and sensitive issues in China-US relations\", a statement on China's foreign ministry website released Saturday evening said.</p>\r\n\r\n<p>The topics discussed in the two-day talks included Taiwan, which held elections this month.</p>\r\n\r\n<p>In the run-up to the poll, Chinese officials slammed President-elect Lai Ching-te as a dangerous separatist who would take Taiwan down the \"evil path\" of independence.</p>\r\n\r\n<p>But Washington congratulated Lai, with Beijing saying it \"strongly deplored\" the statement.</p>\r\n\r\n<p>During the latest talks, Wang stressed that Taiwan was \"China's internal affair and the regional election in Taiwan cannot change the basic reality that Taiwan is part of China\", according to Saturday's statement.</p>\r\n\r\n<p>\"The biggest risk to peace and stability across the Taiwan Strait is the so-called 'Taiwan independence' movement. The biggest challenge to China-US relations is also the 'Taiwan independence' movement,\" it added.</p><p><i>(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2019-12/d9saa0ag_us-china-flag-reuters_625x300_30_December_19.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"US, China spoke about Taiwan, where polls were held this month (Representational)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/iran-gunmen-kill-9-foreigners-near-pak-border-days-after-missile-strikes-report-4942628"},"title":{"#cdata-section":"Iran Gunmen Kill 9 Pakistanis Near Border Days After Missile Hits: Envoy"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/iran-gunmen-kill-9-foreigners-near-pak-border-days-after-missile-strikes-report-4942628"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 18:26:12 +0530"},"description":{"#cdata-section":"Gunmen in southeastern Iran killed nine people Saturday, Iranian media reported, with Islamabad's ambassador identifying them as Pakistanis, as the neighbouring countries have sought to ease tensions after the deadly cross-border fire."},"content:encoded":{"#cdata-section":"<p>Gunmen in southeastern Iran killed nine people Saturday, Iranian media reported, with Islamabad's ambassador identifying them as Pakistanis, as the neighbouring countries have sought to ease tensions after deadly cross-border fire.</p>\r\n\r\n<p>Iran's Mehr news agency reported that \"according to witnesses, this morning unknown armed men killed nine non-Iranians in a house in the Sirkan neighbourhood of Saravan city\" in Sistan-Baluchistan province.</p>\r\n\r\n<p>So far, no group had claimed responsibility, the news agency added.</p>\r\n\r\n<p>The Pakistani ambassador to Tehran, Muhammad Mudassir Tipu, said on X, formerly Twitter, he was \"deeply shocked by horrifying killing of 9 Pakistanis in Saravan\".</p>\r\n\r\n<p>\"Embassy will extend full support to bereaved families... We called upon Iran to extend full cooperation in the matter.\"</p>\r\n\r\n<p>Pakistani foreign ministry spokeswoman Mumtaz Zahra Baloch condemned the attack as \"horrifying and despicable\" and asked Iranian authorities to \"investigate the incident and hold to account those involved in this heinous crime\".</p>\r\n\r\n<p>She stressed that the Pakistani embassy in Iran \"will do its best to repatriate dead bodies at the earliest\", adding that \"such cowardly attacks cannot deter Pakistan from its determination to fight terrorism\".</p>\r\n\r\n<p>The deadly attack follows rare military action in the porous border region of Baluchistan -- split between the two nations -- that had stoked regional tensions already inflamed by the Israel-Hamas war.</p>\r\n\r\n<p>Sistan-Baluchistan, one of the few mainly Sunni Muslim provinces in Shiite-dominated Iran, has seen persistent unrest involving cross-border drug-smuggling gangs and rebels from the Baluchi ethnic minority, as well as jihadists.</p>\r\n\r\n<p>On January 18, Pakistan launched air strikes on \"militant targets\" in Iran, two days after Iran had launched strikes on its territory.</p>\r\n\r\n<p>Tehran said it had targeted Jaish al-Adl, a jihadist group which has carried out a spate of deadly attacks in Iran in recent months and blacklisted by Iran as a \"terrorist\" organisation.</p>\r\n\r\n<p>The Iranian strikes, which Pakistan said killed at least two children, drew a sharp rebuke from Islamabad, which recalled its ambassador from Tehran and blocked Iran's envoy from returning to Islamabad.</p>\r\n\r\n<p>Tehran also summoned Islamabad's charge d'affaires over Pakistan's strikes, which left at least nine people dead.</p>\r\n\r\n<p>The two countries, however, announced last Monday that they had decided to de-escalate and resumed diplomatic missions with the two ambassadors returning to their posts.</p>\r\n\r\n<p>The Pakistani ambassador on Saturday presented his credentials to Iranian President Ebrahim Raisi in Tehran, the presidency website reported.</p>\r\n\r\n<p>\"Borders are an opportunity for economic exchanges and improving the security of neighbours, and it is necessary to protect this opportunity against any element of insecurity,\" Raisi said during the meeting with the Pakistani envoy.</p>\r\n\r\n<p>The Iranian president called the two countries \"brothers\" and described their relations as \"unbreakable\".</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/vqvekkno_pakistan-iran-flags-reuters_625x300_27_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"This comes a little over a week after Iran, Pak exchanged deadly cross-border fires (Representational)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/the-dior-bag-scandal-that-threatens-south-korea-president-yoon-suk-yeol-poll-chances-4942627"},"title":{"#cdata-section":"The Dior Bag Scandal That Threatens South Korea President's Poll Chances"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/the-dior-bag-scandal-that-threatens-south-korea-president-yoon-suk-yeol-poll-chances-4942627"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 18:25:26 +0530"},"description":{"#cdata-section":"A purported video of South Korea's First Lady accepting a Dior bag as a gift has set in motion a political storm for President Yoon Suk Yeol and his People Power Party (PPP) just weeks before the parliamentary election."},"content:encoded":{"#cdata-section":"<p>A purported video of South Korea's First Lady accepting a Dior bag as a gift has set in motion a political storm for President Yoon Suk Yeol and his People Power Party (PPP) just weeks before the parliamentary election.&nbsp;</p>\r\n\r\n<p>In what is being referred to as the \"Dior bag scandal\", some PPP members are urging the president and his wife, Kim Keon Hee, to apologise, while others maintain it was a setup.</p>\r\n\r\n<p>The controversy stems from an alleged footage of Ms Kim Keon Hee accepting a Dior bag, valued at $2,250 (Rs 1,87,023), as a gift. In South Korea, it is illegal for public officials and their spouses to receive gifts exceeding 1 million Won (Rs 62,152) at once or a cumulative total of 3 million Won (Rs 1,86,456) within a fiscal year.</p>\r\n\r\n<p>Analysts suggest this might violate anti-bribery laws. President Yoon's supporters claim it is a setup and a smear campaign.&nbsp;</p>\r\n\r\n<p>The incident came to light in November through a video clip recorded by a Korean-American pastor, Reverend Abraham Choi, who met Kim Keon Hee to discuss concerns about President Yoon's North Korea policy. Reverend Choi alleged that luxury gifts were the only way to secure an audience with her, according to a Reuters report.</p>\r\n\r\n<p>The Opposition Democratic Party latched onto the issue to criticise President Yoon and his party. Opposition leader Hong Ik-pyo argued that it doesn't make sense for the presidential office and the ruling party to ignore the matter, emphasising that an apology won't suffice.</p>\r\n\r\n<p>PPP leader Kim Kyung-Yul also drew comparisons between the First Lady and Marie Antoinette, the infamous French queen known for her extravagant lifestyle.</p>\r\n\r\n<p>A recent poll found that 69% of eligible voters want an explanation from the president about his wife's actions, and an earlier survey in December showed that 53% of respondents believed her behaviour was inappropriate, reported BBC.</p>\r\n\r\n<p>President Yoon's decision to remain silent and his push for the resignation of a party leader over internal disagreements have ignited tensions within the PPP. Some analysts argue that this approach could become a focal point, potentially jeopardising the party's chances in the April 10 election.</p>\r\n\r\n<p>The PPP faces additional challenges, with Kim Keon Hee also entangled in allegations of stock price manipulation from 12 years ago. The Opposition-controlled parliament voted to appoint a special prosecutor for this case. Her past issues, including allegations of falsifying professional records and plagiarism in her PhD thesis, had earlier triggered massive public backlash.</p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/7an0gv1o_kim-keon-hee-with-yoon-suk-yeol-reuters_625x300_27_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The Dior bag scandal involving South Korea's First Lady comes just months ahead of polls (File)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/fire-exchanged-between-carrier-ferry-in-arabian-sea-uk-maritime-monitors-ambrey-ukmto-4942522"},"title":{"#cdata-section":"Fire Exchanged Between Carrier, Ferry In Arabian Sea: UK Maritime Monitors"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/fire-exchanged-between-carrier-ferry-in-arabian-sea-uk-maritime-monitors-ambrey-ukmto-4942522"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 18:06:03 +0530"},"description":{"#cdata-section":"A security team on a bulk carrier exchanged fire with armed individuals on a skiff after it came suspiciously close to the vessel in the Arabian Sea, British maritime monitors said on Saturday."},"content:encoded":{"#cdata-section":"<p>A security team on a bulk carrier exchanged fire with armed individuals on a skiff after it came suspiciously close to the vessel in the Arabian Sea, British maritime monitors said on Saturday.</p>\r\n\r\n<p>\"The skiff closed to 300 metres, before turning back towards a mothership,\" security firm Ambrey said in an advisory note, adding that the carrier and its crew were reported to be safe. It said the incident took place 700 nautical miles southeast of Salalah in Oman.</p>\r\n\r\n<p>The United Kingdom Maritime Trade Operations (UKMTO) authority said it received a report of an incident involving a small craft and a merchant vessel 780 nautical miles east of Hafun in Somalia.</p>\r\n\r\n<p>The small craft came within 300 meters of the vessel, UKMTO said, adding that the onboard security team fired warning shots and after an exchange of fire the small craft retreated.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2020-12/omh8aca_indian-ocean-generic-650_625x300_31_December_20.jpg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The small boat came within 300m of the vessel in the Arabian Sea, UKMTO said (Representational)"}}},{"guid":{"@isPermaLink":"true","#cdata-section":"https://www.ndtv.com/world-news/worlds-largest-cruise-ship-icon-of-the-seas-sets-sail-raising-methane-emission-concerns-4942189"},"title":{"#cdata-section":"World's Largest Cruise Ship Sets Sail Raising Methane Emission Concerns"},"link":{"#cdata-section":"https://www.ndtv.com/world-news/worlds-largest-cruise-ship-icon-of-the-seas-sets-sail-raising-methane-emission-concerns-4942189"},"pubDate":{"#cdata-section":"Sat, 27 Jan 2024 17:03:44 +0530"},"description":{"#cdata-section":"The world's largest cruise ship is set for its maiden voyage on Saturday, but environmental groups are concerned that the liquefied natural gas-powered vessel - and other giant cruise liners to follow - will leak harmful methane into the atmosphere."},"content:encoded":{"#cdata-section":"<p>The world's largest cruise ship is set for its maiden voyage on Saturday, but environmental groups are concerned that the liquefied natural gas-powered vessel - and other giant cruise liners to follow - will leak harmful methane into the atmosphere.</p>\r\n\r\n<p>Royal Caribbean International's Icon of the Seas sets sail from Miami with capacity for 8,000 passengers across 20 decks, taking advantage of the surging popularity of cruises.</p>\r\n\r\n<p>The ship is built to run on liquefied natural gas (LNG), which burns more cleanly than traditional marine fuel but poses greater risks for methane emissions. Environmental groups say methane leakage from the ship's engines is an unacceptable risk to the climate because of its short-term harmful effects.</p>\r\n\r\n<p>\"It's a step in the wrong direction,\" said Bryan Comer, director of the Marine Program at the International Council on Clean Transportation (ICCT), an environmental policy think tank.</p>\r\n\r\n<p>\"We would estimate that using LNG as a marine fuel emits over 120% more life-cycle greenhouse gas emissions than marine gas oil,\" he said.</p>\r\n\r\n<p>In terms of warming effects, methane is 80 times worse over 20 years than carbon dioxide, making cutting those emissions key to holding down global temperature warming.</p>\r\n\r\n<p>Cruise ships like Icon of the Seas use low-pressure, dual-fuel engines that leak methane into the atmosphere during the combustion process, known as \"methane slip,\" according to industry experts. There are two other engines used on bulk carriers or container ships that emit less methane but they are too tall to fit in a cruise ship.</p>\r\n\r\n<p>Royal Caribbean says its new ship is 24% more efficient when it comes to carbon emissions than required by global shipping regulator the International Maritime Organization (IMO).</p>\r\n\r\n<p>LNG emits fewer greenhouse gases than very low sulfur fuel oil (VLSFO) that powers most of the global shipping fleet, said Steve Esau, chief operating officer of Sea-LNG, an industry advocacy organization.</p>\r\n\r\n<p>Cruise engines convert natural gas into power in a cylinder, where it is \"important to make sure that all the natural gas is converted to energy,\" said Juha Kytola, director of R&amp;D and Engineering at Wartsila, which developed the cruise ship's engines.</p>\r\n\r\n<p>What is not converted can escape during the combustion process into the atmosphere, he said, adding that Wartsila's natural gas engine technology emits 90% less methane than it did 20 to 30 years ago.</p>\r\n\r\n<p>Cruise ship engines have an estimated methane slip of 6.4% on average, according to 2024 research funded by the ICCT and other partners. The IMO assumes methane slip at 3.5%.</p>\r\n\r\n<p>\"Methane is coming under more scrutiny,\" said Anna Barford, Canada shipping campaigner at Stand Earth, a nonprofit organization, noting that the IMO last summer said its efforts to cut greenhouse gases include addressing methane emissions.</p>\r\n\r\n<p>Of the 54 ships on order from January 2024 to December 2028, 63% are expected to be powered by LNG, according to the Cruise Line International Association. Currently, about 6% of the 300 cruise ships sailing are fueled by LNG.</p>\r\n\r\n<p>Newer cruise ships are being designed to run on traditional marine gas oil, LNG, or alternatives like bio-LNG that only account for a fraction of U.S. fuel consumption.</p>\r\n\r\n<p>Royal Caribbean will use different fuels as the market evolves, said Nick Rose, the company's vice president of environmental, social, and governance.</p>\r\n\r\n<p>\"LNG is one piece of our actual strategy,\" he said.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"},"media:content":{"@url":"https://c.ndtvimg.com/2024-01/739ut9s8_icon-of-the-seas_625x300_03_January_24.jpeg","@type":"image/jpeg","@expression":"full","@width":"538","@height":"190","media:description":{"@type":"plain","#cdata-section":"The crusie ship, Icon of the Seas, is built to run on liquefied natural gas"}}}]}}}