{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Cyber Security Archives - IT Governance UK Blog","atom:link":{"@href":"https://www.itgovernance.co.uk/blog/category/cyber-security/feed","@rel":"self","@type":"application/rss+xml"},"link":"https://www.itgovernance.co.uk/blog/category/cyber-security","description":"Our Expertise, Your Peace of Mind","lastBuildDate":"Tue, 16 Jan 2024 17:29:40 +0000","language":"en-GB","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t"/*Theme by MyThemeShop.com*/,"image":{"url":"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/02/cropped-IT-Governance-logo512-32x32.png","title":"Cyber Security Archives - IT Governance UK Blog","link":"https://www.itgovernance.co.uk/blog/category/cyber-security","width":"32","height":"32"},"item":[{"title":"Expert Insight: Adam Seamons on Zero-Trust Architecture","link":"https://www.itgovernance.co.uk/blog/expert-insight-adam-seamons-on-zero-trust-architecture","dc:creator":{"#cdata-section":"Adam Seamons"},"pubDate":"Fri, 05 Jan 2024 14:07:31 +0000","category":[{"#cdata-section":"Cyber Resilience"},{"#cdata-section":"Cyber Security"},{"#cdata-section":"Expert insight"},{"#cdata-section":"GDPR"},{"#cdata-section":"Risk Management"}],"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=45799"},"description":{"#cdata-section":"<p>How networks have evolved and how to secure them Adam Seamons is the information security manager of GRC International Group PLC, after more than 15 years’ experience working as a systems engineer and in technical support. Adam also holds CISSP (Certified Information Systems Security Professional) and SSCP (Systems Security Certified Practitioner) certifications. We sat down to chat to him. What trends in network security have you noticed recently? One of the big impacts to networks has come from the changes in technology, particularly in terms of the Cloud. Networks have moved from self-contained, on-site setups to multiple Cloud services that </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/expert-insight-adam-seamons-on-zero-trust-architecture\">Expert Insight: Adam Seamons on Zero-Trust Architecture</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">How networks have evolved and how to secure them</h2>\n\n\n\n<p><em>Adam Seamons is the information security manager of GRC International Group PLC, after more than 15 years’ experience working as a systems engineer and in technical support.</em></p>\n\n\n\n<p><em>Adam also holds </em><a href=\"https://www.itgovernance.co.uk/shop/product/cissp-accelerated-training-course\"><em>CISSP (Certified Information Systems Security Professional)</em></a><em> and SSCP (Systems Security Certified Practitioner) certifications.</em></p>\n\n\n\n<p><em>We sat down to chat to him.</em></p>\n\n\n\n<center><hr class=\"wp-block-separator\"/></center>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-transform: none;\">What trends in network security have you noticed recently?</h3>\n\n\n\n<p>One of the big impacts to networks has come from the changes in technology, particularly in terms of the <a href=\"https://www.itgovernance.co.uk/all-resources/green-papers/cloud-security-who-is-responsible\">Cloud</a>. Networks have moved from self-contained, on-site setups to multiple Cloud services that are accessed remotely by staff and resources.</p>\n\n\n\n<p>Some of these technologies were hastily implemented during the COVID-19 years, when the hand of IT teams and decision makers was forced due to the pressure of having to move to remote working almost immediately. As part of that, there was also a lot of pressure to quickly integrate existing networks with services from third-party providers, often based in the Cloud.</p>\n\n\n\n<p>And criminals took advantage. For instance, recently, the denial-of-service attack on the US Department of Health and Human Services from when the pandemic first hit the US was in the <a href=\"https://www.bloomberg.com/news/articles/2023-12-06/hhs-cyberattack-at-2020-covid-onset-was-bigger-than-first-realized\" target=\"_blank\" rel=\"noreferrer noopener\">news</a> again. That attack probably only succeeded due to a rushed move towards remote working.</p>\n\n\n\n<p>But regardless of why the move to Cloud infrastructure happened, it created complexity where traditional IT and security controls don’t cut it. The inevitable result was the rise of new threats and vulnerabilities – cyber criminals tend to move very quickly and be, unfortunately, extremely innovative. These problems are compounded by a lack of resources – from a funding perspective, but also in terms of <a href=\"https://www.itgovernance.co.uk/professional-certification-training\">skills shortages</a>.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-transform: none;\">You say “traditional” security. Could you please elaborate?</h3>\n\n\n\n<p>Taking you on a bit of a history lesson, IT was used in business long before we had the Internet. In those days, if you wanted to access digital organisational resources, you had to use a device that was physically connected to the company network. It was natural to automatically trust the devices that got past your firewall and onto your network.</p>\n\n\n\n<p>Some years after that, you’d use a VPN [virtual private network] or similar technology. VPNs were – and still are – used to extend network access to users outside the physical network in a fairly secure manner. That said, not all VPNs are equally secure [discussed in more detail in our <a href=\"https://www.itgovernance.co.uk/blog/expert-insight-leon-teale\">interview with senior penetration tester Leon Teale</a>], and many VPNs with poor or legacy security are still in place today.</p>\n\n\n\n<p>The Internet, particularly the Cloud, changed all that. As organisational resources increasingly moved into the Cloud, corporate network structures changed completely. This also completely changed the risks.</p>\n\n\n\n<p>Previously, when the networks were largely or even exclusively physical, organisations and IT teams prioritised accessibility. In other words, staff could access pretty much anything once they had logged in to the network for maximum convenience.</p>\n\n\n\n<p>But now, with the Cloud, people can work whenever and wherever they want. That brings huge business benefits and opportunities, obviously – particularly when you’re dealing with a situation like the 2020 lockdowns – but it also comes with risks. If staff can log in from anywhere, so can intruders.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-transform: none;\">How can organisations address those Cloud-associated risks?</h3>\n\n\n\n<p>For a start, organisations must think about who needs access to what, and what type of access is required. As they transfer more and more data assets into the Cloud, the risk of compromise becomes greater. That’s in the sense of the likelihood of a compromise, but also in terms of the impact of a breach. In 2023, we had incidents where <a href=\"https://www.itgovernance.co.uk/blog/list-of-data-breaches-and-cyber-attacks-in-2023\">more than a billion records were breached</a>. One incident, the DarkBeam breach, even approached 4 billion records – in a small company!</p>\n\n\n\n<p>It’s important to restrict access as much as possible. If certain people – and, by extension, their accounts and devices – haven’t got access to begin with, an attacker who compromises their account or device won’t have that access either. Or at least, not automatically.</p>\n\n\n\n<p>Even if someone <em>does</em> need access to, say, HR or financial data, they may not need access to <em>all</em> of it. Maybe they need access to employee records, but not payroll data, for example. Or someone may only need to be able to view something, but not edit it.</p>\n\n\n\n<p>Strong identity and access management systems are key in keeping your networks secure. But more than having the right software, it’s about following <a href=\"https://www.itgovernance.co.uk/shop/product/cyber-resilience-defence-in-depth-principles\">good principles</a> – in this case, the principle of least privilege.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-transform: none;\">So, to recap, organisations should block access by default and make the device/user prove that it/they can be trusted?</h3>\n\n\n\n<p>Precisely – the zero-trust network. In that type of network architecture, company devices aren’t allowed access unless they have a specific need to <em>and</em> can prove themselves trustworthy via authentication.</p>\n\n\n\n<p>So, zero trust goes beyond restricting access by need to know and the principle of least privilege. It’s about properly verifying access and being 110% certain that the access is legitimate. That means things like limiting access to specific criteria, such as by port or protocol, time period, IP address and/or physical location.</p>\n\n\n\n<p>For example, if an HR employee of a UK or an EU organisation wanted to work in Dubai for a few days, they shouldn’t be granted access to employee records – i.e. personal data – as that’d constitute a data transfer outside the UK or EU under the <a href=\"https://www.itgovernance.co.uk/data-protection-dpa-and-eu-data-protection-regulation\">GDPR</a> [General Data Protection Regulation]. Such a transfer is only permitted if certain mechanisms are put in place. I’m not saying that couldn’t be done, but the default should be to block access.</p>\n\n\n\n<p>A zero-trust network is about verification or double-checking. You want to be verifying not just the person, but also the device and limiting that access to specific permissions and rights that have been approved in advance. And you’re also restricting data access, particularly in situations like the example I just gave.</p>\n\n\n\n<p>Think of it like the difference between a key to the front door that gives you access to the whole house, and needing a key for the front door as well as separate keys for all the different rooms.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-transform: none;\">Presumably, access control isn’t enough to secure your networks. What technologies would organisations need?</h3>\n\n\n\n<p>All-in-one packages like Microsoft Defender – which includes account monitoring and protection, data loss prevention, and more – can go a long way towards addressing organisations’ security needs. It’s like a one-stop shop for security. Microsoft Defender has got everything organisations need, from monitoring user activity to stopping data leaks. It’s smart too, as it uses machine learning to catch threats early.</p>\n\n\n\n<p>As for other solutions, SIEM and SOAR are great tools [security information and event management, and security orchestration, automation and response tools].</p>\n\n\n\n<p>SIEM tools are basically cyber investigations. Splunk is a top pick, which gathers clues from logs and devices to identify potentially suspicious activity. If it does detect something fishy, it’ll automatically send out an alert that someone should manually follow up.</p>\n\n\n\n<p>Meanwhile, SOAR tools are all about making your security team’s lives easier by automating processes that’d otherwise have to be done manually, including updating security systems and escalating security alerts. Cortex XSOAR from Palo Alto Networks is a good choice here. It links up with your existing security measures and speeds up dealing with cyber threats through real-time collaboration within a SOC [security operations centre].</p>\n\n\n\n<p>These types of technical solutions allow organisations to build a solid security setup – not just for today, but also for the future.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-transform: none;\">AI has been on everyone’s mind for the past year or so. Do you believe that AI tools can offer valuable security solutions, whether now or in future?</h3>\n\n\n\n<p>It’s definitely worth combining the measures I mentioned earlier with some of the new AI-powered tools to analyse and respond to threats faster.</p>\n\n\n\n<p>I think that AI is already offering the cyber security world some really exciting solutions. It’s like having a highly efficient assistant who is always on top of things and only brings important issues to your attention.</p>\n\n\n\n<p>Some organisations are already using this technology to spot and stop cyber threats in their tracks, often before you even know they’re there.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h3 class=\"wp-block-heading\">Looking ahead, what role do you believe AI will play in the security landscape?</h3>\n\n\n\n<p>AI and machine learning have both been used in detecting anomalies and suspicious patterns for some time, and will only continue to be used more. I expect SOCs to become increasingly reliant on AI.</p>\n\n\n\n<p>Getting more specific, log analysis is a key area for AI to automate. An AI tool could do the heavy lifting, sifting through tons of logs and data to detect and then respond to threats far faster than a human could. It’s akin to algorithms in the financial markets, identifying and placing trades faster than is humanly possible.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h3 class=\"wp-block-heading\" style=\"text-transform: none;\">Do you have any final words of advice?</h3>\n\n\n\n<p>It’s easy to get caught up in rolling out new technology, particularly with the advancements in, and better availability of, AI tools. Often, organisations deploy technology without taking the time to get the most out of all its features. I’ve even seen them simply abandon it once it has gone live.</p>\n\n\n\n<p>The real key to becoming secure is to spend time thinking about your specific pain points. Ask yourself questions like:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>What cyber security risks do I need to address?</li>\n\n\n\n<li>In view of those risks, how can I optimise my resources?</li>\n</ul>\n\n\n\n<p>I’m a big believer in making sure that you’re using what you’ve got to its full potential. Figuring out what will give you the best ‘bang for your buck’ is key to both effective and sustainable security.</p>\n\n\n\n<center><hr class=\"wp-block-separator\"/></center>\n\n\n\n<p><em>We hope you enjoyed this week’s edition of our ‘Expert Insight’ series. Please do leave a comment below to let us know what you think, and if you have any questions you’d like our experts to answer.</em></p>\n\n\n\n<p><em>We’ll be back next week, chatting to another expert within the Group.</em></p>\n\n\n\n<p><em>In the meantime, if you missed it, check out our previous </em><a href=\"https://www.itgovernance.eu/blog/en/expert-insight-cliff-martin-on-streamlining-dora-compliance\"><em>Expert Insight</em></a><em>, where Cliff Martin, head of cyber incident response within </em><a href=\"https://www.grcilaw.com/\"><em>GRCI Law</em></a><em>, gave us his expert tips on streamlining </em><a href=\"https://www.itgovernance.co.uk/eu-digital-operational-resilience-act\"><em>DORA</em></a><em> (Digital Operational Resilience Act) compliance.</em></p>\n\n\n\n<center><hr class=\"wp-block-separator\"/></center>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">Cyber Security Advice Service</h2>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full is-resized\"><a href=\"https://www.itgovernance.co.uk/shop/product/cyber-security-advice-service\"><img decoding=\"async\" width=\"223\" height=\"223\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/Cyber-security-advice-service.png\" alt=\"\" class=\"wp-image-45800\" style=\"width:182px;height:auto\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/Cyber-security-advice-service.png 223w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/Cyber-security-advice-service-150x150.png 150w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/Cyber-security-advice-service-65x65.png 65w\" sizes=\"(max-width: 223px) 100vw, 223px\" /></a></figure></div>\n\n\n<p>Get fast answers to your cyber security issues from our experts with our unlimited advice service:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>Available via phone, email or video chat.</li>\n\n\n\n<li>Your key point of contact for advice on data breaches or cyber incidents.</li>\n\n\n\n<li>Perfect for small and medium-sized organisations without an in-house cyber security team.</li>\n</ul>\n\n\n\n<p></p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-1 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link has-white-color has-luminous-vivid-orange-background-color has-text-color has-background has-link-color wp-element-button\" href=\"https://www.itgovernance.co.uk/shop/product/cyber-security-advice-service\">Find out more</a></div>\n</div>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/expert-insight-adam-seamons-on-zero-trust-architecture\">Expert Insight: Adam Seamons on Zero-Trust Architecture</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"The Third-Party Threat for Financial Organisations","link":"https://www.itgovernance.co.uk/blog/the-third-party-threat-for-financial-organisations","dc:creator":{"#cdata-section":"Kyna Kosling"},"pubDate":"Fri, 22 Dec 2023 09:00:00 +0000","category":[{"#cdata-section":"Cyber Resilience"},{"#cdata-section":"Cyber Security"},{"#cdata-section":"DORA"},{"#cdata-section":"Risk Management"}],"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=45756"},"description":{"#cdata-section":"<p>DORA’s supply chain security requirements IT Governance’s research for November 2023 found that 48% of the month’s incidents originated from the supply chain (i.e. were third-party attacks). For Europe, this number rises to 61%. Admittedly, it only takes a comparatively small number of supply chain attacks to skew the number of incidents. It’s in their nature for one attack to compromise potentially hundreds or even thousands of organisations. However, that doesn’t stop the numbers from being worrying. It can be challenging to secure your supply chain – organisations tend to simply trust that the products and services they use are </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/the-third-party-threat-for-financial-organisations\">The Third-Party Threat for Financial Organisations</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">DORA’s supply chain security requirements</h2>\n\n\n\n<p><a href=\"https://www.itgovernance.co.uk/blog/data-breaches-and-cyber-attacks-in-november-2023-519111354-records-breached\">IT Governance’s research</a> for November 2023 found that 48% of the month’s incidents originated from the supply chain (i.e. were third-party attacks). For <a href=\"https://www.itgovernance.eu/blog/en/data-breaches-and-cyber-attacks-in-europe-in-november-2023-111218696\" target=\"_blank\" rel=\"noreferrer noopener\">Europe</a>, this number rises to 61%.</p>\n\n\n\n<p>Admittedly, it only takes a comparatively small number of supply chain attacks to skew the number of incidents. It’s in their nature for one attack to compromise potentially hundreds or even thousands of organisations.</p>\n\n\n\n<p>However, that doesn’t stop the numbers from being worrying. It can be challenging to secure your supply chain – organisations tend to simply trust that the products and services they use are safe. But where they aren’t, every organisation that uses them can be at risk, with potentially far-reaching consequences. That those consequences originate from just one source doesn’t make them any less serious.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">Higher risks for the finance sector</h2>\n\n\n\n<p>For the finance sector, the risk is higher than average. As a recent <a href=\"https://info.trustwave.com/spiderlabs-research-report-cybersecurity-in-the-financial-services-sector\" target=\"_blank\" rel=\"noreferrer noopener\">Trustwave report</a> pointed out, the businesses in this sector are extremely interconnected, even by the modern world’s standards. That interconnectedness makes the sector even more susceptible to supply chain attacks.</p>\n\n\n\n<p>EU lawmakers are aware of this too. For that reason, supply chain security is a core requirement of the upcoming <a href=\"https://www.itgovernance.co.uk/eu-digital-operational-resilience-act\" target=\"_blank\" rel=\"noreferrer noopener\">DORA Regulation</a> (Digital Operational Resilience Act). Although it’s an EU law, it will affect UK organisations too, if they operate in the EU.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">What can financial entities do to secure their supply chain?</h2>\n\n\n\n<p>When we put the question to Alan Calder, CEO of <a href=\"https://www.grci.group/\">GRC International Group</a>, he explained:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Financial entities must review ICT security across their supply chains, deploying audit and compliance teams to ensure that third-party ICT service providers are secure and compliant. That means looking for certifications like <a href=\"https://www.itgovernance.co.uk/iso27001\">ISO 27001</a>, <a href=\"https://www.itgovernance.co.uk/iso22301-business-continuity-standard\">ISO 22301</a> and <a href=\"https://www.itgovernance.co.uk/europrivacy\">Europrivacy</a>.</p>\n\n\n\n<p>Where critical suppliers are concerned, you should look at their resilience, including:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>Their <a href=\"https://www.itgovernance.co.uk/penetration-testing\">penetration testing</a> regimes;</li>\n\n\n\n<li>How their incident response mechanisms work; and</li>\n\n\n\n<li>Whether they are DORA compliant.</li>\n</ul>\n\n\n\n<p>If they fall short of your standards or requirements, you need to find alternative suppliers.</p>\n</blockquote>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">What are the requirements under DORA?</h2>\n\n\n\n<p>DORA requires financial entities to have robust contracts in place with ICT service providers. Financial organisations must also maintain a register of service providers and report on this to the competent authority every year.</p>\n\n\n\n<p>The key here is to <a href=\"https://www.itgovernance.co.uk/blog/risk-management-under-the-dora-regulation\">manage risks</a>. This includes managing the risk of having too many critical or important functions supported by a small number of service providers.</p>\n\n\n\n<p>In addition, DORA requires that financial entities only contract with providers that “comply with appropriate information security standards”. Where the ICT service provider supports critical or important functions, the financial entity must ensure the standards are “the most up-to-date and highest quality”.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">What “information security standards” are considered “appropriate”?</h2>\n\n\n\n<p>Unlike the <a href=\"https://www.itgovernance.co.uk/data-protection-dpa-and-eu-data-protection-regulation\">GDPR</a> (General Data Protection Regulation), DORA does not require that these standards be identified by a specific authority, so it’s reasonable to assume that ISO 27001 – since it sets the international benchmark for information security management – would qualify as such a standard.</p>\n\n\n\n<p>As Alan mentioned, certifications like ISO 22301 and Europrivacy<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" />/® add further assurance, as do due diligence checks on suppliers’ resilience, particularly for <em>critical</em> suppliers.</p>\n\n\n\n<p>In fact, DORA sets out a process for the ESAs (European Supervisory Authorities) to designate ‘critical suppliers’ for financial entities. These suppliers will have stricter requirements due to their importance to the financial industry.</p>\n\n\n\n<p>But the burden doesn’t just lie with the authorities. Ultimately, it is the organisation’s responsibility to find suppliers that can offer assurances – preferably backed up by certifications to standards like ISO 27001 – that they are secure.</p>\n\n\n\n<p>As Alan explained:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Financial entities will need to work ever more closely with their key suppliers to ensure they are genuinely resilient. That will include, for instance, running large-scale cyber attack simulations that involve significant elements of the supply chain, to test and improve the depth of their resilience.</p>\n</blockquote>\n\n\n\n<center><hr class=\"wp-block-separator\"/></center>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">Certified DORA Foundation Training Course</h2>\n\n\n\n<p>To learn more about DORA’s core requirements, including supply chain security, consider taking our <a href=\"https://www.itgovernance.co.uk/shop/product/certified-dora-foundation-training-course\">Certified DORA Foundation Training Course</a>.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full\"><a href=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/11/Dora-Foundation-Training-Course.png\"><img fetchpriority=\"high\" decoding=\"async\" width=\"320\" height=\"320\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/11/Dora-Foundation-Training-Course.png\" alt=\"\" class=\"wp-image-45613\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/11/Dora-Foundation-Training-Course.png 320w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/11/Dora-Foundation-Training-Course-300x300.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/11/Dora-Foundation-Training-Course-150x150.png 150w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/11/Dora-Foundation-Training-Course-65x65.png 65w\" sizes=\"(max-width: 320px) 100vw, 320px\" /></a></figure></div>\n\n\n<p>This course covers:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>An introduction to DORA and the regulatory landscape;</li>\n\n\n\n<li>ICT risk management principles in DORA;</li>\n\n\n\n<li>ICT incident management principles in DORA;</li>\n\n\n\n<li>Resilience testing requirements;</li>\n\n\n\n<li>Managing third-party risk; and</li>\n\n\n\n<li>Information-sharing principles.</li>\n</ul>\n\n\n\n<p>The course is the prerequisite to further specialist DORA training courses, including C-DORA Practitioner, C-DORA Compliance Officer and C-DORA Lead Auditor.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-2 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link has-white-color has-luminous-vivid-orange-background-color has-text-color has-background has-link-color wp-element-button\" href=\"https://www.itgovernance.co.uk/shop/product/certified-dora-foundation-training-course\">Book now</a></div>\n</div>\n\n\n\n<p></p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/the-third-party-threat-for-financial-organisations\">The Third-Party Threat for Financial Organisations</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"Sam McNicholls-Novoa on CyberComply","link":"https://www.itgovernance.co.uk/blog/sam-mcnicholls-novoa-on-cybercomply","dc:creator":{"#cdata-section":"Kyna Kosling"},"pubDate":"Wed, 20 Dec 2023 18:10:07 +0000","category":[{"#cdata-section":"Cyber Security"},{"#cdata-section":"CyberComply"},{"#cdata-section":"GDPR"},{"#cdata-section":"ISO 27001"},{"#cdata-section":"Privacy"}],"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=45764"},"description":{"#cdata-section":"<p>Making compliance easy with our Cloud-based solution CyberComply is a Cloud-based, end-to-end solution that simplifies compliance with a range of cyber security and data privacy standards and laws, including ISO 27001, the GDPR (General Data Protection Regulation), and more. This SaaS (Software as a Service) will help you manage all your cyber security and data privacy obligations in one place. You will gain immediate visibility into critical data and key performance indicators, and stay ahead of regulatory changes. Recently, CyberComply has seen some major updates. But we’re not done yet – the development team is working hard behind the scenes </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/sam-mcnicholls-novoa-on-cybercomply\">Sam McNicholls-Novoa on CyberComply</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">Making compliance easy with our Cloud-based solution</h2>\n\n\n\n<p><a href=\"https://www.itgovernance.co.uk/shop/product/cybercomply\"><em>CyberComply</em></a><em> is a Cloud-based, end-to-end solution that simplifies compliance with a range of cyber security and data privacy standards and laws, including </em><a href=\"https://www.itgovernance.co.uk/iso27001\"><em>ISO 27001</em></a><em>, the </em><a href=\"https://www.itgovernance.co.uk/data-protection-dpa-and-eu-data-protection-regulation\"><em>GDPR</em></a><em> (General Data Protection Regulation), and more.</em></p>\n\n\n\n<p><em>This SaaS (Software as a Service) will help you manage all your cyber security and data privacy obligations in one place. You will gain immediate visibility into critical data and key performance indicators, and stay ahead of regulatory changes.</em></p>\n\n\n\n<p><em>Recently, CyberComply has seen some major updates. But we’re not done yet – the development team is working hard behind the scenes on a range of new features.</em></p>\n\n\n\n<p><em>To find out more, we’re sitting down with Sam McNicholls-Novoa for a chat.</em></p>\n\n\n\n<center><hr class=\"wp-block-separator\"/></center>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">Could you tell us a bit about what you do for the Group?</h2>\n\n\n\n<p>Sure. I’m Sam, and I’m the product marketing manager for CyberComply. I work closely with our customer success team, product owner, developers and executives to create a product-led strategy for our software.</p>\n\n\n\n<p>I’m responsible for improving the customer onboarding experience, carrying out competitor research and for the ongoing development of our go-to-market plan. I also work on data analytics, design and web development projects.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">Why should organisations choose CyberComply?</h2>\n\n\n\n<p>We want to make compliance easy for our customers. They can stay focused on their core business while we help them build operational excellence.</p>\n\n\n\n<p>Essentially, we want to help them put the highest standards of cyber security and data protection in place, so they can build trust with their customers, partners and other stakeholders, but without the typical burdens that come with compliance.</p>\n\n\n\n<p>More than that, our platform isn’t limited to ISO 27001, or even a handful of standards and regulations. It can help organisations meet a <em>very </em>large range of requirements, including but not limited to:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>International standards, including ISO 9001, ISO 14001, ISO 20000, ISO 22301, ISO 27001, ISO 27017, ISO 27018, ISO 27701 and ISO 31000;</li>\n\n\n\n<li>UK standards and regulations, including Cyber Essentials, the UK GDPR, the NIS Regulations and the DSP Toolkit;</li>\n\n\n\n<li>EU standards and legal requirements, including the EU GDPR, Europrivacy<sup><img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" />/®</sup>, DORA and NIS 2; and</li>\n\n\n\n<li>US laws and frameworks, including HIPAA, the NIST CSF, the NYDFS Cybersecurity Regulation, SOC 2, the CMMC, the new SEC rules on cyber security, various US breach reporting and privacy regulations, and many more.</li>\n</ul>\n\n\n\n<p>Our research has found that a typical medium-sized organisation must comply with at least six different regulations.</p>\n\n\n\n<p>With that in mind, because we cover so many different requirements – and our database will only continue to expand – users don’t have to look elsewhere if they initially come to us for just ISO 27001 support, for example. They can stay on the same platform as they add more and more frameworks, all the while continuing to focus on their core business activities.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">The cyber landscape is famously a fast-paced one. How do you help customers keep up with it, while making sure that compliance remains easy?</h2>\n\n\n\n<p>We’re continuing to add frameworks as new ones are released. But more importantly, when an existing standard or regulation on our platform is updated, we are quick to update CyberComply too – like we did for the 2022 version of ISO 27001.</p>\n\n\n\n<p>Basically, when the landscape changes, so do we. We’re committed to keeping our clients up to date, helping them maintain their compliance while also continually improving their security posture.</p>\n\n\n\n<p>Another obvious example is AI. This new technology has exploded this year, which has huge implications for the security and privacy landscape. No doubt, this will lead to new regulations to further complicate the landscape.</p>\n\n\n\n<p>In fact, we’re already seeing early signs of this: the <a href=\"https://www.consilium.europa.eu/en/press/press-releases/2023/12/09/artificial-intelligence-act-council-and-parliament-strike-a-deal-on-the-first-worldwide-rules-for-ai/\" target=\"_blank\" rel=\"noreferrer noopener\">recent deal</a> between the European Council and European Parliament on harmonised AI rules, for example. Or the <a href=\"https://www.cisa.gov/news-events/news/dhs-cisa-and-uk-ncsc-release-joint-guidelines-secure-ai-system-development\" target=\"_blank\" rel=\"noreferrer noopener\">joint guidelines</a> for secure AI system development released by the UK NCSC [National Cyber Security Centre] and US CISA [Cybersecurity and Infrastructure Security Agency] at the end of November.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">What else makes CyberComply special?</h2>\n\n\n\n<p>It sits under <a href=\"https://www.grci.group/\">GRC International Group</a>, the parent company of Vigilant Software and IT Governance. This makes us uniquely positioned as a one-stop shop, allowing customers to come to one place to meet all their GRC [governance, risk and compliance] needs, ranging from software, to books, training courses, consultancy services, and more. The Group as a whole is committed to making compliance as easy and cost-efficient as possible.</p>\n\n\n\n<p>In fact, CyberComply has been expanding to help make compliance even easier for customers. For instance, we recently integrated DocumentKits, the platform that hosts our documentation toolkits, with CyberComply. So now, when someone purchases a CyberComply subscription, they also automatically get access to all our toolkits.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">What other new features can we expect?</h2>\n\n\n\n<p>We’re looking to integrate several of the Group’s other offerings into CyberComply, including:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>Our elearning platform;</li>\n\n\n\n<li>Our Cyber Essentials portal;</li>\n\n\n\n<li>A book subscription model; and</li>\n\n\n\n<li>A portal for reports, to support consultancy engagements.</li>\n</ul>\n\n\n\n<p>We’re planning a lot more than that, but that should give you a good sense of how we’re making CyberComply a true one-stop shop, where organisations can meet all their GRC needs.</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">What’s the next stage in your roadmap?</h2>\n\n\n\n<p>Our development team is working on completing our end-to-end solution for ISO 27001. CyberComply already offers tools for risk assessment, asset management, documentation management and incident management. To complete the set, we’ll be releasing a gap analysis tool, an audit manager, and additional tools to make it easier for team members involved in an ISMS [information security management system] to collaborate.</p>\n\n\n\n<p>Beyond that, we’re also completing our end-to-end solution for GDPR compliance, plus we hope to launch new solutions for DORA, Europrivacy and possibly the new SEC cyber security rules within the next six months. Within the next 12 months, we hope to start working on solutions for the CMMC, SOC 2, the DSP Toolkit, the CPRA and HIPAA.</p>\n\n\n\n<p>In the near future, we’re hosting a launch event, which we’ll be sharing more details on in due course. But for now, I strongly recommend giving CyberComply a go – you can <a href=\"https://www.itgovernance.co.uk/shop/product/cybercomply\">try it out for free</a>!</p>\n\n\n\n<div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-clock-spacer\"></div>\n\n\n\n<h2 class=\"wp-block-heading\" style=\"text-transform: none;\">CyberComply</h2>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full is-resized\"><a href=\"https://www.itgovernance.co.uk/shop/product/cybercomply\"><img decoding=\"async\" width=\"320\" height=\"320\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/CyberComply-new-logo.png\" alt=\"\" class=\"wp-image-45855\" style=\"width:171px;height:auto\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/CyberComply-new-logo.png 320w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/CyberComply-new-logo-300x300.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/CyberComply-new-logo-150x150.png 150w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2024/01/CyberComply-new-logo-65x65.png 65w\" sizes=\"(max-width: 320px) 100vw, 320px\" /></a></figure></div>\n\n\n<p>Make compliance with cyber security requirements and data privacy laws simple and affordable:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>Reduce dependence on individuals: put your trust in CyberComply.</li>\n\n\n\n<li>The number one software for GDPR compliance.</li>\n\n\n\n<li>Reduce data security risks with agility and efficiency.</li>\n</ul>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-3 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link has-white-color has-luminous-vivid-orange-background-color has-text-color has-background has-link-color wp-element-button\" href=\"https://www.itgovernance.co.uk/shop/product/cybercomply\">Start your free trial today</a></div>\n</div>\n\n\n\n<center><hr class=\"wp-block-separator\"/></center>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/sam-mcnicholls-novoa-on-cybercomply\">Sam McNicholls-Novoa on CyberComply</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"How to Recover From a Cyber Attack","link":"https://www.itgovernance.co.uk/blog/how-to-recover-from-a-cyber-attack","dc:creator":{"#cdata-section":"Luke Irwin"},"pubDate":"Tue, 27 Jun 2023 08:36:08 +0000","category":{"#cdata-section":"Cyber Security"},"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=44231"},"description":{"#cdata-section":"<p>Cyber attacks are like earthquakes. There is the immediate shockwave when an incident occurs, as you hurry to identify the source of the breach, plug the vulnerability and fulfil your regulatory requirements. Then come the secondary waves that produce new problems. For example, how have essential operations been affected, and what are you doing to protect and restore your reputation? Organisations often overlook the damage that these lingering problems cause, and the consequences can be far more expensive than they bargained for. According to one report, organisations can spend £3.6 million or more recovering from security incidents. But without appropriate </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/how-to-recover-from-a-cyber-attack\">How to Recover From a Cyber Attack</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>Cyber attacks are like earthquakes. There is the immediate shockwave when an incident occurs, as you hurry to identify the source of the breach, plug the vulnerability and fulfil your regulatory requirements.</p>\n\n\n\n<p>Then come the secondary waves that produce new problems. For example, how have essential operations been affected, and what are you doing to protect and restore your reputation?</p>\n\n\n\n<p>Organisations often overlook the damage that these lingering problems cause, and the consequences can be far more expensive than they bargained for.</p>\n\n\n\n<p>According to one report, organisations can spend £3.6 million or more recovering from security incidents. But without appropriate processes in place, that figure could be much higher.</p>\n\n\n\n<p>It’s why experts recommend a layered approach to cyber security, which includes the steps organisations take after an incident has occurred as well as traditional measures designed to prevent data breaches.</p>\n\n\n\n<p>The framework is known as defence in depth, and it contains five interrelated stages. Even if one of these defensive layers is breached, the next works to further contain the damage.</p>\n\n\n\n<p>In this blog, we look at how you can recover from cyber attacks by taking a defence-in-depth approach to information security.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">What is threat recovery?</h2>\n\n\n\n<p>When all other lines of defence fail, you need to ensure your organisation can survive.</p>\n\n\n\n<p>Often, you will be able to restore enough critical services to be able to continue functioning, but it can take months to fully return to business as usual. In the meantime, you need a plan for how you will manage, plus you need appropriate resources to implement those plans.</p>\n\n\n\n<p>For a start, you need business continuity and disaster recovery plans. Business continuity is about ensuring that your organisation continues to operate in the event of disruption. It’s a way of temporarily addressing a problem until you’re able to address the underlying issue.</p>\n\n\n\n<p>For example, say your office is flooded. A business continuity plan would outline how to secure your important assets and how to ensure staff can continue to work.</p>\n\n\n\n<p>Meanwhile, disaster recovery is the process of resolving the disruption. At its most basic level, it involves identifying the source of the incident and finding a way to fix it.</p>\n\n\n\n<p>The plans are usually very technical and focus on specific deadlines that must be met to prevent catastrophic damage. It will include things such as RTOs (recovery time objectives), which are estimates of how long it will take for a product, service or activity to become available following an incident.</p>\n\n\n\n<p>Comprehensive documentation ensures that the organisation is prepared for whatever happens, but implementing these plans can be expensive. This is where cyber insurance helps.</p>\n\n\n\n<p>Policies provide organisations with the means to implement incident response measures, such as forensic investigation, legal assistance and public relations support.</p>\n\n\n\n<p>These activities aren’t typically included in standard business insurance policies, which usually only cover costs related to technical issues, such as corrupted hard drives and lost devices.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">How we can help</h2>\n\n\n\n<p>Whatever your resources or expertise, a defence-in-depth approach to cyber security will give you the best chance of mitigating the security risks your organisation faces.</p>\n\n\n\n<p>This enables you to focus on your core business objectives without having to worry about coming under attack.</p>\n\n\n\n<p>IT Governance has everything you need. Get in touch today to find out how we can help you secure your success.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.itgovernance.co.uk/cyber-defence-in-depth\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" decoding=\"async\" width=\"640\" height=\"200\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/06/Defence-in-Depth-Banner.png\" alt=\"\" class=\"wp-image-45114\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/06/Defence-in-Depth-Banner.png 640w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/06/Defence-in-Depth-Banner-300x94.png 300w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></a></figure></div>\n\n\n\n\n<p>A version of this article was originally published on 10 November 2022.</p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/how-to-recover-from-a-cyber-attack\">How to Recover From a Cyber Attack</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"What is a DoS Attack?","link":"https://www.itgovernance.co.uk/blog/what-is-a-dos-denial-of-service-attack","dc:creator":{"#cdata-section":"Luke Irwin"},"pubDate":"Wed, 31 May 2023 09:08:53 +0000","category":{"#cdata-section":"Cyber Security"},"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=42182"},"description":{"#cdata-section":"<p>DoS (denial-of-service) attacks play an unusual role in cyber crime. Unlike most forms of criminal hacking, they aren’t primarily designed to capture or sensitive information, which can be sold for profit. Instead, DoS attacks are intended to shut down or severely disrupt an organisation’s systems. There is no direct benefit to the criminal hacker in doing this, but the loss of service can cost the victim up to £100,000. There are several ways that a criminal hacker can launch a DoS attacks, and countless reasons they might be motivated to pull off an attack. How does a DoS attack work? </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/what-is-a-dos-denial-of-service-attack\">What is a DoS Attack?</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>DoS (denial-of-service) attacks play an unusual role in cyber crime. Unlike most forms of criminal hacking, they aren’t primarily designed to capture or sensitive information, which can be sold for profit.</p>\n\n\n\n<p>Instead, DoS attacks are intended to shut down or severely disrupt an organisation’s systems. There is no direct benefit to the criminal hacker in doing this, but the <a href=\"https://www.syxsense.com/true-cost-of-dos-attacks\" target=\"_blank\" rel=\"noreferrer noopener\">loss of service can cost the victim up to £100,000</a>.</p>\n\n\n\n<p>There are several ways that a criminal hacker can launch a DoS attacks, and countless reasons they might be motivated to pull off an attack.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">How does a DoS attack work?</h2>\n\n\n\n<p>DoS attacks are hard to prevent, because in most cases they don’t exploit a vulnerability that an organisation can fix. Rather, attackers take advantage of the limitations of computer networks, overwhelming them until traffic is unable to be processed.</p>\n\n\n\n<p>You can think of it like a traffic jam: roads are designed to enable a certain amount of traffic to pass through, but once they become overcrowded, cars must slow down or stop altogether.</p>\n\n\n\n<p>That said, there are ways to mitigate the risk of some DoS attacks, as we explain below.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">Types of DoS attack</h2>\n\n\n\n<p>There are two primary ways to conduct a DoS attack – flooding and crashing.</p>\n\n\n\n<p>Flooding attacks are most common, and work by saturating the targeted server with packets.</p>\n\n\n\n<p>These are segments of data that you send to the organisation’s network when you interact with its website, which are then reassembled to perform tasks or load information.</p>\n\n\n\n<p>If the network receives too many of these packets in a short period of time, the network struggles to reassemble the data. As a result, service will be disrupted or the website will be forced offline altogether.</p>\n\n\n\n<p>Alternatively, an attacker might crash an organisation’s website by exploiting vulnerabilities in its network.</p>\n\n\n\n<p>For instance, they might leverage misconfigured network device by sending spoofed packets to every device on the target network rather than one specific machine.</p>\n\n\n\n<p>The network is then triggered to amplify the traffic, in what is known as a smurf attack or ping of death.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">Attacker motivation</h2>\n\n\n\n<p>The question that surrounds DoS attacks is what motivates a criminal hacker to do this?</p>\n\n\n\n<p>Almost all forms of cyber crime are designed to make money, but this isn’t possible with a DoS attack alone. An attackers’ motivation, therefore, can be much harder to understand.</p>\n\n\n\n<p>One reason for launching an attack is because they hold a grudge against the target. Many DoS attacks are politically or ideologically motivated, with the attacker holding a grievance against their target.</p>\n\n\n\n<p>The attack could cost the organisation money if services are disrupted during the attack. The damage could also damage the organisation’s reputation, particularly if they are responsible for providing critical services of a time-sensitive nature.</p>\n\n\n\n<p>However, cyber criminals might also bring down a service simply to show off their skills to the hacking community.</p>\n\n\n\n<p>A high-profile attack can act as a calling card to other criminals to demonstrate their capabilities or to show off what they’re capable of.</p>\n\n\n\n<p>Meanwhile, there are occasions when a DoS is used as a distraction while the criminal hacker launches a second attack designed to compromise an organisation’s systems.</p>\n\n\n\n<p>The victim might be so focused on restoring its systems from the first attack that it doesn’t notice other security alerts related to unauthorised access to its systems.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">DoS attacks versus DDoS attack</h2>\n\n\n\n<p>A related attack is DDoS (distributed denial of service). This works in the same way as a DoS attack, but uses multiple systems to launch a synchronised attack on a single target.</p>\n\n\n\n<p>In other words, the attack isn’t coming from a single computer operated by the attacker but from several computers.</p>\n\n\n\n<p>Cyber criminals do this with the help of a botnet, which is a series of infected Internet-connected devices that harvests their processing power.</p>\n\n\n\n<p>As a result, DDoS attacks are far more powerful and sustained than a standard DoS attack.</p>\n\n\n\n<p>DDoS attacks are also harder for the victim to identify, with malicious network traffic spread across locations and masked within legitimate traffic.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">How do you know you’ve suffered a DoS attack?</h2>\n\n\n\n<p>The most obvious sign of a DoS attack is prolonged network problems. However, there are other signs to look out for:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>A higher volume of spam than normal.</li>\n\n\n\n<li>Sudden loss of connectivity across devices on the same network.</li>\n\n\n\n<li>Slow website performance, with pages failing to load.</li>\n\n\n\n<li>Staff being unable to open files stored on the network or when accessing websites.</li>\n</ul>\n\n\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\">How to prevent a DoS attack</h2>\n\n\n\n<p>It’s difficult to prevent DoS attacks, but there are steps you can take to mitigate the threat. Here are three ways to get started:</p>\n\n\n\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\">1.&nbsp; Increase your bandwidth</h4>\n\n\n\n<p>The simplest thing you can do is to buy more bandwidth. This enables you to handle a larger amount of traffic, reducing the risk of bottlenecks that could disrupt your service.</p>\n\n\n\n<p>This is a particularly attractive solution to growing companies, as it also helps them process an increased amount of legitimate traffic and is something they might have to do eventually anyway.</p>\n\n\n\n<p>The only downside is that increasing your bandwidth won’t protect you from crashing attacks, which exploit system weaknesses instead of flooding your server.</p>\n\n\n\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\">2.  Build more complex servers</h4>\n\n\n\n<p>You should consider spreading your servers across multiple data centres to make it as hard as possible for cyber criminals to target you.</p>\n\n\n\n<p>These servers should ideally be in different locations, either spread across different premises or in different countries altogether.</p>\n\n\n\n<p>For this strategy to work, you’ll need a load balancing system to distribute traffic between servers.</p>\n\n\n\n<p>Separating your servers this way means that criminals face an uphill task to flood your systems. Their attack may compromise one server, but the rest will be unaffected and should be capable of taking on at least some of the extra traffic.</p>\n\n\n\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\">3.  Reconfigure your network hardware</h4>\n\n\n\n<p>You should adjust or strengthen your hardware configurations to reduce the risk of malicious traffic getting through.</p>\n\n\n\n<p>For example, your network and web application firewalls can be modified to check incoming packets against predefined rules (such as allow/deny protocols, ports and IP addresses) and block incoming malicious traffic.</p>\n\n\n\n\n\n<p>The best way to check how prepared you are for a DoS attack is with a <a href=\"https://www.itgovernance.co.uk/penetration-testing\" target=\"_blank\" rel=\"noreferrer noopener\">penetration test</a>. This is essentially a controlled form of hacking in which a professional tester uses the same techniques as a criminal hacker in an attempt to exploit your systems.</p>\n\n\n\n<p>In this case, the tester will try to flood your systems or exploit vulnerabilities that cripple your servers.</p>\n\n\n\n<p>Should they be successful, the tester will provide detailed notes on how the attack was possible and advice on how to mitigate the threat.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><a href=\"https://www.itgovernance.co.uk/shop/product/combined-external-infrastructure-and-web-application-penetration-test\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" decoding=\"async\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/01/image-5.png\" alt=\"IT Governance Combined External Infrastructure and Web Application Penetration Test\" class=\"wp-image-44395\" width=\"190\" height=\"190\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/01/image-5.png 320w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/01/image-5-300x300.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/01/image-5-150x150.png 150w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/01/image-5-65x65.png 65w\" sizes=\"(max-width: 190px) 100vw, 190px\" /></a></figure></div>\n\n\n<p>If that sounds like something you’re interested in, we recommend our <a href=\"https://www.itgovernance.co.uk/shop/product/combined-infrastructure-and-web-application-penetration-test\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Combined Infrastructure and Web Application Penetration Test</strong></a>.</p>\n\n\n\n<p>One of our CREST-certified penetration testers will conduct a thorough examination of your networks, websites and web applications to determine how an attacker could target you and what you can do to stop them.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-4 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link has-white-color has-luminous-vivid-orange-background-color has-text-color has-background wp-element-button\" href=\"https://www.itgovernance.co.uk/shop/product/combined-infrastructure-and-web-application-penetration-test\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Get started</strong></a></div>\n</div>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p><strong>Want to know more? Download our </strong><a href=\"https://www.itgovernance.co.uk/green-papers/cyber-secure-pentesting\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>free guide on penetration testing</strong></a><strong> to understand how it works and the ways your organisation benefits.</strong></p>\n\n\n\n\n\n<p><em>A version of this article was originally published on 21 January 2021.</em></p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/what-is-a-dos-denial-of-service-attack\">What is a DoS Attack?</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"World Economic Forum: Organisations Must Invest in Security as ‘Catastrophic Cyber Event’ Looms","link":"https://www.itgovernance.co.uk/blog/world-economic-forum-organisations-must-invest-in-security-as-catastrophic-cyber-event-looms","comments":"https://www.itgovernance.co.uk/blog/world-economic-forum-organisations-must-invest-in-security-as-catastrophic-cyber-event-looms#comments","dc:creator":{"#cdata-section":"Luke Irwin"},"pubDate":"Thu, 27 Apr 2023 13:29:38 +0000","category":{"#cdata-section":"Cyber Security"},"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=44838"},"description":{"#cdata-section":"<p>The cost of living crisis is affecting us all. Energy bills are soaring, petrol prices have reached record highs and, as the BBC reported this week, even the humble cheese sandwich has been struck by inflation. Despite these rising costs, one area that remains unchanged is digital transformation. Organisations worldwide are investing in technologies at an unprecedented rate, with an IDC study published last year reporting that digital transformation spending is expected to hit $3.4 trillion (£2.73 trillion) by 2026. These estimates are driven by organisations’ desire to automate projects and to make better use of technology. Much has been </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/world-economic-forum-organisations-must-invest-in-security-as-catastrophic-cyber-event-looms\">World Economic Forum: Organisations Must Invest in Security as ‘Catastrophic Cyber Event’ Looms</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>The cost of living crisis is affecting us all. Energy bills are soaring, petrol prices have reached record highs and, as the BBC reported this week, even <a href=\"https://www.bbc.co.uk/news/business-65324359\" target=\"_blank\" rel=\"noreferrer noopener\">the humble cheese sandwich has been struck by inflation</a>.</p>\n\n\n\n<p>Despite these rising costs, one area that remains unchanged is digital transformation. Organisations worldwide are investing in technologies at an unprecedented rate, with <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS49797222\" target=\"_blank\" rel=\"noreferrer noopener\">an IDC study published last year</a> reporting that digital transformation spending is expected to hit $3.4 trillion (£2.73 trillion) by 2026.</p>\n\n\n\n<p>These estimates are driven by organisations’ desire to automate projects and to make better use of technology. Much has been made of ChatGPT and the ability for artificial general intelligence to radically alter or replace a variety of content-based roles, from writing to coding.</p>\n\n\n\n<p>Elsewhere, Mark Zuckerberg is insistent that the <a href=\"https://www.grcilaw.com/blog/is-the-metaverse-relevant-to-business\" target=\"_blank\" rel=\"noreferrer noopener\">metaverse can reshape workplace collaboration</a> in an era of remote working, while other business leaders look for practical solutions to the challenges that a post-pandemic world presents.</p>\n\n\n\n<p>How can teams talk and share information productively? Will remote workers suffer from their isolation in the long term?</p>\n\n\n\n<p>Amid all this, organisations continue to struggle in their attempts to find skilled personnel to oversee these practices. It’s all well and good automating processes, but you still need people who know what they’re doing to manage your requirements.</p>\n\n\n\n<p>It’s an issue among many industries, but it’s particularly acute in the cyber security sector – where the growing use of technology has propelled a demand for expertise that far outstrips the number of people entering or advancing their position in the field.</p>\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Mounting danger</strong></h2>\n\n\n\n<p>The concerns regarding the cyber skills gap was neatly summarised in a recent <a href=\"https://www.weforum.org/agenda/2023/04/how-reskilling-and-upskilling-talent-shrink-cybersecurity-skills-gap\" target=\"_blank\" rel=\"noreferrer noopener\">World Economic Forum article</a> written by Rob Rashotte, the vice president of global training and technical field enablement at Fortinet.</p>\n\n\n\n<p>He noted that “short-staffed security teams and those lacking senior-level professionals make it difficult for organizations – regardless of industry or sector – to safeguard their assets from threats, resulting in tangible consequences”.</p>\n\n\n\n<p>Rashotte pointed to <a href=\"https://www.fortinet.com/content/dam/fortinet/assets/reports/2023-cybersecurity-skills-gap-report.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">a Fortinet report</a> that found 80% of organisations fell victim to a cyber attack last year, 48% of which said that sensitive data had been stolen. In those instances, organisations spent $1 million (£800,000) on average remediating the damage.</p>\n\n\n\n<p>This trend is expected to worsen, as organisations’ increased use of technology creates more opportunities for cyber criminals to strike.</p>\n\n\n\n<p>We have already seen a <a href=\"https://www.itgovernance.co.uk/blog/data-breaches-and-cyber-attacks-quarterly-review-q1-2023\" target=\"_blank\" rel=\"noreferrer noopener\">12.7% rise in publicly reported data breaches</a> in the first quarter of 2023 compared to the previous three months, and many organisations are expecting a barrage of attacks – which might include potentially devastating fallout from growing geopolitical instability.</p>\n\n\n\n<p><a href=\"https://www3.weforum.org/docs/WEF_Global_Security_Outlook_Report_2023.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">The World Economic Forum’s Global Cybersecurity Outlook 2023 report</a> found that 86% of business leaders and 93% of security leaders believe that growing political tensions – which often play out in cyberspace – could lead to a catastrophic cyber event within the next two years.</p>\n\n\n\n<p>This worrying prediction comes alongside a warning from the new deputy prime minister, Oliver Dowden, who said that <a href=\"https://news.sky.com/story/russia-linked-cyber-attack-groups-want-to-destroy-uk-minister-warns-12860186\" target=\"_blank\" rel=\"noreferrer noopener\">UK businesses are on the frontline of the country’s cyber security defences</a> and they must defend against cyber criminals who intend to destroy critical infrastructure.</p>\n\n\n\n<p>Speaking at the CyberUK conference in Belfast, Dowden said that these groups are “ideologically motivated rather than financially motivated” and their goal is to “disrupt or destroy” their targets.</p>\n\n\n\n<p>The criminals he’s referring to are most likely Russian state-sponsored hackers, who have consistently targeted the country’s political adversaries since the invasion of Ukraine.</p>\n\n\n\n<p>Responding to these threats, the National Cyber Security Centre has issued an official threat notice to help protect the county, while Dowden told the conference he was urging “companies in charge of keeping our country running, of keeping the lights on [to] take their own security seriously”.</p>\n\n\n\n<p>He added: “A bricks-and-mortar business wouldn&#8217;t survive if it left the back door open to criminals every night. Equally in today’s world, businesses can’t afford […] to leave their digital back door open to cyber crooks and hackers.”</p>\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>What should organisations do?</strong></h2>\n\n\n\n<p>In preparing for cyber attacks, organisations have tended towards technological defences. This might be because they think its simpler or more effective than other methods, or because the cyber security skills gap makes it seemingly impossible to find a qualified candidate at an affordable salary.</p>\n\n\n\n<p>But there are options available to organisations beyond hiring a new employee. For instance, rather than employing an existing expert, organisations could build an internal security team and encourage employees in security-adjacent roles, such as IT, to take&nbsp;<a href=\"https://www.itgovernance.co.uk/it-governance-learning-paths\" target=\"_blank\" rel=\"noreferrer noopener\">cyber security training courses</a>.</p>\n\n\n\n<p>An organisation’s ability to retain and upskill its staff is crucial to its long-term success, with 95% of security leaders saying that industry certification programmes have positively affected their operations.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/02/logo-2-1.gif\" alt=\"\" class=\"wp-image-44513\" width=\"130\" height=\"127\"/></figure></div>\n\n\n<p>If you think you or someone one your team is ready to take the next step, IT Governance offers a range of training options, including our Certified <a href=\"https://www.itgovernance.co.uk/shop/product/certified-cyber-security-foundation-training-course\" target=\"_blank\" rel=\"noreferrer noopener\">Cyber Security Foundation</a> and <a href=\"https://www.itgovernance.co.uk/shop/product/certified-cyber-security-practitioner-self-paced-online-training-course\" target=\"_blank\" rel=\"noreferrer noopener\">Practitioner</a> training courses.</p>\n\n\n\n<p>We also offer specialised courses on <a href=\"https://www.itgovernance.co.uk/shop/product/certified-gdpr-practitioner-training-course\" target=\"_blank\" rel=\"noreferrer noopener\">the GDPR</a> and the international standard for information security, <a href=\"https://www.itgovernance.co.uk/shop/product/certified-iso-270012022-isms-foundation-training-course\" target=\"_blank\" rel=\"noreferrer noopener\">ISO 27001</a>.</p>\n\n\n\n<p>Plus, by booking one of these options before 30 June, you’ll receive another selected course worth up to £315 free.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.itgovernance.co.uk/broaden-your-knowledge-with-free-training\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" decoding=\"async\" width=\"640\" height=\"200\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-9.png\" alt=\"\" class=\"wp-image-44839\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-9.png 640w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-9-300x94.png 300w\" sizes=\"(max-width: 640px) 100vw, 640px\" /></a></figure></div>\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-5 wp-block-buttons-is-layout-flex\"></div>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/world-economic-forum-organisations-must-invest-in-security-as-catastrophic-cyber-event-looms\">World Economic Forum: Organisations Must Invest in Security as ‘Catastrophic Cyber Event’ Looms</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"wfw:commentRss":"https://www.itgovernance.co.uk/blog/world-economic-forum-organisations-must-invest-in-security-as-catastrophic-cyber-event-looms/feed","slash:comments":"1"},{"title":"Insider Threats Unveiled: Definition, Types, and Real-Life Examples","link":"https://www.itgovernance.co.uk/blog/what-is-an-insider-threat-definition-types-and-examples","dc:creator":{"#cdata-section":"Luke Irwin"},"pubDate":"Tue, 25 Apr 2023 12:12:30 +0000","category":{"#cdata-section":"Cyber Security"},"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=44831"},"description":{"#cdata-section":"<p>Insider threats are one of the most difficult security challenges that organisations face. Staying safe isn’t simply about stopping criminal hackers from breaking into your systems, because the vulnerabilities already inside your organisation. A malicious threat can be an employee, contractor or business partner who is liable to leak sensitive information. Preventing this from happening requires a nuanced approach to information security, and it’s one that organisations are increasingly struggling with. According to the 2022 Verizon Data Breach Investigations Report, insider threats account for 18% of all security incident. Meanwhile, a Ponemon Institute report found that data breaches caused by </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/what-is-an-insider-threat-definition-types-and-examples\">Insider Threats Unveiled: Definition, Types, and Real-Life Examples</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\r\n<p>Insider threats are one of the most difficult security challenges that organisations face. Staying safe isn’t simply about stopping criminal hackers from breaking into your systems, because the vulnerabilities already inside your organisation.</p>\r\n\r\n\r\n\r\n<p>A malicious threat can be an employee, contractor or business partner who is liable to leak sensitive information. Preventing this from happening requires a nuanced approach to information security, and it’s one that organisations are increasingly struggling with.</p>\r\n\r\n\r\n\r\n<p><a href=\"https://www.verizon.com/business/resources/reports/dbir/\" target=\"_blank\" rel=\"noreferrer noopener\">According to the 2022 Verizon Data Breach Investigations Report</a>, insider threats account for 18% of all security incident.</p>\r\n\r\n\r\n\r\n<p>Meanwhile, <a href=\"https://static.poder360.com.br/2022/01/pfpt-us-tr-the-cost-of-insider-threats-ponemon-report.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">a Ponemon Institute report</a> found that data breaches caused by insiders increased by 14% between 2018 and 2022.</p>\r\n\r\n\r\n\r\n<p>But who exactly is causing these incidents and why? &nbsp;We explain everything you need to know in this blog.</p>\r\n\r\n\r\n\r\n\r\n\r\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Who are insider threats?</strong></h2>\r\n\r\n\r\n\r\n<p>An insider threat is someone who works for, or with, an organisation and uses their legitimate access to company data to breach sensitive information or damage systems.</p>\r\n\r\n\r\n\r\n<p>Insider threats fall into two categories: malicious or negligent. Malicious insiders act deliberately, and they often use the same techniques as criminal hackers, such as planting malware or exploiting an unprotected database.</p>\r\n\r\n\r\n\r\n<p>By contrast, negligent insiders act carelessly but have no intent to harm the organisation. They can cause data breaches and other forms of disruption by mistakenly damaging the organisation’s systems or by enabling a cyber criminal to act.</p>\r\n\r\n\r\n\r\n<p>Within this dyad, insider threats can be further divided into three types.</p>\r\n\r\n\r\n\r\n<ul>\r\n<li><strong>Financially motivated malicious insiders</strong></li>\r\n</ul>\r\n\r\n\r\n\r\n<p>Security experts often say that ‘personal data is the new currency’. That’s a slight exaggeration (good luck trying to pay rent with your email address), but the point remains: legitimate organisations and cyber criminals alike are trying to get their hands on personal data.</p>\r\n\r\n\r\n\r\n<p>Indeed, many business activities are designed with information-gathering potential in mind, while cyber criminals want personal information to commit fraud.</p>\r\n\r\n\r\n\r\n<p>Personal data is therefore abundant within organisations and extremely valuable to cyber criminals. An employee hoping to make some extra cash is liable to take that information and sell it on the dark web.</p>\r\n\r\n\r\n\r\n<p>As with crime generally, the two biggest obstacles that prevent people from doing this are their moral compass and their fear of being caught. These factors don’t go away just because you’re dealing with virtual loot and a faceless buyer over the Internet.</p>\r\n\r\n\r\n\r\n<p>But things can change if you put someone in the wrong circumstance. There are countless examples of people who have turned to crime when they need money or they want more.</p>\r\n\r\n\r\n\r\n<p>They might know their actions are wrong but tell themselves that there’s no other option and what they’re doing isn’t that bad. Or that it’s a one-time thing, or a victimless crime.</p>\r\n\r\n\r\n\r\n<p>These motivations are much easier to reconcile with one’s sense of right and wrong when it comes to cyber crime, because the culprit isn’t causing any damage directly. They are, in effect, a middleman, and the knock-on effects of their actions aren’t immediately obvious.</p>\r\n\r\n\r\n\r\n<ul>\r\n<li><strong>Vengeful malicious insiders</strong></li>\r\n</ul>\r\n\r\n\r\n\r\n<p>Business is full of tough decisions, and that sometimes means employees feel hard done by. Perhaps they have been turned down for a promotion or a pay rise, or they feel as though they have been treated poorly by their boss.</p>\r\n\r\n\r\n\r\n<p>Or, in the most common instance of vengeful malicious insiders, they have been fired or forced out. This kind of insider is particularly dangerous if they can log in to their work account remotely and the organisation doesn’t remove their access rights immediately.</p>\r\n\r\n\r\n\r\n<p>That’s because the employee will be acting on emotion, recklessly sabotaging the organisation without considering the consequences of their actions.</p>\r\n\r\n\r\n\r\n<p>A more subtle form of this occurs when perpetrators are unhappy with their employer but are otherwise getting on with their work.</p>\r\n\r\n\r\n\r\n<p>These types of attacks will usually be more thought out and harder to detect. The perpetrator will take a more deliberate approach and could involve personal gain, such as embezzling money or stealing information to sell on the dark web.</p>\r\n\r\n\r\n\r\n<p>However, they might simply want the organisation to suffer, for example by shutting down business processes or redirecting information.</p>\r\n\r\n\r\n\r\n<ul>\r\n<li><strong>Negligent insider</strong></li>\r\n</ul>\r\n\r\n\r\n\r\n<p>Negligent insiders don’t set out to cause damage, but that doesn’t make them any less dangerous.</p>\r\n\r\n\r\n\r\n<p>They pose a problem because they make mistakes while performing normal work duties. This might be because they don’t understand the rules or the organisation doesn’t have properly defined processes and policies in place.</p>\r\n\r\n\r\n\r\n<p>Alternatively, they might simply be tired or slip-up due to a lapse in concentration.</p>\r\n\r\n\r\n\r\n<p>Their actions might result directly in a data breach, such as emailing sensitive files to the wrong person. Or they can make an error that creates opportunities for malicious actors to pounce, such as inadvertently allowing an unauthorised person into the building.</p>\r\n\r\n\r\n\r\n\r\n\r\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Why do they pose a threat?</strong></h2>\r\n\r\n\r\n\r\n<p>Insider threats can result in a range of negative outcomes, from the theft of sensitive data and unauthorised access to the sabotage of their systems and equipment.</p>\r\n\r\n\r\n\r\n<p>In every case, insider threats can jeopardise the confidentiality, integrity and availability of sensitive information and systems.</p>\r\n\r\n\r\n\r\n<p>Confidentiality refers to an organisation’s ability to keep sensitive information private and secure. Whether they’re acting maliciously or negligently, an insider is liable to leak information to a third party. They might hand the information to a cyber criminal or a rival firm, or leak it publicly online.</p>\r\n\r\n\r\n\r\n<p>Integrity refers to the completeness and accuracy of data, as well as the organisation’s ability to protect it from corruption. Insiders could deliberately or inadvertently tamper with information in order to disrupt its operations.</p>\r\n\r\n\r\n\r\n<p>Availability refers to an organisation’s ability to access information when needed. For example, this could happen if an insider damages the organisation’s server or deletes information from its Cloud systems.</p>\r\n\r\n\r\n\r\n<p>The risks presented by negligent insiders are, by definition, harder to define. They aren’t operating with malicious intent, so it’s impossible to say exactly what outcome their actions will have.</p>\r\n\r\n\r\n\r\n<p>The best-case scenario is that the vulnerability caused by their negligence is spotted before any adverse consequences occur. However, in organisations where information security practices are lacking, continuous mistakes could result in long-running and extensive-ranging breaches.</p>\r\n\r\n\r\n\r\n\r\n\r\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Examples of insider threats</strong></h2>\r\n\r\n\r\n\r\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>1. Theft of trade secrets</strong></h4>\r\n\r\n\r\n\r\n<p>The US multinational company General Electric learned in July 2022 that&nbsp;<a href=\"https://www.justice.gov/usao-ndny/pr/former-ge-engineer-sentenced-24-months-conspiring-steal-trade-secrets\" target=\"_blank\" rel=\"noreferrer noopener\">an employee had stolen more than 8,000 sensitive files</a>&nbsp;in a breach that spanned more than eight years.&nbsp;</p>\r\n\r\n\r\n\r\n<p>An engineer at the firm, Jean Patrice Delia, had persuaded an IT administrator to grant him access to sensitive information, which he siphoned off with the intention of starting a rival company.&nbsp;</p>\r\n\r\n\r\n\r\n<p>The FBI investigated the incident and learned that Delia emailed commercially sensitive information to a co-conspirator. He eventually pleaded guilty to the charges and was sentenced to up to 87 months in prison.&nbsp;</p>\r\n\r\n\r\n\r\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>2. Phishing</strong></h4>\r\n\r\n\r\n\r\n<p>Phishing is perhaps the biggest cyber security risk that organisations face, with organisations of all sizes and in all sectors being at risk.&nbsp;</p>\r\n\r\n\r\n\r\n<p>The NHS learned that to its cost this year, after more than 130 email accounts were compromised in a prolonged phishing campaign.&nbsp;</p>\r\n\r\n\r\n\r\n<p><a href=\"https://www.computerweekly.com/news/252516702/NHS-email-accounts-hijacked-for-phishing-campaign\" target=\"_blank\" rel=\"noreferrer noopener\">The Cloud security firm Inky found</a> that scammers sent 1,157 phishing emails originating from NHS mail between October 2021 and March 2022.&nbsp;</p>\r\n\r\n\r\n\r\n<p>The emails contained a link that directed to a bogus Microsoft 365 login page, asking them to provide their login details.&nbsp;</p>\r\n\r\n\r\n\r\n<p>Inky reported that at least 139 NHS emails were compromised in the attack, but the true scope of the campaign was likely much larger, because the organisation only analysed phishing attacks made against its own customers.&nbsp;</p>\r\n\r\n\r\n\r\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>3. Sabotage</strong></h4>\r\n\r\n\r\n\r\n<p>A system administrator who lost his job at a paper mill served 34 months in prison after tampering with the control systems of his former employer and&nbsp;<a href=\"https://www.theadvocate.com/baton_rouge/news/courts/article_7f6ea818-f488-11e6-bada-eb1757011f89.html\" target=\"_blank\" rel=\"noreferrer noopener\">causing $1.1 million (about £900,000) in damages</a>.&nbsp;</p>\r\n\r\n\r\n\r\n<p>Brian Johnson, who had been made redundant by the paper manufacturer Georgia-Pacific after 15 years’ service, was able to use login credentials that remained valid. He accessed servers via a VPN in his home, installing his own software and altering the industrial control systems.&nbsp;</p>\r\n\r\n\r\n\r\n<p>In a two-week-long attack on the firm’s factory in Port Hudson, Louisiana, Johnson created a series of delays that cost his former employer huge sums in missed deadlines.&nbsp;</p>\r\n\r\n\r\n\r\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>4. Financially motivated</strong></h4>\r\n\r\n\r\n\r\n<p>In June 2022, a Taco Bell employee&nbsp;<a href=\"https://www.wmbfnews.com/2022/06/22/hartsville-taco-bell-worker-accused-credit-card-identity-fraud/\" target=\"_blank\" rel=\"noreferrer noopener\">was caught stealing customers’ credit card details</a>&nbsp;and using the numbers to buy items for herself.&nbsp;</p>\r\n\r\n\r\n\r\n<p>Police were called after a victim reported that someone had tried to use their credit card at a nearby Pizza Hut.&nbsp;</p>\r\n\r\n\r\n\r\n<p>The investigation soon led to 36-year-old Laquawanda Hawkins, who worked in Taco Bell’s drive-thru. CCTV footage revealed that she had taken photographs of customers bank cards and used the information to make a series of purchases locally and online.&nbsp;</p>\r\n\r\n\r\n\r\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>5. Internal error</strong></h4>\r\n\r\n\r\n\r\n<p>Pegasus Airline accidentally left 23 million files containing personal data exposed online after an employee improperly configured a database.&nbsp;<a href=\"https://techmonitor.ai/technology/cybersecurity/pegasus-airline-data-breach-aws-bucket\" target=\"_blank\" rel=\"noreferrer noopener\">The incident was reported in June 2022</a>&nbsp;after the Turkish airline discovered the error.&nbsp;</p>\r\n\r\n\r\n\r\n<p>Organisations often use third-party services to store sensitive information, because it saves them money and resources. With a Cloud service provider, the data is stored on a central server that can be accessed online.&nbsp;</p>\r\n\r\n\r\n\r\n<p>Because the information is stored online, organisations must adopt appropriate controls to ensure that only authorised people can access the information.&nbsp;</p>\r\n\r\n\r\n\r\n<p>In this case, an employee misconfigured the security settings, exposing valuable information such as fight charts, navigation materials and information data of flight crew.&nbsp;</p>\r\n\r\n\r\n\r\n<p>The database also contained up to 400 files with plaintext passwords and secret keys, as well as the source code for the software.&nbsp;</p>\r\n\r\n\r\n\r\n\r\n\r\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>How to detect an insider threat</strong></h2>\r\n\r\n\r\n\r\n<p>Whether you’re trying to spot malicious or negligent behaviour, the best way to detect insider threats is to keep an eye out for employees acting abnormally.<strong></strong></p>\r\n\r\n\r\n\r\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Behavioural indicators</strong></h4>\r\n\r\n\r\n\r\n<p>If an employee appears to be dissatisfied at work, they might act less professionally in person and in correspondences. Likewise, the quality of their work might decline and they may show other signs of insubordination, such as turning up to work late or leaving early.</p>\r\n\r\n\r\n\r\n<p>Suspicious behaviour can also include working at unusual times. If an employee logs in to their systems in the middle of the night, it suggests they are doing something that they don’t want their employer to know about.</p>\r\n\r\n\r\n\r\n<p>They might also take a more cavalier attitude towards work and their professional standards. An insider threat might talk often about how much they dislike their job and make reference to the fact they are planning or hoping to quit.</p>\r\n\r\n\r\n\r\n<h4 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Digital indicators</strong></h4>\r\n\r\n\r\n\r\n<p>If there is a large volume of traffic, it might indicate that the employee is copying sensitive information to a personal hard drive, which they can use for fraudulent purposes.</p>\r\n\r\n\r\n\r\n<p>Most telling, however, is if the employee accesses resources that they wouldn’t ordinarily need for their job. This suggests that they are using information for illegitimate purposes, whether that’s to commit fraud or to share with a third party.</p>\r\n\r\n\r\n\r\n<p>Other signs of insider threat include using unauthorised storage devices (such as USB drives and the Cloud), network crawling and searching for sensitive data and data hoarding.</p>\r\n\r\n\r\n\r\n<p>They might also copy files from sensitive folders, email sensitive data to non-work affiliated accounts or attempt to bypass security mechanisms.</p>\r\n\r\n\r\n\r\n\r\n\r\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>How to protect against insider threats</strong></h2>\r\n\r\n\r\n\r\n<p>Insider threats can occur in any number of ways, which means there’s no single solution you can use to mitigate the risk. You must instead take a holistic approach, with an overarching security mechanism to address your vulnerabilities.</p>\r\n\r\n\r\n\r\n<p>You should start with technical controls to protect critical assets. This should include network monitoring so you can see when users are active, as well as the documents that they view.</p>\r\n\r\n\r\n\r\n<p>Alongside this, you should implement access controls to ensure that employees can only view information that’s relevant to their job. This will take time to configure, as the requirements for each job role will differ.</p>\r\n\r\n\r\n\r\n<p>However, you can cut down on the work by identifying information that’s suitable for everyone in the organisation to view as well as highly classified information that only senior personnel can access.</p>\r\n\r\n\r\n\r\n<p>From there, access to information can be controlled based on its purpose and who in the organisation uses it.</p>\r\n\r\n\r\n\r\n<p>In addition to technical controls, you should adopt cyber security policies that outline employees’ requirements when handling sensitive information.</p>\r\n\r\n\r\n\r\n<p>Likewise, you should take steps to promote the organisation’s security culture. This will give staff a greater understanding of insider threats and mitigate the risk of accidental data breaches.</p>\r\n\r\n\r\n\r\n<p>Demonstrating a company-wide commitment to information security will also dissuade malicious action, as potential wrongdoers learn about the measures the organisation has in place to detect and identify the source of data breaches.</p>\r\n\r\n\r\n\r\n<p>The best place to start when developing a security culture is staff awareness training. An effective course will promote the importance of cyber security and demonstrate the technical and organisational measures that are in place to mitigate the risk.</p>\r\n\r\n\r\n<div class=\"wp-block-image\">\r\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-8.png\" alt=\"\" class=\"wp-image-44832\" width=\"199\" height=\"199\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-8.png 320w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-8-300x300.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-8-150x150.png 150w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-8-65x65.png 65w\" sizes=\"(max-width: 199px) 100vw, 199px\" /></figure></div>\r\n\r\n\r\n<p>You can give employees all the information they need with our&nbsp;<a href=\"https://www.itgovernance.co.uk/shop/product/complete-staff-awareness-e-learning-suite\">Complete Staff Awareness E-learning Suite</a>.</p>\r\n\r\n\r\n\r\n<p>This online course offers a quick, affordable and comprehensive solution to your training needs.</p>\r\n\r\n\r\n\r\n<p>It contains all eight of our e-learning courses, covering essential topics such as the&nbsp;GDPR,&nbsp;ISO 27001&nbsp;and&nbsp;phishing.</p>\r\n\r\n\r\n\r\n<p>All you need to do is purchase a licence for the number of staff taking the courses.</p>\r\n\r\n\r\n\r\n<p>The suite is available on a one-year, easily renewable licence, and the courses can be taken as many times as you like.</p>\r\n\r\n\r\n\r\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-6 wp-block-buttons-is-layout-flex\">\r\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link has-white-color has-luminous-vivid-orange-background-color has-text-color has-background wp-element-button\" href=\"https://www.itgovernance.co.uk/shop/product/complete-staff-awareness-e-learning-suite\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Learn more</strong></a></div>\r\n</div>\r\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/what-is-an-insider-threat-definition-types-and-examples\">Insider Threats Unveiled: Definition, Types, and Real-Life Examples</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"What Is Data Minimisation? Definition & Examples","link":"https://www.itgovernance.co.uk/blog/what-is-data-minimisation-definition-examples","dc:creator":{"#cdata-section":"Luke Irwin"},"pubDate":"Tue, 18 Apr 2023 09:16:58 +0000","category":{"#cdata-section":"Cyber Security"},"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=44804"},"description":{"#cdata-section":"<p>Data minimisation is a key part of information security and the GDPR (General Data Protection Regulation) in particular. Its principles are at the heart of effective data protection practices, and are intended to prevent privacy breaches and minimise the damage when security incidents occur. What is data minimisation? Data minimisation requires organisations to process personal data only if it serves a specific purpose, and to retain it for only as long as it’s needed to meet that purpose. Article 5(1) of the GDPR provides further guidance, explaining that organisations should consider three factors whenever they process personal information: Meeting the </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/what-is-data-minimisation-definition-examples\">What Is Data Minimisation? Definition &amp; Examples</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>Data minimisation is a key part of information security and the <a href=\"https://www.itgovernance.co.uk/data-protection-dpa-and-eu-data-protection-regulation?promo_name=megamenu-dataprivacy&amp;promo_id=info-gdpr\" target=\"_blank\" rel=\"noreferrer noopener\">GDPR (General Data Protection Regulation)</a> in particular.</p>\n\n\n\n<p>Its principles are at the heart of effective data protection practices, and are intended to prevent privacy breaches and minimise the damage when security incidents occur.</p>\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>What is data minimisation?</strong></h2>\n\n\n\n<p>Data minimisation requires organisations to process personal data only if it serves a specific purpose, and to retain it for only as long as it’s needed to meet that purpose.</p>\n\n\n\n<p>Article 5(1) of the GDPR provides further guidance, explaining that organisations should consider three factors whenever they process personal information:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li><strong>Adequacy</strong>: is the personal data that’s been processed sufficient to fulfil your stated purpose?</li>\n\n\n\n<li><strong>Relevance</strong>: does the information have a clear link to that purpose?</li>\n\n\n\n<li><strong>Necessity</strong>: do you have more information than you need to fulfil that purpose?</li>\n</ul>\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Meeting the requirements</strong></h2>\n\n\n\n<p>The GDPR doesn’t provide specific guidance on the sorts of practices that meet the threshold of adequacy, relevance and necessity. This is because the answer will depend on the specific circumstances for processing and using the personal data.</p>\n\n\n\n<p>As such, organisations must justify their processing practices and explain why they meet the guidelines for data minimisation.</p>\n\n\n\n<p>The first step to solving that issue is to understand what you are trying to achieve with this data processing activity. In other words: what is all this information going to be used for? You should be as specific as possible when answering this question, identifying clear objectives.</p>\n\n\n\n<p>You can use your documented <a href=\"https://www.itgovernance.co.uk/blog/gdpr-lawful-bases-for-processing-with-examples\" target=\"_blank\" rel=\"noreferrer noopener\">lawful basis for processing</a> as a guideline here. For example, if you’re processing the information to meet your legal obligations or contractual requirements, you can identify specific activities within those terms.</p>\n\n\n\n<p>Likewise, if you’re processing information to protect an individuals’ vital interests, you can ask yourself how each piece of data supports that activity.</p>\n\n\n\n<p>You must be careful when completing this process. It might not seem like a crucial task, at least compared to measures specifically designed to prevent data breaches, but data minimisation is a core principle of the GDPR.</p>\n\n\n\n<p>The damage caused by data breaches is often exacerbated by organisations processing unnecessary amounts of personal information, thus increasing the volume of data compromised in security incidents.</p>\n\n\n\n<p>By keeping your data processing activities to a minimum, you reduce the threat of data breaches and privacy violations. You also reduce the amount of work you need to do to protect and maintain your records.</p>\n\n\n\n<p>This is particularly true when it comes to special category data or criminal offence data, where extra precautions are in place.</p>\n\n\n\n<p>If you are at all unsure whether your data processing practices meet the thresholds, you should err on the side of caution or seek expert guidance.</p>\n\n\n\n<p>You should also review your processing practices periodically to ensure that the personal data you hold is still relevant and adequate.</p>\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>What to look out for</strong></h2>\n\n\n\n<p><a href=\"https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/principles/data-minimisation/#how_do_we_decide\" target=\"_blank\" rel=\"noreferrer noopener\">The ICO (Information Commissioner’s Office) provides</a> further guidance on the GDPR’s data minimisation requirements, and it provides examples of situations where compliance could be jeopardised.</p>\n\n\n\n<p>In one scenario, the ICO describes a debt collection agency that’s trying to locate a particular debtor. After processing information on several people with a similar name, it finds the right person.</p>\n\n\n\n<p>At this point, the agency must delete the relevant records for the people whose information it collected during its search. However, it’s a good idea to keep a basic record of the people it removed from its search, provided it has no intention of contacting them again.</p>\n\n\n\n<p>The ICO highlights that an organisation cannot keep records on the off chance that they will be useful in the future. However, if it can document a reason why that information might be important at a later data, it’s permitted to retain it.</p>\n\n\n\n<p>In another example, the ICO describes a group of individuals who set up a club. At first, it has only a handful of members who all know each other, and the activities are set up using the members’ names and email addresses.</p>\n\n\n\n<p>Over time, the club becomes more popular and the administrators realise that they need additional information about its members in order to keep track of their membership status and subscription payments.</p>\n\n\n\n<p>The ICO notes that, although the group hadn’t initially intended to process these types of data, it’s entitled to change the terms of processing as requirements change.</p>\n\n\n\n<p>In fact, organisations that fail to change the terms of processing might actually be breaching their data protection obligations. If they don’t have enough data to perform necessary tasks – such as tracking subscriptions – their records are inadequate for the organisation’s purpose.</p>\n\n\n\n<p>Personal data might also be considered inadequate if the organisation makes decisions about someone based on an incomplete understanding of the facts. Incomplete or inaccurate records could lead to information being misinterpreted and false judgements being drawn.</p>\n\n\n\n<p>Organisations should prevent this by reviewing their records regularly to ensure that data is accurate and up to date.</p>\n\n\n\n<h2 style=\"text-transform: none;\" class=\"wp-block-heading\"><strong>Meeting your data minimisation requirements</strong></h2>\n\n\n\n<p>Data minimisation is a crucial practice for all organisations, but as with many aspects of the GDPR, it’s a particular challenge for marketing departments.</p>\n\n\n\n<p>It’s why IT Governance created <a href=\"https://www.itgovernance.co.uk/green-papers/gdpr-and-pecr-a-guide-for-marketers\" target=\"_blank\" rel=\"noreferrer noopener\">GDPR and PECR – A guide for marketers</a> to help explain the difficulties these teams face.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-7-1024x724.png\" alt=\"\" class=\"wp-image-44805\" width=\"248\" height=\"175\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-7-1024x724.png 1024w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-7-300x212.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-7-768x543.png 768w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-7-211x150.png 211w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-7.png 1234w\" sizes=\"(max-width: 248px) 100vw, 248px\" /></figure></div>\n\n\n<p>This free green paper explains what you need to do to ensure your marketing activities meet your regulatory requirements, and how you can save time by addressing all privacy legislation together.</p>\n\n\n\n<p>It covers the key requirements of data protection laws in relation to marketing.</p>\n\n\n\n<p>You’ll find a range of tips for meeting your GDPR and PECR compliance requirements, including the rules surrounding consent.</p>\n\n\n\n<p><strong>Avoid the risk of non-compliance. Download your free guide today.</strong></p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-7 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link has-white-color has-luminous-vivid-orange-background-color has-text-color has-background wp-element-button\" href=\"https://www.itgovernance.co.uk/green-papers/gdpr-and-pecr-a-guide-for-marketers\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Download now</strong></a></div>\n</div>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/what-is-data-minimisation-definition-examples\">What Is Data Minimisation? Definition &amp; Examples</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"How to Prevent Malware Attacks: 8 Tips for 2023","link":"https://www.itgovernance.co.uk/blog/how-to-prevent-malware-attacks-8-tips-for-2023","dc:creator":{"#cdata-section":"Luke Irwin"},"pubDate":"Wed, 05 Apr 2023 13:00:22 +0000","category":{"#cdata-section":"Cyber Security"},"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=44745"},"description":{"#cdata-section":"<p>Malware is one of the most common cyber security threats that organisations and individuals face. Whenever someone talks about their computer being infected, encountering bots or even falling victim to a scam email, malware is normally involved. It’s why anti-malware software is usually considered a top priority for staying safe online. However, those tools are not flawless. For example, they can only spot known types of malware, and according to the AV-Test Institute, almost half a million new types of malware are detected each day. But how exactly does malware work? In this blog, we explain everything you need to </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/how-to-prevent-malware-attacks-8-tips-for-2023\">How to Prevent Malware Attacks: 8 Tips for 2023</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>Malware is one of the most common cyber security threats that organisations and individuals face. Whenever someone talks about their computer being infected, encountering bots or even falling victim to a scam email, malware is normally involved.</p>\n\n\n\n<p>It’s why anti-malware software is usually considered a top priority for staying safe online. However, those tools are not flawless. For example, they can only spot known types of malware, and <a href=\"https://www.av-test.org/de/statistiken/malware/\" target=\"_blank\" rel=\"noreferrer noopener\">according to the AV-Test Institute</a>, almost half a million new types of malware are detected each day.</p>\n\n\n\n<p>But how exactly does malware work? In this blog, we explain everything you need to know about it, including our top 8 tips for preventing malware attacks.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\"><strong>What is malware?</strong></h2>\n\n\n\n<p>Malware, or malicious software, is a broad term that refers to any type of code that intends to harm a computer.</p>\n\n\n\n<p>It can do this in a number of ways, such as:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li>Stealing, encrypting or deleting sensitive information;</li>\n\n\n\n<li>Hijacking or altering core system functions;</li>\n\n\n\n<li>Monitoring user activity; and</li>\n\n\n\n<li>Spamming the device with adverts.</li>\n</ul>\n\n\n\n\n\n<h2 style=\"text-transform: none;\"><strong>Types of malware</strong></h2>\n\n\n\n<p>There are many different types of malware, but there are <a href=\"https://www.itgovernance.co.uk/blog/7-types-of-malware-you-need-to-look-out-for\" target=\"_blank\" rel=\"noreferrer noopener\">seven types</a> that are extremely common:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li><strong>Adware</strong> displays ads on your computer – typically in the form of popups and windows that can’t be closed.</li>\n\n\n\n<li><strong>Spyware</strong> monitors Internet activity and gathers information, which can either be sold to a third party or used to target you with adware.</li>\n\n\n\n<li><strong>Bots</strong> run automatic and often repetitive tasks over the Internet. This might not necessarily be for criminal purposes (think, for example, of Twitterbots, which tweet and follow other accounts), but bots can be used to harness multiple computers in a botnet and create a more powerful threat.</li>\n\n\n\n<li><strong>Ransomware </strong>spreads through a target’s systems, encrypting files as it goes. The criminal behind the attack then demands a payment in exchange for the decryption key.</li>\n\n\n\n<li><strong>Trojan horses</strong> are malicious programs that masquerades as something useful in an attempt to trick people into downloading it.</li>\n\n\n\n<li><strong>Viruses</strong> copy themselves and spread, undetected, to other victims. It can do this by attaching itself to programs, script files, documents and cross-site scripting vulnerabilities in web apps.</li>\n\n\n\n<li><strong>Worms</strong> are self-contained and self-propagating viruses. They usually show up via email and instant messages, and spread over networks by exploiting operating system vulnerabilities.</li>\n</ul>\n\n\n\n\n<ul class=\"wp-block-latest-posts__list is-grid columns-2 has-dates wp-block-latest-posts\"><li><div class=\"wp-block-latest-posts__featured-image alignleft\"><a href=\"https://www.itgovernance.co.uk/blog/mother-of-all-breaches-26-billion-records-leaked\" aria-label=\"‘Mother of All Breaches’: 26 BILLION Records Leaked\"><img loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"168\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/10/digital-8280789_1280-300x168.jpg\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" style=\"max-width:100px;max-height:100px;\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/10/digital-8280789_1280-300x168.jpg 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/10/digital-8280789_1280-1024x574.jpg 1024w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/10/digital-8280789_1280-768x430.jpg 768w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/10/digital-8280789_1280.jpg 1280w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></div><a class=\"wp-block-latest-posts__post-title\" href=\"https://www.itgovernance.co.uk/blog/mother-of-all-breaches-26-billion-records-leaked\">‘Mother of All Breaches’: 26 BILLION Records Leaked</a><time datetime=\"2024-01-24T14:11:37+00:00\" class=\"wp-block-latest-posts__post-date\">24th January 2024</time></li>\n<li><div class=\"wp-block-latest-posts__featured-image alignleft\"><a href=\"https://www.itgovernance.co.uk/blog/the-week-in-cyber-security-and-data-privacy-15-21-january-2024\" aria-label=\"The Week in Cyber Security and Data Privacy: 15 – 21 January 2024\"><img loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"155\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1-300x155.png\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" style=\"max-width:100px;max-height:100px;\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1-300x155.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1.png 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></div><a class=\"wp-block-latest-posts__post-title\" href=\"https://www.itgovernance.co.uk/blog/the-week-in-cyber-security-and-data-privacy-15-21-january-2024\">The Week in Cyber Security and Data Privacy: 15 – 21 January 2024</a><time datetime=\"2024-01-23T11:08:31+00:00\" class=\"wp-block-latest-posts__post-date\">23rd January 2024</time></li>\n<li><div class=\"wp-block-latest-posts__featured-image alignleft\"><a href=\"https://www.itgovernance.co.uk/blog/the-week-in-cyber-security-and-data-privacy-8-14-january-2024\" aria-label=\"The Week in Cyber Security and Data Privacy: 8 – 14 January 2024\"><img loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"155\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1-300x155.png\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" style=\"max-width:100px;max-height:100px;\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1-300x155.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1.png 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></div><a class=\"wp-block-latest-posts__post-title\" href=\"https://www.itgovernance.co.uk/blog/the-week-in-cyber-security-and-data-privacy-8-14-january-2024\">The Week in Cyber Security and Data Privacy: 8 – 14 January 2024</a><time datetime=\"2024-01-16T12:31:44+00:00\" class=\"wp-block-latest-posts__post-date\">16th January 2024</time></li>\n<li><div class=\"wp-block-latest-posts__featured-image alignleft\"><a href=\"https://www.itgovernance.co.uk/blog/the-week-in-cyber-security-and-data-privacy-1-7-january-2024\" aria-label=\"The Week in Cyber Security and Data Privacy: 1 – 7 January 2024\"><img loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"155\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1-300x155.png\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" style=\"max-width:100px;max-height:100px;\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1-300x155.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/12/1.-The-Week-in-Cyber-Security-and-Data-Privacy_1.png 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a></div><a class=\"wp-block-latest-posts__post-title\" href=\"https://www.itgovernance.co.uk/blog/the-week-in-cyber-security-and-data-privacy-1-7-january-2024\">The Week in Cyber Security and Data Privacy: 1 – 7 January 2024</a><time datetime=\"2024-01-09T18:22:49+00:00\" class=\"wp-block-latest-posts__post-date\">9th January 2024</time></li>\n</ul>\n\n\n\n\n<h2 style=\"text-transform: none;\"><strong>How is malware distributed?</strong></h2>\n\n\n\n<p>Malware is delivered in one of several ways, but the most common method by far is <a href=\"https://www.itgovernance.co.uk/blog/5-ways-to-detect-a-phishing-email\" target=\"_blank\" rel=\"noreferrer noopener\">phishing</a>. This is a type of fraud in which bogus messages appear as though they have come from a genuine source and encourage the user to follow a link or download an attachment.</p>\n\n\n\n<p>For instance, an email might look as though it is from Amazon with an order confirmation for a product the individual hasn’t made. Or perhaps the email contains an invoice attached and is sent to an employee’s work address.</p>\n\n\n\n<p>Whatever form the message takes, it’s almost always designed to create a sense of urgency and pressure the recipient into acting immediately.</p>\n\n\n\n<p>If the email contains an attachment, there will be malware hidden within it – often contained in a macro on a Word file – which is unleashed as soon as the user opens the file or approves the macro.</p>\n\n\n\n<p>By contrast, phishing emails that direct users to another website are typically designed to capture  login credentials, but the bogus website might also use another method of malware delivery: drive-by downloads.</p>\n\n\n\n<p>Compromised websites can be laced with malware, which infect users&#8217; devices after they inadvertently click a pop-up window that gives the site permission to download an attachment. The windows usually mask as something genuine, such as an error message that looks as though it’s part of the computer’s operating system.</p>\n\n\n\n<p>A subset of this is social network spam. Cyber criminals include bogus links on these platforms that direct visitors to a compromised website. For example, a video link might ask you to install a bogus video player plugin, which contains malware.</p>\n\n\n\n\n\n<h2 style=\"text-transform: none;\"><strong>How to prevent malware attacks in 2023</strong></h2>\n\n\n\n<p>As we&#8217;ve explained, malware can attack you in many different ways, so there’s no one way to prevent infections. However, there are certain measures you can take to protect you from an array of threats.</p>\n\n\n\n<p>Here are eight things you can do to get started:</p>\n\n\n\n<ul style=\"padding-top: 5px;\">\n<li><strong>Install antivirus and anti-malware software</strong>: These tools help protect your computer from viruses and other types of malicious software. Make sure to choose reputable software and keep it updated.</li>\n\n\n\n<li><strong>Update software and operating systems</strong>: Keeping software and operating systems updated is important because updates often include security patches and bug fixes that help protect against vulnerabilities.</li>\n\n\n\n<li><strong>Disable macro scripts in Microsoft Office files</strong>: Macro scripts can be used to execute malicious code, so it&#8217;s a good idea to disable them in Microsoft Office files unless you know that they are safe.</li>\n\n\n\n<li><strong>Back up important data</strong>: Backing up important data is important in case of a data breach or other type of cyber attack. Make sure to keep backups in a secure location.</li>\n\n\n\n<li><strong>Use a VPN</strong>: Using a VPN can help protect your online privacy by encrypting your internet traffic and masking your IP address.</li>\n\n\n\n<li><strong>Provide staff awareness training</strong>: Educating employees about cyber security best practices is important to help prevent cyber attacks. Make sure to provide training and resources to help employees understand the risks and how to protect themselves.</li>\n\n\n\n<li><strong>Implement access controls</strong>: These ensure that only authorised personnel can view sensitive information, and can protect data if an employee’s account it compromised.</li>\n\n\n\n<li><strong>Use email filters</strong>: These can identify known malware hidden within emails and block those messages from employees’ inboxes.</li>\n</ul>\n\n\n\n\n\n<h2 style=\"text-transform: none;\"><strong>Covering the essentials</strong></h2>\n\n\n\n<p>If you want more advice on preventing malware attacks, we recommend Cyber Essentials. It’s a UK government-backed scheme that outlines the basic measures that organisations can take to secure their systems.</p>\n\n\n\n<p>It contains five controls, one of which focuses on malware protection, and when they’re implemented correctly they can prevent 80% of common cyber attacks.</p>\n\n\n\n<p>IT Governance offers a <a href=\"https://www.itgovernance.co.uk/solutions-for-ces-certification\" target=\"_blank\" rel=\"noreferrer noopener\">range of solutions</a> to help you understand and implement the framework. We’re one of the founding Cyber Essentials certification bodies and remain one of the largest in the UK.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-2.png\" alt=\"\" class=\"wp-image-44746\" width=\"250\" height=\"177\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-2.png 512w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-2-300x212.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/04/image-2-211x150.png 211w\" sizes=\"(max-width: 250px) 100vw, 250px\" /></figure></div>\n\n\n<p>We also offer a free guide that provides more detail on Cyber Essentials and the way it helps organisations.</p>\n\n\n\n<p><a href=\"https://www.itgovernance.co.uk/cyber-essentials-a-guide-to-the-scheme\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Cyber Essentials: A guide to the scheme</strong></a>&nbsp;is a perfect introduction to framework, explaining the five controls and the ways they work to keep organisations safe.</p>\n\n\n\n<p>The guide also explains how to obtain certification and the things you should know before getting started.</p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-layout-8 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link has-white-color has-luminous-vivid-orange-background-color has-text-color has-background wp-element-button\" href=\"https://www.itgovernance.co.uk/cyber-essentials-a-guide-to-the-scheme\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Download now</strong></a></div>\n</div>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/how-to-prevent-malware-attacks-8-tips-for-2023\">How to Prevent Malware Attacks: 8 Tips for 2023</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}},{"title":"Data Backups Are for Life, Not Just for World Backup Day","link":"https://www.itgovernance.co.uk/blog/data-backups-are-for-life-not-just-for-world-backup-day","dc:creator":{"#cdata-section":"Luke Irwin"},"pubDate":"Tue, 28 Mar 2023 13:32:09 +0000","category":{"#cdata-section":"Cyber Security"},"guid":{"@isPermaLink":"false","#text":"https://www.itgovernance.co.uk/blog/?p=44652"},"description":{"#cdata-section":"<p>It’s almost time to wrap up your prized possessions and put them in a safe place, because this Friday marks World Backup Day. The international event takes place on 31 March and aims to raise awareness of the importance of securing valuable data. According to the event’s organisers, 21% of people have never made backups of important files, whether that’s family photos, business documents or work files. It’s a baffling statistic, because digital media is ubiquitous in our everyday lives and there is always a chance of those files being compromised. For instance, documents can be corrupted in a hardware </p>\n<p>The post <a href=\"https://www.itgovernance.co.uk/blog/data-backups-are-for-life-not-just-for-world-backup-day\">Data Backups Are for Life, Not Just for World Backup Day</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>It’s almost time to wrap up your prized possessions and put them in a safe place, because this Friday marks World Backup Day.</p>\n\n\n\n<p>The international event takes place on 31 March and aims to raise awareness of the importance of securing valuable data.</p>\n\n\n\n<p><a href=\"https://www.worldbackupday.com/en\" target=\"_blank\" rel=\"noreferrer noopener\">According to the event’s organisers</a>, 21% of people have never made backups of important files, whether that’s family photos, business documents or work files.</p>\n\n\n\n<p>It’s a baffling statistic, because digital media is ubiquitous in our everyday lives and there is always a chance of those files being compromised.</p>\n\n\n\n<p>For instance, documents can be corrupted in a hardware failure or compromised in a cyber attack, they can be lost or tampered with, or the devices that they’re kept on can be damaged.</p>\n\n\n\n<p>If you have only one copy of those files, they will be permanently lost. That’s a big risk given how easy it is to back up your files.</p>\n\n\n\n<p>Understanding these risks should be a cornerstone of our education, because almost everyone these days keeps digital files as part of their job or personal life.</p>\n\n\n\n<p>As <a href=\"https://www.digitaljournal.com/business/steps-for-securing-business-data-begin-with-first-identifying-it/article\" target=\"_blank\" rel=\"noreferrer noopener\">Databodi CTO Carl D’Halluin explains</a>: “Failing to backup your data can have catastrophic consequences, as a single hardware failure, cyberattack, or natural disaster can wipe out all your valuable information, leaving you with no way to recover it.</p>\n\n\n\n<p>“This means that years of hard work can all be lost in an instant, with no chance of retrieval. Even the cost of losing just a portion of your important data can be immeasurable, with potential financial, legal, and reputational implications that can last for years.”</p>\n\n\n\n<p>Given how important data backups are, you’d be forgiven for thinking that experts had detailed technical advice for securing your information. However, the process can be as simple or as complex as you like.</p>\n\n\n\n<p>Individuals might be content to email copies of sensitive files to themselves, keeping them in a server controlled by their email provider. Meanwhile, organisations will probably have more robust measures that automate the process.</p>\n\n\n\n<p>As part of its campaign, World Backup Day urges people to make the following pledge:</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1015\" height=\"192\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/03/image-5.png\" alt=\"\" class=\"wp-image-44653\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/03/image-5.png 1015w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/03/image-5-300x57.png 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2023/03/image-5-768x145.png 768w\" sizes=\"(max-width: 1015px) 100vw, 1015px\" /></figure></div>\n\n\n<div style=\"height:24px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Although that’s a great start, you need to get in the habit of backing up your data on a regular basis. Any time you create a new file or amend an existing one, you must ensure that the data is secured.</p>\n\n\n\n<p>It’s therefore worth taking the time to figure out a system that suits your needs. The information you save should be stored in a secure location that enables you to find the documents you need easily.</p>\n\n\n\n<h2 style=\"text-transform: none;\"><strong>Online vs offline backups</strong></h2>\n\n\n\n<p>The most common solution for backups is to store your data in the Cloud. Apple iCloud, Dropbox, Google Drive and Microsoft OneDrive are common Cloud storage providers, which enable people to quickly save duplicates in an online server.</p>\n\n\n\n<p>The process is often automatic, and it comes with the added benefit of allowing people to access data on one device that was created in another. This is handy if you have a photo saved on your phone that you want to display on your laptop, or if you want to share a file with someone else.</p>\n\n\n\n<p>However, the benefits of the Cloud have seen it take on mythic status among its proponents. There is a mistaken belief that you can simply put whatever information you like into the Cloud and it’ll be safe forever.</p>\n\n\n\n<p>But like any other Internet-connected system, the Cloud contains vulnerabilities that can be exploited. This means that servers can be rendered temporarily unavailable, or the data can viewed by unauthorised parties. Worse still, it could be permanently wiped.</p>\n\n\n\n<p>There’s no doubt that the Cloud is an ideal way to conveniently secure your files, particularly if you need to regularly access or amend them.</p>\n\n\n\n<p>However, if you have highly classified data or want to be certain that the information won’t be compromised, we recommend storing another set of backups offline.</p>\n\n\n\n<p>For example, you might keep your data on a USB stick or a portable hard drive. This ensures that you have versions of the data that are protected from cyber criminals or third-party technical failure.</p>\n\n\n\n<p>This isn’t a foolproof solution because these devices can also be damaged or lost, but there is a much lower risk of this happening.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><a href=\"https://www.itgovernance.co.uk/weekly-round-up\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" decoding=\"async\" width=\"800\" height=\"415\" src=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2022/03/WEEKLY-ROUNDUP.jpg\" alt=\"\" class=\"wp-image-43610\" srcset=\"https://www.itgovernance.co.uk/blog/wp-content/uploads/2022/03/WEEKLY-ROUNDUP.jpg 800w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2022/03/WEEKLY-ROUNDUP-300x156.jpg 300w, https://www.itgovernance.co.uk/blog/wp-content/uploads/2022/03/WEEKLY-ROUNDUP-768x398.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></figure></div><p>The post <a href=\"https://www.itgovernance.co.uk/blog/data-backups-are-for-life-not-just-for-world-backup-day\">Data Backups Are for Life, Not Just for World Backup Day</a> appeared first on <a href=\"https://www.itgovernance.co.uk/blog\">IT Governance UK Blog</a>.</p>\n"}}]}}}