{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Security Intelligence","atom:link":{"@href":"http://securityintelligence.com/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://securityintelligence.com","description":"Analysis and Insight for Information Security Professionals","lastBuildDate":"Fri, 26 Jan 2024 17:21:11 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.4.2","image":{"url":"https://securityintelligence.com/wp-content/uploads/2016/04/SI_primary_rgb-80x80.png","title":"Security Intelligence","link":"https://securityintelligence.com","width":"32","height":"32"},"item":[{"title":"DORA and your quantum-safe cryptography migration","link":"https://securityintelligence.com/posts/dora-quantum-safe-cryptography-migration/","dc:creator":{"#cdata-section":"Dinesh Nagarajan"},"pubDate":"Fri, 26 Jan 2024 17:00:00 +0000","category":[{"#cdata-section":"Banking & Finance"},{"#cdata-section":"Data Protection"},{"#cdata-section":"Risk Management"},{"#cdata-section":"quantum cryptography"},{"#cdata-section":"finance"},{"#cdata-section":"quantum-safe"},{"#cdata-section":"quantum-safe cryptography"},{"#cdata-section":"DORA"},{"#cdata-section":"Cryptography"},{"#cdata-section":"Quantum Computing"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446907"},"description":{"#cdata-section":"<p>Quantum computing is a new paradigm with the potential to tackle problems that classical computers cannot solve today. Unfortunately, this also introduces threats to the digital economy and particularly the financial sector. The Digital Operational Resilience Act (DORA) is a regulatory framework that introduces uniform requirements across the European Union (EU) to achieve a &#8220;high [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/dora-quantum-safe-cryptography-migration/\">DORA and your quantum-safe cryptography migration</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p><a href=\"https://www.ibm.com/quantum\"  target=\"_blank\" rel=\"noopener nofollow\" >Quantum computing</a> is a new paradigm with the potential to tackle problems that classical computers cannot solve today. Unfortunately, this also introduces threats to the digital economy and particularly the financial sector.</p>\n<p>The <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A52020PC0595\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Digital Operational Resilience Act (DORA)</a> is a regulatory framework that introduces uniform requirements across the European Union (EU) to achieve a &ldquo;high level of operational resilience&rdquo; in the financial services sector. Entities covered by DORA &mdash; such as credit institutions, payment institutions, insurance undertakings, information and communication technology (ICT) service providers, etc. &mdash; are expected to comply by January 17, 2025.</p>\n<h2>New requirements for financial entities in the EU</h2>\n<p>DORA lays out a set of requirements across ICT risk management, incident reporting, operational resilience testing, cyber threat and vulnerability information sharing, and third-party risk management. As part of those requirements and in the context of data protection and <a href=\"https://www.ibm.com/topics/cryptography\"  target=\"_blank\" rel=\"noopener nofollow\" >cryptography</a>, it lays out in Article 9 (&ldquo;Protection and prevention&rdquo;) that financial entities &ldquo;shall use ICT solutions and processes&rdquo; that &ldquo;(a) ensure the security of the means of transfer of data&rdquo; or &ldquo;(c) prevent [&hellip;] the impairment of the authenticity and integrity, the breaches of confidentiality and the loss of data.&rdquo;</p>\n<p>Further elements to consider in the context of Article 9 are referred to in Article 15 and laid out in the related (draft) regulatory technical standards, which the <a href=\"https://www.esma.europa.eu/press-news/esma-news/esas-publish-first-set-rules-under-dora-ict-and-third-party-risk-management\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >ESA published on January 17, 2024</a>. Particularly, <a href=\"https://www.esma.europa.eu/document/final-report-draft-rts-ict-risk-management-framework-and-simplified-ict-risk-management\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >JC 2023 86</a> provides detailed requirements on cryptographic guidance. In addition, in its preambles, the following is stated:</p>\n<p>&ldquo;Given the rapid technological developments in the field of cryptographic techniques, financial entities [&hellip;] should remain abreast of relevant developments in cryptanalysis and consider leading practices and standards and should hence follow a flexible approach based on mitigation and monitoring to deal with the dynamic landscape of cryptographic threats, including those from quantum advancements.&rdquo;</p>\n<p>Below, we will further elaborate on the referred &lsquo;cryptographic threats&rsquo; and the implications they could have on financial institutions in the context of quantum computing.</p>\n<h2>Quantum threats and quantum-safe cryptography</h2>\n<p>While current quantum computers still struggle with noise and are not yet &ldquo;fault-tolerant,&rdquo; impressive milestones <a href=\"https://www.nature.com/articles/s41586-023-06096-3\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >have been reached</a> already proving their utility. Given the number of investments being made in both the private sector and academia, it is expected that this technology will scale and drastically improve over time. As it does, the potential threat to the digital economy will grow.</p>\n<p>In 1994, the physicist Peter Shor <a href=\"https://ieeexplore.ieee.org/document/365700/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >introduced an algorithm</a> that, when run on a large-scale quantum computer, could break public key-cryptography algorithms such as Rivest-Shamir-Adleman (RSA), Diffie-Hellman and Elliptic Curve Cryptography (ECC). The financial sector relies on these algorithms to ensure the confidentiality and integrity of bank transactions, the authenticity of its customers, the validity of digitally signed documents and the confidentiality of customer financial data. If the supporting cryptography can no longer be trusted, the entire financial sector is at risk.</p>\n<p><amp-img src=\"https://images4.cmp.optimizely.com/Zz1hOTFiMzJkMGIxNzgxMWVlOTYwN2VlNDQwMmExYzVkNw==\" layout=\"intrinsic\" class=\"\" alt=\"An infographic showing the threats that quantum computing poses to cryptography.\" width=\"688\" height=\"323\" lightbox=\"lightbox\"></amp-img></p>\n<p class=\"wc-small\" style=\"text-align: center; font-size: 13px; line-height: 20px;\"><em>Quantum threats posed to cryptography</em></p>\n<p>To break today&rsquo;s cryptography, a so-called Cryptographically Relevant Quantum Computer (CRQC) would need to be realized (some experts estimate it could happen <a href=\"https://globalriskinstitute.org/publication/2022-quantum-threat-timeline-report/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >in the early 2030s</a>). However, while the impact is in the future, we are at risk already. One can imagine an attacker harvesting encrypted confidential data today to decrypt it later.</p>\n<h2>Fast-tracking quantum-resistant cryptography</h2>\n<p>Fortunately, new &ldquo;quantum-safe&rdquo; cryptography is being standardized, with the most noteworthy effort being run by the National Institute of Standards and Technology (NIST). In 2016, NIST launched a competition with more than 80 submissions to standardize a new form of cryptography that will run on ordinary systems (e.g., laptops, cloud, etc.) but will be resistant to a quantum attacker because it relies on mathematical problems that are hard to solve by a quantum (and classical) computer.</p>\n<p>The <a href=\"https://csrc.nist.gov/Projects/post-quantum-cryptography/selected-algorithms-2022\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >first four algorithms</a> for standardization were selected by NIST in July 2022 (out of which three were co-contributed by IBM). While the standards are planned to be released in 2024, additional alternate candidates are still being considered.</p>\n<p><amp-img src=\"https://images2.cmp.optimizely.com/Zz1hOGVmYWI2YWIxNzgxMWVlYTU2ODE2NmYyZTI4NDc5ZA==\" layout=\"intrinsic\" class=\"\" alt=\"NIST standardization timeline for quantum-safe (aka 'post-quantum') cryptography.\" width=\"701\" height=\"295\" lightbox=\"lightbox\"></amp-img></p>\n<p class=\"wc-small\" style=\"text-align: center; font-size: 13px; line-height: 20px;\"><em>NIST standardization timeline for quantum-safe (aka &lsquo;post-quantum&rsquo;) cryptography</em></p>\n<p>A quantum-safe cryptography standard is in sight. Unfortunately, due to the complexity of the financial sector in particular, a lengthy journey lies ahead. NIST <a href=\"https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04282021.pdf\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >assumes</a> that &ldquo;five to 15 or more years will elapse [&hellip;] before a full implementation of those standards is completed.&rdquo; If we overlay this with the development timelines of a CRQC, one realizes that entities have to start this journey today.</p>\n<h2>Why quantum has an impact on DORA</h2>\n<p>Quantum threats, when they materialize, have the potential to drastically impact the operational resilience of financial entities and could disrupt the economy globally. Fortunately, new quantum-safe cryptography algorithms are available (with standards very soon to be published), which will be needed to mitigate those threats.</p>\n<p>If we relate this to the requirements of DORA, we can draw several direct links. To satisfy Article 9, financial entities will need to adopt quantum-safe means of data transfer, as well as quantum-safe mechanisms to &ldquo;prevent [&hellip;] the impairment of the authenticity and integrity, the breaches of confidentiality and loss of data.&rdquo;</p>\n<p>This implies the need to adopt upcoming, quantum-safe data-in-transit protocols such as quantum-safe transport layer security (TLS) or quantum-safe virtual private networks (VPNs), as well as quantum-safe mechanisms for signing (legally binding) documents or bank transactions. As a result, financial entities will need to implement supporting infrastructure such as quantum-safe public key infrastructure (PKI) and key management systems.</p>\n<p>Additionally, implementations today are often in the hands of third-party suppliers. To add to the complexity, in many cases, existing programs, such as a &ldquo;move to cloud&rdquo; or &ldquo;zero trust&rdquo; implementation, will be impacting several of the above-mentioned elements.</p>\n<h2>Quantum threats can have serious consequences</h2>\n<p>In a worst-case scenario, if financial services organizations do not remediate quantum threats in their digital ecosystem, this can impact the resilience of their business by:</p>\n<ul>\n<li>Being unable to verify authorized users on their network leads to confusion and a complete lack of trust in their digital ecosystem.</li>\n<li>Being unable to fulfill their data privacy regulations due to a lack of trust in the mechanisms (e.g., encryption) used to protect such data.</li>\n<li>Increased risk of exposure to external threats from the presence of vulnerable cryptography protocols and algorithms on business-to-business and supply chain networks.</li>\n<li>Disruption of day-to-day business from downtime required to remediate digital services and applications.</li>\n</ul>\n<p>Given current draft requirements as per <a href=\"https://www.esma.europa.eu/document/final-report-draft-rts-ict-risk-management-framework-and-simplified-ict-risk-management\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >JC 2023 86</a>, one can anticipate that soon after quantum-safe cryptography is standardized, it will be considered an account-leading practice. Hence, regardless of when quantum threats might materialize, regulatory requirements, such as DORA, will soon implicitly mandate the adoption of quantum-safe cryptography in the financial industry.</p>\n<p>At the same time, organizations should seize the opportunity to improve their overall cryptographic agility by modernizing the way cryptography is implemented today and making future changes much more timely and cost-efficient.</p>\n<h2>Implement your quantum-safe migration</h2>\n<p>It is clear that implementing quantum-safe cryptography will not be an easy endeavor. Such a migration program will require agility and also offers the possibility to exploit an early mover advantage. It will require a multi-pronged approach, including top-down business priorities as well as bottom-up technical capabilities.</p>\n<p>We recommend the following steps that organizations impacted by DORA should take at a minimum:</p>\n<ul>\n<li>Assess and review your enterprise cryptographic posture and identify elements (applications, networks, strategic projects, etc.) potentially impacted by quantum threats.</li>\n<li>Develop a plan based on business priorities and take into account synergies with existing transformation programs, laying out an approach to remediation for the impacted digital services and corresponding systems.</li>\n<li>Improve your cryptographic posture by introducing cryptographic discovery and inventory capabilities. Introduce cryptographic observability to validate cryptographic compliance on an ongoing basis, including leveraging &ldquo;<a href=\"https://owasp.org/blog/2023/10/03/CycloneDX-Cryptography-CBOM.html\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >cryptography bills of material</a>.&rdquo; Such elements will increase the cryptographic agility of your organization.</li>\n<li>Ensure current change processes and strategic projects take into consideration the impact of cryptography and provisions are made to implement remediation on the least disruptive basis.</li>\n<li>Sponsor a program to continue the steps above continually.</li>\n</ul>\n<p>Above all, do not wait to begin tackling these steps. We strongly recommend that organizations define a quantum-safe migration program today.</p>\n<a class=\"btn orange1 large\" href=\"https://www.ibm.com/quantum/quantum-safe\" >Start your quantum safe journey</a>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/dora-quantum-safe-cryptography-migration/\">DORA and your quantum-safe cryptography migration</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Updated SBOM guidance: A new era for software transparency?","link":"https://securityintelligence.com/articles/updated-sbom-guidance-2024/","dc:creator":{"#cdata-section":"C.J. Haughey"},"pubDate":"Thu, 25 Jan 2024 14:00:00 +0000","category":[{"#cdata-section":"Government"},{"#cdata-section":"Risk Management"},{"#cdata-section":"CISA"},{"#cdata-section":"cyber risk management"},{"#cdata-section":"sbom"},{"#cdata-section":"sbom security"},{"#cdata-section":"Federal Government"},{"#cdata-section":"National Institute of Standards and Technology (NIST)"},{"#cdata-section":"Open Source"},{"#cdata-section":"Supply Chain"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446904"},"description":{"#cdata-section":"<p>The cost of cyberattacks on software supply chains is a growing problem, with the average data breach costing $4.45 million in 2023. Since President Biden&#8217;s 2021 executive order, software bills of materials (SBOMs) have become a cornerstone in protecting supply chains. In December 2023, the National Security Agency (NSA) published new guidance to help organizations [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/updated-sbom-guidance-2024/\">Updated SBOM guidance: A new era for software transparency?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p><span class=\"resolved\">The cost of cyberattacks on software supply chains is </span><span class=\"resolved\">a growing problem, with the <a href=\"https://www.ibm.com/reports/data-breach\"  target=\"_blank\" rel=\"noopener nofollow\" >average data breach costing $4.45 million</a></span> in 2023. Since President Biden&rsquo;s 2021 executive order, software bills of materials (SBOMs) have become a cornerstone in <a href=\"https://securityintelligence.com/posts/securing-supply-chain-through-cyber-risk-management/\"  target=\"_blank\" rel=\"noopener nofollow\" >protecting supply chains</a>.</p>\n<p><span class=\"resolved\">In December 2023,</span> the National Security Agency (NSA) published new guidance to help organizations incorporate SBOMs and combat the threat of <a href=\"https://www.ibm.com/topics/supply-chain-management?mhsrc=ibmsearch_a&amp;mhq=supply%20chain\"  target=\"_blank\" rel=\"noopener nofollow\" >supply chain</a> attacks.</p>\n<p>Let&rsquo;s look at how things have developed since <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/\" target=\"_blank\" rel=\"noopener nofollow\" >Biden&rsquo;s 2021 order</a> and what these updates mean for the owners and operators of national security systems.</p>\n<h2>Navigating new standards: NIST and CISA&rsquo;s contributions</h2>\n<p>Since 2021, the <a href=\"https://securityintelligence.com/articles/nist-supply-chain-guidelines-ten-takeaways/\"  target=\"_blank\" rel=\"noopener nofollow\" >National Institute of Standards and Technology (NIST)</a> and Cybersecurity and Infrastructure Security Agency (CISA) have been pivotal in shaping SBOM standards. Their guidelines aim to offer companies and operators a complete picture of software components, including <a href=\"https://securityintelligence.com/articles/is-open-source-security-a-ticking-cyber-time-bomb/\" >open-source software</a>.</p>\n<p>An SBOM should provide transparency into the ingredients of software, including:</p>\n<ul>\n<li>Open-source libraries and dependencies</li>\n<li>Commercial/proprietary libraries and modules</li>\n<li>Services and tools</li>\n<li>Versions of libraries and components</li>\n<li>Relationships between components</li>\n<li>Licensing information.</li>\n</ul>\n<p>It&rsquo;s important to collect and share this information in a clear format. There are three commonly-used standards for SBOMs:</p>\n<ul>\n<li><strong>Software Package Data Exchange (SPDX&reg;):</strong> An open-source, machine-readable format developed by the Linux Foundation. SPDX is a flexible option with the size and capacity to be an all-inclusive format.</li>\n<li><strong>CycloneDX (CDX):</strong> An open-source, machine-readable format from the OWASP community. CDX is a more agile, user-friendly option than SPDX.</li>\n<li><strong>Software Identification (SWID):</strong> An ISO/IEC industry standard that many commercial software publishers use. This is, by far, the easiest standard to use &mdash; but its capabilities are limited to simple inventory and cataloging.</li>\n</ul>\n<p>This standardization makes it easier for operators to understand and manage the security risks related to the software. Unfortunately, operators managing intricate tech stacks and cybersecurity systems often need to use more than one standard, which poses additional challenges.</p>\n<a class=\"btn orange1 large\" href=\"https://www.ibm.com/topics/supply-chain-management\" >What is supply chain management?</a>\n<h2>What are the problems with SBOMs?</h2>\n<p>SBOMs offer information about code provenance and help software engineering teams detect malicious attacks in their early stages &mdash; often during development and deployment. However, getting in line with <a href=\"https://www.cisa.gov/sbom\" target=\"_blank\" rel=\"noopener nofollow\" >the U.S. government&rsquo;s regulations around SBOMs</a> is not straightforward.</p>\n<p>Here are some concerns:</p>\n<ul>\n<li><strong>Complex requirements: </strong>An app may comprise files, functions or code from separate <a href=\"https://securityintelligence.com/posts/how-to-manage-third-party-supply-chain-risks/\"  target=\"_blank\" rel=\"noopener nofollow\" >third-party sources</a>. Without proper documentation during development, creating an accurate SBOM that includes all components is challenging.</li>\n<li><strong>Lack of data:</strong> SBOMs explain the ingredients in software but share nothing about the quality of those components, the contributors or the processes around quality control.</li>\n<li><strong>Time investment:</strong> Companies must dedicate a lot of time to properly research and document SBOMs. Also, SBOMs are not static documents, so a new SBOM will be needed with every release or update &mdash; making this an ongoing draw on company resources.</li>\n<li><strong>Budget:</strong> With more time spent on SBOMs, compliance costs will impact the company&rsquo;s payroll. Also, there&rsquo;s a chance that SBOM focus can distract software developers from focusing on more serious security risks.</li>\n<li><strong>Intellectual property concerns:</strong> Sharing detailed software components can feel like giving away trade secrets. It&rsquo;s a tightrope walk between optimal security and competitive positioning.</li>\n</ul>\n<h2>An imperfect step in the right direction</h2>\n<p><span class=\"resolved\">With the <a href=\"https://media.defense.gov/2023/Dec/14/2003359097/-1/-1/0/CSI-SCRM-SBOM-MANAGEMENT.PDF\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >NSA&rsquo;s latest updates for SBOM management</a>, we</span><span class=\"resolved\"> can expect SBOMs</span> to become a key aspect of securing and managing software supply chains in 2024. companies can use them to offer software developers and customers transparency about the software they use.</p>\n<p>But it&rsquo;s important to remember that SBOMs are not a magic bullet against <a href=\"https://securityintelligence.com/articles/supply-chain-attack-what-it-is-what-to-do/\" >cyberattacks on supply chains</a>. Challenges in cost and compliance remain a concern, especially for smaller organizations.</p>\n<p>Operators in national security and enterprises must adapt to the changes and collaborate with software developers to give companies the best chance of protecting their supply chains and assets.</p>\n<p>Ready to take action? Learn <a href=\"https://securityintelligence.com/posts/securing-supply-chain-through-cyber-risk-management/\" >how to secure your supply chain through cyber risk management</a>.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/updated-sbom-guidance-2024/\">Updated SBOM guidance: A new era for software transparency?</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Beware of rogue chatbot hacking incidents","link":"https://securityintelligence.com/articles/rogue-chatbot-hacking-incidents/","dc:creator":{"#cdata-section":"Jonathan Reed"},"pubDate":"Wed, 24 Jan 2024 14:00:00 +0000","category":[{"#cdata-section":"Artificial Intelligence"},{"#cdata-section":"Data Protection"},{"#cdata-section":"chatbot"},{"#cdata-section":"reverse tabnabbing"},{"#cdata-section":"Comcast"},{"#cdata-section":"Xfinity"},{"#cdata-section":"Breach"},{"#cdata-section":"Facebook"},{"#cdata-section":"Google"},{"#cdata-section":"Phishing"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446897"},"description":{"#cdata-section":"<p>For years, chatbots have been a useful tool to help automate customer-facing applications. But what happens if the chatbot goes rogue? Recent reports have revealed that this may have happened to the Comcast / Xfinity chatbot. First, there were incidents of Xfinity email outages. Next, some reported that if you try to resolve the issue [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/rogue-chatbot-hacking-incidents/\">Beware of rogue chatbot hacking incidents</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>For years, chatbots have been a useful tool to help automate customer-facing applications. But what happens if the chatbot goes rogue?</p>\n<p>Recent reports have revealed that this may have happened to the Comcast / Xfinity chatbot. First, there were incidents of <a href=\"https://www.reddit.com/r/Comcast_Xfinity/comments/194ybxz/email_outage/\" target=\"_blank\" rel=\"noopener nofollow\" >Xfinity email outages</a>. Next, some reported that if you try to resolve the issue via chat, a rogue chatbot may engage with you. The impersonator chatbot then tries to redirect you to a malicious page that asks you to divulge your credit card number.</p>\n<p>Could this be related to the <a href=\"https://www.cybersecuritydive.com/news/comcasts-xfinity-data-breach-citrixbleed/702957/\" target=\"_blank\" rel=\"noopener nofollow\" >massive breach</a> that involved 35.9 million Comcast Xfinity broadband entertainment platform customers? While this story is still developing, it wouldn&rsquo;t be the first time chatbots were recruited for online scams.</p>\n<p>There are a variety of ways chatbots are being used to spread <a href=\"https://www.ibm.com/topics/malware\"  target=\"_blank\" rel=\"noopener nofollow\" ><span class=\"resolved\">malware</span></a> and/or obtain sensitive information. Here&rsquo;s what to watch out for.</p>\n<h2>Hacking Bing</h2>\n<p>Bing Chat has quickly become one of the world&rsquo;s leading AI chatbots. Millions of people use it every day. One feature of Bing Chat is that ads can be inserted into the conversation. For example, a user can hover over a link and then an ad is displayed.</p>\n<p><a href=\"https://www.malwarebytes.com/blog/threat-intelligence/2023/09/malicious-ad-served-inside-bing-ai-chatbot\" target=\"_blank\" rel=\"noopener nofollow\" >Malwarebytes reported</a> on a case where Bing Chat ads were being hijacked by nefarious actors. In this scam, when the user&rsquo;s cursor hovers over a legitimate link, a dialog box appears showing a malicious ad:</p>\n<p><amp-img src=\"https://images4.cmp.optimizely.com/Zz05YjBiNzczYWIzZTUxMWVlOGJhYTIyMGY3ZTc5NzBiMw==\" layout=\"intrinsic\" class=\"\" alt=\"A screenshot of a Bing chat showing a malicious ad\" width=\"624\" height=\"381\" lightbox=\"lightbox\"></amp-img></p>\n<p><em>Image source </em><em>Malwarebytes</em></p>\n<p>Clicking on the malicious ad leads users to a website (mynetfoldersip[.]cfd) that can identify real victims and filter out bots, sandboxes or security researchers. Filtering works by checking IP addresses, time zones and other system settings, such as web rendering that identifies virtual machines.</p>\n<p>Actual human users are eventually redirected to another fake site (advenced-ip-scanner[.]com) that mimics an official page, while others are sent to a decoy page. Victims are then invited to download malware that looks like legitimate software.</p>\n<h2>Fake AI chatbot scams</h2>\n<p>Scammers are also taking advantage of the rising popularity of AI chatbots, like Google&rsquo;s Bard. It&rsquo;s easy to miss these hacks as they easily blend in with the tsunami of AI-related products and services offered now.</p>\n<p><a href=\"https://blog.google/outreach-initiatives/public-policy/taking-legal-action-to-protect-users-of-ai-and-small-businesses/\" target=\"_blank\" rel=\"noopener nofollow\" >According to Google</a>, two different scammer groups created social media pages and ran ads that encouraged people to &ldquo;download&rdquo; Bard. But Bard is a freely available generative AI tool that does not need to be downloaded.</p>\n<p>Scammers used Google&rsquo;s logos, trademarks and product names as part of their scheme. The ads lure targets to a phony website designed to look like it&rsquo;s affiliated with Google. On the site, visitors are encouraged to download software to use Bard, but it&rsquo;s really malware.</p>\n<p>It&rsquo;s worth noting that Google is suing the bad actors instead of just reporting them to the authorities. The company says that &ldquo;lawsuits are an effective tool for establishing a legal precedent, disrupting the tools used by scammers, and raising the consequences for bad actors.&rdquo; According to Google, they have filed roughly 300 takedowns related to this group of bad actors.</p>\n<h2>Other chatbot scams</h2>\n<p>Some chatbot-based scams aren&rsquo;t really chatbots at all. In one scam, criminals sent <a href=\"https://www.ibm.com/topics/phishing?mhsrc=ibmsearch_a&amp;mhq=phishing\"  target=\"_blank\" rel=\"noopener nofollow\" >phishing</a> emails <a href=\"https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/interactive-phishing-using-chatbot-like-web-applications-to-harvest-information/\" target=\"_blank\" rel=\"noopener nofollow\" >impersonating DHL</a>.</p>\n<p><amp-img src=\"https://images1.cmp.optimizely.com/Zz05YTk4YjZmMGIzZTUxMWVlYTkwYTFlMGU1YTdlYmQ2OA==\" layout=\"intrinsic\" class=\"\" alt=\"A chatbot scam designed to look like a DHL shipping page.\" width=\"624\" height=\"315\" lightbox=\"lightbox\"></amp-img></p>\n<p><em>Image source: Trustwave</em></p>\n<p>From there, the malicious link connected to a fake chatbot that eventually requested sensitive information like the user&rsquo;s email and password:</p>\n<p><amp-img src=\"https://images4.cmp.optimizely.com/Zz05YWNiOGQzMmIzZTUxMWVlYWM5OWRlOGVlOWY3MWM5Nw==\" layout=\"intrinsic\" class=\"\" alt=\"A screenshot of a chatbot scam requesting a user's DHL credentials\" width=\"624\" height=\"569\" lightbox=\"lightbox\"></amp-img></p>\n<p><em>Image source: Trustwave</em></p>\n<p>And credit card data, of course&hellip;</p>\n<p><amp-img src=\"https://images3.cmp.optimizely.com/Zz05YTczMzkwMmIzZTUxMWVlYTZmZGU2NDM1ODcyNzllZQ==\" layout=\"intrinsic\" class=\"\" alt=\"A screenshot showing a chatbot scam's attempt to harvest users' credit card info.\" width=\"582\" height=\"549\" lightbox=\"lightbox\"></amp-img></p>\n<p><em>Image source: Trustwave</em></p>\n<p>A similar <a href=\"https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/interactive-phishing-mark-ii-messenger-chatbot-leveraged-in-a-new-facebook-themed-spam/\" target=\"_blank\" rel=\"noopener nofollow\" >scam</a> has also been luring Facebook users under the guise of an account cancellation message. In this case, an actual Facebook chatbot is used, which then redirects targets to a fake site that asks for sensitive information.</p>\n<p><amp-img src=\"https://images1.cmp.optimizely.com/Zz05YWM4MDY0NGIzZTUxMWVlODkzZjllZGExMDg2MGIyYw==\" layout=\"intrinsic\" class=\"\" alt=\"A screenshot of a Facebook chatbot scam.\" width=\"376\" height=\"551\" lightbox=\"lightbox\"></amp-img></p>\n<p><em>Image source: Trustwave</em></p>\n<p>Here&rsquo;s how they try to get users to give up their passwords:</p>\n<p><em><amp-img src=\"https://images3.cmp.optimizely.com/Zz05YWNhNWU0NGIzZTUxMWVlYTJmYWQyYTdlYzAyYjYyYQ==\" layout=\"intrinsic\" class=\"\" alt=\"A screenshot of a chatbot scam to harvest Facebook passwords.\" width=\"616\" height=\"245\" lightbox=\"lightbox\"></amp-img></em></p>\n<p><em>Image sources Trustwave</em></p>\n<h2>Use chatbots with caution</h2>\n<p>As with any online engagement, interacting with a chatbot should be done with the utmost caution. Always think twice, or even three times, before you click, download or provide private personal information.</p>\n<p data-pm-slice=\"1 1 []\"><em>To learn how IBM X-Force can help you with anything regarding cybersecurity including incident response, threat intelligence, or offensive security services </em><a href=\"https://www.ibm.com/account/reg/us-en/signup?formid=urx-52262\"  target=\"_blank\" rel=\"noopener nofollow\" ><em>schedule a meeting here</em></a><em>.</em></p>\n<p><em>If you are experiencing cybersecurity issues or an incident, contact </em><a href=\"https://www.ibm.com/x-force\"  target=\"_blank\" rel=\"noopener nofollow\" ><em>X-Force</em></a><em> to help: US hotline </em><em>1-888-241-9812</em><em> | Global hotline (+001) </em><em>312-212-8034</em><em>.</em></p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/rogue-chatbot-hacking-incidents/\">Beware of rogue chatbot hacking incidents</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Boardroom cyber expertise comes under scrutiny","link":"https://securityintelligence.com/articles/boardroom-cyber-expertise-scrutiny/","dc:creator":{"#cdata-section":"Jonathan Reed"},"pubDate":"Mon, 22 Jan 2024 14:00:00 +0000","category":[{"#cdata-section":"CISO"},{"#cdata-section":"SEC"},{"#cdata-section":"Chief Information Security Officer (CISO)"},{"#cdata-section":"Cybersecurity"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446891"},"description":{"#cdata-section":"<p>Why are companies concerned about cybersecurity? Some of the main drivers are data protection, compliance, risk management and ensuring business continuity. None of these are minor issues. Then why do board members frequently keep their distance when it comes to cyber concerns? A report released last year showed that just 5% of CISOs reported directly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/boardroom-cyber-expertise-scrutiny/\">Boardroom cyber expertise comes under scrutiny</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>Why are companies concerned about cybersecurity? Some of the main drivers are data protection, compliance, risk management and ensuring business continuity. None of these are minor issues. Then why do board members frequently keep their distance when it comes to cyber concerns?</p>\n<p>A <a href=\"https://www.cybersecuritydive.com/news/ciso-reporting-structure/685571/?&amp;web_view=true\" target=\"_blank\" rel=\"noopener nofollow\" >report released</a> last year showed that just 5% of CISOs reported directly to the CEO. This was actually down from 8% in 2022 and 11% in 2021. But even if board members don&rsquo;t want to get too close to cyber, it will reach them anyway &mdash; at least according to a potential new SEC rule. What should security leaders do?</p>\n<h2>Cyber knowledge gap</h2>\n<p>A recent <a href=\"https://cyberedboard.io/assets/files/Transcript-CyberEdBoard-Art-Coviello-DRAFT-20210202-4.pdf\" target=\"_blank\" rel=\"noopener nofollow\" >CyberEdBoard report</a> said, &ldquo;Board members are just not equipped to understand technology. The other side of the problem is that CISOs tend to talk in technical terms and it goes right over the board&rsquo;s head. We have to figure out ways for CISOs to communicate effectively to the board.&rdquo;</p>\n<p>That might be a generalization as tech savviness increasingly makes its way into the upper ranks of business. However, when only a fraction of CISOs report to CEOs, it raises questions about how companies prioritize security issues.</p>\n<p>Meanwhile, the federal government is increasingly concerned about the impact of cyberattacks, for example, on critical infrastructure and government agencies. And the feds are taking action to enforce compliance.</p>\n<h2>SEC enforcement moves forward</h2>\n<p>In 2022, the SEC nearly doubled the size of the <a href=\"https://www.sec.gov/news/press-release/2022-78\" target=\"_blank\" rel=\"noopener nofollow\" >Enforcement Division&rsquo;s Cyber and Crypto Assets Unit</a>. Since then, the unit has initiated enforcement proceedings against SEC-regulated entities due to insufficient cybersecurity controls and inadequate disclosure concerning cyber risks and incidents.</p>\n<p>Over the past two years, <a href=\"https://www.reuters.com/legal/legalindustry/sec-is-inching-closer-clarity-cybersecurity-requirements-2023-04-19/\" target=\"_blank\" rel=\"noopener nofollow\" >SEC enforcement</a> has resulted in charges, fines and settlements. Some of the biggest financial entities in the world have had to pay penalties ranging from $425,000 up to $35 million.</p>\n<h2>Are public company regulations next?</h2>\n<p>Now, the <a href=\"https://www.sec.gov/files/34-97142-fact-sheet.pdf\" target=\"_blank\" rel=\"noopener nofollow\" >SEC&rsquo;s proposed Rule 10</a> would specifically require all public companies to report material cybersecurity incidents on Form 8-K. Rule 10 would also mandate periodic disclosures regarding a registrant&rsquo;s policies and procedures to identify and manage cybersecurity risks, management&rsquo;s role in implementing cybersecurity policies and procedures &mdash; and the board of directors&rsquo; cybersecurity expertise, if any.</p>\n<h2>The board should get on board with cyber</h2>\n<p>Although some board members might still be reluctant to address security issues head-on, education is the key. Some easy-to-grasp parameters should be presented, like the global average <a href=\"https://www.ibm.com/reports/data-breach\" >cost of a data breach</a> reaching $4.45 million. Or tell them about the $35 million SEC fines.</p>\n<p>Security leaders should also compile data about the real-world risk &mdash; and damage &mdash; that cyber presents to their company. How many attacks did you detect last year? How many breaches? What were the estimated costs? What measures are needed to minimize further incidents and what would be the investment needed?</p>\n<p>These are simple concepts that any business-minded person can get their head around. Armed with this type of information, board members could converse intelligently with any regulatory agency.</p>\n<p>It would be unreasonable to ask board members to become cyber experts, but they can be guided to understand the associated business risks and benefits. Additionally, cyber executives should have a seat in the C-suite &mdash; or at least direct access to the CEO.</p>\n<h2>Give the board terms they understand</h2>\n<p>As per <a href=\"https://www.databreachtoday.com/blogs/3-boardroom-initiatives-to-see-you-through-cyber-winter-p-3441\" target=\"_blank\" rel=\"noopener nofollow\" >Marco T&uacute;lio Moraes</a>, CISO and expert board advisor at CyberEdBoard, security officers need to learn to speak in financial terms.</p>\n<p>For example, can you explain the total loss exposure for your cyber risk portfolio in quantitative financial terms? This can help everyone grasp the size of the issue to drive the strategy. Healthcare, for instance, has a risk portfolio with an average loss exposure of $5.5 million, given a probable annual likelihood of 9% and an average loss of $40 million. Is this something your board can accept?</p>\n<p>Once these numbers are clearly outlined, risk appetite and tolerance can be defined given constraints such as budget, staff, time and other resource limitations. From there, an informed discussion about strategic cybersecurity can happen, including investments, responsibilities and expected results.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/boardroom-cyber-expertise-scrutiny/\">Boardroom cyber expertise comes under scrutiny</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"AI trends: A closer look at machine learning’s role","link":"https://securityintelligence.com/articles/ai-trends-machine-learning-role/","dc:creator":{"#cdata-section":"Sue Poremba"},"pubDate":"Thu, 18 Jan 2024 14:00:00 +0000","category":[{"#cdata-section":"Artificial Intelligence"},{"#cdata-section":"generative artificial intelligence"},{"#cdata-section":"generative ai"},{"#cdata-section":"Artificial Intelligence (AI)"},{"#cdata-section":"Machine Learning"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446887"},"description":{"#cdata-section":"<p>The hottest technology right now is AI &#8212; more specifically, generative AI. The trend is so popular that every conference and webinar speaker feels obligated to mention some form of AI, no matter their field. The innovations and risks that AI offers are both exciting and frightening. However, the heavy focus on this technology overshadows [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/ai-trends-machine-learning-role/\">AI trends: A closer look at machine learning&#8217;s role</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>The hottest technology right now is <a href=\"https://www.ibm.com/topics/artificial-intelligence\"  target=\"_blank\" rel=\"noopener nofollow\" >AI </a>&mdash; more specifically, generative AI. The trend is so popular that every conference and webinar speaker feels obligated to mention some form of AI, no matter their field.</p>\n<p>The innovations and risks that AI offers are both exciting and frightening. However, the heavy focus on this technology overshadows an important component of artificial intelligence: <a href=\"https://www.ibm.com/topics/machine-learning\"  target=\"_blank\" rel=\"noopener nofollow\" >machine learning (ML)</a>.</p>\n<p>For a quick overview, <a href=\"https://www.ibm.com/blog/ai-vs-machine-learning-vs-deep-learning-vs-neural-networks/\"  target=\"_blank\" rel=\"noopener nofollow\" >ML is a subset of AI </a>&nbsp;based on patterns, predictions and optimization. Cybersecurity tools rely on ML to use predictions and patterns to find anomalies and sniff out potential threats. Instead of a human spending hours reading logs, ML can do the same tasks in seconds.</p>\n<p>Like AI, ML has been around for a long time. The reason why we&rsquo;re talking about AI so much now is because generative AI is a game changer in the way we communicate with technology. But ML is also changing, and we&rsquo;ll see it used in new ways in 2024.</p>\n<h2>How we use machine learning</h2>\n<p>Machine learning is all about data. ML algorithms rely on historical data to detect patterns, from software codes to customer shopping behaviors. Social media networks rely on ML algorithms to keep relevant information at the top of your feed. Self-driving cars use ML algorithms to <span class=\"resolved\">navigate city streets and traffic laws. In cybersecurity, ML is used in areas like behav</span>ioral analytics and sending alerts for unusual usage, task automation and providing more efficient real-time threat-hunting intelligence.</p>\n<p>There are three common types of ML currently used. Supervised learning trains ML to perform a specific task based on the presented data. Unsupervised learning relies on relationships across the data. <span class=\"resolved\">Reinforcement learning is most similar to human learning, where the ML model learns to solve problems through trial-and-error formats.</span></p>\n<h2><span class=\"resolved\">New trends in machine learning</span></h2>\n<p><span class=\"resolved\">As AI continues to advance, so does ML, and one of the most anticipated improvements to ML in 2024 will be no-cod</span>e machine learning. No-code ML relies heavily on behavioral data and plain English to get results. Instead of complicated coding language, analysts will be able to ask a question or create a command to get a report. One of the biggest benefits of no-code ML is that it allows companies of all sizes to implement ML and AI into their networks without the need to hire data analysts and engineers. The downfall is that this type of ML technology is limited and won&rsquo;t be able to do deep-dive predictive analysis.</p>\n<p>Unsupervised and reinforcement ML are both expected to expand in the coming year, in part because of no-code ML.</p>\n<p>As ML evolves, we will likely see growth in other technologies like augmented reality and quantum computing. &ldquo;Machine learning models can generate 3D objects for apps and other uses in augmented reality,&rdquo; Lu&iacute;s Fernando Torres <a href=\"https://ai.plainenglish.io/what-to-expect-in-machine-learning-for-2024-and-beyond-f2b9bbb075ce\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >wrote</a>. In addition, ML will play a role in improved facial recognition technology and interactions with generative AI.</p>\n<h2>Machine learning and security &mdash; the good and bad</h2>\n<p>As mentioned earlier, ML benefits your overall cybersecurity program by automating what were once cumbersome manual tasks. It can find threats that are otherwise missed and can cut down on false positives.</p>\n<p>But as with any technology, there are security risks involved. Threat actors use ML and AI to launch attacks by poisoning or misleading the data to trick the system into providing false reports. Threat actors use this to bypass security systems and hijack the network.</p>\n<p>AI and its role in security is what everyone wants to talk about today, but the ways that AI can improve your company&rsquo;s security systems depend on machine learning. The time has come to get back to the basics and recognize how ML fits into your security system and how to best train ML so that your AI is even more effective.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/ai-trends-machine-learning-role/\">AI trends: A closer look at machine learning&#8217;s role</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"The CISO’s guide to accelerating quantum-safe readiness","link":"https://securityintelligence.com/posts/ciso-guide-quantum-safe-readiness/","dc:creator":{"#cdata-section":"Jai Arun"},"pubDate":"Tue, 16 Jan 2024 14:00:00 +0000","category":[{"#cdata-section":"CISO"},{"#cdata-section":"Risk Management"},{"#cdata-section":"quantum security"},{"#cdata-section":"quantum cryptography"},{"#cdata-section":"quantum cybersecurity"},{"#cdata-section":"Chief Information Security Officer (CISO)"},{"#cdata-section":"Cryptography"},{"#cdata-section":"Quantum Computing"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446880"},"description":{"#cdata-section":"<p>Quantum computing presents both opportunities and challenges for the modern enterprise. While quantum computers are expected to help solve some of the world&#8217;s most complex problems, they also pose a risk to traditional cryptographic systems, particularly public-key encryption. To ensure their organization&#8217;s data remains secure now and in the future, chief information security officers (CISOs) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/ciso-guide-quantum-safe-readiness/\">The CISO’s guide to accelerating quantum-safe readiness</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p data-pm-slice=\"0 0 []\">Quantum computing presents both opportunities and challenges for the modern enterprise. While quantum computers are expected to help solve some of the world&rsquo;s most complex problems, they also pose a risk to traditional cryptographic systems, particularly public-key encryption. To ensure their organization&rsquo;s data remains secure now and in the future, chief information security officers (CISOs) should educate themselves about quantum computing, proactively address the coming quantum risks to cybersecurity and work to establish cryptographic agility in their enterprise.</p>\n<p data-pm-slice=\"0 0 []\">A future cryptographically relevant quantum computer may be able to break public-key algorithms such as Rivest-Shamir-Adleman (RSA), Elliptic Curve Diffie-Hellman (ECDH) and the Elliptic Curve Digital Signature Algorithm (ECDSA), leaving sensitive information vulnerable to attacks. Even today, data not protected with quantum-safe cryptography is at risk of being stolen and stored until it can be decrypted. These are commonly called &ldquo;harvest now, decrypt later&rdquo; attacks.</p>\n<p data-pm-slice=\"0 0 []\">Standards bodies worldwide have begun guiding the transition to quantum-safe cryptography &mdash; encryption algorithms based on math problems considered difficult for even a mature quantum computer to solve. In 2022, after a six-year-long submission and review process, the National Institute of Standards and Technology (NIST) selected four quantum-resistant algorithms for standardization, three of which were contributed by IBM researchers and partners. <a href=\"https://www.cisa.gov/sites/default/files/2023-08/Quantum%20Readiness_Final_CLEAR_508c%20%283%29.pdf\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Recent guidance</a> from NIST, the National Security Agency (NSA) and the Cybersecurity and Infrastructure Security Agency (CISA) recommends that organizations create a quantum-readiness roadmap for transitioning to these standards, which NIST expects to publish in 2024.</p>\n<p data-pm-slice=\"0 0 []\">While every organization, guided by its CISO, should create its own quantum-readiness roadmap, three steps are critical for every organization to undertake to become quantum-safe:</p>\n<ol>\n<li>Discover your cryptography</li>\n<li>Observe your cryptography</li>\n<li>Transform your cryptography.</li>\n</ol>\n<a class=\"btn orange1 large\" href=\"https://www.youtube.com/watch?v=c5t0m_nd4hk\" target=\"_blank\" rel=\"noopener nofollow\" >Watch video 3 Steps to Become Quantum Safe with Crypto-agility</a>\n<h2><strong>1. Discover your cryptography</strong></h2>\n<p>The first step in the journey toward quantum-safe security is to gain a deep understanding of the vulnerabilities within the existing cryptographic infrastructure.</p>\n<p>Discovery activities should identify at-risk cryptography and determine where the dependencies exist, translating these findings into robust cryptographic inventories. For example, IBM Quantum Safe Explorer scans source code to identify and inventory cryptography usage, formatting this information as a <a href=\"https://github.com/IBM/CBOM\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Cryptography Bill of Materials (CBOM)</a> that can be shared with the software supply chain.</p>\n<p>Cryptographic discovery should extend beyond applications to include network protocols, systems and assets, especially those that create and validate digital signatures. For third-party products, CISOs should work with their technology procurement specialists to gather information about embedded cryptography from vendors. After a thorough discovery process, CISOs might be surprised to learn how wide their quantum risk exposure is, given broad dependencies on public-key cryptography embedded within applications, networks and systems.</p>\n<h2><strong>2. Observe your cryptography</strong></h2>\n<p>Once security leaders have discovered the weaknesses in their cryptographic infrastructure, the next step is to observe the potential impact and identify the necessary steps to mitigate these risks.</p>\n<p>With a dynamic perspective of their enterprise-wide cryptographic usage, CISOs can begin the work of cybersecurity risk assessments. This step involves working with cybersecurity and privacy managers to prioritize sensitive and critical data sets most at risk from &ldquo;harvest now, decrypt later&rdquo; attacks and with the highest business value and impact. To translate these insights into a quantum-safe strategy, security leaders should evaluate the business relevance in relation to the complexity of mitigation for specific assets so that they can plan their quantum-safe transition in a way that optimizes performance, compatibility and ease of integration.</p>\n<h2><strong>3. Transform your cryptography</strong></h2>\n<p>The final step in the journey to quantum-safe security is the transformation of cryptographic infrastructure to incorporate quantum-resistant cryptography.</p>\n<p>Before deploying quantum-safe solutions to their stack, security leaders should equip their teams with the tools and education to test the new cryptographic protocols and evaluate the potential impact on systems and performance. Quantum-safe solutions that can be updated without having to overhaul their cybersecurity infrastructure will help CISOs establish crypto-agility and ensure they can proactively and seamlessly address potential quantum vulnerabilities. Security leaders should engage vendors to determine their timeline for migrating to quantum-safe cryptography for processes, services and systems secured with quantum-vulnerable cryptography embedded in third-party products.</p>\n<p>By following the three steps of discover, observe and transform, CISOs can assess the vulnerabilities in their cybersecurity landscape and begin implementing quantum-resistant cryptography to safeguard their organization&rsquo;s data for the coming quantum computing era. The time to embark on the journey to quantum-safe security is now.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/ciso-guide-quantum-safe-readiness/\">The CISO’s guide to accelerating quantum-safe readiness</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Cybersecurity trends: IBM’s predictions for 2024","link":"https://securityintelligence.com/articles/cybersecurity-trends-ibm-predictions-2024/","dc:creator":{"#cdata-section":"Jennifer Gregory"},"pubDate":"Tue, 09 Jan 2024 14:00:00 +0000","category":[{"#cdata-section":"Artificial Intelligence"},{"#cdata-section":"CISO"},{"#cdata-section":"Risk Management"},{"#cdata-section":"quantum cryptography"},{"#cdata-section":"artificial intelligence in cyber security"},{"#cdata-section":"cyber criminal"},{"#cdata-section":"chatGPT"},{"#cdata-section":"generative artificial intelligence"},{"#cdata-section":"generative ai"},{"#cdata-section":"genai"},{"#cdata-section":"Artificial Intelligence (AI)"},{"#cdata-section":"Cryptography"},{"#cdata-section":"Cybercriminals"},{"#cdata-section":"Cybersecurity"},{"#cdata-section":"Quantum Computing"},{"#cdata-section":"Ransomware"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446872"},"description":{"#cdata-section":"<p>As organizations begin planning their cybersecurity strategies for 2024, these expert insights provide guidance on facing the year to come.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/cybersecurity-trends-ibm-predictions-2024/\">Cybersecurity trends: IBM’s predictions for 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>From world events to the economy, 2023 was an unpredictable year. Cybersecurity didn&rsquo;t stray far from this theme, delivering some unexpected twists. As organizations begin planning their security strategies for 2024, now is the time to look back on the year before and extrapolate what the future may hold.</p>\n<p>The year kicked off with Generative Artificial Intelligence (GenAI) hitting the headlines and dominating the conversation unexpectedly. The impact of the many new uses for <a href=\"https://securityintelligence.com/articles/chatgpt-and-the-race-to-secure-your-intellectual-property/\" >GenAI rippled the cybersecurity world</a> and was a top topic and cybersecurity concern, with a <a href=\"https://securityintelligence.com/articles/chatgpt-confirms-data-breach/\" >data breach of ChatGPT</a> highlighting the risk. Cybersecurity professionals also increased their <a href=\"https://securityintelligence.com/posts/c-suite-weighs-generative-ai-security/\" >use of AI technology</a> to help detect and prevent attacks.</p>\n<p>Ransomware stayed in the headlines, starting with an increase in volume. The month of <a href=\"https://securityintelligence.com/x-force/ransomware-renaissance-definitive-guide-2023/\" >March alone saw 400 attacks</a>. <a href=\"https://securityintelligence.com/news/lessons-learned-from-the-dallas-ransomware-attack/\" >Local governments</a> were a prime target this year with more than 34 attacks, including one incident that shut down critical systems in Dallas. On the good news front, the U.S. government issued the <a href=\"https://securityintelligence.com/articles/how-nist-cybersecurity-framework-2-tackles-risk-management/\" >NIST Cybersecurity Framework 2.0</a> and the <a href=\"https://securityintelligence.com/articles/cyber-experts-applaud-new-white-house-cybersecurity-plan/\" >White House Cybersecurity plan</a> took steps to protect critical infrastructure from cyberattacks.</p>\n<p>To get insights into what to expect in the cybersecurity industry in 2024, we talked to leading experts. Here&rsquo;s what they have to say.</p>\n<h2>2024 will be the year of deception (Charles Henderson, Global Head, IBM X-Force)</h2>\n<p>2024 is going to be a busy year for cyber criminals amid ongoing geopolitical tensions, major elections in the U.S. and European Union and the biggest sporting event in the world (Paris Olympics) all taking place within a few months of each other. It&rsquo;s a perfect storm of events that&rsquo;s going to see disinformation campaigns on a whole new level.</p>\n<p>Cyber criminals have everything they need to deceive unsuspecting users, consumers and even public officials through AI-engineered deception tactics. We&rsquo;re about to see improved deep fakes, audio fakes and very convincing AI-crafted phishing emails in cyber criminals&rsquo; efforts to deceive the public and advance their malicious objectives.</p>\n<h2>GenAI is about to make &ldquo;customer acquisition&rdquo; much easier for cyber criminals (Charles Henderson, Global Head, IBM X-Force)</h2>\n<p>Until now, cyber criminals have been very limited in how they can monetize from their data spoils collected from the billions of data compromised over the years. But all that&rsquo;s about to change thanks to GenAI. GenAI is going to help filter through, correlate and categorize those huge data sets in minutes and put them together in a programmatic way for cyber criminals to create profiles for potential targets. GenAI&rsquo;s ability to optimize target selection is no different from how it&rsquo;s improving the customer acquisition process in marketing &mdash; it&rsquo;s just a different light of legality.</p>\n<h2>Enterprises will see an influx of &ldquo;doppelg&auml;nger users&rdquo; (Dustin Heywood, Chief Architect, IBM X-Force)</h2>\n<p>With millions of valid enterprise credentials on the Dark Web right now and the number continuing to rise, attackers are weaponizing identity, viewing it as a stealthy means of access to overprivileged accounts. In the next year, I expect we&rsquo;ll see more &ldquo;doppelg&auml;nger&rdquo; users popping up in enterprise environments, with users behaving a certain way one day and another way the next &mdash; this abnormal behavior should be enterprises&rsquo; sign of compromise. Attackers are assuming legitimate users&rsquo; digital identities unbeknownst to them, with this trend only exacerbating in 2024. Security and password hygiene have never been more important.</p>\n<h2>Get ready for the AI version of Morris Worm (John Dwyer, Head of Research, IBM X-Force)</h2>\n<p>The Morris worm is widely believed to be the first cyberattack ever reported back in 1988. I think in the relatively near term we&rsquo;ll see a &ldquo;Morris Worm-like&rdquo; event where AI is confirmed being used to scale a malicious campaign. With AI platforms starting to become generally available to businesses, adversaries will begin testing the nascent AI attack surface, with activity increasing as AI adoption begins to scale. While we&rsquo;re still far out from the day when AI-engineered cyberattacks become the norm, these things don&rsquo;t happen overnight &mdash; but the &ldquo;premiere&rdquo; is likely around the corner.</p>\n<h2>Amid midlife crisis, ransomware is heading for a makeover (John Dwyer, Head of Research, IBM X-Force)</h2>\n<p>Ransomware may be facing a recession in 2024 as more countries pledge not to pay the ransom and increasingly fewer enterprises succumb to the pressure of encrypted systems &mdash; choosing to divert funds to rebuilding systems versus decrypting systems. Ransomware operators are starting to face a cash flow problem, making it challenging to keep up with their resource-intensive campaigns.</p>\n<p>While we anticipate a bigger pivot to high-pressure data extortion attacks, ransomware isn&rsquo;t going anywhere, as we expect it to shift focus to a consumer or small business target base where threat actors&rsquo; leverage remains strong. But considering that ransom demands against small and medium-sized businesses are likely to be less than enterprise victims, it&rsquo;s clear that ransomware is heading for a makeover.</p>\n<h2>Generative AI adoption will force CISOs to focus on critical data (Akiba Saeedi, Vice President, Data Security, IBM Security)</h2>\n<p>With enterprises beginning to embed GenAI into their infrastructure, they&rsquo;re dealing with new risks introduced by centralizing various types of data into AI models, various stakeholders accessing those models and data they&rsquo;re ingesting, as well as the actual inference and live use of the model. This risk will drive CISOs to redefine what data can introduce an existential threat to the organization if compromised (e.g., fundamental IP) and reassess the security and access controls surrounding it.</p>\n<p>Data security, protection and privacy measures are the linchpin to the success of an AI-driven business model. But with data becoming more dynamic and active across the environment, the discovery, classification and prioritization of critical data will be a top action for security leaders in 2024.</p>\n<h2>GenAI will level up the role of security analysts (Chris Meenan, Vice President, Product Management, IBM Security)</h2>\n<p>Companies have been using AI and machine learning to improve the efficacy of security technologies for years, and the introduction of generative AI will be aimed squarely at maximizing the human element of security. In this coming year, GenAI will begin to take on certain tedious, administrative tasks on behalf of security teams &mdash; but beyond this, it will also enable less experienced team members to take on more challenging, higher-level tasks.</p>\n<p>For example, we&rsquo;ll see <span class=\"resolved\">GenAI</span> being used to translate technical content, such as machine-generated log data or analysis output, into simplified language that is more understandable and actionable for novice users. By embedding this type of GenAI into existing workflows, it will not only free up security analysts&rsquo; time in their current roles but enable them to take on more challenging work &mdash; alleviating some of the pressure that has been created by the current security workforce and skills challenges.</p>\n<h2>From threat prevention to prediction &mdash; cybersecurity nears a historic milestone (Sridhar Muppidi, CTO, IBM Security)</h2>\n<p>As AI crosses a new threshold, security predictions at scale are becoming more tangible. Although early security use cases of generative AI focus on the front end, improving security analysts&rsquo; productivity, I don&rsquo;t think we&rsquo;re far from seeing generative AI deliver a transformative impact on the back end to completely reimagine threat detection and response into threat prediction and protection. The technology is there, and the innovations have matured. The cybersecurity industry will soon reach a historic milestone: achieving prediction at scale.</p>\n<h2>A new approach to security&rsquo;s &ldquo;identity crisis&rdquo; (Wes Gyure, Director, Identity and Access Management, IBM Security)</h2>\n<p>As organizations continue expanding their cloud services and applications, each one brings its own disparate identity capabilities &mdash; creating a web of disconnected identity profiles and capabilities across cloud, on-premise systems and applications. In the past, organizations hoped to consolidate these identities via a single identity solution or platform, but in today&rsquo;s reality, organizations are coming to terms with the fact that this approach is neither practical nor feasible.</p>\n<p>In the coming year, organizations will move to embrace an &ldquo;identity fabric&rdquo; approach which aims to integrate and enhance existing identity solutions rather than replace them. The goal is to create a less complex environment where consistent security authentication flows and visibility can be enforced.</p>\n<h2>&ldquo;Harvest now, decrypt later&rdquo; attacks to become more common with quantum advancements (Ray Harishankar, IBM Fellow, IBM Quantum Safe)</h2>\n<p>Quantum system performance continues to scale closer to the point of being cryptographically relevant, with studies conducted by World Economic Forum, National Security memorandums and timelines published by CNSA suggesting quantum computers could have the ability to break the most widely used security protocols in the world by as early as the 2030s. And right now, classical systems are still vulnerable to &ldquo;harvest now, decrypt later&rdquo; attacks &mdash; where bad actors steal and store data for later decryption on the chance of accessing such future quantum computers. With quantum computing advancing rapidly, we believe these attacks will become more common over the next several years.</p>\n<p>Recognizing these risks, the U.S. National Institute of Standards and Technology (NIST) has already begun the process of developing new quantum-safe cryptography standards and is expected to publish its first official standards in early 2024. In anticipation of this, organizations should start the process today of identifying cryptography used in their environments to prepare for the transition to quantum-safe cryptography to ensure their data and systems remain protected from threats posed by quantum decryption. With bad actors already carrying out &ldquo;harvest now, decrypt later&rdquo; attacks, and some estimates showing this transition could take as long as 15 years, the earlier organizations start, the better.</p>\n<p>2023 was an unpredictable year, and 2024 will certainly hold many more surprises. But with proper planning and agile cybersecurity strategies, your organization can meet those challenges as they come.</p>\n<p class=\"ice-del flite-container-only\" data-flite-cid=\"14\" data-flite-marked=\"1\" data-last-change-time=\"1703011542340\" data-session-id=\"OTYNSNjU\" data-time=\"1703011542340\" data-userid=\"6345a768b8e149bfce9bb712\" data-username=\"Amelia Fisher\">&nbsp;</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/cybersecurity-trends-ibm-predictions-2024/\">Cybersecurity trends: IBM’s predictions for 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"IT and OT cybersecurity: A holistic approach","link":"https://securityintelligence.com/posts/it-and-ot-cybersecurity-integration/","dc:creator":{"#cdata-section":"Shaik Zakeer"},"pubDate":"Thu, 04 Jan 2024 15:00:00 +0000","category":[{"#cdata-section":"Risk Management"},{"#cdata-section":"operational technology"},{"#cdata-section":"IT Security"},{"#cdata-section":"Vulnerabilities"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446866"},"description":{"#cdata-section":"<p>In the realm of cybersecurity, both information technology (IT) and operational technology (OT) present distinct challenges that organizations must navigate. Ensuring the security of these distinct domains is paramount to bolstering your overall cyber resilience. By following the best practices outlined in this article, you can minimize potential vulnerabilities and keep your security posture strong. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/it-and-ot-cybersecurity-integration/\">IT and OT cybersecurity: A holistic approach</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>In the realm of cybersecurity, both information technology (IT) and operational technology (OT) present distinct challenges that organizations must navigate. Ensuring the security of these distinct domains is paramount to bolstering your overall cyber resilience. By following the best practices outlined in this article, you can minimize potential vulnerabilities and keep your security posture strong.</p>\n<h2>Differences between IT and OT</h2>\n<p>IT encompasses digital systems that facilitate data management and communication within organizations. In comparison, OT refers to the specialized systems that control physical processes and industrial operations.</p>\n<p><span class=\"resolved\">While both IT and OT rely on technology, they differ in terms of infrastructure, objectives and the types of technologies employed. Securing both IT and OT systems poses distinct challenges due to divergent requirements and threat landscapes.</span></p>\n<p><strong>Infrastructure differences</strong></p>\n<p>IT infrastructure primarily focuses on data storage, processing and information flow within corporate networks. OT infrastructure involves physical machinery, sensors and devices used in industrial operations, often in isolated environments.</p>\n<p><strong>Objectives variances</strong></p>\n<p>IT objectives are generally aimed at managing and processing information to support business processes, decision-making and data analysis. In comparison, OT objectives primarily focus on ensuring the efficiency, reliability and safety of industrial processes and production.</p>\n<p><strong>Technological distinctions</strong></p>\n<p>IT Technologies encompass software applications, databases and communication protocols for business operations and information management. OT Technologies include industrial control systems (ICS), SCADA systems and programmable logic controllers (PLCs) that directly control physical processes.</p>\n<p><strong>Challenges in integrating IT and OT</strong></p>\n<p><a href=\"https://securityintelligence.com/articles/it-ot-connection-two-work-together/\"  target=\"_blank\" rel=\"noopener nofollow\" >Integrating IT and OT systems</a> is not without its challenges. One of the biggest is the difference in culture and priorities between the two fields. IT tends to focus on security and maintaining the status quo, while OT is more focused on achieving operational goals and maximizing efficiency. Additionally, IT and OT systems often use different protocols and standards, which can make it difficult to connect them.</p>\n<p><amp-img src=\"https://images4.cmp.optimizely.com/Zz05YmExMmNjNGEwM2MxMWVlYTlmNmFhZmVlOGI2NzJhMw==\" layout=\"intrinsic\" class=\"\" alt=\"Screenshot 2023-12-21 at 3.06.22&#8239;PM.png\" width=\"680\" height=\"198\" lightbox=\"lightbox\"></amp-img></p>\n<h2><span class=\"resolved\">Cybersecurity in IT</span></h2>\n<p><span class=\"resolved\">Cybersecurity in IT is a multidimensional approach aimed at safeguarding digital systems, networks and data from unauthorized access, breaches and malicious activities. In the realm of IT, security measures encompass a wide range of technologies, processes and policies. This includes network security, endpoint protection, data encryption, access control mechanisms and more. The primary goal of IT cybersecurity is to maintain the confidentiality, integrity and availability of digital assets. </span></p>\n<p>For example, organizations implement firewalls and intrusion detection systems to monitor and control network traffic, antivirus software to detect and remove malware and encryption protocols to secure sensitive data during transmission.</p>\n<h2><span class=\"resolved\">Common cyber threats and vulnerabilities in IT systems</span></h2>\n<p><span class=\"resolved\">IT systems face many cyber threats and vulnerabilities that can compromise their security and functionality. Viruses, <a href=\"https://www.ibm.com/topics/ransomware?mhsrc=ibmsearch_a&amp;mhq=ransomware\"  target=\"_blank\" rel=\"noopener nofollow\" >ransomware</a> and trojans pose a significant threat to IT environments by exploiting software vulnerabilities or tricking users into downloading malicious content. <a href=\"https://www.ibm.com/topics/phishing?mhsrc=ibmsearch_a&amp;mhq=phishing\"  target=\"_blank\" rel=\"noopener nofollow\" >Phishing attacks</a>, where attackers use deceptive emails or websites to trick individuals into revealing sensitive information, are another prevalent threat. Vulnerabilities in software applications, operating systems and outdated security patches create opportunities for exploitation. </span></p>\n<p><span class=\"resolved\">Additionally, insider threats, whether intentional or unintentional, can compromise IT security. For example, a disgruntled employee might intentionally leak sensitive information.</span></p>\n<h2><span class=\"resolved\">Strategies for securing IT systems</span></h2>\n<p><span class=\"resolved\">Securing IT systems requires a comprehensive and proactive approach to mitigate potential risks. One crucial strategy is implementing robust access controls, ensuring that only authorized users have access to sensitive data and systems. Regular software updates and <a href=\"https://securityintelligence.com/articles/is-patching-the-holy-grail-of-cybersecurity/\"  target=\"_blank\" rel=\"noopener nofollow\" >patch management</a> help address known vulnerabilities and strengthen the system&rsquo;s defenses against emerging threats. Employing encryption mechanisms for data at rest and in transit adds an extra layer of protection. </span><span class=\"resolved\"><a href=\"https://securityintelligence.com/posts/3-reasons-make-edr-incident-response-plan/\"  target=\"_blank\" rel=\"noopener nofollow\" >Incident response planning</a> is essential to detect and respond to security incidents promptly. </span></p>\n<p><span class=\"resolved\">Furthermore, user education and <a href=\"https://securityintelligence.com/articles/why-cybersecurity-training-isnt-working-and-how-to-fix-it/\"  target=\"_blank\" rel=\"noopener nofollow\" >training programs</a> help raise awareness about cybersecurity best practices, reducing the likelihood of falling victim to social engineering attacks. By integrating these strategies, organizations can enhance the resilience of their IT systems in the face of evolving cyber threats. </span></p>\n<h2><span class=\"resolved\"><span class=\"resolved\">Common cyber threats and vulnerabilities in OT systems</span></span></h2>\n<p><span class=\"resolved\"><span class=\"resolved\">As OT becomes more interconnected, the need to safeguard OT systems against cyber threats is paramount. Many cyber threats and vulnerabilities specifically target OT systems, which emphasizes the potential impact on industrial operations.</span></span></p>\n<p><span class=\"resolved\"><span class=\"resolved\">Many OT systems still use legacy technologies and protocols that may have inherent vulnerabilities, as they were not designed with modern cybersecurity standards in mind. They may also use older or insecure communication protocols that may not encrypt data, making them susceptible to eavesdropping and tampering. Concerns about system stability often lead OT environments to avoid frequent updates and patches. This can leave systems exposed to known vulnerabilities.</span></span></p>\n<p><span class=\"resolved\"><span class=\"resolved\">OT systems are not immune to <a href=\"https://securityintelligence.com/articles/now-social-engineering-attackers-have-ai-b/\"  target=\"_blank\" rel=\"noopener nofollow\" >social engineering attacks</a> either. Insufficient training and awareness among OT personnel can lead to unintentional security breaches, such as clicking on malicious links or falling victim to social engineering attacks. <a href=\"https://securityintelligence.com/posts/securing-supply-chain-through-cyber-risk-management/\"  target=\"_blank\" rel=\"noopener nofollow\" >Supply chain </a>risks also pose a threat, as third-party suppliers and vendors may introduce vulnerabilities into OT systems if their products or services are not adequately secured.</span></span></p>\n<p>OT systems may also fall prey to several targeted cyber threats:</p>\n<ol>\n<li><span class=\"resolved\"><span class=\"resolved\"><strong><a href=\"https://www.ibm.com/topics/malware?mhsrc=ibmsearch_a&amp;mhq=malware\"  target=\"_blank\" rel=\"noopener nofollow\" >Malware</a> and <a href=\"https://www.ibm.com/topics/ransomware?mhsrc=ibmsearch_a&amp;mhq=ransomware\"  target=\"_blank\" rel=\"noopener nofollow\" >ransomware</a>: </strong>OT systems can be targeted by malware and ransomware, disrupting operations and demanding ransom for restoration</span></span></li>\n<li><span class=\"resolved\"><span class=\"resolved\"><strong>Denial of service (DoS) attacks:</strong> Attackers may attempt to overwhelm OT systems with traffic, causing service disruptions and impacting industrial processes</span></span></li>\n<li><span class=\"resolved\"><span class=\"resolved\"><strong><a href=\"https://securityintelligence.com/posts/detecting-insider-threats-leverage-user-behavior-analytics/\"  target=\"_blank\" rel=\"noopener nofollow\" >Insider threats</a>: </strong>Employees or contractors with insider access may pose a threat, intentionally or unintentionally compromising OT system security</span></span></li>\n<li><span class=\"resolved\"><span class=\"resolved\"><strong>Physical attacks:</strong> Physical access to OT devices can result in tampering or destruction, potentially causing catastrophic consequences for industrial operations</span></span></li>\n<li><span class=\"resolved\"><span class=\"resolved\"><a href=\"https://securityintelligence.com/news/should-you-worry-about-state-sponsored-attacks-maybe-not/\"  target=\"_blank\" rel=\"noopener nofollow\" ><strong>Nation-state attacks:</strong></a> State-sponsored actors may target critical infrastructure for political or economic reasons, posing a significant threat to national security.</span></span></li>\n</ol>\n<h2><span class=\"resolved\"><span class=\"resolved\">Strategies for securing OT systems</span></span></h2>\n<p><span class=\"resolved\"><span class=\"resolved\">OT systems require resilient architectures and robust <a href=\"https://www.ibm.com/topics/incident-response?mhsrc=ibmsearch_a&amp;mhq=incident%20response\"  target=\"_blank\" rel=\"noopener nofollow\" >incident response</a> capabilities. Implementing network <span class=\"resolved\">segmentation to isolate critical OT systems from less secure networks is a good way to reduce the <a href=\"https://www.ibm.com/topics/attack-surface?mhsrc=ibmsearch_a&amp;mhq=attack%20surface\"  target=\"_blank\" rel=\"noopener nofollow\" >attack surface</a>. In addition, system administrators should conduct regular security audits and risk assessments to identify vulnerabilities and weaknesses in OT systems. Enforce strict access controls to ensure that only authorized personnel have access to critical OT systems and data.</span></span></span></p>\n<p>When OT systems are disrupted by a cyberattack, the consequences can be serious. Proper incident response planning, with regular testing and plans tailor-made for OT environments, can minimize downtime in the event of a security incident.</p>\n<h2><span class=\"resolved\">Integrating IT and OT security principles</span></h2>\n<p><span class=\"resolved\">Given the importance of holistic security, the proper integration of IT and OT security principles can mitigate risks across the organization:</span></p>\n<ol>\n<li><span class=\"resolved\"><strong>Collaborative governance: </strong>Establish a cross-functional cybersecurity governance structure that involves both IT and OT teams, ensuring alignment with organizational objectives</span></li>\n<li><span class=\"resolved\"><strong>Unified security policies: </strong>Develop and enforce security policies that address both IT and OT concerns, promoting a consistent and comprehensive approach to cybersecurity</span></li>\n<li><span class=\"resolved\"><strong>Continuous monitoring: </strong>Implement continuous monitoring solutions that provide real-time visibility into both IT and OT environments, enabling quick detection and response to security incidents</span></li>\n<li><span class=\"resolved\"><strong>Training and awareness: </strong>Provide <a href=\"https://securityintelligence.com/articles/how-include-cybersecurity-training-employee-onboarding/\"  target=\"_blank\" rel=\"noopener nofollow\" >comprehensive training</a> for employees across IT and OT teams to enhance awareness of cybersecurity risks and best practices</span></li>\n<li><span class=\"resolved\"><strong><a href=\"https://securityintelligence.com/posts/how-to-manage-third-party-supply-chain-risks/\"  target=\"_blank\" rel=\"noopener nofollow\" >Vendor security</a> standards: </strong>Collaborate with vendors to establish and enforce security standards for products and services integrated into OT systems.</span></li>\n</ol>\n<h2><span class=\"resolved\"><strong>Looking to the future of IT and OT security</strong></span></h2>\n<p><span class=\"resolved\">Examining the evolving threat landscape, the following emerging trends and future considerations will play a large role in IT and OT security:</span></p>\n<ol>\n<li><span class=\"resolved\"><strong><a href=\"https://www.ibm.com/topics/artificial-intelligence?mhsrc=ibmsearch_a&amp;mhq=AI\"  target=\"_blank\" rel=\"noopener nofollow\" >AI</a> and machine learning: </strong>Integration of AI and machine learning for anomaly detection and predictive analysis can identify and respond to potential threats in real-time</span></li>\n<li><span class=\"resolved\"><strong><a href=\"https://www.ibm.com/topics/zero-trust?mhsrc=ibmsearch_a&amp;mhq=zero%20trust\"  target=\"_blank\" rel=\"noopener nofollow\" >Zero trust</a> architecture: </strong>Adoption of zero trust principles, where no entity is trusted by default, requires verification from anyone trying to access resources in both IT and OT environments</span></li>\n<li><span class=\"resolved\"><strong>Digital twins: </strong>Digital twin technology can create virtual replicas of physical assets, allowing for better monitoring, testing and securing of OT systems</span></li>\n<li><span class=\"resolved\"><strong>Cloud adoption: </strong>Increasing integration of cloud technologies in OT environments will require secure cloud architectures and data protection measures</span></li>\n<li><span class=\"resolved\"><strong>IoT security: </strong>As more <a href=\"https://securityintelligence.com/articles/how-white-house-new-iot-labels-improve-security/\"  target=\"_blank\" rel=\"noopener nofollow\" >IoT devices</a> are deployed in industrial settings, ensuring the security of these devices becomes crucial to prevent potential vulnerabilities in OT systems. </span></li>\n</ol>\n<h2><span class=\"resolved\">Common ground in IT and OT cybersecurity</span><span class=\"resolved\"><br></span></h2>\n<p><span class=\"resolved\">Both IT and OT share the fundamental principles of maintaining the confidentiality, integrity and availability of information. Protecting sensitive data, ensuring data accuracy and minimizing downtime are common goals.</span></p>\n<p><span class=\"resolved\">IT and OT environments also require robust access controls to restrict unauthorized access to critical systems and information. </span><span class=\"resolved\">The need for regular updates and patch management is common, although the implementation may differ. Both IT and OT need to address vulnerabilities promptly.</span></p>\n<p><span class=\"resolved\">Lastly, training and awareness programs are essential in both IT and OT to educate users about cybersecurity best practices and potential threats.<br></span></p>\n<h2><span class=\"resolved\">Different systems, different security challenges</span><span class=\"resolved\"><br></span></h2>\n<p><span class=\"resolved\">Though approaches to cybersecurity in IT and OT share many objectives, they also involve divergent requirements. Organizations seeking to implement comprehensive cybersecurity measures must consider their approach carefully when integrating IT and OT security. </span></p>\n<p><span class=\"resolved\">The following are all distinctions between securing IT and OT systems:</span></p>\n<ol>\n<li><span class=\"resolved\"><strong>The pace of change:</strong> IT environments typically evolve rapidly with frequent software updates and changes, while OT systems often remain in operation for many years without major modifications. This difference in the pace of change affects how cybersecurity measures are implemented and managed.</span></li>\n<li><span class=\"resolved\"><strong>Risk tolerance:</strong> While both IT and OT seek to minimize risks, the risk tolerance may differ. In OT, where safety and reliability are paramount, the consequences of a security incident can be more severe, leading to a lower risk tolerance.</span></li>\n<li><span class=\"resolved\"><strong>Technology stack: </strong>IT deals with general-purpose hardware and software, whereas OT involves specialized industrial control systems (ICS) and field devices. The technology stack and protocols used in OT are often unique and require specialized security measures.</span></li>\n<li><span class=\"resolved\"><strong>Impact of downtime: </strong>In IT, the primary concern may be financial losses due to downtime. In OT, downtime can have more immediate and severe consequences, potentially affecting safety, production processes and critical infrastructure.</span></li>\n<li><span class=\"resolved\"><strong>Network segmentation:</strong> While network segmentation is common in both domains, its implementation and implications differ. OT may have more stringent requirements for segmentation due to the need to protect critical processes.</span></li>\n</ol>\n<h2><span class=\"resolved\">Key considerations for implementing comprehensive cybersecurity measures<br></span></h2>\n<p><span class=\"resolved\">When implementing your cybersecurity measures to secure IT and OT assets, keep these critical considerations in mind:</span></p>\n<ol>\n<li><span class=\"resolved\"><strong>Risk assessment:</strong> Conduct a thorough risk assessment to identify and prioritize potential threats and vulnerabilities specific to the organization&rsquo;s IT and OT environments</span></li>\n<li><span class=\"resolved\"><strong>Compliance requirements: </strong>Understand and adhere to industry-specific regulations and compliance standards that apply to both IT and OT systems</span></li>\n<li><span class=\"resolved\"><strong>Asset inventory: </strong>Maintain a comprehensive inventory of both IT and OT assets, including hardware, software and connected devices, to effectively manage and secure the entire ecosystem</span></li>\n<li><span class=\"resolved\"><strong>Incident response planning: </strong>Develop and regularly test incident response plans that cover both IT and OT scenarios, ensuring a coordinated and effective response to security incidents</span></li>\n<li><span class=\"resolved\"><strong>Collaboration and communication: </strong>Establish effective communication channels and collaboration mechanisms between IT and OT teams to share threat intelligence and insights and coordinate security efforts.<br></span></li>\n</ol>\n<h2>Challenges of integrating IT and OT security</h2>\n<p>Bridging the gap between the disparate technologies and protocols used in IT and OT can be challenging, requiring specialized knowledge and solutions. IT and OT teams may have different priorities, risk tolerances and operating cultures. Bridging these cultural gaps requires effective communication and collaboration.</p>\n<p>Achieving compliance with industry-specific regulations that may have different requirements for IT and OT poses a challenge when integrating security measures. In addition, many OT systems rely on legacy technologies that may lack the built-in security features present in modern IT systems. Upgrading or securing these legacy systems can be challenging.</p>\n<p>And finally, addressing the skill gaps between IT and OT personnel is crucial. Cross-training programs may be necessary to ensure that teams understand and can effectively manage both environments.</p>\n<h2><span class=\"resolved\">Benefits of integrating IT and OT security</span></h2>\n<p><span class=\"resolved\">Integration allows for a holistic security posture, addressing vulnerabilities and threats across the entire organization rather than in isolated silos. <span class=\"resolved\">Successfully integrating your IT and OT security offers many benefits:</span></span></p>\n<ol>\n<li><span class=\"resolved\"><strong>Improved visibility: </strong>Integrating IT and OT security provides better visibility into the entire digital infrastructure, enabling more effective monitoring and threat detection</span></li>\n<li><span class=\"resolved\"><strong>Efficient resource allocation: </strong>Shared resources and expertise between IT and OT teams lead to more efficient use of cybersecurity resources, reducing redundancy and optimizing efforts</span></li>\n<li><span class=\"resolved\"><strong>Synergistic threat intelligence: </strong>Combining threat intelligence from both IT and OT environments enhances the organization&rsquo;s ability to anticipate and respond to evolving cyber threats.</span></li>\n</ol>\n<h2>Creating a seamless security approach</h2>\n<p>IT and OT each involve distinct challenges in the realm of cybersecurity. While IT systems serve as prime targets for cyberattacks and demand robust security measures, OT systems control critical physical processes and present unique risks amplified by legacy technologies. The integration of IT and OT systems, both crucial for organizational efficiency, faces hurdles arising from cultural disparities, divergent priorities and technical incongruities. To navigate these challenges successfully, a holistic cybersecurity approach is paramount, necessitating the convergence of IT and OT security principles.</p>\n<p>Despite the potential benefits, organizations must carefully manage the intricacies of this integration. Vigilance towards emerging threats, adoption of effective mitigation strategies and an awareness of evolving trends are essential for building a resilient cybersecurity posture that safeguards both digital and operational assets in the dynamic and interconnected landscape of today&rsquo;s technology-driven world.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/posts/it-and-ot-cybersecurity-integration/\">IT and OT cybersecurity: A holistic approach</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"What the cybersecurity workforce can expect in 2024","link":"https://securityintelligence.com/articles/cybersecurity-workforce-trends-2024/","dc:creator":{"#cdata-section":"Sue Poremba"},"pubDate":"Wed, 03 Jan 2024 18:00:00 +0000","category":[{"#cdata-section":"Risk Management"},{"#cdata-section":"cybersecurity careers"},{"#cdata-section":"Career"},{"#cdata-section":"Cybersecurity"},{"#cdata-section":"Cybersecurity Jobs"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446863"},"description":{"#cdata-section":"<p>For cybersecurity professionals, 2023 was a mixed bag of opportunities and concerns. The good news is that the number of people in cybersecurity jobs has reached its highest number ever: 5.5 million, according to the 2023 ISC2 Global Workforce Study. However, the same study reported that there is still a serious shortfall. To best address [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/cybersecurity-workforce-trends-2024/\">What the cybersecurity workforce can expect in 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>For cybersecurity professionals, 2023 was a mixed bag of opportunities and concerns. The good news is that the number of people in cybersecurity jobs has reached its highest number ever: 5.5 million, according to the <a href=\"https://media.isc2.org/-/media/Project/ISC2/Main/Media/documents/research/ISC2_Cybersecurity_Workforce_Study_2023.pdf?rev=28b46de71ce24e6ab7705f6e3da8637e&amp;hash=CE6762D811935593F5C04AAB49DF33DF\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >2023 ISC2 Global Workforce Study</a>. However, the same study reported that there is still a serious shortfall. To best address threat landscape challenges, the workforce needs to grow at a rate of 12.6 percent a year. In the 2023 study, it only grew by 8.7 percent.</p>\n<p>More troubling than the shortfall of approximately 4 million cybersecurity professionals is the slowdown in hiring and the rise of cutbacks. As the ISC2 study found, nearly half of those surveyed said their companies have dealt with layoffs, reduced budgets and/or hiring freezes &mdash; with more slowdown expected to come in 2024.</p>\n<p>It&rsquo;s quite a paradox. The need for a skilled cybersecurity workforce is greater than ever due to the rise in cyber threats, new attackers and attack vectors. Positions are available. Yet the looming threat of an economic downturn has made employers overly cautious about filling out their security team, and part of the reason could be because having a warm body in the position isn&rsquo;t enough; potential employees don&rsquo;t have the right skill sets to effectively guard against today&rsquo;s biggest risks.</p>\n<p>So, what are the demands on the cybersecurity workforce as we head into 2024? What skills are in demand and what are the obstacles that potential cyber professionals face?</p>\n<h2>What employees are looking for</h2>\n<p>A Google search of cybersecurity jobs came up with hundreds of hits. On the very first page, there were ads for a cybersecurity administrator, a cybersecurity analyst, a cyber intelligence analyst and a cybersecurity engineer.</p>\n<p>Asking a generative AI tool for the top skills that employers are looking for in a cybersecurity workforce, the top results, which used information from job sites like Indeed, LinkedIn and Coursera, included:</p>\n<ul>\n<li>Scripting and programming languages</li>\n<li>Intrusion and threat prevention</li>\n<li>Risk identification and management</li>\n<li>Information security and assurance</li>\n<li>General security operations</li>\n<li>Threat analysis</li>\n<li>Communication and critical thinking skills.</li>\n</ul>\n<p>These descriptions highlight one of the biggest issues cybersecurity professionals face when looking for new jobs or starting their careers. There are no standards for job titles, and the job requirements are fairly generic. Entry-level positions often require multiple years of experience <a href=\"https://www.coursera.org/articles/popular-cybersecurity-certifications\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >along with certifications</a> like CISSP, Security+ and CISA.</p>\n<p>As government agencies, contractors and the military ramp up their cybersecurity defenses, one key requirement often stands in the way of hiring qualified applicants: security clearances.</p>\n<p>&ldquo;There are many cybersecurity jobs that need clearance, which means the main pipeline is from the military for these roles, often with no actual technical expertise,&rdquo; Joseph Yang, Information Technology Administrator for Summit Public Schools, Redwood City, Calif., said in a LinkedIn message.</p>\n<p><span class=\"resolved\"><a href=\"https://www.coursera.org/articles/security-clearance\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Getting security clearance</a> is a complicated process that starts after the job offer is accepted. It can take upwards of a year or more for clearance to be approved, and there are disqualifiers for approval, like citizenship and poor credit scores.</span></p>\n<h2>Who needs cybersecurity professionals the most?</h2>\n<p>Every business, no matter the industry or the size, needs to think about cybersecurity. But some industries are more at risk than others. The industries that require strong cybersecurity policies and practices are finance, healthcare and energy. All three are highly regulated industries that must follow strict compliance guidelines to protect customer data. Healthcare and finance have long been popular for attackers because of the treasure trove of information and monetary benefits. Energy may seem like an outlier here, but the <a href=\"https://www.securityhq.com/blog/a-surge-of-cyber-security-for-the-energy-sector/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >energy and utility infrastructure has become a target for ransomware attacks in recent years.</a></p>\n<p>But as the threat landscape changes and new technologies boost new industries, risk levels are shifting toward different industries. According to <a href=\"https://www.cyberdegrees.org/resources/best-industries-cybersecurity/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Cyber Degrees</a>, industries now in near critical need of cybersecurity are digital assets, e-sports and those developing AI technology. Those industries seeing an increase in risks include manufacturing, professional services and education.</p>\n<h2>Upskilling workers</h2>\n<p>Sometimes, your best cybersecurity employees have been inside the company all along. In fact, Robert Fitzgerald, Field CISO with Blue Mantis, recommended training new cybersecurity professionals. During a phone conversation, Fitzgerald pointed out that training someone specifically for your organization means you ensure you have a cyber professional who knows your organization&rsquo;s security needs and they aren&rsquo;t bringing in any bad habits from past jobs.</p>\n<p>Upskilling is something large enterprises and government agencies have been doing for a while, as research finds that <a href=\"https://www.shrm.org/resourcesandtools/hr-topics/organizational-and-employee-development/pages/report-employers-reap-benefits-of-employee-training-when-done-right.aspx\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >training employees for new tasks improves overall retention</a>. SMBs that might already be using MSSPs for most of their cybersecurity needs can also take advantage of upskilling to ensure that they have some in-house experience, even to help other employees with security awareness training and improving overall cyber hygiene. Many cybersecurity vendors offer training programs specific to their products, while others offer vendor-neutral training that can build on skill sets. Organizations like the <a href=\"https://www.cisa.gov/cybersecurity-training-exercises\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >Cybersecurity and Infrastructure Security Agency (CISA)</a> and <a href=\"https://www.isc2.org/\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >ISC2</a> offer training options, as well.</p>\n<h2>Skills for the cyber workforce</h2>\n<p>There are some basic hard skills that every cybersecurity professional needs to know. Technical skills in operating systems, building infrastructure and databases, coding languages and understanding the fundamentals of computer networking are a must.</p>\n<p>But cybersecurity is becoming more specialized. There is a greater need for those who understand cloud computing and the differences between cloud security and information security. AI is going to present new challenges in cybersecurity, so those who can implement AI as well as defend against new threats are required. Data analysts, white hat hackers for penetration testing and app development are also skills in increasing demand.</p>\n<p>Organizations need cybersecurity professionals with experience with governance frameworks. Nearly every industry is now required to meet at least one government compliance standard, and new laws are being introduced each year. While a <a href=\"https://comptiacdn.azureedge.net/webcontent/docs/default-source/research-reports/comptia-it-industry-outlook-2024_final.pdf?sfvrsn=8aeab92c_4\" target=\"_blank\" rel=\"noopener nofollow\"  target=\"_blank\" rel=\"noopener nofollow\" >CompTIA study</a> found that governance isn&rsquo;t a high-ranking skill needed among its respondents, the changing nature of compliance means that companies will need someone with this skillset to build strategy and ensure security measures meet regulations to avoid penalties and hefty fines.</p>\n<h2>Don&rsquo;t forget soft skills</h2>\n<p>Soft skills may be just as important as technical ones. Cybersecurity requires communication, so cybersecurity professionals need good verbal and written communication skills and the ability to work with people face-to-face. ISC2&rsquo;s survey listed communication skills as the second most in demand, immediately behind cloud computing security. Good networking skills are vital. If interacting with the security team intimidates the rest of the organization&rsquo;s employees, cybersecurity efforts will fail.</p>\n<p>Be aware that skills do become dated and fall out of favor. The ISC2 report found that formal cybersecurity education is less in demand, especially advanced degrees and knowledge of advanced cybersecurity concepts. Hands-on experience is becoming more important.</p>\n<p>The most important requirement for a career in cybersecurity is interest. Technology can be learned. Soft skills can be practiced. But no matter your background, if building knowledge around threat actor behaviors and putting together the strategy to protect data and networks is something that interests you, you&rsquo;ve already taken the first step toward becoming a cybersecurity professional.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/cybersecurity-workforce-trends-2024/\">What the cybersecurity workforce can expect in 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}},{"title":"Roundup: Federal action that shaped cybersecurity in 2023","link":"https://securityintelligence.com/articles/2023-federal-cybersecurity-action-roundup/","dc:creator":{"#cdata-section":"Mark Stone"},"pubDate":"Thu, 28 Dec 2023 14:00:00 +0000","category":[{"#cdata-section":"Government"},{"#cdata-section":"Artificial Intelligence (AI)"},{"#cdata-section":"Cybersecurity"},{"#cdata-section":"Federal Government"},{"#cdata-section":"Federal Government Security"},{"#cdata-section":"Home Network"},{"#cdata-section":"Home Network Security"},{"#cdata-section":"Infrastructure"},{"#cdata-section":"National Institute of Standards and Technology (NIST)"},{"#cdata-section":"National Security Agency (NSA)"},{"#cdata-section":"Quantum Computing"}],"guid":{"@isPermaLink":"false","#text":"https://securityintelligence.com/?p=446855"},"description":{"#cdata-section":"<p>As 2023 draws to a close, it&#8217;s time to look back on our top five federal cyber stories of the year: a compilation of pivotal moments and key developments that have significantly shaped the landscape of cybersecurity at the federal level. These stories highlight the challenges federal agencies faced in securing digital infrastructure in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/2023-federal-cybersecurity-action-roundup/\">Roundup: Federal action that shaped cybersecurity in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"},"content:encoded":{"#cdata-section":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><p>As 2023 draws to a close, it&rsquo;s time to look back on our top five federal cyber stories of the year: a compilation of pivotal moments and key developments that have significantly shaped the landscape of cybersecurity at the federal level.</p>\n<p>These stories highlight the challenges federal agencies faced in securing digital infrastructure in the past year and explore the evolving nature of cyber threats, as well as the innovative responses required to address them.</p>\n<h2>New White House cybersecurity strategy</h2>\n<p>The White House&rsquo;s <a href=\"https://securityintelligence.com/news/new-white-house-cybersecurity-strategy-plots-the-road-ahead/\"  target=\"_blank\" rel=\"noopener nofollow\" >National Cybersecurity Strategy</a> represents a decisive shift in the U.S. approach to cybersecurity. This 35-page document details the government&rsquo;s plan to strengthen cyber defenses, focusing on reducing the burden on end-users, small businesses and local governments. The strategy proposes shifting software security liability to larger corporations, a move that has sparked discussions in the cybersecurity community. Finally, it prioritizes protecting critical infrastructure, like public water systems, from cyberattacks while preparing for emerging threats from quantum computing and AI.</p>\n<h2>NIST evolved for risk management</h2>\n<p>The <a href=\"https://securityintelligence.com/articles/how-nist-cybersecurity-framework-2-tackles-risk-management/\"  target=\"_blank\" rel=\"noopener nofollow\" >NIST Cybersecurity Framework 2.0</a> (CSF) is evolving to meet the challenges of modern risk management, aligning with the Biden Administration&rsquo;s National Cybersecurity Strategy. This update emphasizes improved risk management strategies, which are crucial in today&rsquo;s cybersecurity landscape. The framework introduces a new &lsquo;govern&rsquo; function, focusing on policies, procedures and team roles in cybersecurity risk management. It also expands guidelines on supply chain security, reflecting broader government initiatives. The CSF 2.0 continues to grow, addressing emerging threats like generative AI while striving for a cohesive U.S. cybersecurity approach across government and private sectors.</p>\n<h2>NSA&rsquo;s best practices for home networks</h2>\n<p>The hybrid workplace is here to stay, and since home networks are central to our personal and professional lives, their security is paramount. The National Security Agency (NSA) emphasizes this shift in their latest <a href=\"https://securityintelligence.com/articles/nsa-releases-new-best-practices-for-securing-home-networks/\"  target=\"_blank\" rel=\"noopener nofollow\" >best practices for securing home networks</a>, highlighting the risks posed by cyber criminals. Bad actors often target home networks as gateways to larger corporate systems, especially through remote workers. The NSA&rsquo;s guidelines focus on two key areas: technical upgrades to network hardware and software and behavioral changes to enhance online safety. By following the guidelines, individuals can mount a defense against breaches, keeping their personal data and professional integrity intact.</p>\n<h2>White House continues cybersecurity push</h2>\n<p>The Biden Administration&rsquo;s <a href=\"https://securityintelligence.com/articles/cyber-experts-applaud-new-white-house-cybersecurity-plan/\"  target=\"_blank\" rel=\"noopener nofollow\" >National Cybersecurity Strategy Implementation Plan</a> (NCSIP) marks a significant advancement in the United States&rsquo; approach to cybersecurity. Managed by the White House&rsquo;s Office of the National Cyber Director, the plan has been well-received by cybersecurity experts for its clarity and actionable goals. It outlines over 65 federal initiatives to enhance cybersecurity, assigning specific tasks and deadlines to 18 federal agencies. The NCSIP is structured around five core pillars: defending critical infrastructure, disrupting threat actors, shaping market forces for security and resilience, investing in a resilient future and forging international partnerships. The comprehensive plan represents a groundbreaking shift in the U.S. government&rsquo;s allocation of roles, responsibilities and resources in cyber, emphasizing long-term investments in cybersecurity and a coordinated effort across federal agencies.</p>\n<h2>The White House on managing AI</h2>\n<p>President Biden&rsquo;s <a href=\"https://securityintelligence.com/articles/the-white-house-safeguarding-ai/\"  target=\"_blank\" rel=\"noopener nofollow\" >executive order on Artificial Intelligence (AI)</a>, issued on October 30, 2023, takes a significant step in the regulation and advancement of AI technology. The order aims to protect the American public from any negative side effects of AI&rsquo;s rapid and expansive development. It outlines ambitious goals, including setting new AI safety and security standards, protecting privacy, advancing equity and civil rights and promoting innovation and competition. The order has also sparked debate over its sufficiency and potential impact on America&rsquo;s AI leadership. While it emphasizes labeling AI-generated content, supporting the American workforce and promoting innovation, critics argue it lacks enforceable mandates and detailed implementation strategies. Ultimately, the executive order is seen as an initial step in a longer journey.</p>\n</body></html>\n<p>The post <a rel=\"nofollow\" href=\"https://securityintelligence.com/articles/2023-federal-cybersecurity-action-roundup/\">Roundup: Federal action that shaped cybersecurity in 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://securityintelligence.com\">Security Intelligence</a>.</p>\n"}}]}}}