{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Safety Detectives","atom:link":{"@href":"https://www.safetydetectives.com/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://www.safetydetectives.com","description":"","lastBuildDate":"Fri, 26 Jan 2024 18:11:45 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.4.1","item":[{"title":"Venmo, Zelle, Cash App Users at High Risk of Fraud, Manhattan DA Warns","link":"https://www.safetydetectives.com/news/venmo-zelle-cash-app-users-at-high-risk-of-fraud-manhattan-da-warns/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Fri, 26 Jan 2024 18:11:45 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173870"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Zelle-300x200.jpg\" alt=\"\"></p>Manhattan District Attorney Alvin Bragg sent letters to the companies that own Venmo, Zelle, and Cash App, demanding that they increase protections for consumers. DA Bragg argued in his letters that these companies don’t offer the level of security to safeguard consumers from fraud that’s &#8220;draining bank accounts of significant sums of money.” He noted [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Zelle-300x200.jpg\" alt=\"\"></p><p>Manhattan District Attorney Alvin Bragg sent letters to the companies that own Venmo, Zelle, and Cash App, demanding that they increase protections for consumers.</p>\n<p>DA Bragg argued in his letters that these companies don’t offer the level of security to safeguard consumers from fraud that’s &#8220;draining bank accounts of significant sums of money.” He noted that &#8220;frauds and scams have proliferated&#8221; as more people are using peer-to-peer payment services.</p>\n<p>Bragg&#8217;s letters said he was writing &#8220;in response to a growing number of” fraud and theft incidents &#8220;through the exploitation of your company&#8217;s mobile financial applications on personal electronic devices such as iPhones.&#8221;</p>\n<p>&#8220;I am concerned about the troubling rise in illegal behavior that has developed because of insufficient security measures connected with your software and business policy decisions,&#8221; Bragg&#8217;s letters said.</p>\n<p>&#8220;These crimes involve an unauthorized user gaining access to unlocked devices and then draining bank accounts of significant sums of money, making purchases with mobile financial applications, and using financial information from the applications to open new accounts,&#8221; Bragg&#8217;s letters said.</p>\n<p>&#8220;Offenders also take over the phone&#8217;s security by changing passwords, recovery accounts, and application settings. The ease with which offenders can collect five- and even six-figure windfalls in a matter of minutes is incentivizing a large number of individuals to commit these crimes, which are creating serious financial, and in some cases physical, harm to our residents,” the letter continued.</p>\n<p>Bragg urged these companies to put a strict limit on transactions, enforce a secondary verification process that could take up to a day, and enhance surveillance of abnormal activities.</p>\n<p>In a statement for Early Warning Services, which operates Zelle, a spokesperson said, &#8220;Providing a safe and reliable service to consumers is the top priority of Early Warning Services, LLC, the network operator of Zelle, and our 2,100 participating banks and credit unions.”</p>\n<p>&#8221; As a result of our continued efforts to build on Zelle&#8217;s strong foundation of security, less than one tenth of one percent of transactions are reported as fraud or scams, and that percentage keeps getting smaller,” the statement added.</p>\n<p>CashApp is &#8220;committed to building trust with our customers and investing in areas that help build a safe and secure platform,” a spokesperson for the company said in a statement.</p>\n<p>&#8220;We work proactively and diligently to safeguard our customer&#8217;s money and mitigate against the risk of fraud on our platform through a combination of preventative controls like multi-factor authentication, account transaction limits, fraud detection, and consumer education. We also partner with law enforcement agencies to detect and combat criminal activity,&#8221; the statement said.</p>\n"}},{"title":"Activision Blizzard lays off 1,900 Video Gaming Employees","link":"https://www.safetydetectives.com/news/activision-blizzard-lays-off-1900-video-gaming-employees/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Fri, 26 Jan 2024 16:53:13 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173865"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Microsoft-300x199.jpg\" alt=\"\"></p>Activision Blizzard laid off 1,900 employees at the behest of its parent company, Microsoft. The move isn’t a complete surprise — over the last several months many major tech companies have been forced to make layoffs. The job market saw several years of rapid increases in wages and hiring, but the bubble has largely popped. [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Microsoft-300x199.jpg\" alt=\"\"></p><p>Activision Blizzard laid off 1,900 employees at the behest of its parent company, Microsoft.</p>\n<p>The move isn’t a complete surprise — over the last several months many major tech companies have been forced to make layoffs. The job market saw several years of rapid increases in wages and hiring, but the bubble has largely popped. Other major companies like Alphabet, eBay, and even Amazon had waves of layoffs.</p>\n<p>Microsoft recently acquired Activision Blizzard in a divisive $69 billion deal that had some critics claiming it was acting like a monopoly. Now it’s slashing jobs at the newly purchased company.</p>\n<p>“In all, 1,900 employees are being cut, the bulk of which are from Activision Blizzard, less so from Xbox and Zenimax/Bethesda,” writes Forbes.</p>\n<p>The news comes from an internal memo written by Phil Spencer, head of Xbox. To the many who are outraged at the massive layoffs, the memo only adds fuel to the fire. Critics say the language used comes off as dispassionate and purely profit-driven.</p>\n<p>“The leadership of Microsoft Gaming and Activision Blizzard is committed to aligning on a strategy and an execution plan with a sustainable cost structure that will support the whole of our growing business,” said Spencer, explaining that the layoffs are indeed being made to save money.</p>\n<p>Another passage from the memo has drawn some criticism from social media users.</p>\n<p>“We will provide our full support to those who are impacted during the transition, including severance benefits informed by local employment laws.” Some argue this simply means the company will only provide the bare minimum local employment laws grant — though it is simply speculation.</p>\n<p>Regardless of whether or not it’s palatable, the continued wave of layoffs by major tech companies is most likely going to continue, making for a cutthroat job market.</p>\n"}},{"title":"Netflix Adds Live Sports To Its Streaming Service","link":"https://www.safetydetectives.com/news/netflix-adds-live-sports-to-its-streaming-service/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Fri, 26 Jan 2024 16:50:23 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173861"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Netflix-300x197.jpg\" alt=\"\"></p>In a move that’s practically borrowed from cable TV services of the past, Netflix has begun adding access to live sports broadcasts with a subscription. This isn’t a revolutionary decision as other streaming services have already begun. Amazon Prime, for example, already broadcasts some live sports for anyone with Amazon Prime. The result certainly drew [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Netflix-300x197.jpg\" alt=\"\"></p><p>In a move that’s practically borrowed from cable TV services of the past, Netflix has begun adding access to live sports broadcasts with a subscription.</p>\n<p>This isn’t a revolutionary decision as other streaming services have already begun. Amazon Prime, for example, already broadcasts some live sports for anyone with Amazon Prime. The result certainly drew more customers as a result.</p>\n<p>Netflix secured the rights to broadcast WWE, a US-based live wrestling show. Shows like Smackdown and Raw will no longer need a separate subscription to view.</p>\n<p>The move comes after years of Netflix losing its market share to competitive streaming services. As an example, popular television shows like The Office are now housed on competitors&#8217; websites. In response, Netflix began pouring billions of dollars into acquiring movies, television shows, and now, sports broadcasts.</p>\n<p>It’s certainly a defensive move by Netflix while it tries to play catch-up to its rivals.</p>\n<p>This move essentially cements the similarities between streaming and cable. In the past, you’d need to pay a base subscription, plus extra for various channel packages, sports broadcasts, and pay-per-view events.</p>\n<p>Now you’ll need a variety of different streaming services that each have their own payment structure, ads, apps, and websites to watch the majority of popular shows and sports. The average person is spending just as much on streaming services (if not more) than they were on cable.</p>\n<p>WWE also has a streaming service with its own subscription to view a range of matches from across the years, so combining some of its services with Netflix can also be seen as a good thing for consumers.</p>\n<p>Netflix recently boasted its largest-ever fourth-quarter subscription growth (potentially as a result of the crackdown on password sharing), and this deal is expected to bring in a whole new slew of subscribers.</p>\n<p>According to senior analysts, other top streaming services will have to begin including live sports, news broadcasts, and other cable-like elements to stay competitive.</p>\n"}},{"title":"New Update Explains How The SEC X Hack Happened","link":"https://www.safetydetectives.com/news/new-update-explains-how-the-sec-x-hack-happened/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Thu, 25 Jan 2024 18:53:47 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173463"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/SEC-X-300x198.jpg\" alt=\"\"></p>New details shed light on the SEC X hack that occurred recently. On Jan. 9, the X account of the Securities Exchange Commission (SEC) was hacked by a group of scammers who posted that the SEC approved Bitcoin ETFs. The price of Bitcoin instantly peaked $48,000 before crashing. The scammers were able to both hack [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/SEC-X-300x198.jpg\" alt=\"\"></p><p>New details shed light on the SEC X hack that occurred recently.</p>\n<p>On Jan. 9, the X account of the Securities Exchange Commission (SEC) was hacked by a group of scammers who posted that the SEC approved Bitcoin ETFs. The price of Bitcoin instantly peaked $48,000 before crashing. The scammers were able to both hack into the SEC and manipulate the Bitcoin market, presumably to a profit.</p>\n<p>The attack drew international criticism towards the SEC, but for a little over two weeks there were no answers.</p>\n<p>To break down the timeline:</p>\n<ul>\n<li>In February 2023, Twitter (now X) sent out a notification to its users that they must remove two-factor authorization or they risk losing their accounts. At the time, Twitter Blue had just launched and the company was pressuring users into subscribing.</li>\n<li>In March 2023, Twitter completely removed SMS-based 2FA for anyone without a subscription.</li>\n<li>In July 2023, the SEC asked Twitter support to disable 2FA on their account after they were locked out of their account because of their old SMS-based 2FA.</li>\n<li>This month, hackers were able to perform a “Sim Swap” attack. A hacker was able to obtain the phone number used to log into the SEC’s X account. Without 2FA, all they needed was the phone number.</li>\n</ul>\n<p>After obtaining the information, the hacker pulled off their scam before the SEC was able to take control of its account again. Eyebrows were raised at the fact that the SEC didn’t reconfigure their 2FA after gaining access to their accounts in July.</p>\n<p>In a dramatic twist, the SEC chairman was tweeting about the importance of MFA at the time the hack was taking place. In a sense, he wasn’t wrong.</p>\n<p>Still, X bears some level of responsibility for pressuring users into subscribing by removing extremely basic security measures for free accounts, resulting in a wave of users being temporarily locked out of their accounts.</p>\n<p>That said, it isn’t the best look for the SEC.</p>\n"}},{"title":"Department Of Defense Tightens Rules On Cloud Security","link":"https://www.safetydetectives.com/news/department-of-defense-tightens-rules-on-cloud-security/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Thu, 25 Jan 2024 18:47:33 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173459"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Department-Of-Defense-Tightens-300x200.jpg\" alt=\"\"></p>A new memo sent from the Department of Defense (DoD) revealed that they’re tightening security requirements for cloud providers at the FedRAMP level. Historically, it was unclear what constituted being FedRAMP certified and what it entails. Before the new rules, the DFARS clause stated a third-party contractor should ensure their cloud service providers meet FedRAMP [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Department-Of-Defense-Tightens-300x200.jpg\" alt=\"\"></p><p>A new memo sent from the Department of Defense (DoD) revealed that they’re tightening security requirements for cloud providers at the FedRAMP level.</p>\n<p>Historically, it was unclear what constituted being FedRAMP certified and what it entails. Before the new rules, the DFARS clause stated a third-party contractor should ensure their cloud service providers meet FedRAMP requirements.</p>\n<p>At the time those requirements simply meant that the service providers needed to follow rules for data retention, incident reports, and access requirements.</p>\n<p>While that’s still an important step to take, it failed to create a baseline level of security requirements cloud service providers needed to take. However, after altering the DFARS clause, that concern has been addressed.</p>\n<p>Now, being FedRAMP-approved requires a minimum baseline of cybersecurity defenses. FedRAMP uses a third-party company to evaluate if providers meet the given criteria.</p>\n<p>“To be considered FedRAMP Moderate equivalent, CSO’s must achieve 100% with the latest FedRAMP moderate security control baseline through an assessment conducted by a FedRAMP-recognized Third-Party Assessment Organization (3PAO),” reads the memo.</p>\n<p>This puts the ball in the cloud service providers&#8217; hands, so to speak. If they want to continue working with the DoD, they’ll need to bring their cybersecurity up to snuff. Companies that take shortcuts with their cybersecurity practices will lose the DoD’s business.</p>\n<p>It’s not completely known what’s causing the DoD to tighten its security rules, but there are a few guesses. Data breaches and hacks on cloud service providers have sharply risen over the years, especially with the rise of AI making it easier than ever. If a hacker can obtain data from the service provider, they can obtain the data of every contractor that they work with.</p>\n<p>In response, US government agencies have been working together to make sure that companies are following minimum safety requirement guidelines.</p>\n"}},{"title":"Cyberattacks Attempts Increased 104% Last Year","link":"https://www.safetydetectives.com/news/cyberattacks-attempts-increased-last-year/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Wed, 24 Jan 2024 17:19:27 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173137"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Cyberattacks-300x200.jpg\" alt=\"\"></p>There was a more than twofold increase in worldwide attack efforts in 2023, according to the latest report from cybersecurity company Armis. Armis’s latest report, &#8220;The Anatomy of Cybersecurity: A Dissection of 2023&#8217;s Atack Landscape,&#8221; draws on  Armis’ proprietary data, which points to a serious surge in cyberwarfare. The data marks a 104% rise in [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Cyberattacks-300x200.jpg\" alt=\"\"></p><p>There was a more than twofold increase in worldwide attack efforts in 2023, according to the latest report from cybersecurity company Armis.</p>\n<p>Armis’s latest report, &#8220;<a href=\"https://www.armis.com/anatomy-of-cybersecurity\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" data-btn-name=\"Affiliate Link\">The Anatomy of Cybersecurity: A Dissection of 2023&#8217;s Atack Landscape</a>,&#8221; draws on  Armis’ proprietary data, which points to a serious surge in cyberwarfare. The data marks a 104% rise in cyberattack attempts in 2023.</p>\n<p>The numbers show that the most affected sectors include utilities, which recorded a 200% increase and  manufacturing, with a 165% increase. The highest number of attacks took place in July, when hackers mostly went after communications devices, imaging devices, and manufacturing devices.</p>\n<p>“Armis found that not only are attack attempts increasing, but cybersecurity blind spots and critical vulnerabilities are worsening, painting prime targets for malicious actors,” said CTO and Co-Founder of Armis, Nadir Izrael.</p>\n<p>“It’s critical that security teams leverage similar intelligence defensively so that they know where to prioritize efforts and fill these gaps to mitigate risk. We hope that by sharing these insights, global businesses and governments will leverage them to immediately pinpoint what they should be focusing on to improve their cybersecurity posture this year to keep critical infrastructure, economies and society safe and secure,” Izrael added.</p>\n<p>Armis’s research reveals that Chinese and Russian actors mainly attacked manufacturing, educational services and public administration sectors. In the manufacturing sector, domains with .cn and .ru extensions accounted for approximately 30% of the average monthly attack attempts. Meanwhile, in the educational services sector, attacks originating from these domains have escalated to around 10% of the overall attacks.</p>\n<p>The report also delves into the challenges posed by legacy technology. For example, Armis found that older Windows server OS versions (2012 and earlier) are 77% more likely to experience attack attempts compared to newer versions.</p>\n<p>“Blueprints like this report are invaluable as they help teams focus limited resources on efforts with the greatest impact and with the insights to tell data-driven stories in justification of cross-team priorities,” said Curtis Simpson, CISO of Armis. “Using hindsight and analyzed data could allow CISOs to focus 2024 efforts on segmenting legacy technology, prioritizing exposures of greatest significance, and utilizing AI-driven technologies that can assist security teams with defending and managing the attack surface in real-time.”</p>\n"}},{"title":"Cybersecurity Alliance: UK and Japan Join Forces","link":"https://www.safetydetectives.com/news/cybersecurity-alliance-uk-and-japan-join-forces/","dc:creator":{"#cdata-section":"Penka Hristovska"},"pubDate":"Wed, 24 Jan 2024 17:14:06 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173132"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Downing-street-300x201.jpg\" alt=\"\"></p>The UK and Japan have signed a memorandum of cooperation (MOC), solidifying their commitment to improving cybersecurity together. Both countries formally agreed to strengthen their cooperation between government and private companies in cybersecurity during Japan’s Keidanren Cyber Security Committee’s visit to the UK. The committee traveled to the UK for the 3-day event hosted by [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Downing-street-300x201.jpg\" alt=\"\"></p><p>The UK and Japan have signed a memorandum of cooperation (MOC), solidifying their commitment to improving cybersecurity together.</p>\n<p>Both countries formally agreed to strengthen their cooperation between government and private companies in cybersecurity during Japan’s Keidanren Cyber Security Committee’s visit to the UK.</p>\n<p>The committee traveled to the UK for the 3-day event hosted by the National Cyber Advisory Board (NCAB). This event, co-chaired by Deputy Prime Minister Oliver Dowden and Chief Information Officer at Lloyds Banking Group Sharon Barber, was established in 2022 to bring experts from both the academic and business worlds together. The group&#8217;s goal is to bring different ideas and use resources from all areas of the cyber field to help carry out the National Cyber Strategy.</p>\n<p>“Cyber is the new frontier. To ensure we remain at the forefront of cyber strategy, we must continue to work with democratic partners who share our values,” said Deputy Prime Minister Oliver Dowden, who signed the memorandum on behalf of the UK.</p>\n<p>“Japan is an important friend and ally, sharing our beliefs on areas such as rule of law, climate change and human rights. This latest partnership further strengthens our relationship with Japan following the signing of the Hiroshima Accord and promotes collaboration across the public and private sector, strengthening our economy and demonstrating the UK Government’s commitment to making long-term decisions to secure our future,” he added.</p>\n<p>During the event, representatives from Japan met with key figures from the government and industry, including top officials from IBM. They discussed a variety of topics, including making digital supply chains more secure, getting businesses involved in cyber resilience, and using the best methods for hiring to improve cyber skills in both countries.</p>\n<p>“Based on this MoC, Keidanren is determined to further deepen and broaden bilateral cooperation between our public and private sectors. From the perspective of co-creating a data-driven society, we hope to continue to discuss safe and secure use of digital technologies including AI,” said Dr. Nobuhiro Endo, who signed on behalf of Japan.</p>\n<p>“Close collaboration between government and industry is at the heart of NCAB. The Memorandum of Cooperation between the UK and Japan is a significant further step on our journey and one which will help both nations further mature their private-public partnerships on cyber, and ultimately support the delivery of each nation’s cyber security strategy,” co-chair of NCAB, Sharon Barber commented.</p>\n"}},{"title":"26 Billion Records Leaked In ‘Mother Of All Breaches’","link":"https://www.safetydetectives.com/news/26-billion-records-leaked-in-mother-of-all-breaches/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Wed, 24 Jan 2024 17:07:59 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173130"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2021/11/Cybersecurity-Agencies-Warn-of-Iranian-Hackers-Targeting-Crucial-U.S.-Sectors-300x199.png\" alt=\"\"></p>The largest data breach of all time just happened right under everyone’s noses. Over 26 billion records were found by researchers on an unsecured page in what’s being called the “Mother of All Breaches” (MOAB). The 12+ terabytes of data were from extremely popular social media websites, like Lindin, Dropbox, and Twitter before it changed [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2021/11/Cybersecurity-Agencies-Warn-of-Iranian-Hackers-Targeting-Crucial-U.S.-Sectors-300x199.png\" alt=\"\"></p><p>The largest data breach of all time just happened right under everyone’s noses. Over 26 billion records were found by researchers on an unsecured page in what’s being called the “Mother of All Breaches” (MOAB).</p>\n<p>The 12+ terabytes of data were from extremely popular social media websites, like Lindin, Dropbox, and Twitter before it changed its name to X. Tencent was hit the worst, with over 1.5 billion records found. The data was a combination of login credentials and sensitive information given to the website in confidence.</p>\n<p>“The dataset is extremely dangerous as threat actors could leverage the aggregated data for a wide range of attacks,” explain researchers from Cybernews.</p>\n<p>It was stored in an extremely insecure location.</p>\n<p>However, while the story sounds very dramatic, it’s far from being as catastrophic as it seems. None of the data that researchers found was new, rather it appeared to be a massive compilation of previously leaked data from a variety of data breaches.</p>\n<p>This means that the culprit behind the website (most likely) wasn’t the one collecting the data.</p>\n<p>While that is a great silver lining for the average user, it doesn’t mean you shouldn’t take it seriously. Anyone could have obtained any of the sensitive data you stored on those websites over the last few years. Login credentials, personal information, and even financial information were found.</p>\n<p>Due to the amount of data found on the website, it’s highly likely some of yours was included. You can use websites like Haveibeenpwned to run a quick check if your information has been breached.</p>\n<p>Take my advice and frequently change your passwords and remember that no website is completely safe from harm. The threat actor behind this is currently unknown, but researchers suspect the culprit is likely someone who works with a large amount of data.</p>\n"}},{"title":"Russian Intelligence Agency Hacks Microsoft","link":"https://www.safetydetectives.com/news/russian-intelligence-agency-hacks-microsoft/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Wed, 24 Jan 2024 17:04:48 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=173125"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Microsoft-300x199.jpg\" alt=\"\"></p>Microsoft, the massive tech company behind Windows, faced a cyberattack from a Russian intelligence agency. The attackers go by the name Nobelium, and this isn’t the first time they’ve attacked. They were responsible for the attack on SolarWinds, a global supply chain network. The attack had rippling ramifications that are still being worked through. Microsoft [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Microsoft-300x199.jpg\" alt=\"\"></p><p>Microsoft, the massive tech company behind Windows, faced a cyberattack from a Russian intelligence agency.</p>\n<p>The attackers go by the name Nobelium, and this isn’t the first time they’ve attacked. They were responsible for the attack on SolarWinds, a global supply chain network. The attack had rippling ramifications that are still being worked through. Microsoft was also affected by the breach.</p>\n<p>The group was also implicated in the 2016 breach of the Democratic National Committee (DNC). This attack launched a multi-year-long investigation proving its legitimacy.</p>\n<p>Microsoft explained the situation in a regulatory filing that the attacks were launched the attack in early January.</p>\n<p>“On January 12, 2024, Microsoft detected that beginning in late November 2023, a nation-state associated threat actor had gained access to and exfiltrated information from a very small percentage of employee email accounts,” the filing stated.</p>\n<p>Information was also obtained from senior leadership and employees in the cybersecurity department. It’s unknown how sensitive the stolen information was. The Cybersecurity and Infrastructure Security Agency (CISA) immediately became involved, an investigation is currently underway.</p>\n<p>“(We are) closely coordinating with Microsoft to gain additional insights into this incident and understand impacts so we can help protect other potential victims,” CISA said.</p>\n<p>According to the filing, Microsoft was able to restrict the attacker&#8217;s access on Jan. 13, a full day later. It’s currently unknown exactly how much data was exfiltrated or what the nature of the data was.</p>\n<p>“The Company (Microsoft) has not yet determined whether the incident is reasonably likely to materially impact the Company’s financial condition or results of operations,” CISA said.</p>\n<p>Critics of Microsoft have pointed out that Microsoft&#8217;s not yet including basic security features like 2FA has put it and its user&#8217;s security in jeopardy.</p>\n<p>“The U.S. government needs to reevaluate its dependence on Microsoft,” explains Sen. Ron Wyden (Oregon).</p>\n"}},{"title":"New Deep Fake Technology Used For Crypto Scams","link":"https://www.safetydetectives.com/news/new-deep-fake-technology-used-for-crypto-scams/","dc:creator":{"#cdata-section":"Tyler Cross"},"pubDate":"Fri, 19 Jan 2024 17:37:52 +0000","guid":{"@isPermaLink":"false","#text":"https://www.safetydetectives.com/?post_type=news&p=172025"},"description":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Deepfake-Detection-300x168.jpg\" alt=\"\"></p>A new report from researchers with Bitdefender labs sheds light on the methods hackers are using to stream-jack high-profile YouTube personalities, which has been steadily increasing over the last few years. For years, scammers have used various social engineering tactics to obtain YouTube access tokens for any influencer on the platform with a large following. Once [&#8230;]"},"content:encoded":{"#cdata-section":"<p><img src=\"https://www.safetydetectives.com/wp-content/uploads/2024/01/Deepfake-Detection-300x168.jpg\" alt=\"\"></p><p>A new report from researchers with <a href=\"https://www.safetydetectives.com/best-antivirus/bitdefender/\" target=\"_blank\">Bitdefender</a> labs sheds light on the methods hackers are using to stream-jack high-profile YouTube personalities, which has been steadily increasing over the last few years.</p>\n<p>For years, scammers have used various social engineering tactics to obtain YouTube access tokens for any influencer on the platform with a large following. Once they get access to the account, they can easily change all of the original creator&#8217;s videos, plus change their profile name, profile picture, and banner.</p>\n<p>The scammers will quickly reorganize the YouTuber’s channel to mimic a legitimate organization, usually cryptocurrency news platforms or crypto exchanges. They can then take advantage of their newfound audience to push crypto scams on unsuspecting viewers.</p>\n<p>They’ll decorate their videos with all sorts of gimmicks, from advertising get-rich-quick schemes to encouraging users to visit fraudulent (and often dangerous) websites. Bitdefender’s researchers uncovered a scam that used deep-fake technology powered by AI to create a loop of the former CEO of MicroStartegy US (a legitimate company) telling users that they should participate by scanning a QR code.</p>\n<p>“The phony websites are usually hosted on domains that resemble the name of the impersonated company or its former CEO, or simpler domains that include the symbols of the cryptocurrencies used in the fake giveaways,” Bitdefender said in a blog post.</p>\n<p>Another major example they illustrate was the takeover of the official SpaceX YouTube account — SpaceX’s social media accounts were hacked earlier this week. The hackers were able to completely redesign the channel within minutes to begin pushing a crypto scheme.</p>\n<p>Theft incurred from cryptocurrency schemes totaled more than $24 billion in 2023.</p>\n<p>If you ever find yourself trading cryptocurrency, go to extreme lengths to verify the legitimacy of any exchange or wallet you install. Never listen to a social media account attempt to sell you crypto, whether it’s a charming celebrity pitching Bitcoin, or a suspicious YouTube account attempting to sell you a get-rich-quick scheme.</p>\n"}}]}}}