{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","@xmlns:georss":"http://www.georss.org/georss","@xmlns:geo":"http://www.w3.org/2003/01/geo/wgs84_pos#","channel":{"title":"MIT Technology Review","atom:link":{"@href":"https://www.technologyreview.com/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://www.technologyreview.com","description":"","lastBuildDate":"Fri, 26 Jan 2024 19:42:24 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.4.2","image":{"url":"https://wp.technologyreview.com/wp-content/uploads/2020/01/20130408-ftweekendmag-mit-0030-final-w0-1.jpg?w=32?crop=0px,33px,1272px,716px&w=32px","title":"MIT Technology Review","link":"https://www.technologyreview.com","width":"32","height":"32"},"item":[{"title":"People are worried that AI will take everyone’s jobs. We’ve been here before.","link":"https://www.technologyreview.com/2024/01/27/1087041/technological-unemployment-elon-musk-jobs-ai/","dc:creator":{"#cdata-section":"David Rotman"},"pubDate":"Sat, 27 Jan 2024 12:00:00 +0000","category":[{"#cdata-section":"Business"},{"#cdata-section":"125th anniversary"},{"#cdata-section":"App"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1087041"},"description":{"#cdata-section":"MIT Technology Review is celebrating our 125th anniversary with an online series that draws lessons for the future from our past coverage of technology.&#160; It was 1938, and the pain of the Great Depression was still very real. Unemployment in the US was around 20%. Everyone was worried about jobs. In 1930, the prominent British&#8230;"},"content:encoded":{"#cdata-section":"\n<p>MIT Technology Review<em> is celebrating our 125th anniversary with an online series that draws lessons for the future from our past coverage of technology.&nbsp;</em></p>\n\n\n\n<p>It was 1938, and the pain of the Great Depression was still very real. Unemployment in the US was around 20%. Everyone was worried about jobs.</p>\n\n\n\n<p>In 1930, the prominent British economist John Maynard Keynes had warned that we were “being afflicted with a new disease” called technological unemployment. Labor-saving advances, <a href=\"http://www.econ.yale.edu/smith/econ116a/keynes1.pdf\">he wrote</a>, were “outrunning the pace at which we can find new uses for labour.” There seemed to be examples everywhere. New machinery was transforming factories and farms. Mechanical switching being adopted by the nation’s telephone network was <a href=\"https://www.nber.org/papers/w28061\">wiping out the need for local phone operators</a>, one of the most common jobs for young American women in the early 20th century.</p>\n\n\n\n<p>Were the impressive technological achievements that were making life easier for many also destroying jobs and wreaking havoc on the economy? To make sense of it all, <a href=\"https://libraries.mit.edu/mithistory/institute/offices/office-of-the-mit-president/karl-taylor-compton-1887-1954/\">Karl T. Compton</a>, the president of MIT from 1930 to 1948 and one of the leading scientists of the day, wrote <a href=\"https://wp.technologyreview.com/wp-content/uploads/2012/10/MIT-Technology-Review-1938-12.pdf?_ga=2.227431261.1778831993.1704711674-471444333.1704465818\">in the December 1938 issue of this publication</a> about the “Bogey of Technological Unemployment.”</p>\n\n\n\n<p>How, began Compton, should we think about the debate over technological unemployment—“the loss of work due to obsolescence of an industry or use of machines to replace workmen or increase their per capita production”? He then posed this question: “Are machines the genii which spring from Aladdin’s Lamp of Science to supply every need and desire of man, or are they Frankenstein monsters which will destroy man who created them?” Compton signaled that he’d take a more grounded view: “I shall only try to summarize the situation as I see it.”&nbsp;&nbsp;</p>\n\n\n\n<p>His essay concisely framed the debate over jobs and technical progress in a way that remains relevant, especially given today’s fears over the impact of artificial intelligence. Impressive recent breakthroughs in generative AI, smart robots, and driverless cars are again leading many to worry that advanced technologies will replace human workers and decrease the overall demand for labor. Some leading Silicon Valley techno-optimists even postulate that we’re headed toward a jobless future where everything can be done by AI.&nbsp;</p>\n\n\n\n<p>While today’s technologies certainly look very different from those of the 1930s, Compton’s article is a worthwhile reminder that worries over the future of jobs are not new and are best addressed by applying an understanding of economics, rather than conjuring up genies and monsters.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Uneven impacts</h3>\n\n\n\n<p>Compton drew a sharp distinction between the consequences of technological progress on “industry as a whole” and the effects, often painful, on individuals.&nbsp;</p>\n\n\n\n<p>For “industry as a whole,” he concluded, “technological unemployment is a myth.” That’s because, he argued, technology &#8220;has created so many new industries” and has expanded the market for many items by “lowering the cost of production to make a price within reach of large masses of purchasers.” In short, technological advances had created more jobs overall. The argument—and the question of whether it is still true—remains pertinent in the age of AI.</p>\n\n\n\n<p>Then Compton abruptly switched perspectives, acknowledging that for some workers and communities, “technological unemployment may be a very serious social problem, as in a town whose mill has had to shut down, or in a craft which has been superseded by a new art.”</p>\n\n\n\n<figure class=\"wp-block-pullquote alignleft\"><blockquote><p>Even those who agreed that jobs will come back in “the long run” were concerned that “displaced wage-earners must eat and care for their families ‘in the short run.’”</p></blockquote></figure>\n\n\n\n<p>This analysis reconciled the reality all around—millions without jobs—with the promise of progress and the benefits of innovation. Compton, a physicist, was the first chair of a scientific advisory board formed by Franklin D. Roosevelt, and he began his 1938 essay with a quote from the board’s 1935 report to the president: “That our national health, prosperity and pleasure largely depend upon science for their maintenance and their future improvement, no informed person would deny.”&nbsp;</p>\n\n\n\n<p>Compton’s assertion that technical progress had produced a net gain in employment wasn’t without controversy. According to <a href=\"https://timesmachine.nytimes.com/timesmachine/1940/02/25/109344698.pdf?pdf_redirect=true&amp;ip=0\">a <em>New York Times</em> article written in 1940 by Louis Stark</a>, a leading labor journalist, Compton “clashed” with Roosevelt after the president told Congress, “We have not yet found a way to employ the surplus of our labor which the efficiency of our industrial processes has created.”</p>\n\n\n\n<p>As Stark explained, the issue was whether “technological progress, by increasing the efficiency of our industrial processes, take[s] jobs away faster than it creates them.” Stark reported recently gathered data on the strong productivity gains from new machines and production processes in various sectors, including the cigar, rubber, and textile industries. In theory, as Compton argued, that meant more goods at a lower price, and—again in theory—more demand for these cheaper products, leading to more jobs. But as Stark explained, the worry was: How quickly would the increased productivity lead to those lower prices and greater demand?&nbsp;&nbsp;</p>\n\n\n\n<p>As Stark put it, even those who agreed that jobs will come back in “the long run” were concerned that “displaced wage-earners must eat and care for their families ‘in the short run.’”</p>\n\n\n\n<p>World War II soon meant there was no shortage of employment opportunities. But the job worries continued. In fact, while it has waxed and waned over the decades depending on the health of the economy, anxiety over technological unemployment has never gone away.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Automation and AI</h3>\n\n\n\n<p>Lessons for our current AI era can be drawn not just from the 1930s but also from the early 1960s. Unemployment was high. Some leading thinkers of the time claimed that automation and rapid productivity growth would outpace the demand for labor. In 1962, <em>MIT Technology Review</em> sought to debunk the panic with an essay by Robert Solow, an MIT economist who received the 1987 Nobel Prize for explaining the role of technology in economic growth and who died late last year at the age of 99.&nbsp;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-large\"><img fetchpriority=\"high\" decoding=\"async\" width=\"1588\" height=\"1454\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/MIT-Technology-Review-1962-Solow.jpg?w=1588\" alt=\"1962 cartoon of Robert Solow walking past three scarecrows and whistling nonchalantly\" class=\"wp-image-1086668\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/MIT-Technology-Review-1962-Solow.jpg 1588w, https://wp.technologyreview.com/wp-content/uploads/2024/01/MIT-Technology-Review-1962-Solow.jpg?resize=300,275 300w, https://wp.technologyreview.com/wp-content/uploads/2024/01/MIT-Technology-Review-1962-Solow.jpg?resize=768,703 768w, https://wp.technologyreview.com/wp-content/uploads/2024/01/MIT-Technology-Review-1962-Solow.jpg?resize=1536,1406 1536w\" sizes=\"(max-width: 1588px) 100vw, 1588px\" /><figcaption class=\"wp-element-caption\">Robert Solow&#8217;s 1962 essay was illustrated by a cartoon of a Solow-looking character whistling past a trio of straw men (presumably jobless ones).</figcaption></figure></div>\n\n\n<p>In his piece, titled <a href=\"https://wp.technologyreview.com/wp-content/uploads/2012/10/MIT-Technology-Review-1962-07-2.pdf?_ga=2.162495484.1778831993.1704711674-471444333.1704465818\">“Problems That Don’t Worry Me,”</a> Solow scoffed at the idea that automation was leading to mass unemployment. Productivity growth between 1947 and 1960, he noted, had been around 3% a year. “That’s nothing to be sneezed at, but neither does it amount to a revolution,” he wrote. No great productivity boom meant there was no evidence of a second Industrial Revolution that &#8220;threatens catastrophic unemployment.” But, like Compton, Solow also acknowledged a different type of problem with the rapid technological changes: “certain specific kinds of labor … may become obsolete and command a suddenly lower price in the market … and the human cost can be very great.”</p>\n\n\n\n<p>These days, the panic is over artificial intelligence and other advanced digital technologies. Like the 1930s and the early 1960s, the early 2010s were a time of high unemployment, in this case because the economy was struggling to recover from the 2007–’09 financial crisis. It was also a time of impressive new technologies. Smartphones were suddenly everywhere. Social media was taking off. There were glimpses of driverless cars and breakthroughs in AI. Could those advances be related to the lackluster demand for labor? Could they portend a jobless future?</p>\n\n\n\n<p>Again, the debate played out in the pages of <em>MIT Technology Review</em>. In a story I wrote titled “<a href=\"https://www.technologyreview.com/2013/06/12/178008/how-technology-is-destroying-jobs/\">How Technology Is Destroying Jobs</a>,” economist Erik Brynjolfsson and his colleague Andrew McAfee argued that technological change was eliminating jobs faster than it was creating them. This wasn’t just about a mill shutting down. Rather, advanced digital technologies were leading to job losses across a broad swath of the economy, raising the specter once again of technological unemployment.</p>\n\n\n\n<figure class=\"wp-block-pullquote alignright\"><blockquote><p>Like the 1930s and the early 1960s, the early 2010s were a time of high unemployment.</p></blockquote></figure>\n\n\n\n<p>It’s difficult to pinpoint a single cause for something as complex as a dip in total employment—it could be just a result of sluggish economic growth. But it was becoming increasingly obvious, both in the data and in everyday observations, that new technologies were changing the types of jobs in demand—and while that was nothing new, the scope of the transition was troubling, and so was the speed at which it was happening. Industrial robots had killed off<a href=\"https://mitsloan.mit.edu/ideas-made-to-matter/a-new-study-measures-actual-impact-robots-jobs-its-significant\"> many well-paying manufacturing jobs</a> in places like the Rust Belt, and now AI and other digital technologies were coming after clerical and office jobs—and even, it was feared, truck driving.</p>\n\n\n\n<p>In his farewell speech before leaving office in January 2017, President Barack Obama spoke about “the relentless pace of automation that makes a lot of good middle-class jobs obsolete.” By that time, it was clear that Compton’s optimism needed to be rethought. Technical progress was not turning out to lead to inevitable job growth, and the pain was not limited to a <a href=\"https://www.technologyreview.com/2017/02/13/153772/the-relentless-pace-of-automation/\">few specific locations and industries.</a></p>\n\n\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Why Musk is wrong</strong></h3>\n\n\n\n<p>In <a href=\"https://www.youtube.com/watch?v=R2meHtrO1n8\">an interview late last year</a> with the UK prime minister, Rishi Sunak, Elon Musk declared there will come a time when “no job is needed,” thanks to an AI “magic genie that can do everything you want.” Musk added that as a result, “we won’t have universal basic income, we’ll have universal high income”—apparently answering Compton’s rhetorical question about whether machines will be “the genii which … supply every need and desire of man.”&nbsp;</p>\n\n\n\n<p>It might not be possible to <em>prove</em> Musk wrong, since he gave no timeline for his utopian prediction; in any case, how do you argue against the power of a magical genie? But the end-of-work meme is a distraction as we figure out the best way to use AI to expand the economy and create new jobs.</p>\n\n\n\n<p>Breakthroughs in generative AI, such as ChatGPT and other large language models, will likely <a href=\"https://www.technologyreview.com/2023/03/25/1070275/chatgpt-revolutionize-economy-decide-what-looks-like/\">transform the economy and labor markets</a>. But there’s no convincing evidence that we’re on a path to a jobless future. To paraphrase Solow, we should worry about that when there’s a problem to worry about.</p>\n\n\n\n<p>Even a <a href=\"https://www.goldmansachs.com/intelligence/pages/generative-ai-could-raise-global-gdp-by-7-percent.html\">bullish estimate about the effects of generative AI by Goldman Sachs</a> puts its impact on productivity growth at around 1.5% a year over the next 10 years. That, as Solow might say, is nothing to sneeze at, but it’s not going to end the need for workers. The Goldman Sachs report calculated that roughly two-thirds of US jobs are “exposed to some degree of automation by AI.” Yet this conclusion is often misinterpreted—it doesn’t mean all those jobs will be replaced. Rather, as the Goldman Sachs report notes, most of these positions are “only partially exposed to automation.” For many of these workers, AI will become part of the workday and won’t necessarily lead to layoffs.</p>\n\n\n\n<figure class=\"wp-block-pullquote alignright\"><blockquote><p>The end-of-work meme is a distraction as we figure out the best way to use AI to expand the economy and create new jobs.</p></blockquote></figure>\n\n\n\n<p>One critical wild card is how many new jobs will be created by AI even as existing ones disappear. Estimating such job creation is notoriously difficult. But MIT’s David Autor and his collaborators recently calculated that <a href=\"https://www.nber.org/papers/w30389\">60% of employment in 2018 was in types of jobs that didn’t exist before 1940</a>. One reason innovation has created so many new jobs is that it has increased the productivity of workers, augmenting their capabilities and expanding their potential to do new tasks. The bad news: this job creation is countered by the labor-destroying impact of automation when it’s used to simply replace workers. As Autor and his coauthors conclude, one of the key questions now is whether “automation is <em>acceleratin</em>g relative to augmentation, as many researchers and policymakers fear.”</p>\n\n\n\n\n\n<p>In recent decades, companies have often used AI and advanced automation to slash jobs and cut costs. There’s no economic rule that innovation will in fact favor augmentation and job creation over this type of automation. But we have a choice going forward: we can use technology to simply replace workers, or we can use it to expand their skills and capabilities, leading to economic growth and new jobs.</p>\n\n\n\n<p>One of the lasting strengths of Compton’s 1938 essay was his argument that companies needed to take responsibility for limiting the pain of any technological transition. His suggestions included “coöperation between industries of a community to synchronize layoffs in one company with new employment in another.” That might sound outdated in today’s global economy. But the underlying sentiment remains relevant: “The fundamental criterion for good management in this matter, as in every other, is that the predominant motive must not be quick profits but best ultimate service of the public.”</p>\n\n\n\n<p>At a time when AI companies are gaining unprecedented power and wealth, they also need to take greater responsibility for how the technology is affecting workers. Conjuring up a magical genie to explain an inevitable jobless future doesn’t cut it. We can choose how AI will define the future of work. </p>\n"}},{"title":"The Download: testing wastewater for measles, and the cost of nature","link":"https://www.technologyreview.com/2024/01/26/1087258/the-download-testing-wastewater-for-measles-and-the-cost-of-nature/","dc:creator":{"#cdata-section":"Rhiannon Williams"},"pubDate":"Fri, 26 Jan 2024 13:10:00 +0000","category":{"#cdata-section":"The Download"},"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1087258"},"description":{"#cdata-section":"This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. How wastewater could offer an early warning system for measles Measles is back with a vengeance. In the UK, where only 85% of school-age children have received two doses of the MMR vaccine,&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This is today&#8217;s edition of <a href=\"https://forms.technologyreview.com/newsletters/briefing-the-download/?_ga=2.179569122.736533416.1649661040-405833893.1649413289\">The Download</a></em>,<em> our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology</em>.</p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How wastewater could offer an early warning system for measles</strong></p>\n\n\n\n<p>Measles is back with a vengeance. In the UK, where only 85% of school-age children have received two doses of the MMR vaccine, as many as 300 people have contracted the disease since October. And cases are creeping up across the US too.<br><br>Catching measles outbreaks early is tricky, though. Like many other respiratory viruses, it starts off with a cough, runny nose, fever, and achy body. The telltale rash doesn’t appear for two to four more days. By then, a person is already infectious. Very infectious, in fact. Measles is one of the most contagious diseases around.</p>\n\n\n\n<p>Maybe there’s a solution. The US developed a vast wastewater sampling network to detect covid during the pandemic. Could we leverage that network to provide an early warning system for measles? <a href=\"https://www.technologyreview.com/2024/01/26/1087215/how-wastewater-could-offer-an-early-warning-system-for-measles/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Cassandra Willyard</em></p>\n\n\n\n<p><strong>This story is from The Checkup, our weekly biotech and health newsletter. </strong><a href=\"https://forms.technologyreview.com/newsletters/biotech-the-checkup/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>Sign up</strong></a><strong> to receive it in your inbox every Thursday.</strong></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Meet the economist who wants the field to account for nature</strong></p>\n\n\n\n<p>What is the true value of a honeybee? A mountain stream? A mangrove tree?</p>\n\n\n\n<p>Gretchen Daily, cofounder and faculty director of the Stanford Natural Capital Project, has dedicated her career to answering such complex questions. Daily and her team help governments, international banks, and NGOs to not only quantify the value of nature, but also determine the benefits of conservation and ecosystem restoration.</p>\n\n\n\n<p>This marriage of ecological and economic concerns may seem an unusual one to some. But to Daily, it’s a union as natural as the planet’s ecosystems themselves.<strong> </strong><a href=\"https://www.technologyreview.com/2023/12/26/1084603/gretchen-daily-economist-environment-accounting/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Kathryn Miles</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The must-reads</strong></p>\n\n\n\n<p><em>I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.</em></p>\n\n\n\n<p><strong>1 Social media is overrun with explicit AI deepfakes of Taylor Swift<br></strong>Her army of fans quickly mobilized to bury the images, which appear to have originated from a single Telegram account. (<a href=\"https://www.404media.co/ai-generated-taylor-swift-porn-twitter/\">404 Media</a>)<br>+ <em>X has suspended numerous accounts, but the images are still circulating. </em>(<a href=\"https://www.wsj.com/tech/taylor-swifts-fans-swarm-x-to-combat-ai-fakes-of-singer-cf928031?mod=tech_lead_pos2\">WSJ</a> $)<br>+ <em>We can’t say we didn’t see this coming</em>. (<a href=\"https://www.vice.com/en/article/qjvajd/taylor-swift-is-living-every-womans-ai-porn-nightmare\">Motherboard</a>)<br>+ <em>A high school’s deepfake porn scandal is pushing US lawmakers into action. </em>(<a href=\"https://www.technologyreview.com/2023/12/01/1084164/deepfake-porn-scandal-pushing-us-lawmakers/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>2 Apple is reluctantly revamping its App Store in Europe</strong><br>Customers will be able to download apps from rival App Stores from March. (<a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-alternative-app-marketplaces-eu/\">MacRumors</a>)<br>+ <em>Obviously, Apple isn’t thrilled about the situation. </em>(<a href=\"https://www.ft.com/content/a0672ed0-7b3d-4957-ab46-c2003edc923b\">FT</a> $)</p>\n\n\n\n<p><strong>3 Cruise is being investigated by US regulators<br></strong>The autonomous car company is being probed over its handling of an incident involving a pedestrian last October. (<a href=\"https://www.washingtonpost.com/technology/2024/01/25/cruise-investigation-doj-sec/\">WP</a> $)<br>+ <em>US competition regulators are also looking at AI partnerships. </em>(<a href=\"https://www.ft.com/content/6046292f-1c6d-499b-8ed5-7e7c337c5bbd\">FT</a> $)<br>+ <em>What’s next for robotaxis in 2024. </em>(<a href=\"https://www.technologyreview.com/2024/01/23/1086936/whats-next-for-robotaxis-2024/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>4</strong> <strong>The first mission to study gravitational waves from space has been green-lit</strong><br>Work on the European Space Agency project will kick off next January. (<a href=\"https://arstechnica.com/space/2024/01/esa-approves-a-search-for-the-gravitational-echoes-of-the-big-bang/\">Ars Technica</a>)</p>\n\n\n\n<p><strong>5 Britain is keen to build cheaper nuclear power plants<br></strong>Whether it’ll actually happen or not is anyone’s guess. (<a href=\"https://www.economist.com/britain/2024/01/24/britain-wants-to-make-nuclear-power-plants-cheaper-to-build\">Economist</a> $)<br>+ <em>The next generation of nuclear reactors is getting more advanced. Here’s how. </em>(<a href=\"https://www.technologyreview.com/2024/01/18/1086753/advanced-nuclear-power/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>6 Encoding AI rules in silicon could prevent disasters<br></strong>Assuming future algorithms will still be restricted by their hardware. (<a href=\"https://www.wired.com/story/fast-forward-ai-silicon-doomsday/\">Wired</a> $)<br>+ <em>Google Chrome’s AI writing assistant is launching next month. </em>(<a href=\"https://nymag.com/intelligencer/2024/01/new-ai-powered-google-chrome-browser-end-of-human-internet.html\">NY Mag</a> $)</p>\n\n\n\n<p><strong>7 The US Presidential race could rest on memes<br></strong>Funny clips and pictures are primary news sources for millions of people. (<a href=\"https://www.newyorker.com/news/annals-of-communications/the-meme-ification-of-american-politics\">New Yorker</a> $)</p>\n\n\n\n<p><strong>8 How one scientist sparked the weight-loss drug frenzy<br></strong>Richard DiMarchi spotted a gut hormone’s potential three decades ago—but his employer didn’t want to know. (<a href=\"https://www.bloomberg.com/news/features/2024-01-26/zepbound-how-eli-lilly-s-lucky-break-fueled-a-600b-weight-loss-empire?srnd=businessweek-v2&amp;sref=E9Urfma4\">Bloomberg</a> $)<br>+ <em>Weight-loss drugs are one of our 10 Breakthrough Technologies of 2024. </em>(<a href=\"https://www.technologyreview.com/2024/01/08/1085116/weight-loss-drugs-ozempic-wegovy-mounjaro-eli-lilly-novo-nordisk-breakthrough-technologies/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>9 Don’t even talk to me if you won’t peel me an orange <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f34a.png\" alt=\"🍊\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></strong><br>TikTok’s latest love litmus test is typically bonkers. (<a href=\"https://www.vox.com/culture/2024/1/25/24048474/orange-peel-theory-tiktok-relationship-test-explained\">Vox</a>)<br>+ <em>Letting a chatbot screen your dating matches is not a good idea. </em>(<a href=\"https://www.wired.com/story/volar-dating-app-chatbot-screen-matches/\">Wired</a> $)</p>\n\n\n\n<p><strong>10 How to take much, much better photos <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f4f1.png\" alt=\"📱\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></strong><br>Don’t be afraid to use that zoom! (<a href=\"https://www.theguardian.com/lifeandstyle/2024/jan/26/the-experts-photographers-on-20-easy-enjoyable-ways-to-vastly-improve-your-pictures\">The Guardian</a>)</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Quote of the day</strong></p>\n\n\n\n<p class=\"has-large-font-size\"><strong>“There’s no sound I don’t like.”&nbsp;</strong></p>\n\n\n\n<p>—Aissam Dam, an 11-year old boy from Morocco who was born deaf, describes hearing the world for the first time after a successful gene therapy trial to <a href=\"https://www.nytimes.com/2024/01/23/health/deaf-gene-therapy.html?partner=slack&amp;smid=sl-share\">the New York Times</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The big story</strong></p>\n\n\n\n<p><strong>How culture drives foul play on the internet, and how new “upcode” can protect us</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://www.technologyreview.com/2023/08/23/1077693/crypto-foul-play/?truid=*|LINKID|*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*|SUBCLASS|*&amp;utm_content=*|DATE:m-d-Y|*\"><img decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/3UB6ZfbMR6LgloQsmSjG_VqX8qDdx--ywk3VCUXYf5e3s20UQlUCVSJCzyJq3Hdm-AcOnIYYzxOM0stIrMHOdpdiYue9gTh5kEyTQ4pit1n8Yhy8PF7yHiATlSNoyEVSIj9jriaQRmtmqhOxg6H8_GQ\" alt=\"\"/></a></figure>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2023/08/23/1077693/crypto-foul-play/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"></a><strong>August 2023</strong><br><br>From Bored Apes and Fancy Bears, to Shiba Inu coins, self-­replicating viruses, and whales, the internet is crawling with fraud, hacks, and scams. </p>\n\n\n\n<p>And while new technologies come and go, they change little about the fact that online illegal operations exist because some people are willing to act illegally, and others fall for the stories they tell.&nbsp;</p>\n\n\n\n<p>Ultimately, online crime is a human story. But why does it work, and how can we protect ourselves from falling for such schemes? <a href=\"https://www.technologyreview.com/2023/08/23/1077693/crypto-foul-play/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Rebecca Ackermann</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>We can still have nice things</strong></p>\n\n\n\n<p><em>A place for comfort, fun and distraction in these weird times. (Got any ideas? </em><a href=\"mailto:rhiannon.williams@technologyreview.com\"><em>Drop me a line</em></a><em> or </em><a href=\"https://twitter.com/yannon_\"><em>tweet &#8217;em at me</em></a><em>.)</em></p>\n\n\n\n<p>+ Jet lag is the pits. Can any of <a href=\"https://www.afar.com/magazine/how-to-overcome-jet-lag\">these suggestions</a> make it less awful?<br>+ The most popular attraction at this British zoo? The <a href=\"https://www.npr.org/2024/01/25/1226911707/parrots-swear-profanities-british-zoo\">swearing parrots</a>, obviously. <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f99c.png\" alt=\"🦜\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /><br>+ This hypnotic <a href=\"https://www.instagram.com/p/CxAfBdkIVwE/\">background painting</a> is healing my soul.<br>+ Justice for the <a href=\"https://www.pastemagazine.com/drink/jell-o-shot/bring-back-the-jell-o-shot\">jell-o shot</a>!<br>+ It’s (almost) the weekend, which calls for these delicious-looking <a href=\"https://www.thekitchn.com/japanese-pancakes-266949\">fluffy pancakes</a>.</p>\n"}},{"title":"How wastewater could offer an early warning system for measles","link":"https://www.technologyreview.com/2024/01/26/1087215/how-wastewater-could-offer-an-early-warning-system-for-measles/","dc:creator":{"#cdata-section":"Cassandra Willyard"},"pubDate":"Fri, 26 Jan 2024 10:00:00 +0000","category":[{"#cdata-section":"Biotechnology and health"},{"#cdata-section":"App"},{"#cdata-section":"The Checkup"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1087215"},"description":{"#cdata-section":"Measles is back with a vengeance. In the UK, where only 85% of school-age children have received two doses of the MMR vaccine, as many as 300 people have contracted the disease since October. And in the US, an outbreak has infected nine people in Philadelphia since last month. One case has been reported in&#8230;"},"content:encoded":{"#cdata-section":"\n<p>Measles is back with a vengeance. In the UK, where only 85% of school-age children have received two doses of the MMR vaccine, as many as 300 people have contracted the disease since October. And in the US, an outbreak has infected nine people in Philadelphia since last month. One case has been reported in Atlanta, another in Delaware. An entire family of six is infected in Washington state.&nbsp;</p>\n\n\n\n<p>On January 23, the World Health Organization <a href=\"https://www.independent.co.uk/news/uk/vaccination-mmr-jenny-harries-world-health-organisation-hans-kluge-b2483222.html\">issued a warning</a>. “It is vital that all countries are prepared to rapidly detect and timely respond to measles outbreaks, which could endanger progress towards measles elimination,” said Hans Kluge, WHO regional director for Europe.&nbsp;</p>\n\n\n\n<p>Catching measles outbreaks early is tricky, though. Like many other respiratory viruses, it starts off with a cough, runny nose, fever, and achy body. The telltale rash doesn’t appear for two to four more days. By then, a person is already infectious. Very infectious, in fact. Measles is one of the most contagious diseases around.</p>\n\n\n\n\n\n<p>Maybe there’s a solution. The US developed a vast wastewater sampling network to detect covid during the pandemic. Could we leverage that network to provide an early warning system for measles?</p>\n\n\n\n<p>“I actually think you could make the argument that measles is even more important to [detect] than covid or influenza or any of the other pathogens that we’re looking for,” says Samuel Scarpino, an epidemiologist at Northeastern University in Boston.</p>\n\n\n\n<p>Wastewater surveillance relies on standard lab tests to find genetic evidence of pathogens in sewage—DNA or RNA. When people are infected with covid, they shed SARS-CoV-2 in their stools, so it’s easy to see why it would show up in wastewater. But even viruses that don’t get pooped out can show up in the sewers.&nbsp;</p>\n\n\n\n<p>Although measles is a respiratory virus, people shed it in their urine. They also brush their teeth and spit in the sink. They blow their noses and throw the tissue in the toilet. “We shed these viruses and we shed bacteria and fungi in so many ways that end up in the sewer,” says Marlene Wolfe, an environmental microbiologist and epidemiologist at Emory University and one of the directors of WastewaterSCAN, a program based at Stanford that monitors infectious diseases through municipal wastewater systems.&nbsp;</p>\n\n\n\n<p>The literature on wastewater detection of measles is scant, but encouraging. In <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5478994/\">one study</a>, a team of researchers in the Netherlands tested wastewater samples collected in 2013 during a measles outbreak in an orthodox Protestant community for evidence of the virus. They found measles RNA, and the positive samples matched the locations where cases had been reported. They even managed to confirm that the virus in one sample was genetically identical to the outbreak strain. But not every measles case showed up in the sewers. Some samples taken where cases had occurred didn’t harbor any measles RNA.&nbsp;</p>\n\n\n\n<p>In <a href=\"https://pubmed.ncbi.nlm.nih.gov/37201817/\">another study</a>, researchers from Nova Scotia developed a tool to screen wastewater for four pathogens simultaneously: RSV, influenza, covid, and measles. When they tested it in Nova Scotia, they didn’t get any positive hits for measles, which didn’t surprise them as no cases had been reported. But when they seeded the wastewater samples with a surrogate for measles, they were able to detect it at both high and low concentrations</p>\n\n\n\n<p>The real question, Wolfe says, is whether detecting measles in wastewater would have any public health value. Because measles is rarely asymptomatic and the rash is so distinctive, cases tend to get noticed. “Some of our other systems can work pretty well at identifying measles cases as they come up,” she says.</p>\n\n\n\n<p>Wolfe could see value in monitoring, she says, if people really shed high quantities of the virus before those signs are visible. “Then it really could provide an early warning,” she says. But that’s not known at the moment.&nbsp;</p>\n\n\n\n<p>What would a wastewater surveillance program for measles look like? “If we had the ability to target places where the vaccination coverage was lower, that would be a place to prioritize resources,” Scarpino says. “Airports and other ports of entry are going to be really important as well.” Earlier this month, someone infected with measles passed through both Dulles and Ronald Reagan airports just outside of Washington, DC. Finding measles RNA in airport sewage doesn’t necessarily mean a local outbreak might occur, but “it definitely means that the risk profile is there and we should be monitoring much more actively,” he says. </p>\n\n\n\n\n\n<p>While measles isn’t part of wastewater surveillance yet, plenty of other pathogens are. Health officials around the globe have been testing sewage for polio since the late 1980s. Because people who contract polio shed large amounts of the virus in their feces, and because so many people are asymptomatic, “it’s like a perfect use case in a lot of ways,” Wolfe says. But wastewater surveillance didn’t really become fashionable until 2020, when covid hit.&nbsp;</p>\n\n\n\n<p>The National Wastewater Surveillance System, which the Centers for Disease Control and Prevention (CDC) launched in 2020 to monitor covid, now also tests for mpox. WastewaterSCAN currently tests for 10 different pathogens, including covid, mpox, RSV, influenza, norovirus, and rotavirus. The team publishes that data on a dashboard on its website and shares it with the CDC. Wolfe and her colleagues also recently worked with Miami-Dade County in Florida to assess the feasibility of testing for dengue. Even though dengue is rare in Florida, the team <a href=\"https://pubs.acs.org/doi/10.1021/acs.estlett.3c00769\">picked up a signal in the wastewater</a>.&nbsp;</p>\n\n\n\n<p>In fact, wastewater surveillance works for most of the pathogens they’ve tried, Wolfe says: “The potential for leveraging this tool to effectively support measles surveillance is absolutely possible.”&nbsp;</p>\n\n\n\n<p><strong>Another thing</strong></p>\n\n\n\n<p>The complement system may be the most important immune defense you’ve never heard of. And now two teams of researchers say that <a href=\"https://www.technologyreview.com/2023/10/18/1081842/this-microbe-filled-pill-could-track-inflammation-in-the-gut/?utm_source=the_checkup&amp;utm_medium=email&amp;utm_campaign=the_checkup.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\">this microbe-fighting protein cascade</a> is abnormal in some people with long covid, pointing researchers toward new potential therapies.&nbsp;</p>\n\n\n\n<p><strong>Read more from MIT Technology Review’s archive</strong></p>\n\n\n\n<p>Wastewater with its wealth of microbes could help researchers track the evolution of antibiotic resistance in bacteria, Jessica Hamzelou <a href=\"https://www.technologyreview.com/2023/01/13/1066837/sewage-track-antibiotic-resistant-bacteria/?utm_source=the_checkup&amp;utm_medium=email&amp;utm_campaign=the_checkup.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\">wrote last year</a>.<strong>&nbsp;</strong></p>\n\n\n\n<p>Health officials used wastewater surveillance to track the spread of mpox in 2022 and helped scientists estimate how many people in California’s Bay Area might be affected, Hana Kiros <a href=\"https://www.technologyreview.com/2022/07/23/1056399/monkeypox-california-wastewater/?utm_source=the_checkup&amp;utm_medium=email&amp;utm_campaign=the_checkup.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\">reported</a>.&nbsp;</p>\n\n\n\n<p>Way back in 2021, Antonio Regalado <a href=\"https://www.technologyreview.com/2021/02/08/1017609/the-fast-spreading-coronavirus-variant-is-so-prevalent-its-turning-up-in-us-sewers/?utm_source=the_checkup&amp;utm_medium=email&amp;utm_campaign=the_checkup.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\">covered</a> some of the first efforts to track the spread of covid variants using wastewater. <strong>&nbsp;</strong></p>\n\n\n\n<p><strong>From around the web</strong></p>\n\n\n\n<p>The FDA slapped a black box warning on CAR-T cancer therapies, which rely on engineered T cells to fight the disease. The decision comes after the agency received 25 reports of new blood cancers in people who received these treatments. (<a href=\"https://www.nbcnews.com/health/cancer/fda-says-cancer-treatment-car-t-therapy-may-increase-risk-cancer-rcna135262\">NBC</a>)</p>\n\n\n\n<p>My latest for <em>Nature </em>is a deep dive into efforts to restore immune tolerance in people with autoimmune diseases. Researchers are finally having some success addressing the cause of these diseases and are even talking about (gasp!) the possibility of a cure. (<a href=\"https://www.nature.com/articles/d41586-024-00169-7\">Nature</a>)   </p>\n\n\n\n<p>An 11-year-old boy who was born deaf can now hear after receiving gene therapy as part of a clinical trial. “There’s no sound I don’t like,” he told the <em>New York Times</em>. “They’re all good.” (<a href=\"https://www.nytimes.com/2024/01/23/health/deaf-gene-therapy.html\">NYT</a>)</p>\n"}},{"title":"The Download: US mining tax credits, and Ring’s police data U-turn","link":"https://www.technologyreview.com/2024/01/25/1087165/the-download-us-mining-tax-credits-and-rings-police-data-u-turn/","dc:creator":{"#cdata-section":"Rhiannon Williams"},"pubDate":"Thu, 25 Jan 2024 13:10:00 +0000","category":{"#cdata-section":"The Download"},"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1087165"},"description":{"#cdata-section":"This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. How one mine could unlock billions in EV subsidies On a pine farm north of the tiny town of Tamarack, Minnesota, Talon Metals has uncovered one of America’s densest nickel deposits—and now it&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This is today&#8217;s edition of <a href=\"https://forms.technologyreview.com/newsletters/briefing-the-download/?_ga=2.179569122.736533416.1649661040-405833893.1649413289\">The Download</a></em>,<em> our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology</em>.</p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How one mine could unlock billions in EV subsidies</strong></p>\n\n\n\n<p>On a pine farm north of the tiny town of Tamarack, Minnesota, Talon Metals has uncovered one of America’s densest nickel deposits—and now it wants to begin tunneling deep into the rock to extract hundreds of thousands of metric tons of mineral-rich ore a year.<br><br>If regulators approve the mine, it could mark the starting point in what this mining exploration company claims would become the country’s first complete domestic nickel supply chain, running from the bedrock beneath the Minnesota earth to the batteries in electric vehicles across the nation.</p>\n\n\n\n<p>MIT Technology Review wanted to provide a clearer sense of the law’s on-the-ground impact by zeroing in on a single project and examining how these rich subsidies could be unlocked at each point along the supply chain. <a href=\"https://www.technologyreview.com/2024/01/25/1087027/climate-subsidies-inflation-reduction-act-mining-critical-minerals/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Take a look at what we found out</a>.</p>\n\n\n\n<p><em>—James Temple</em></p>\n\n\n\n<p><strong>This is the second story in a </strong><a href=\"https://www.technologyreview.com/2024/01/23/1086458/critical-minerals-nickel-inflation-reduction-act-environmental-dangers/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>two-part series</strong></a><strong> exploring the hopes and fears surrounding a single mining proposal in a tiny Minnesota town.<br><br>To read more about the importance of critical minerals to building a greener future, check out the </strong><a href=\"https://www.technologyreview.com/2024/01/25/1087086/nickel-mining-cleaner-future/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>latest edition</strong></a><strong> of The Spark, our weekly climate newsletter. </strong><a href=\"https://forms.technologyreview.com/newsletters/climate-energy-the-spark/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>Sign up</strong></a><strong> to receive it in your inbox every Wednesday.</strong></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The must-reads</strong></p>\n\n\n\n<p><em>I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.</em></p>\n\n\n\n<p><strong>1 Ring will stop the police from requesting doorbell footage from users</strong><br>Instead, forces will have to seek warrants to access video from next week. (<a href=\"https://www.bloomberg.com/news/articles/2024-01-24/amazon-s-ring-to-stop-letting-police-request-video-from-users?sref=E9Urfma4\">Bloomberg</a> $)<br>+ <em>It’s a huge U-turn on the company’s previous stance. </em>(<a href=\"https://www.wired.com/story/ring-police-rfa-tool-shut-down/\">Wired</a> $)<br>+ <em>Privacy groups are cautiously excited by the decision. </em>(<a href=\"https://www.theregister.com/2024/01/25/amazon_ring_sounds_death_knell/\">The Register</a>)<br>+ <em>Ring’s new TV show is a brilliant but ominous viral marketing ploy. </em>(<a href=\"https://www.technologyreview.com/2022/08/19/1058259/ring-nation-new-tv-show-viral-marketing/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>2 A spy tool has been tracking billions of phone profiles  </strong><br>Ads inside hundreds of thousands of apps tracked user behavior and location data. (<a href=\"https://www.404media.co/inside-global-phone-spy-tool-patternz-nuviad-real-time-bidding/\">404 Media</a>)<br>+ <em>Israeli spyware maker NSO Group is planning a global comeback. </em>(<a href=\"https://www.wired.com/story/nso-group-lobbying-israel-hamas-war/\">Wired</a> $)<br>+ <em>Inside NSO, Israel’s billion-dollar spyware giant. </em>(<a href=\"https://www.technologyreview.com/2020/08/19/1006458/nso-spyware-controversy-pegasus-human-rights/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>) </p>\n\n\n\n<p><strong>3 Researchers claim to have created a more accurate AI-text detection tool </strong><br>By analyzing how surprising its models find combinations of words. (<a href=\"https://www.businessinsider.com/ai-detection-tool-false-positives-student-writing-2024-1?r=US&amp;IR=T\">Insider</a> $)<br>+ <em>The problem is, AI-text detection tools are really easy to fool. </em>(<a href=\"https://www.technologyreview.com/2023/07/07/1075982/ai-text-detection-tools-are-really-easy-to-fool/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>4 Some doctors are advocating to rename certain cancers<br></strong>They claim it would benefit patients to reclassify some low-risk, slow-growing cancers. (<a href=\"https://www.wsj.com/health/wellness/prostate-cancer-low-risk-treatment-rename-185b6e3f?mod=wknd_pos1\">WSJ</a> $)<br>+ <em>The best way to prevent this deadly cancer is to remove multiple organs. And I’m about to do it. </em>(<a href=\"https://www.technologyreview.com/2023/12/11/1084853/ovarian-cancer-fallopian-tubes-menopause-genetic-testing/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>5 Blockchain technology is shedding light on early Earth<br></strong>Its simulation of chemical reactions models how life could have first formed. (<a href=\"https://spectrum.ieee.org/blockchain-computation-simulation\">IEEE Spectrum</a>)<br>+ <em>This mathematician is making sense of nature’s complexity. </em>(<a href=\"https://www.technologyreview.com/2023/10/13/1081426/gabor-domokos-mathematician-geometry-physical-world/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)&nbsp;</p>\n\n\n\n<p><strong>6 Making face-worn computers cool is an uphill challenge<br></strong>Apple is the latest in a long line of companies to try their luck. (<a href=\"https://www.nytimes.com/2024/01/24/technology/personaltech/apple-vr-smart-goggles.html\">NYT</a> $)<br>+ <em>Apple doesn’t exactly have a strong track record of playing nice with others. </em>(<a href=\"https://nymag.com/intelligencer/2024/01/the-vision-pros-biggest-problem-is-apple.html\">NY Mag</a> $)<br>+ <em>These minuscule pixels are poised to take augmented reality by storm. </em>(<a href=\"https://www.technologyreview.com/2023/12/20/1084518/micro-leds-micro-oleds-augmented-reality-ar/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>7 Your heart contains taste buds<br></strong>The nutrient sensors could help us to understand more about obesity. (<a href=\"https://www.newscientist.com/article/mg26134751-400-why-do-we-have-taste-buds-in-our-heart-and-testicles/\">New Scientist</a> $)</p>\n\n\n\n<p><strong>8 Pope Francis has had enough of those AI-generated images of him</strong><br>The Pontiff warned such pictures could distort our relationship with reality. (<a href=\"https://arstechnica.com/information-technology/2024/01/pope-francis-warns-of-perverse-ai-technology-that-faked-him-in-a-puffy-coat/\">Ars Technica</a>)<br>+ <em>Fact is becoming increasingly hard to separate from fiction. </em>(<a href=\"https://www.ft.com/content/0afb2e58-c7e2-4194-a6e0-927afe0c3555\">FT</a> $)<br>+ <em>Making an image with generative AI uses as much energy as charging your phone. </em>(<a href=\"https://www.technologyreview.com/2023/12/01/1084189/making-an-image-with-generative-ai-uses-as-much-energy-as-charging-your-phone/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>9 The age of the computer mouse is over <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f5b1.png\" alt=\"🖱\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></strong><br>But touchpads are inferior in lots of ways. (<a href=\"https://www.theatlantic.com/technology/archive/2024/01/computer-mouse-evolution-trackpad/677228/\">The Atlantic</a> $)</p>\n\n\n\n<p><strong>10 Pac-Man snacks are everywhere</strong><br>Even after 40 years, brands just can’t get enough of the circular yellow hero. (<a href=\"https://www.theguardian.com/games/2024/jan/25/why-are-we-still-guzzling-pac-man-snacks\">The Guardian</a>)</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Quote of the day</strong></p>\n\n\n\n<p class=\"has-large-font-size\"><strong>“The function of the guru has needed to be overhauled in modern times…AI is in a perfect position to do that.”</strong></p>\n\n\n\n<p>—Self-help guru Deepak Chopra reflects on artificial intelligence’s potential to enlighten its users spiritually, <a href=\"https://www.fastcompany.com/91015525/deepak-chopra-explains-how-to-make-ai-your-guru\">the Fast Company</a> reports.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The big story</strong></p>\n\n\n\n<p><strong>Inside NASA’s bid to make spacecraft as small as possible</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://www.technologyreview.com/2023/10/24/1081404/small-spacecraft-engineering-physics-space/?truid=*|LINKID|*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*|SUBCLASS|*&amp;utm_content=*|DATE:m-d-Y|*\"><img decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/CRqOwyjFRttDPojWJAYBxT8uRErIKzD-4AG7c9Pg0KPLJwnWdUL9k-G379i9IK6S94c1yi5GpkQH66Zm5uQ3lsLP9vkjQWZHqmMNNsrILDvctr6dTzbHl9gGeteqL_UVMcxb4u3LGHL_GF_ES0PXO6g\" alt=\"\"/></a></figure>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2023/10/24/1081404/small-spacecraft-engineering-physics-space/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"></a><strong>October 2023</strong></p>\n\n\n\n<p>Since the 1970s, we’ve sent a lot of big things to Mars. But when NASA successfully sent twin Mars Cube One spacecraft, the size of cereal boxes, to the red planet in November 2018, it was the first time we’d ever sent something so small.</p>\n\n\n\n<p>Just making it this far heralded a new age in space exploration. NASA and planetary science researchers caught a glimpse of a future long sought: a pathway to much more affordable space exploration using smaller, cheaper spacecraft.&nbsp;</p>\n\n\n\n<p>There was a catch, though. Miniaturization can only go so far before it comes to a crashing halt against some very fundamental laws of physics. <a href=\"https://www.technologyreview.com/2023/10/24/1081404/small-spacecraft-engineering-physics-space/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—David W. Brown</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>We can still have nice things</strong></p>\n\n\n\n<p><em>A place for comfort, fun and distraction in these weird times. (Got any ideas? </em><a href=\"mailto:rhiannon.williams@technologyreview.com\"><em>Drop me a line</em></a><em> or </em><a href=\"https://twitter.com/yannon_\"><em>tweet &#8217;em at me</em></a><em>.)</em></p>\n\n\n\n<p>+ This Gordon Ramsay photoshoot for <a href=\"https://www.sandwichmagazine.com/fillings/the-chefs-special\">Sandwich Magazine</a> is absolutely fantastic <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f96a.png\" alt=\"🥪\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /><br>+ So <em>that’s</em> how you make a <a href=\"https://www.reddit.com/r/oddlysatisfying/comments/19erp3m/spring_making_process/\">spring</a>.<br>+ Would you wear the world’s <a href=\"https://www.thegentlemansjournal.com/article/RM-UP-01-Ferrari-watch-thin-review/\">thinnest watch</a>? (I’m pretty sure I’d buckle it by accident.)<br>+ Who doesn’t love a <a href=\"https://www.spin.com/2024/01/10-truly-bad-soundtracks/\">shockingly bad film soundtrack</a>?<br>+ Lets go behind the scenes of a <a href=\"https://arstechnica.com/science/2024/01/inside-the-making-of-national-geographics-a-real-bugs-life-docuseries/\">real-life Bugs’ Life</a>.</p>\n"}},{"title":"The contentious path to a cleaner future","link":"https://www.technologyreview.com/2024/01/25/1087086/nickel-mining-cleaner-future/","dc:creator":{"#cdata-section":"Casey Crownhart"},"pubDate":"Thu, 25 Jan 2024 11:00:00 +0000","category":[{"#cdata-section":"Climate change and energy"},{"#cdata-section":"App"},{"#cdata-section":"Climate Change"},{"#cdata-section":"sustainable energy"},{"#cdata-section":"The Spark"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1087086"},"description":{"#cdata-section":"This article is from The Spark, MIT Technology Review’s weekly climate newsletter. To receive it in your inbox every Wednesday, sign up here. The world is building solar panels, wind turbines, electric vehicles, and other crucial climate technologies faster than ever. As the pace picks up, though, a challenge is looming: we need a whole&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This article is from The Spark, </em>MIT Technology Review<em>’s weekly climate newsletter. To receive it in your inbox every Wednesday, </em><a href=\"https://forms.technologyreview.com/newsletters/climate-energy-the-spark/\" target=\"_blank\" rel=\"noreferrer noopener\"><em>sign up here</em></a><em>.</em></p>\n\n\n\n<p>The world is building solar panels, wind turbines, electric vehicles, and other crucial climate technologies faster than ever. <strong>As the pace picks up, though, a challenge is looming: we need a whole lot of materials to build it all.&nbsp;</strong></p>\n\n\n\n<p><strong>From cement and steel to nickel and lithium, the ingredient list for the clean energy transition is a long one. </strong>And in some cases, getting our hands on all those materials won’t be simple, and the trade-offs are starting to become abundantly clear.&nbsp;</p>\n\n\n\n<p>My colleague James Temple, senior editor for energy here at <em>MIT Technology Review</em>, has spent over a year digging into the building tensions around mining for critical minerals. <a href=\"https://www.technologyreview.com/2024/01/23/1086458/critical-minerals-nickel-inflation-reduction-act-environmental-dangers/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">In a new story published this week</a>, James highlights one community in rural Minnesota and the conflicts over a mining project planned for the nearby area.&nbsp;</p>\n\n\n\n\n\n<p>If you haven’t already, I highly recommend you <a href=\"https://www.technologyreview.com/2024/01/23/1086458/critical-minerals-nickel-inflation-reduction-act-environmental-dangers/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">check out that article</a>. In the meantime, I got to sit down with James to ask him a few questions about the process of reporting and writing this feature and chat about critical minerals and the energy transition. Here’s some of what we talked about.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>So, what’s the big deal with critical minerals?</strong></h3>\n\n\n\n<p>To address climate change, “we just need to build an enormous amount of stuff,” James says. And building all of it means a whole lot of demand for materials.&nbsp;</p>\n\n\n\n<p>We might need nearly 20 times more nickel in 2040 than the annual supply in 2020, <a href=\"https://www.iea.org/reports/the-role-of-critical-minerals-in-clean-energy-transitions/mineral-requirements-for-clean-energy-transitions\" target=\"_blank\" rel=\"noreferrer noopener\">according to the International Energy Agency</a>. That multiple is 25 times for graphite, and for lithium it’s over 40 times the current figure.&nbsp;</p>\n\n\n\n<p>Even if people agree in the abstract that we need to extract and process the materials needed to build the stuff to address climate change, figuring out where it all should come from is easier said than done. <strong>“We came to realize that mining proposals were creating community tensions basically anywhere they appeared in the US,” </strong>James says.&nbsp;</p>\n\n\n\n<p>There’s pushback to all sorts of different climate tech projects—we’ve seen very vocal opposition to <a href=\"https://www.pbs.org/newshour/nation/coastal-new-jersey-county-and-groups-sue-to-block-federal-approval-of-offshore-wind-farm\" target=\"_blank\" rel=\"noreferrer noopener\">proposed wind farms</a>, for example. But there seems to be an additional layer to the concerns around mining, James says. Among other reasons, it’s a legacy industry with a particularly checkered past in terms of environmental impact.&nbsp;</p>\n\n\n\n<p>Even as communities raise concerns over new mining projects, <strong>“you also saw the companies proposing them stressing the potential benefits to cleantech and climate goals,” </strong>James says. This combination of clear potential climate benefits with community concerns was worth exploring, he tells me.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What does a proposed nickel mine near a small town in Minnesota tell us about conflict over critical minerals?&nbsp;&nbsp;</strong></h3>\n\n\n\n<p>The town of Tamarack, Minnesota, has a population of around 70.&nbsp;</p>\n\n\n\n<p>Despite its small size, Tamarack could soon be key to a crucial landmark for climate technology, because Talon Metals wants to build a huge mine outside the town that could dig up as much as 725,000 metric tons of raw ore each year. The primary target is nickel, a metal that’s crucial to building high-performance EV batteries.&nbsp;</p>\n\n\n\n<p><strong>Talon has been very explicit in claiming that this mine would have benefits for the planet, going as far as applying to trademark the term “Green Nickel.”</strong> That’s one of the reasons this particular site piqued James’s interest, he says.&nbsp;</p>\n\n\n\n<p><strong>At the same time, local concerns are growing. </strong>Drilling could release 2.6 million gallons of water into the mine every day, which Talon plans to pump out and treat before it’s released into nearby wetlands. This part of the plan has caused some of the greatest unease, since local fresh water is crucial to the community’s economy and identity.&nbsp;</p>\n\n\n\n<p>The central tension was abundantly clear on a nearly weeklong trip to Tamarack and the surrounding communities, James tells me. He went to Rice Lake National Wildlife Refuge and learned about native wild rice that grows there and its importance to Indigenous groups. He went to see samples of the ore that Talon dug up and spoke to a geologist about the resources in the region. He also attended community meetings that got a little heated, and even had to contend with some local bees.&nbsp;</p>\n\n\n\n<p><strong>“We’re talking about a story of two different, very precious resources that have created a really difficult-to-address conflict,”</strong> he says. “It’s a tension that’s ultimately going to be very hard to resolve.”</p>\n\n\n\n<p>There are rarely easy answers when it comes to the massive task of addressing climate change. If you’re interested in getting a better understanding of this complicated web of trade-offs, <a href=\"https://www.technologyreview.com/2024/01/23/1086458/critical-minerals-nickel-inflation-reduction-act-environmental-dangers/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">take the time to read James’s story</a>. You’ll get all the details about why this particular deposit is such a big deal, and hear more about where things are likely to go from here.</p>\n\n\n\n<p>And the story doesn’t stop there. James also has another big project out this week, in which he worked to understand how this one mine could unlock billions of dollars in government subsidies. <a href=\"https://www.technologyreview.com/2024/01/25/1087027/climate-subsidies-inflation-reduction-act-mining-critical-minerals/\" data-type=\"link\" data-id=\"https://www.technologyreview.com/2024/01/25/1087027/climate-subsidies-inflation-reduction-act-mining-critical-minerals/\" target=\"_blank\" rel=\"noreferrer noopener\">Dig into that here.</a>  </p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Related reading</strong></h3>\n\n\n\n<p><strong>Yes, we have enough materials to power the world with clean energy. </strong><a href=\"https://www.technologyreview.com/2023/01/31/1067444/we-have-enough-materials-to-power-world-with-renewables/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">Mining and processing it all might prove tricky, though.</a></p>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2023/09/13/1079377/china-clean-tech-supply-chain/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Here’s how China hopes to secure its supply chain for critical minerals.&nbsp;</strong></a></p>\n\n\n\n<p><strong>Some companies are looking deep in the ocean for new sources of nickel and other metals crucial to the energy transition.</strong> <a href=\"https://www.technologyreview.com/2023/04/06/1071051/these-deep-sea-potatoes-could-be-the-future-of-mining-for-renewable-energy/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">Deep-sea rocks that look like potatoes could hold the key.</a></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Keeping up with climate&nbsp;&nbsp;</strong></h3>\n\n\n\n<p><strong>Some truck drivers are falling in love with EVs.</strong> Electric trucks are still limited in range, and they make up a small fraction of the trucks on the road, but drivers are starting to see the upside, even as critics say the move to electric is going too fast. (<a href=\"https://www.washingtonpost.com/climate-solutions/2024/01/18/electric-truck-drivers-vehicles/\" target=\"_blank\" rel=\"noreferrer noopener\">Washington Post</a>)</p>\n\n\n\n<p><strong>Gas prices are down in the US, but charging up an EV is still way cheaper. </strong>Here’s how cheap gas has to get in every state to compete with EV charging. (<a href=\"https://yaleclimateconnections.org/2024/01/gasoline-is-cheap-right-now-but-charging-an-ev-is-still-cheaper/\" target=\"_blank\" rel=\"noreferrer noopener\">Yale Climate Connections</a>)</p>\n\n\n\n<p><strong>Old cell phones might provide a much-needed source of rare earth metals.</strong> These metals are crucial for motors, including the ones in electric vehicles and wind turbines, and recycling could meet as much as 40% of US demand by 2050. (<a href=\"https://www.nytimes.com/2024/01/20/climate/rare-earth-recycling.html\" target=\"_blank\" rel=\"noreferrer noopener\">New York Times</a>)</p>\n\n\n\n<p>→ Old personal devices can be a source for other metals, like lithium and cobalt, as I wrote in this story on battery recycling from last year. (<a href=\"https://www.technologyreview.com/2023/01/17/1065026/evs-recycling-batteries-10-breakthrough-technologies-2023/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>Nobody knows when the next nuclear plant will come online in the US.</strong> The former front-runner was a NuScale modular reactor array, but the future of that project is uncertain now. (<a href=\"https://www.canarymedia.com/articles/nuclear/when-will-the-next-nuclear-plant-come-online-in-the-us-no-one-knows?utm_campaign=canary-social&amp;utm_source=twitter&amp;utm_medium=social&amp;utm_content=1705586963\" target=\"_blank\" rel=\"noreferrer noopener\">Canary Media</a>)</p>\n\n\n\n<p><strong>Local bans can eliminate nearly 300 single-use plastic bags per person per year, according to a new report. </strong>Bottom line: the policies work. (<a href=\"https://grist.org/solutions/plastic-bag-bans-have-already-prevented-billions-of-bags-from-being-used-report-finds/\" target=\"_blank\" rel=\"noreferrer noopener\">Grist</a>)</p>\n\n\n\n<p>→ Think that your plastic is being recycled? Think again. (<a href=\"https://www.technologyreview.com/2023/10/12/1081129/plastic-recycling-climate-change-microplastics/?utm_source=the_spark&amp;utm_medium=email&amp;utm_campaign=the_spark.unpaid.engagement&amp;utm_content=*%7Cdate:m-d-y%7C*\" target=\"_blank\" rel=\"noreferrer noopener\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>Europe will need 34,000 miles (54,000 kilometers) of additional transmission lines to handle the growth in offshore wind power.</strong> It could be Europe’s third-biggest energy source by 2050, if infrastructure can keep up. (<a href=\"https://www.bloomberg.com/news/articles/2024-01-23/europe-s-offshore-wind-dreams-face-huge-supply-chain-challenge?srnd=green&amp;sref=E9Urfma4\" target=\"_blank\" rel=\"noreferrer noopener\">Bloomberg</a>)</p>\n"}},{"title":"How one mine could unlock billions in EV subsidies","link":"https://www.technologyreview.com/2024/01/25/1087027/climate-subsidies-inflation-reduction-act-mining-critical-minerals/","dc:creator":{"#cdata-section":"James Temple"},"pubDate":"Thu, 25 Jan 2024 10:00:00 +0000","category":[{"#cdata-section":"Climate change and energy"},{"#cdata-section":"App"},{"#cdata-section":"Climate Change"},{"#cdata-section":"Electric Vehicles"},{"#cdata-section":"Features and Investigations"},{"#cdata-section":"Tesla"},{"#cdata-section":"The Big Story"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1087027"},"description":{"#cdata-section":"A collection of brown pipes emerge at odd angles from the mud and overgrown grasses on a pine farm north of the tiny town of Tamarack, Minnesota. Beneath these capped drill holes, Talon Metals has uncovered one of America’s densest nickel deposits—and now it wants to begin tunneling deep into the rock to extract hundreds&#8230;"},"content:encoded":{"#cdata-section":"\n<p>A collection of brown pipes emerge at odd angles from the mud and overgrown grasses on a pine farm north of the tiny town of Tamarack, Minnesota.</p>\n\n\n\n<p>Beneath these capped drill holes, Talon Metals has uncovered one of America’s densest nickel deposits—and now it wants to begin tunneling deep into the rock to extract hundreds of thousands of metric tons of mineral-rich ore a year.<br><br>If regulators approve the mine, it could mark the starting point in what this mining exploration company claims would become the country’s first complete domestic nickel supply chain, running from the bedrock beneath the Minnesota earth to the batteries in electric vehicles across the nation.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p><em><strong>This is the second story in a two-part series exploring the hopes and fears surrounding a single mining proposal in a tiny Minnesota town. You can <a href=\"https://www.technologyreview.com/2024/01/23/1086458/critical-minerals-nickel-inflation-reduction-act-environmental-dangers/\">read the first part here</a>.</strong></em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p>The US government is poised to provide generous support at every step, distributing millions to billions of dollars in subsidies for those refining the metal, manufacturing the batteries, and buying the cars and trucks they power.</p>\n\n\n\n<p>The products generated with the raw nickel that would flow from this one mining project could theoretically net more than $26 billion in subsidies, just through federal tax credits created by the Inflation Reduction Act (IRA). That’s according to <a href=\"http://netzeropolicylab.com/s/PB03-IRA-Battery-vf.pdf\">an original analysis</a> by Bentley Allan, an associate professor of political science at Johns Hopkins University and co-director of the <a href=\"https://www.netzeropolicylab.com/\">Net Zero Industrial Policy Lab</a>, produced in coordination with <em>MIT Technology Review</em>.&nbsp;</p>\n\n\n\n<p>One of the largest beneficiaries would be battery manufacturers that use Talon’s nickel, which could secure more than $8 billion in tax credits. About half of that could go to the EV giant Tesla, which has already agreed to purchase tens of thousands of metric<strong> </strong>tons of the metal from this mine.&nbsp;</p>\n\n\n\n<p>But the biggest winner, at least collectively, would be American consumers who buy EVs powered by those batteries. All told, they could enjoy nearly $18 billion in savings.&nbsp;</p>\n\n\n\n<p>While it’s <a href=\"https://www.wsj.com/articles/inflation-reduction-act-subsidies-cost-goldman-sachs-report-5623cd29\">been</a><a href=\"https://www.npr.org/2023/08/16/1194115237/biden-to-commemorate-1-year-since-he-signed-the-inflation-reduction-act\"> widely</a><a href=\"https://www.bloomberg.com/news/articles/2023-08-16/total-cost-of-joe-biden-s-inflation-reduction-act-is-rising-one-year-later?sref=E9Urfma4\"> reported</a> that the IRA could unleash at least hundreds of billions of federal dollars, <em>MIT Technology Review</em> wanted to provide a clearer sense of the law’s on-the-ground impact by zeroing in on a single project and examining how these rich subsidies could be unlocked at each point along the supply chain. (Read my related story on Talon’s proposal and the community reaction to it <a href=\"https://www.technologyreview.com/2024/01/23/1086458/critical-minerals-nickel-inflation-reduction-act-environmental-dangers/\">here</a>.)&nbsp;</p>\n\n\n\n<p>We consulted with Allan to figure out just how much money is potentially in play, where it’s likely to go, and what it may mean for emerging industries and the broader economy.&nbsp;</p>\n\n\n\n<p>These calculations are all high-end estimates meant to assess the full potential of the act, and they assume that every company and customer qualifies for every tax credit available at each point along the supply chain. In the end, the government almost certainly won’t hand out the full amounts that Allan calculated, given the varied and complex restrictions in the IRA and other factors.</p>\n\n\n\n<p>In addition, Talon itself may not obtain any subsidies directly through the law, according to recent but not-yet-final IRS interpretations. But thanks to rich EV incentives that will stimulate demand for domestic critical minerals, the company still stands to benefit indirectly from the IRA.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h3 class=\"wp-block-heading\">How $26 billion in tax credits could break down across a new US nickel supply chain</h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"4000\" height=\"4086\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Main-Mining-Data_Edits_Final.png?w=1958\" alt=\"\" class=\"wp-image-1087134\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Main-Mining-Data_Edits_Final.png 4000w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Main-Mining-Data_Edits_Final.png?resize=294,300 294w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Main-Mining-Data_Edits_Final.png?resize=768,785 768w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Main-Mining-Data_Edits_Final.png?resize=1958,2000 1958w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Main-Mining-Data_Edits_Final.png?resize=1504,1536 1504w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Main-Mining-Data_Edits_Final.png?resize=2005,2048 2005w\" sizes=\"(max-width: 4000px) 100vw, 4000px\" /></figure>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p>The sheer scale of the numbers offer a glimpse into how and why the IRA, <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/16/fact-sheet-one-year-in-president-bidens-inflation-reduction-act-is-driving-historic-climate-action-and-investing-in-america-to-create-good-paying-jobs-and-reduce-costs/\">signed into law</a> in August 2022, has already begun to drive projects, reconfigure sourcing arrangements, and accelerate the shift away from fossil fuels.</p>\n\n\n\n<p>Indeed, the policies have dramatically altered the math for corporations considering whether, where, and when to build new facilities and factories, helping to spur at least tens of billions of dollars’ worth of private investments into the nation’s critical-mineral-to-EV supply chain, according to <a href=\"https://climatepower.us/wp-content/uploads/sites/23/2023/07/Clean-Energy-Boom-Anniversary-Report-1.pdf\">several</a><a href=\"https://www.technologyreview.com/2023/08/17/1078074/breakthrough-climate-bill-then-and-now/\"> analyses</a>.</p>\n\n\n\n<p>“If you try to work out the math on these for five minutes, you start to be really shocked by what you see on paper,” Allan says, noting that the IRA’s incentives ensure that many more projects could be profitably and competitively developed in the US. “It’s going to transform the country in a serious way.”</p>\n\n\n\n<h3 class=\"wp-block-heading\">An urgent game of catch-up</h3>\n\n\n\n<p>For decades, the US steadily offshored the messy business of mining and processing metals, leaving other nations to deal with the environmental damage and community conflicts that these industries often cause. But the country is increasingly eager to revitalize these sectors as climate change and simmering trade tensions with China raise the economic, environmental, and geopolitical stakes.&nbsp;</p>\n\n\n\n<p>Critical minerals like lithium, cobalt, nickel, and copper are the engine of the emerging clean-energy economy, essential for producing solar panels, wind turbines, batteries, and EVs. Yet China dominates production of the source materials, components, and finished goods for most of these products, following decades of strategic government investments and targeted trade policies. It refines 71% of the type of nickel used for batteries and produces more than 85% of the world’s battery cells, according to Benchmark Mineral Intelligence.&nbsp;</p>\n\n\n\n<p>The US is now in a high-stakes scramble to catch up and ensure its unfettered access to these materials, either by boosting domestic production or by locking in supply chains through friendly trading partners. The IRA is the nation’s biggest bet, by far, on bolstering these industries and countering China’s dominance over global cleantech supply chains. By <a href=\"https://www.goldmansachs.com/intelligence/pages/the-us-is-poised-for-an-energy-revolution.html\">some estimates</a>, it could unlock more than $1 trillion in federal incentives.</p>\n\n\n\n<p>“It should be sufficient to drive transformational progress in clean-energy adoption in the United States,” says Kimberly Clausing, a professor at the UCLA School of Law who previously served as deputy assistant secretary for tax analysis at the Treasury Department. “The best modeling <a href=\"https://rhg.com/research/emerging-climate-technology-ira/\">seems to show</a> it will reduce emissions substantially, getting us halfway to our Paris Agreement goals.”</p>\n\n\n\n<p>Among other subsidies, the IRA <a href=\"https://irc.bloombergtax.com/public/uscode/doc/irc/section_45x\">provides tax credits</a> that companies can earn for producing critical minerals, electrode materials, and batteries, enabling them to substantially cut their federal tax obligations.&nbsp;</p>\n\n\n\n<p>But the provisions that are really driving the rethinking of sourcing and supply chains are the so-called domestic content requirements contained in the tax credits for purchasing EVs. For consumers to earn the full credits, and for EV makers to benefit from the boost in demand they’ll generate, a significant share of the critical minerals the batteries contain must be produced in the US, sourced from free-trade partners, or recycled in North America, among other requirements.&nbsp;</p>\n\n\n\n<p>This makes the critical minerals coming out of a mine like Talon’s especially valuable to US car companies since it could help ensure that their EV models and customers qualify for these credits.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\">Mining and refining</h3>\n\n\n\n<p>Nickel, like the deposits found in Minnesota, is of particular importance for cleaning up the auto sector. The metal boosts the amount of energy that can be packed into battery cathodes, extending the range of cars and making possible heavier electric vehicles, like trucks and even semis.</p>\n\n\n\n<p>Global nickel demand could rise 112% by 2040, according to the International Energy Agency, owing primarily to an expected ninefold increase in demand for EV batteries. But there’s only one dedicated nickel mine operating in the US today, and most processing of the metal happens overseas.&nbsp;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"3000\" height=\"1955\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/230628_Talon_0897.jpg?w=3000\" alt=\"&quot;&quot;\" class=\"wp-image-1086576\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/230628_Talon_0897.jpg 3000w, https://wp.technologyreview.com/wp-content/uploads/2024/01/230628_Talon_0897.jpg?resize=300,196 300w, https://wp.technologyreview.com/wp-content/uploads/2024/01/230628_Talon_0897.jpg?resize=768,500 768w, https://wp.technologyreview.com/wp-content/uploads/2024/01/230628_Talon_0897.jpg?resize=1536,1001 1536w, https://wp.technologyreview.com/wp-content/uploads/2024/01/230628_Talon_0897.jpg?resize=2048,1335 2048w\" sizes=\"(max-width: 3000px) 100vw, 3000px\" /><figcaption class=\"wp-element-caption\">A former Talon worker pulls tubes of bedrock from drill pipe and places them into a box for further inspection. </figcaption><div class=\"image-credit\">ACKERMAN + GRUBER</div>\n</figure>\n</div>\n\n\n<p>In a preliminary <a href=\"https://talonmetals.com/wp-content/uploads/2021/02/Talon-Tamarack-PEA3_2021.pdf\">economic analysis</a> of the proposed mine released in 2021, Talon said it hoped to dig up nearly 11 million metric tons of ore over a nine-year period, including more than 140,000 tons of nickel. That’s enough to produce lithium-ion batteries that could power almost 2.4 million electric vehicles, Allan finds.&nbsp;</p>\n\n\n\n<p>After Talon mines the ore, the company plans to ship the material more than 400 miles west by rail to a planned processing site in central North Dakota that would produce what’s known as “nickel in concentrate,” which is generally around 10% pure.&nbsp;</p>\n\n\n\n<p>But that’s not enough to earn any subsidies under the <a href=\"https://www.federalregister.gov/documents/2023/12/15/2023-27498/section-45x-advanced-manufacturing-production-credit\">current interpretation</a> of the IRA’s tax credit for critical-mineral production. The law <a href=\"https://irc.bloombergtax.com/public/uscode/doc/irc/section_45x\">specifies</a> that a company must convert nickel into a highly refined form known as “nickel sulphate” or process the metal to at least 99% purity by mass to be eligible for tax credits that cover 10% of the operating cost. Allan estimates that whichever company or companies carry out that step could earn subsidies that exceed $55 million.&nbsp;</p>\n\n\n\n<p>From there, the nickel would still need to be processed and mixed with other metals to produce the “cathode active materials” that go into a battery. Whatever companies carry out that step could secure some share of another $126.5 million in tax savings, thanks to a separate credit covering 10% of the costs of generating these materials, Allan notes.</p>\n\n\n\n<p>Some share of the subsidies from these two tax credits might go to Tesla, which has stressed that it’s bringing more aspects of battery manufacturing in-house. For instance, it’s <a href=\"https://www.statesman.com/story/business/technology/2023/05/09/austin-based-tesla-breaks-ground-on-corpus-christi-lithium-refinery/70197266007/\">in the process</a> of constructing its own lithium refinery and cathode plant in Texas.&nbsp;</p>\n\n\n\n<p>But it’s not yet clear what other companies could be involved in processing the nickel mined by Talon and, thus, who would benefit from these particular provisions.</p>\n\n\n\n<p>Talon and other mining companies have campaigned to have the costs for mining raw materials included in the critical-mineral production tax credit, but the IRS recently <a href=\"https://www.federalregister.gov/documents/2023/12/15/2023-27498/section-45x-advanced-manufacturing-production-credit\">stated</a> in a proposed rule that this step won’t qualify.</p>\n\n\n\n<p>Todd Malan, Talon’s chief external affairs officer and head of climate strategy, argues that this and other recent determinations will limit the incentives for companies to develop new mines in the US, or to make sure that any mines that are developed meet the higher environmental and labor standards the Biden administration and others have been calling for.</p>\n\n\n\n<p>(The determinations could change since the Treasury Department and IRS have <a href=\"https://www.federalregister.gov/documents/2023/12/15/2023-27498/section-45x-advanced-manufacturing-production-credit\">said</a> they are still considering including the costs of mining in the tax credits. They have requested additional comments on the matter.)&nbsp;</p>\n\n\n\n<p>Even if Talon doesn’t obtain any IRA subsidies, it still stands to earn federal funds in several other ways. The company is <a href=\"https://www.newsfilecorp.com/release/185985\">set to receive</a> a nearly $115 million grant from the Department of Energy to build the North Dakota processing site, through funds freed up under the Bipartisan Infrastructure Law. In addition, in September Talon <a href=\"https://talonmetals.com/department-of-defense-and-talon-sign-agreement-to-support-domestic-nickel-exploration/#:~:text=Utilizing%20Defense%20Production%20Act%20(DPA,more%20equipment%2C%20hire%20additional%20employees\">secured</a> nearly $21 million in matching grants through the Defense Production Act, which will support further nickel exploration in Minnesota and at another site the company is evaluating in Michigan. (These numbers are not included in Allan’s overall $26 billion estimate.)</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h3 class=\"wp-block-heading\">Talon Metals could receive $136 million in federal subsidies</h3>\n\n\n\n<div class=\"wp-block-columns is-layout-flex wp-container-core-columns-layout-1 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\"><div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"979\" height=\"1427\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Processing1.png\" alt=\"$115 million to build a nickel processing site in North Dakota with funds from the Bipartisan Infrastructure Law\" class=\"wp-image-1086709\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Processing1.png 979w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Processing1.png?resize=206,300 206w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Processing1.png?resize=768,1119 768w\" sizes=\"(max-width: 979px) 100vw, 979px\" /></figure></div></div>\n\n\n\n<div class=\"wp-block-column is-layout-flow wp-block-column-is-layout-flow\"><div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"978\" height=\"1427\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Exploration.png\" alt=\"$21 million through the Defense Production Act to support additional nickel exploration in the Midwest.\" class=\"wp-image-1086677\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Exploration.png 978w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Exploration.png?resize=206,300 206w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Talon-Exploration.png?resize=768,1121 768w\" sizes=\"(max-width: 978px) 100vw, 978px\" /></figure></div></div>\n</div>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h3 class=\"wp-block-heading\">The math</h3>\n\n\n\n<p><em>Allan says that his findings are best thought of as ballpark figures. Some of Talon’s estimates have already changed, and the actual mineral quantities and operating costs will depend on a variety of factors, including how the company’s plans shift, what state and local regulators ultimately approve, what Talon actually pulls out of the ground, how much nickel the ore contains, and how much costs shift throughout the supply chain in the coming years.</em></p>\n\n\n\n<p><em>His analysis assumes a preparation cost of $6.68 per kilowatt-hour for cathode active materials, based on an </em><a href=\"https://www.mdpi.com/1996-1073/12/3/504\"><em>earlier analysis</em></a><em> in the journal </em>Energies<em>. It did not evaluate any potential subsidies associated with other metals that Talon may extract from the mine, such as iron, copper, and cobalt. Please see his </em><a href=\"http://netzeropolicylab.com/s/PB03-IRA-Battery-vf.pdf\"><em>full research brief</em></a><em> on the Net Zero Industrial Policy Lab site.&nbsp;</em></p>\n\n\n\n<p><em>Companies can use the IRA tax credits to reduce or even eliminate their federal tax obligations, both now and in tax years to come. In addition, businesses can <a href=\"https://www.americanprogress.org/article/understanding-direct-pay-and-transferability-for-tax-credits-in-the-inflation-reduction-act/\">transfer and sell</a> the tax credits to other taxpayers.</em></p>\n\n\n\n<p><em>Most of the tax credits in the IRA begin to phase out in 2030, so companies need to move fast to take advantage of them. The subsidies for critical-mineral production, however, don’t have any such cutoff.</em></p>\n\n\n\n<h3 class=\"wp-block-heading\">Where will the money go and what will it do?</h3>\n\n\n\n<p>The $136 million in direct federal grants would double Talon’s funds for exploratory drilling efforts and cover <a href=\"https://talonmetals.com/talon-metals-battery-minerals-processing-facility-selected-by-us-department-of-energy-for-114-million-in-bipartisan-infrastructure-law-funding/\">about 27%</a> of the development cost for its North Dakota processing plant.</p>\n\n\n\n<p>The company says that these projects will help accelerate the country’s shift toward EVs and reduce the nation’s reliance on China for critical minerals. Further, Talon notes the mine will provide significant local economic benefits, including about 300 new jobs. That’s in addition to the nearly 100 employees already working in or near Tamarack. The company also expects the operation to generate nearly $110 million in mineral royalties and taxes paid to the state, local government, and the regional school district.</p>\n\n\n\n<p>Plenty of citizens around Tamarack, however, argue that any economic benefits will come with steep trade-offs in terms of environmental and community impacts. A number of local tribal members fear the project could contaminate waterways and harm the region’s plants and animals.&nbsp;</p>\n\n\n\n<p>“The energy transition cannot be built by desecrating native lands,” said Leanna Goose, a member of the Leech Lake Band of Ojibwe, in an email. “If these ‘critical’ minerals leave the ground and are taken out from on or near our reservations, our people would be left with polluted water and land.”</p>\n\n\n\n\n\n<p>Meanwhile, as it becomes clear just how much federal money is at stake, opposition to the IRA and other climate-related laws is <a href=\"https://waysandmeans.house.gov/wp-content/uploads/2023/04/V.-Ginn-Written-Testimony.pdf\">hardening</a>. Congressional Republicans, some of whom have portrayed the tax subsidies as corporate handouts to the “wealthy and well connected,” have <a href=\"https://www.washingtonpost.com/business/2023/06/18/foes-inflation-reduction-act-race-repeal-climate-drug-pricing-programs/\">repeatedly attempted</a> to repeal key provisions of the laws. In addition, some environmentalists and left-wing critics have <a href=\"https://waterlegacy.org/wp-content/uploads/2023/08/NGO-Opposition-Letter-Talon-Mine-Federal-Subsidy-Aug.15-2023.pdf\">chided the government</a> for offering generous subsidies to controversial companies and projects, including Talon’s.&nbsp;</p>\n\n\n\n<p>Talon stresses that it has made significant efforts to limit pollution and address Indigenous concerns. In addition, Malan pushed back on Allan’s findings. He says the overall estimate of $26 billion in subsidies across the supply chain significantly exaggerates the likely outcome, given numerous ways that companies and consumers might fail to qualify for the tax credits.</p>\n\n\n\n<p>“I think it’s too much to tie it back to a little mining company in Minnesota,” he says.&nbsp;</p>\n\n\n\n<p>He emphasizes that Talon will earn money only for selling the metal it extracts, and that it will receive other federal grants only if it secures permits to proceed on its projects. (The company could also apply to receive separate IRA tax credits that cover a portion of the investments made into certain types of energy projects, but it has not at this time.)</p>\n\n\n\n<h3 class=\"wp-block-heading\">Boosting the battery sector</h3>\n\n\n\n<p>The next stop in the supply chain is the battery makers.&nbsp;</p>\n\n\n\n<p>The amount of nickel that Talon expects to pull from the mine could be used to produce cathodes for nearly 190 million kilowatt-hours’ worth of lithium-ion batteries, according to Allan’s findings.&nbsp;</p>\n\n\n\n<p>Manufacturing that many batteries could generate some $8.5 billion from a pair of IRA tax credits worth $45 per kilowatt-hour, dwarfing the potential subsidies for processing the nickel.</p>\n\n\n\n<p>Any number of companies might purchase metals from Talon to build batteries, but Tesla has <a href=\"https://talonmetals.com/tesla-and-talon-metals-enter-into-supply-agreement-for-nickel/\">already agreed</a> to buy 75,000 tons of nickel in concentrate from the North Dakota facility. (The companies have not disclosed the financial terms of the deal.)</p>\n\n\n\n<p>Given the batteries that could be produced with this amount of metal, Tesla’s share of these tax savings could exceed $4 billion, Allan found.&nbsp;</p>\n\n\n\n<p>The tax credits add up to “a third of the cost of the battery, full stop,” he says. “These are big numbers. The entire cost of building the plant, at least, is covered by the IRA.”</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h3 class=\"wp-block-heading\">What Talon&#8217;s nickel may mean for Tesla</h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1153\" height=\"1523\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Minerals_new_final_color.png?w=1153\" alt=\"\" class=\"wp-image-1087132\" style=\"width:400px\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Minerals_new_final_color.png 1153w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Minerals_new_final_color.png?resize=227,300 227w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Minerals_new_final_color.png?resize=768,1014 768w\" sizes=\"(max-width: 1153px) 100vw, 1153px\" /></figure></div>\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1153\" height=\"1523\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Cars_new_final_color.png?w=1153\" alt=\"\" class=\"wp-image-1087133\" style=\"width:400px\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Cars_new_final_color.png 1153w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Cars_new_final_color.png?resize=227,300 227w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Cars_new_final_color.png?resize=768,1014 768w\" sizes=\"(max-width: 1153px) 100vw, 1153px\" /></figure></div>\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1153\" height=\"1523\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Gold_new_final_color.png\" alt=\"\" class=\"wp-image-1087131\" style=\"width:400px\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Gold_new_final_color.png 1153w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Gold_new_final_color.png?resize=227,300 227w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Tesla-Gold_new_final_color.png?resize=768,1014 768w\" sizes=\"(max-width: 1153px) 100vw, 1153px\" /></figure></div>\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h3 class=\"wp-block-heading\">The math</h3>\n\n\n\n<p><em>The subsidies for battery makers would flow from two credits within the IRA. Those include a $35-per-kilowatt-hour tax credit for manufacturing battery cells and a $10-per-kilowatt-hour credit for producing battery modules, which are the bundles of interoperating cells that slot into vehicles. Allan’s calculations assume that all the metal will be used to produce nickel-rich NMC 811 batteries, and that every EV will include an 80-kilowatt-hour battery pack that costs $153 per kilowatt-hour to produce.</em></p>\n\n\n\n<h3 class=\"wp-block-heading\">Where will the money go and what will it do?</h3>\n\n\n\n<p>Those billions are just what Tesla could secure in tax credits from the nickel it buys from Talon. It and other battery makers could qualify for still more government subsidies for batteries produced with critical minerals from other sources.&nbsp;</p>\n\n\n\n<p>Tesla didn’t respond to inquiries from <em>MIT Technology Review</em>. But its executives have said they believe Tesla’s batteries will qualify for the manufacturing tax credits, even before Talon’s mining and processing plants are up and running.</p>\n\n\n\n<p>On an <a href=\"https://ir.tesla.com/webcast-2023-01-25\">earnings call</a> last January, Zachary Kirkhorn, who was then the company’s chief financial officer, said that Tesla expected the battery subsidies from its current production lines to total $150 million to $250 million per quarter in 2023. He said the company intends to use the tax credits to lower prices and promote greater adoption of electric vehicles: “We want to use this to accelerate sustainable energy, which is our mission and also the goal of [the IRA].”&nbsp;</p>\n\n\n\n<p>But these potential subsidies are clear evidence that the US government is dedicating funds to the wrong societal priorities, says Jenna Yeakle, an organizer for the Sierra Club North Star Chapter in Minnesota, which added its name to <a href=\"https://waterlegacy.org/wp-content/uploads/2023/08/NGO-Opposition-Letter-Talon-Mine-Federal-Subsidy-Aug.15-2023.pdf\">a letter</a> to the White House criticizing federal support for Talon’s proposals.&nbsp;</p>\n\n\n\n<p>“People are struggling to pay rent and put food on the table and to navigate our monopolized corporate health-care system,” she says. “Do we need to be subsidizing Elon Musk’s bank account?”</p>\n\n\n\n<p>Still, the IRA&#8217;s tax credits will go to numerous battery companies beyond Tesla.&nbsp;</p>\n\n\n\n<p>In fact, the incentives are already reshaping the marketplace, driving a sharp increase in the number of battery and electric-vehicle projects announced, according to the EV Supply Chain Dashboard, a <a href=\"https://www.charged-the-book.com/na-ev-supply-chain-map\">database</a> managed by Jay Turner, a professor of environmental studies at Wellesley College and author of <a href=\"https://www.charged-the-book.com/\"><em>Charged:</em></a><em> A History of Batteries and Lessons for a Clean Energy Future.&nbsp;</em></p>\n\n\n\n<p>As of press time, 81 battery and EV-related projects representing $79 billion in investments and more than 50,000 jobs have been announced across the US since Biden signed the IRA. On an annual basis, that’s nearly three times the average dollar figures announced in recent years before the law was enacted. The projects include BMW, Hyundai, and Ford battery plants, Tesla’s semi manufacturing pilot plant in Nevada, and Redwoods Materials’ battery recycling facility in South Carolina.&nbsp;</p>\n\n\n\n<p>“It’s really exceptional,” Turner says. “I don’t think anybody expected to see so many battery projects, so many jobs, and so many investments over the past year.”</p>\n\n\n\n<h3 class=\"wp-block-heading\">Driving EV sales</h3>\n\n\n\n<p>The biggest subsidy, though also the most diffuse one, would go to American consumers.&nbsp;</p>\n\n\n\n<p>The IRA offers two tax credits worth up to $7,500 combined for purchasing EVs and plug-in hybrids if the battery materials and components comply with the domestic content requirements.</p>\n\n\n\n<p>Since the nickel that Talon expects to extract from the Minnesota mine could power nearly 2.4 million electric vehicles, consumers could collectively see $17.7 billion in potential savings if all those vehicles qualify for both credits, Allan finds.&nbsp;</p>\n\n\n\n<p>Talon’s Malan says this estimate significantly overstates the likely consumer savings, noting that many purchases won’t qualify. Indeed, an individual with a gross income that exceeds $150,000 won’t be eligible, nor will pickups, vans, and SUVs that cost more than $80,000. That would rule out, for instance, the high-end model of Tesla’s Cybertruck.<br><br>A number of Tesla models are currently <a href=\"https://www.reuters.com/business/autos-transportation/tesla-lose-7500-consumer-tax-credits-some-model-3-vehicles-2023-12-13/#:~:text=%22Tax%20credit%20will%20end%20for,a%20notice%20on%20its%20website.\">excluded</a> from one or both consumer credits, for <a href=\"https://www.theverge.com/2023/1/3/23537295/tesla-model-y-five-seat-not-eligible-federal-incentives-clean-vehicle-tax-credit\">varied and confusing</a> reasons. But the Talon deal and other recent <a href=\"https://www.reuters.com/technology/brazils-vale-signs-long-term-deal-supply-tesla-with-nickel-2022-05-06/\">sourcing</a><a href=\"https://www.nytimes.com/2021/12/30/world/asia/tesla-batteries-nickel-new-caledonia.html\"> arrangements</a>, as well as the company’s plans to manufacture more of its own batteries, could help more of Tesla’s vehicles to qualify in the coming months or years.&nbsp;</p>\n\n\n\n<p>The IRA’s consumer incentives are likely to do more to stimulate demand than previous federal EV policies, in large part because customers can take them in the form of a price cut at the point of sale, says Gil Tal, director of the Electric Vehicle Research Center at the University of California, Davis. Previously, such incentives would simply reduce the buyer’s federal obligations come tax season.&nbsp;</p>\n\n\n\n<p>RMI, a nonprofit research group focused on clean energy, <a href=\"https://rmi.org/insight/how-inflation-reduction-act-will-affect-ev-adoption-in-the-united-states/\">projects</a> that all the EV provisions within the IRA, which also include subsidies for new charging stations, will spur the sales of an additional 37 million electric cars and trucks by 2032. That would propel EV sales to around 80% of new passenger-automobile purchases. Those vehicles, in turn, could eliminate 2.4 billion tons of transportation emissions by 2040.&nbsp;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"2832\" height=\"2124\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Model3_78.jpg?w=2667\" alt=\"red Tesla Model3\" class=\"wp-image-1086687\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/Model3_78.jpg 2832w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Model3_78.jpg?resize=300,225 300w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Model3_78.jpg?resize=768,576 768w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Model3_78.jpg?resize=1536,1152 1536w, https://wp.technologyreview.com/wp-content/uploads/2024/01/Model3_78.jpg?resize=2048,1536 2048w\" sizes=\"(max-width: 2832px) 100vw, 2832px\" /><figcaption class=\"wp-element-caption\">In a preliminary economic analysis, Talon said it hoped to dig up more than 140,000 tons of nickel. That’s enough to produce lithium-ion batteries that could power almost 2.4 million electric vehicles.</figcaption><div class=\"image-credit\">TESLA</div>\n</figure>\n</div>\n\n\n<h3 class=\"wp-block-heading\">The math</h3>\n\n\n\n<p><em>The IRA <a href=\"https://home.treasury.gov/news/press-releases/jy1379#:~:text=To%20be%20eligible%20for%20a,eligible%20for%20a%20%243%2C750%20credit.\">offers two tax credits</a> that could apply to EV buyers. The first is a $3,750 credit for those who purchase vehicles with batteries that contain a significant portion of critical minerals that were mined or processed in the US, or in a country with which the US has a free-trade agreement. The <a href=\"https://www.irs.gov/irb/2022-52_IRB#REV-PROC-2022-42\">required share</a> is 50% in 2024 but reaches 80% beginning in 2027. Cars and trucks may also qualify if the materials came from recycling in North America.</em></p>\n\n\n\n<p><em>Buyers can also earn a separate $3,750 credit if a specified share of the battery components in the vehicle were manufactured or assembled in North America. The share is 60% this year and next but reaches 100% in 2029.</em></p>\n\n\n\n<h3 class=\"wp-block-heading\">The big bet</h3>\n\n\n\n<p>There are lingering questions about how many of the projects sparked by the country’s new green industrial policies will ultimately be built—and what the US will get for all the money it’s giving up.&nbsp;</p>\n\n\n\n<p>After all, the tens of billions of dollars’ worth of tax credits that could be granted throughout the Talon-to-Tesla-to-consumer nickel supply chain is money that isn’t going to the federal government, and isn’t funding services for American taxpayers.</p>\n\n\n\n<p>The IRA’s impacts on tax coffers are certain to come under greater scrutiny as the programs ramp up, the dollar figures rise, projects run into trouble, and the companies or executives benefiting engage in questionable practices. After all, that’s exactly what happened in the aftermath of the country’s first major <a href=\"https://www.technologyreview.com/2020/07/28/1005503/the-us-needs-a-green-stimulus-but-must-provide-immediate-relief-first/\">green industrial policy</a> efforts a decade ago, when the high-profile failures of <a href=\"https://www.theatlantic.com/politics/archive/2011/09/the-solyndra-scandal-what-it-is-and-why-it-matters/245186/\">Solyndra</a>,<a href=\"https://www.reuters.com/article/us-fisker-doe/republicans-slam-u-s-bet-on-electric-carmaker-fisker-idUSBRE93N14J20130425\"> Fisker</a>, and other government-backed clean-energy ventures fueled outrage among conservative critics.&nbsp;</p>\n\n\n\n<p>Nevertheless, Tom Moerenhout, a research scholar at Columbia University’s Center on Global Energy Policy, insists it’s wrong to think of these tax credits as forgone federal revenue.&nbsp;</p>\n\n\n\n<p>In many cases, the projects set to get subsidies for 10% of their operating costs would not otherwise have existed in the first place, since those processing plants and manufacturing facilities would have been built in other, cheaper countries. “They would simply go to China,” he says.</p>\n\n\n\n<p>UCLA’s Clausing doesn’t entirely agree with that take, noting that some of this money will go to projects that would have happened anyway, and some of the resources will simply be pulled from other sectors of the economy or different project types.&nbsp;</p>\n\n\n\n<p>“It doesn’t behoove us as experts to argue this is free money,” she says. “Resources really do have costs. Money doesn’t grow on trees.”</p>\n\n\n\n<p>But any federal expenses here are “still cheaper than the social cost of carbon,” she adds, referring to <a href=\"https://www.brookings.edu/articles/what-is-the-social-cost-of-carbon/#:~:text=The%20social%20cost%20of%20carbon%20(SCC)%20is%20an%20estimate%20of,a%20ton%20of%20carbon%20emissions.\">the estimated costs</a> from the damage associated with ongoing greenhouse-gas pollution. “And we should keep our eyes on the prize and remember that there are some social priorities worth paying for—and this is one of those.”</p>\n\n\n\n<p>In the end, few expect the US’s sweeping climate laws to completely achieve any of the hopes underlying them on their own. They won’t propel the US to net-zero emissions. They won’t enable the country to close China’s massive lead in key minerals and cleantech, or fully break free from its reliance on the rival nation. Meanwhile, the battle to lock down access to critical minerals will only become increasingly competitive as more nations accelerate efforts to move away from fossil fuels—and it will generate even more controversy as communities push back against proposals over concerns about environmental destruction.</p>\n\n\n\n<p>But the evidence is building that the IRA in particular is spurring real change, delivering at least some progress on most of the goals that drove its passage: galvanizing green-tech projects, cutting emissions, creating jobs, and moving the nation closer to its clean-energy future.&nbsp;</p>\n\n\n\n<p>“It is catalyzing investment up and down the supply chain across North America,” Allan says. “It is a huge shot in the arm of American industry.”</p>\n"}},{"title":"The Download: how China’s regulating robotaxis","link":"https://www.technologyreview.com/2024/01/24/1087035/the-download-how-chinas-regulating-robotaxis/","dc:creator":{"#cdata-section":"Rhiannon Williams"},"pubDate":"Wed, 24 Jan 2024 13:10:00 +0000","category":{"#cdata-section":"The Download"},"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1087035"},"description":{"#cdata-section":"This is today&#8217;s edition of The Download, our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. How China is regulating robotaxis Not many technologies have had such a roller-coaster ride in the past year as robotaxis. In just a few months they went from San Francisco’s new darling to&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This is today&#8217;s edition of <a href=\"https://forms.technologyreview.com/newsletters/briefing-the-download/?_ga=2.179569122.736533416.1649661040-405833893.1649413289\">The Download</a></em>,<em> our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology.</em></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How China is regulating robotaxis</strong></p>\n\n\n\n<p>Not many technologies have had such a roller-coaster ride in the past year as robotaxis. In just a few months they went from San Francisco’s new darling to a national scandal after a car operated by Cruise, one of the leading companies in the business, was involved in a serious accident.</p>\n\n\n\n<p>Other than rebuilding the public trust that was lost last year, robotaxi companies are also struggling to find a realistic business model. It’s not a moonshot idea anymore, but it’s also not a viable business yet either.</p>\n\n\n\n<p>Zeyi Yang, our China reporter, <a href=\"https://www.technologyreview.com/2024/01/23/1086936/whats-next-for-robotaxis-2024/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">published a piece</a> yesterday looking at where the industry is going this year. While it mostly focuses on the situation in the US, he’s also paying close attention to the industry’s Chinese players. <a href=\"https://www.technologyreview.com/2024/01/24/1086989/china-regulation-robotaxi-autonomous-driving/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read his story</a> about what’s happening in China’s robotaxi scene.</p>\n\n\n\n<p><strong>This story is from China Report, our weekly newsletter giving you the inside track on all things happening in China. </strong><a href=\"https://forms.technologyreview.com/newsletters/tech-control-china-report/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>Sign up</strong></a><strong> to receive it in your inbox every Tuesday.</strong></p>\n\n\n\n<p><em>Correction: The story we ran yesterday, </em><a href=\"https://www.technologyreview.com/2024/01/23/1086936/whats-next-for-robotaxis-2024/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><em>What’s next for robotaxis in 2024</em></a><em>, has been updated to clarify that Cruise’s October accident was not fatal.</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The must-reads</strong></p>\n\n\n\n<p><em>I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.</em></p>\n\n\n\n<p><strong>1 San Francisco is fighting back against self-driving cars </strong><br>The city has filed a lawsuit that could force firms to roll back their rapid expansions. (<a href=\"https://www.washingtonpost.com/technology/2024/01/23/san-francisco-lawsuit-robotaxi-waymo-cruise/\">WP</a> $)<br>+ <em>Meanwhile, Waymo is planning a new fleet in LA. </em>(<a href=\"https://www.nbcnews.com/tech/innovation/waymo-la-california-sf-los-angeles-rcna135335\">NBC News</a>)<br>+ <em>Robotaxis are here. It’s time to decide what to do about them. </em>(<a href=\"https://www.technologyreview.com/2023/06/23/1074270/obotaxis-decision-time/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>2 The EU is going to force Apple to permit non-App Store downloads</strong><br>Naturally, Apple has discovered it’s a way for it to introduce new fees. (<a href=\"https://www.wsj.com/tech/apple-plans-new-fees-and-restrictions-for-downloads-outside-app-store-f464f426?mod=tech_lead_story\">WSJ</a> $)</p>\n\n\n\n<p><strong>3 Amazon has been fined for excessively surveilling its workers</strong><br>A French data watchdog deemed its system ‘overly intrusive.’ (<a href=\"https://techcrunch.com/2024/01/23/french-regulator-fines-amazon-35-million-over-its-surveillance-system-of-warehouse-workers/\">TechCrunch</a>)</p>\n\n\n\n<p><strong>4 AI could help to develop exciting new battery materials<br></strong>Just like drug discovery, it could halve the length of time it takes to bring them to market. (<a href=\"https://www.ft.com/content/62b42579-f3c1-471d-9dab-8bb95ac218c8\">FT</a> $)<br>+ <em>Tesla is reportedly starting production of a new EV next year. </em>(<a href=\"https://www.reuters.com/business/autos-transportation/tesla-plans-build-new-electric-vehicles-mid-2025-sources-2024-01-24/\">Reuters</a>)<br>+ <em>This abundant material could unlock cheaper batteries for EVs. </em>(<a href=\"https://www.technologyreview.com/2023/05/09/1072738/this-abundant-material-could-unlock-cheaper-batteries-for-evs/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>5 Global electricity demand is expected to surge in the next three years</strong><br>And data centers, crypto, and AI is behind it. (<a href=\"https://www.bloomberg.com/news/articles/2024-01-24/cryptocurrency-ai-electricity-demand-seen-doubling-in-three-years?srnd=technology-vp&amp;sref=E9Urfma4\">Bloomberg</a> $)<br>+ <em>Nuclear power is being touted as a potential solution. </em>(<a href=\"https://spectrum.ieee.org/cop28-nuclear\">IEEE Spectrum</a>)<br>+ <em>AI could also make the power grid faster and more resilient, though. </em>(<a href=\"https://www.technologyreview.com/2023/11/22/1083792/ai-power-grid-improvement/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>6 This Chinese startup says it’s working on generative AI’s first killer apps<br></strong>01.AI’s open source model is outperforming its Big Tech rivals’. (<a href=\"https://www.wired.com/story/chinese-startup-01-ai-is-winning-the-open-source-ai-race/\">Wired</a> $)<br>+ <em>America’s chip sanctions against China are pretty easy to circumvent. </em>(<a href=\"https://www.economist.com/business/2024/01/21/why-americas-controls-on-sales-of-ai-tech-to-china-are-so-leaky\">Economist</a> $)<br>+ <em>North Korea is throwing everything into AI development right now. </em>(<a href=\"https://www.reuters.com/technology/north-koreas-ai-development-raises-sanctions-concerns-report-says-2024-01-23/\">Reuters</a>)<br>+ <em>These six questions will dictate the future of generative AI. </em>(<a href=\"https://www.technologyreview.com/2023/12/19/1084505/generative-ai-artificial-intelligence-bias-jobs-copyright-misinformation/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>7 How China’s fast fashion giants exploit a tax loophole to ship packages<br></strong>Which has helped them to gain a major foothold in the US. (<a href=\"https://www.businessinsider.com/shein-temu-de-minimis-tax-loophole-scrutiny-2024-1?r=US&amp;IR=T\">Insider</a> $)<br>+ <em>Why my bittersweet relationship with Shein had to end. </em>(<a href=\"https://www.technologyreview.com/2023/01/18/1067049/shein-phone-case-ecommerce-bittersweet/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>8 Spreading rock dust on farms could help remove atmospheric CO2<br></strong>The only problem is, it’s really hard to measure how much it captures. (<a href=\"https://www.newscientist.com/article/2413702-huge-amounts-of-rock-dust-are-being-spread-across-farms-to-capture-co2/\">New Scientist</a> $)</p>\n\n\n\n<p><strong>9 We can finally see how animals see the world around us</strong><br>A new video system is unveiling their secrets. (<a href=\"https://www.nytimes.com/2024/01/23/science/animals-vision-video.html\">NYT</a> $)</p>\n\n\n\n<p><strong>10 This space tech company is experimenting with inflatable habitats</strong><br>By pushing them to their absolute pressure limits. (<a href=\"https://arstechnica.com/space/2024/01/sierra-space-is-blowing-up-stuff-to-prove-inflatable-habitats-are-safe/\">Ars Technica</a>)</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Quote of the day</strong></p>\n\n\n\n<p class=\"has-large-font-size\"><strong>“We surely want to avoid the situation turning into a FURBYGATE. :)”</strong></p>\n\n\n\n<p>—An NSA employee discusses the potential spying dangers presented by electronic Furby toys in the late 90s in internal documents seen by <a href=\"https://www.404media.co/these-are-the-notorious-nsa-furby-documents-showing-spy-agency-freaking-out-about-childrens-toy/\">404 Media</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The big story</strong></p>\n\n\n\n<p><strong>My new Turing test would see if AI can make $1 million</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://www.technologyreview.com/2023/07/14/1076296/mustafa-suleyman-my-new-turing-test-would-see-if-ai-can-make-1-million/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*#:~:text=Artificial%20intelligence-,Mustafa%20Suleyman:%20My%20new%20Turing%20test%20would%20see%20if%20AI,more%20telling%20than%20making%20money?&amp;text=AI%20systems%20are%20increasingly%20everywhere,powerful%20almost%20by%20the%20day.\"><img decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/aVcQQ0bhP7BwIROOQ_CU-0zo8eKHvP8uxvkcUhFyKlvyJsT6Mzl1whfOdfTx0bfLhpPAxz33eo5Sx1Xt8_2lcrRw2OG1p3Zu5zhLkv5XcbuyGEKMJRczr4KKaB7YMEhfchnZb_i0h4417jOtlssjnT4\" alt=\"\"/></a></figure>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2023/07/14/1076296/mustafa-suleyman-my-new-turing-test-would-see-if-ai-can-make-1-million/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*#:~:text=Artificial%20intelligence-,Mustafa%20Suleyman:%20My%20new%20Turing%20test%20would%20see%20if%20AI,more%20telling%20than%20making%20money?&amp;text=AI%20systems%20are%20increasingly%20everywhere,powerful%20almost%20by%20the%20day.\"></a><strong>July 2023</strong></p>\n\n\n\n<p><em>—Mustafa Suleyman is the co-founder and CEO of Inflection AI and a venture partner at Greylock, a venture capital firm. Before that, he co-founded DeepMind, one of the world’s leading artificial intelligence companies.</em></p>\n\n\n\n<p>AI systems are increasingly everywhere and are becoming more powerful almost by the day. But how can we know if a machine is truly “intelligent”? For decades this has been defined by the Turing test, which argues that an AI that’s able to replicate language convincingly enough to trick a human into thinking it was also human should be considered intelligent.</p>\n\n\n\n<p>But there’s now a problem: the Turing test has arguably already been surpassed. We need something better. I propose the Modern Turing Test. It would give AIs a simple instruction:  “Go make $1 million on a retail web platform in a few months with just a $100,000 investment.” <a href=\"https://www.technologyreview.com/2023/07/14/1076296/mustafa-suleyman-my-new-turing-test-would-see-if-ai-can-make-1-million/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*#:~:text=Artificial%20intelligence-,Mustafa%20Suleyman:%20My%20new%20Turing%20test%20would%20see%20if%20AI,more%20telling%20than%20making%20money?&amp;text=AI%20systems%20are%20increasingly%20everywhere,powerful%20almost%20by%20the%20day.\">Read the full story</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>We can still have nice things</strong></p>\n\n\n\n<p><em>A place for comfort, fun and distraction in these weird times. (Got any ideas? </em><a href=\"mailto:rhiannon.williams@technologyreview.com\"><em>Drop me a line</em></a><em> or </em><a href=\"https://twitter.com/yannon_\"><em>tweet &#8217;em at me</em></a><em>.)</em></p>\n\n\n\n<p>+ Italy’s former premier Silvio Burlusconi had… <a href=\"https://www.theguardian.com/world/2023/dec/31/silvio-berlusconi-art-collection-italy-lucas-vianini-curator\"><em>interesting</em> taste in art</a>.<br>+ Looking to get into a new hobby? <a href=\"https://www.businessinsider.com/how-to-find-a-hobby-work-life-balance-2024-1\">Here’s</a> how to get started.<br>+ Take a minute to reflect on the ever-changing saga of <a href=\"https://www.thedriftmag.com/can-the-sireniform-speak/\">the Little Mermaid</a>.<br>+ Tune into the soulful sounds of someone making <a href=\"http://listen.hatnote.com/\">edits to a Wikipedia page</a>.<br>+ A trip to <a href=\"https://www.wallpaper.com/travel/what-to-do-in-helsinki-guide\">Helsinki</a> would be pretty great right now.</p>\n"}},{"title":"How China is regulating robotaxis","link":"https://www.technologyreview.com/2024/01/24/1086989/china-regulation-robotaxi-autonomous-driving/","dc:creator":{"#cdata-section":"Zeyi Yang"},"pubDate":"Wed, 24 Jan 2024 11:00:00 +0000","category":[{"#cdata-section":"Artificial intelligence"},{"#cdata-section":"App"},{"#cdata-section":"artificial intelligence"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1086989"},"description":{"#cdata-section":"This story first appeared in China Report, MIT Technology Review’s newsletter about technology in China. Sign up to receive it in your inbox every Tuesday. Not many technologies have had such a roller-coaster ride in the past year as robotaxis. In just a few months they went from San Francisco’s new darling to a national scandal after&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This story first appeared in China Report, MIT Technology Review’s newsletter about technology in China. </em><a href=\"https://forms.technologyreview.com/newsletters/tech-control-china-report/?_ga=2.51846569.1436992670.1667238728-1045050203.1649777307\"><em>Sign up</em></a><em> to receive it in your inbox every Tuesday.</em></p>\n\n\n\n<p>Not many technologies have had such a roller-coaster ride in the past year as robotaxis. In just a few months they went from San Francisco’s new darling to a national scandal after Cruise, one of the leading companies in the business, was involved in a serious accident.</p>\n\n\n\n<p>This morning, <a href=\"https://www.technologyreview.com/2024/01/23/1086936/whats-next-for-robotaxis-2024/\">I published a story</a> looking at where the industry is going in the new year. Other than rebuilding the public trust that was lost last year, robotaxi companies are also struggling to find a realistic business model. It’s not a moonshot idea anymore, but it’s also not quite a feasible business yet.</p>\n\n\n\n<p>The piece mostly focuses on the situation in the US, which is experiencing the most uncertainty because of that Cruise incident. But obviously, I’ve also been paying close attention to Chinese companies in this field. <strong>And this newsletter will be a crash course to bring you up to date on how the Chinese peers of Cruise and Waymo are doing now.</strong></p>\n\n\n\n<p>The US and China have been on similar timelines when it comes to autonomous-driving technology.</p>\n\n\n\n<p>It’s hard to make a direct comparison because these companies don’t usually operate in the same market. Cruise and Waymo don’t exist in China at all; while some Chinese companies have set up research labs in the US and have been testing their vehicles here, they have no plan to compete in the US domestic market.&nbsp;</p>\n\n\n\n<p>But there are so many developments happening in parallel. In the last two years, companies in both countries obtained permits to remove safety operators from the cars, charge passengers for the ride, expand their services to airports, and extend their operating hours to 24/7.&nbsp;</p>\n\n\n\n<p><strong>What it means is that robotaxis are nearly as accessible in China right now as they are in the US. If you are determined to try them out, there are several Chinese cities where you can find these self-driving vehicles on the streets—although you still can’t really use them for a regular commute.</strong></p>\n\n\n\n\n\n<p>And now, American and Chinese robotaxi companies are both under pressure to start making money. Considering the advanced hardware and software in a robotaxi and the human intervention still needed to operate and maintain them, robotaxi rides have much higher costs than taxi rides today, which makes the business hard to scale up. </p>\n\n\n\n<p>I first heard about this in the summer of 2023, when I noticed that <a href=\"https://www.technologyreview.com/2023/08/15/1077895/china-city-race-autonomous-driving\">Chinese carmakers had suddenly started aggressively rolling out autopilot functions</a> (similar to Tesla’s FSD). One of the reasons behind that push turned out to be that Chinese autonomous-driving companies wanted to generate quicker revenues. Instead of waiting for fully autonomous vehicles, like robotaxis, to make money by themselves, they’d rather package the technologies into driver-assistance systems and sell to the market now.</p>\n\n\n\n<p>One difference between the robotaxi rollouts in the two countries has to do with regulation. Chinese regulators are known for their hands-on approach and the tendency to rein in new technologies early. Robotaxis have been no exception.</p>\n\n\n\n<p><strong>In December 2023, China’s first regulation on commercial operation of autonomous vehicles went into effect. </strong>It sets some ground rules for different kinds of vehicles: roboshuttles or robotrucks still need to have in-car safety operators, while robotaxis can use remote operators. The ratio of robotaxis to remote operators cannot exceed 3:1, and operators need to pass certain skill tests. There are also rules specifying what data the companies need to report when accidents happen.</p>\n\n\n\n<p>Like any first stab at regulations, the document still seems relatively abstract at this point. But it does put China one step ahead of the US, where national legislation on robotaxis could take much longer to come, and it’s the individual states taking all the steps for now. It will be interesting to see how the different regulatory approaches will affect the industry in the future.</p>\n\n\n\n<p><strong>On that note, we might be able to see American and Chinese robotaxi companies compete directly soon—not on their home turfs, but in the Middle East.</strong> In Abu Dhabi, the capital city of the United Arab Emirates, robotaxis made by the Chinese company WeRide <a href=\"https://www.youtube.com/watch?v=p5aqHtLcwHE\">have been carrying out free test rides</a>. Just a two-hour drive away in Dubai, <a href=\"https://www.reuters.com/business/autos-transportation/cruise-testing-continues-japan-dubai-even-vehicles-parked-us-2023-11-17/\">robotaxis made by Cruise are also being tested</a>, even though the same vehicles have been pulled off the roads in the US.&nbsp;</p>\n\n\n\n<p>Maybe we will soon be able to ride a Chinese robotaxi and an American robotaxi on the same day. If you get the chance to do that, definitely let me know how it goes!</p>\n\n\n\n<p><em>Do you think the Chinese hands-on regulatory approach will benefit the industry or not? Tell me your thoughts at </em><a href=\"mailto:zeyi@technologyreview.com\"><em>zeyi@technologyreview.com</em></a><em>.</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Catch up with China</strong></h3>\n\n\n\n<p>1. China&#8217;s population declined for the second year in a row, according to new data released by the government. (<a href=\"https://www.nbcnews.com/news/world/china-population-declines-second-consecutive-year-rcna134054\">NBC News</a>)</p>\n\n\n\n<p>2. AI scientists and policy experts from the US and China held secretive talks in Geneva last year to align their views on AI safety. (<a href=\"https://www.ft.com/content/f87b693f-9ba3-4929-8b95-a296b0278021\">Financial Times $</a>)</p>\n\n\n\n<p>3. More than one million Chinese people have emigrated since 2019, transforming the communities in neighboring Asian countries. (<a href=\"https://www.bloomberg.com/news/features/2024-01-17/china-migration-wave-arrives-in-unexpected-places-after-pandemic?sref=E9Urfma4\">Bloomberg $</a>)</p>\n\n\n\n<p>4. China&#8217;s internet regulator is investigating what data Shein could share overseas as the fast-fashion company prepares to go public in the US. (<a href=\"https://www.wsj.com/world/china/fashion-giant-faces-new-ipo-hitch-chinas-cybersecurity-police-70c57561\">Wall Street Journal $</a>)</p>\n\n\n\n<p>5. CJPL, a Chinese research lab hunting for dark matter, just opened its second phase and became the world’s deepest and largest underground lab. (<a href=\"https://www.nature.com/articles/d41586-024-00166-w\">Nature</a>)</p>\n\n\n\n<p>6. The Chinese government vows to rein in the overproduction of electric cars and the &#8220;disorderly competition behaviors&#8221; among domestic EV companies. (<a href=\"https://www.ft.com/content/bf4aa7c8-5eb9-4927-909f-b37d18674988\">Financial Times $</a>)</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lost in translation</strong></h3>\n\n\n\n<p>Once determined to reduce its reliance on coal, China is ramping up coal production and consumption again. According to the Chinese publication <em>Caixin Weekly</em>, China <a href=\"https://companies.caixin.com/2024-01-17/102157440.html\">produced 4.66 billion tons of coal in 2023</a>, reaching a historical peak; China also <a href=\"https://www.caixin.com/2024-01-13/102156180.html\">imported 0.47 billion tons of coal in 2023</a>, a 61.8% increase from the year before and another historical high.&nbsp;</p>\n\n\n\n<p>In 2020, the Chinese government was taking measures to phase out coal power plants. But the war between Russia and Ukraine pushed up the global energy price and left China uncertain whether shifting to renewable energy could disrupt its economic stability. As a result, more coal power plants have entered construction in the past few years in China, causing a rebound in coal consumption and production.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>One more thing</strong> </h3>\n\n\n\n<p>Today in gadgets nobody asked for: <a href=\"https://chinadigitaltimes.net/2024/01/xi-branded-power-bank-speaker-provides-two-kinds-of-positive-energy/\">A Chinese party-owned outlet designed a power bank–slash–speaker</a>. Called the “‘Xi Jinping’s “The Governance of China” Volumes 1-4’ Ideology Power Bank,” the speaker reads you 72 political essays explaining the Chinese president’s ideology while it also charges your phone. What, you want to buy one? Sorry, it’s exclusively given to party cadres and government employees.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1269\" height=\"818\" src=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/power-bank-speaker.jpeg?w=1269\" alt=\"A red power bank and speaker with the Chinese characters &quot;‘Xi Jinping’s “The Governance of China” Volumes 1-4’ Ideology Power Bank&quot; printed on it.\" class=\"wp-image-1086992\" srcset=\"https://wp.technologyreview.com/wp-content/uploads/2024/01/power-bank-speaker.jpeg 1269w, https://wp.technologyreview.com/wp-content/uploads/2024/01/power-bank-speaker.jpeg?resize=300,193 300w, https://wp.technologyreview.com/wp-content/uploads/2024/01/power-bank-speaker.jpeg?resize=768,495 768w\" sizes=\"(max-width: 1269px) 100vw, 1269px\" /><div class=\"image-credit\">GUANGMING ONLINE</div>\n</figure>\n</div>"}},{"title":"The Download: disputes over green mining, and what’s next for robotaxis","link":"https://www.technologyreview.com/2024/01/23/1086951/the-download-disputes-over-green-mining-and-whats-next-for-robotaxis/","dc:creator":{"#cdata-section":"Rhiannon Williams"},"pubDate":"Tue, 23 Jan 2024 13:10:00 +0000","category":{"#cdata-section":"The Download"},"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1086951"},"description":{"#cdata-section":"This is today&#8217;s edition of&#160;The Download,&#160;our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology. This town’s mining battle reveals the contentious path to a cleaner future In June last year, Talon, an exploratory mining company, submitted a proposal to Minnesota state regulators to begin digging up as&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>This is today&#8217;s edition of&nbsp;<a href=\"https://forms.technologyreview.com/newsletters/briefing-the-download/?_ga=2.179569122.736533416.1649661040-405833893.1649413289\">The Download</a></em>,<em>&nbsp;our weekday newsletter that provides a daily dose of what&#8217;s going on in the world of technology.</em></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>This town’s mining battle reveals the contentious path to a cleaner future<br><br></strong>In June last year, Talon, an exploratory mining company, submitted a proposal to Minnesota state regulators to begin digging up as much as 725,000 metric tons of raw ore per year, mainly to unlock the rich and lucrative reserves of high-grade nickel in the bedrock.</p>\n\n\n\n<p>Talon is striving to distance itself from the mining industry’s dirty past, portraying its plan as a clean, friendly model of modern mineral extraction. It proclaims the site will help to power a greener future for the US by producing the nickel needed to manufacture batteries for electric cars and trucks, but with low emissions and light environmental impacts.</p>\n\n\n\n<p>But as the company has quickly discovered, a lot of locals aren’t eager for major mining operations near their towns. <a href=\"https://www.technologyreview.com/2024/01/23/1086458/critical-minerals-nickel-inflation-reduction-act-environmental-dangers/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—James Temple</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What’s next for robotaxis in 2024</strong></p>\n\n\n\n<p>In 2023, it almost felt as if the promise of robotaxis was soon to be fulfilled. Hailing a robotaxi had briefly become the new trendy thing to do in San Francisco.&nbsp;</p>\n\n\n\n<p>However, that dream crashed and burned in October, when a serious accident in downtown San Francisco involving a vehicle belonging to Cruise, one of the leading US robotaxi companies, cast a long shadow over the technology’s future. </p>\n\n\n\n<p>Despite that, other robotaxi companies across the world are still forging ahead. Zeyi Yang, our China reporter, talked to experts about how to understand the challenges facing the robotaxi industry. <a href=\"https://www.technologyreview.com/2024/01/23/1086936/whats-next-for-robotaxis-2024/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Here’s how they expect it to change in 2024</a>.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Why does AI being good at math matter?</strong></p>\n\n\n\n<p>Last week the AI world was buzzing over a new paper in Nature from Google DeepMind, in which the lab managed to create an AI system that can solve <a href=\"https://www.technologyreview.com/2024/01/17/1086722/google-deepmind-alphageometry/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">complex geometry problems</a>.<br><br>This is the second time in recent months that the AI world got all excited about math. The rumor mill went into overdrive last November, when there were reports that the boardroom drama at OpenAI, which saw CEO Sam Altman temporarily ousted, was caused by a new powerful AI breakthrough. It was reported that the AI system in question was called Q* and could solve <a href=\"https://www.technologyreview.com/2023/11/27/1083886/unpacking-the-hype-around-openais-rumored-new-q-model/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">complex math calculations</a>.&nbsp;</p>\n\n\n\n<p>You don’t need to be really into math to see why this is potentially very exciting. Math is really, really hard for AI models. Complex math requires sophisticated reasoning skills, and many AI researchers believe that the ability to crack it could herald more powerful and intelligent systems. <a href=\"https://www.technologyreview.com/2024/01/23/1086944/why-does-ai-being-good-at-math-matter/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><strong>This story is from The Algorithm, our weekly newsletter keeping you up to date on all the biggest AI developments. </strong><a href=\"https://forms.technologyreview.com/newsletters/ai-demystified-the-algorithm/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"><strong>Sign up</strong></a><strong> to receive it in your inbox every Monday.</strong></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Vote for the 11th breakthrough technology of 2024</strong></p>\n\n\n\n<p>Throughout January, we’ve been showcasing the 10 breakthrough technologies poised to have a real impact on the world—covering everything from Twitter killers to weight-loss drugs. But now we need your help to help select a bonus 11th technology.&nbsp;</p>\n\n\n\n<p>Check out the <a href=\"https://www.technologyreview.com/2024/01/08/1085094/10-breakthrough-technologies-2024/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*#breakthrough-technology-poll\">shortlist</a> (and the <a href=\"https://www.technologyreview.com/2024/01/08/1085094/10-breakthrough-technologies-2024/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">rest of the list</a>) and vote in our poll to confirm your choice—we’ll be unveiling the winner in April.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The must-reads</strong></p>\n\n\n\n<p><em>I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.</em></p>\n\n\n\n<p><strong>1 Fake Joe Biden robocalls urged New Hampshire residents not to vote</strong><br>The incident is being treated as an attempt at voter suppression. (<a href=\"https://www.nbcnews.com/politics/2024-election/fake-joe-biden-robocall-tells-new-hampshire-democrats-not-vote-tuesday-rcna134984\">NBC News</a>)<br>+ <em>The Trump campaign has denied any involvement. </em>(<a href=\"https://nymag.com/intelligencer/2024/01/who-is-behind-the-fake-biden-robocall-in-new-hampshire.html\">NY Mag</a> $)<br>+ <em>It could be the start of a new wave of political deepfakes ahead of the US election. </em>(<a href=\"https://www.nytimes.com/2024/01/22/business/media/biden-robocall-ai-new-hampshire.html\">NYT</a> $)<br>+ <em>Six ways that AI could change politics. </em>(<a href=\"https://www.technologyreview.com/2023/07/28/1076756/six-ways-that-ai-could-change-politics/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>2 Google is turning its back on ambitious moonshots&nbsp;</strong><br>The projects are wildly expensive, and don’t tend to produce viable businesses. (<a href=\"https://www.bloomberg.com/news/articles/2024-01-22/google-layoffs-saga-continues-as-alphabet-s-x-cuts-dozens-of-jobs-seeks-funds\">Bloomberg</a> $)<br><strong><br>3 The world’s first malaria vaccine program for children has begun</strong><br>But experts worry how many children in high-risk areas will actually receive it. (<a href=\"https://www.wired.com/story/malaria-vaccine-routine-childhood-camaroon/\">Wired</a> $)<br>+ <em>The new malaria vaccine might not be perfect, but it will save countless lives. </em>(<a href=\"https://www.technologyreview.com/2022/02/23/1045131/malaria-vaccine-save-lives/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>4 A man claims Macy’s facial recognition led to him being assaulted in jail</strong><br>The technology’s accuracy has been questioned in multiple lawsuits. (<a href=\"https://www.washingtonpost.com/technology/2024/01/22/facial-recognition-wrongful-identification-assault/\">WP</a> $)<br>+ <em>Police are using the technology to try and crack cold cases. </em>(<a href=\"https://www.wired.com/story/parabon-nanolabs-dna-face-models-police-facial-recognition/\">Wired</a> $)<br>+ <em>The movement to limit face recognition tech might finally get a win. </em>(<a href=\"https://www.technologyreview.com/2023/07/20/1076539/face-recognition-massachusetts-test-police/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>5 It’s pretty unlikely a printer cartridge could contain a computer virus</strong><br>But HP’s CEO is convinced it’s a real and present danger. (<a href=\"https://arstechnica.com/gadgets/2024/01/hp-ceo-blocking-third-party-ink-from-printers-fights-viruses/\">Ars Technica</a>)</p>\n\n\n\n<p><strong>6 We’re learning more about China’s shadowy spy agency<br></strong>Its public profile is growing as it steps up its efforts to warn the public about the dangers of foreign espionage. (<a href=\"https://www.ft.com/content/f78c7243-2ff5-4f77-93d0-91c20f6b5548\">FT</a> $)</p>\n\n\n\n<p><strong>7 TikTok’s illness influencers are sick and tired<br></strong>While documenting their conditions can help with medical bills, it’s exhausting. (<a href=\"https://www.vox.com/the-highlight/2023/12/4/23984175/tiktok-illness-influencers\">Vox</a>)<br>+ <em>Dementia content gets billions of views on TikTok. Whose story does it tell? </em>(<a href=\"https://www.technologyreview.com/2022/02/16/1045322/dementia-consent-tiktok-online-ethics/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)</p>\n\n\n\n<p><strong>8 The first chickpeas have been grown in moon dust</strong>&nbsp;<br>It’s the sort of development that could make long-term lunar stays more feasible. (<a href=\"https://www.newscientist.com/article/2413611-chickpeas-grown-in-moon-dust-for-the-first-time/\">New Scientist</a> $)<br>+ <em>What’s next for the moon. </em>(<a href=\"https://www.technologyreview.com/2023/07/24/1076673/whats-next-for-the-moon/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">MIT Technology Review</a>)<strong><br><br>9 Gummy vitamins rarely deliver on their promises</strong><br>Their less-tasty counterparts are lower in sugar, and deliver their benefits more reliably. (<a href=\"https://www.theatlantic.com/health/archive/2024/01/gummy-supplements-vitamins-sugar-overdose/677215/\">The Atlantic</a> $)<br><br><strong>10 Rats love taking selfies <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f400.png\" alt=\"🐀\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /><br></strong>Or could it just be the sugar reward they received for snapping the shutter? (<a href=\"https://www.nytimes.com/2024/01/23/science/photography-rats-selfies.html\">NYT</a> $)</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Quote of the day</strong></p>\n\n\n\n<p class=\"has-large-font-size\"><strong>“Some members of Congress prefer to opine about aliens to the press rather than get an evidence-based briefing on the matter.”&nbsp;</strong></p>\n\n\n\n<p>—Sean Kirkpatrick, the former head of the Pentagon’s division dedicated to investigating extraterrestrials, explains his decision to step down from the group, <a href=\"https://www.vice.com/en/article/wxjydq/former-pentagon-ufo-investigator-is-pissed-because-congress-believes-in-conspiracy-theories\">Motherboard</a> reports.</p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>The big story</strong></p>\n\n\n\n<p><strong>How a tiny Pacific Island became the global capital of cybercrime</strong></p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://www.technologyreview.com/2023/11/02/1082798/tiny-pacific-island-global-capital-cybercrime/?truid=*|LINKID|*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*|SUBCLASS|*&amp;utm_content=*|DATE:m-d-Y|*\"><img decoding=\"async\" src=\"https://lh7-us.googleusercontent.com/G9ojzKB9VlOAoj4zjF7uZkeOWt16XxR1q4GUzkbYfpf5iNPO90v18zTlfOv7uXB5g73N3WLRenB8r09oXp3DKmnJzlF9ewOglQRmCwba-wWKK0HQaiP-ZPv_yGTqrjO8Mast8fEZa7SNHnYOTkr-qII\" alt=\"\"/></a></figure>\n\n\n\n<p><a href=\"https://www.technologyreview.com/2023/11/02/1082798/tiny-pacific-island-global-capital-cybercrime/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\"></a><strong>November 2023</strong><br><br>Tokelau, a string of three isolated atolls strung out across the Pacific, is so remote that it was the last place on Earth to be connected to the telephone—only in 1997. Just three years later, the islands received a fax with an unlikely business proposal that would change everything.</p>\n\n\n\n<p>It was from an early internet entrepreneur from Amsterdam, named Joost Zuurbier. He wanted to manage Tokelau’s country-code top-level domain, or ccTLD—the short string of characters that is tacked onto the end of a URL—in exchange for money.</p>\n\n\n\n<p>In the succeeding years, tiny Tokelau became an unlikely internet giant—but not in the way it may have hoped. Until recently, its .tk domain had more users than any other country’s: a staggering 25 million—but the vast majority were spammers, phishers, and cybercriminals.</p>\n\n\n\n<p>Now the territory is desperately trying to clean up .tk. Its international standing, and even its sovereignty, may depend on it. <a href=\"https://www.technologyreview.com/2023/11/02/1082798/tiny-pacific-island-global-capital-cybercrime/?truid=*%7CLINKID%7C*&amp;utm_source=the_download&amp;utm_medium=email&amp;utm_campaign=the_download.unpaid.engagement&amp;utm_term=*%7CSUBCLASS%7C*&amp;utm_content=*%7CDATE:m-d-Y%7C*\">Read the full story</a>.</p>\n\n\n\n<p><em>—Jacob Judah</em></p>\n\n\n\n<p></p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>We can still have nice things</strong></p>\n\n\n\n<p><em>A place for comfort, fun and distraction in these weird times. (Got any ideas? </em><a href=\"mailto:rhiannon.williams@technologyreview.com\"><em>Drop me a line</em></a><em> or </em><a href=\"https://twitter.com/yannon_\"><em>tweet &#8217;em at me</em></a><em>.)</em></p>\n\n\n\n<p>+ If you catch a glimpse of bigfoot while you’re out and about, I’m afraid to say it <a href=\"https://arstechnica.com/science/2024/01/study-finds-bigfoot-sightings-correlate-with-black-bear-populations/\">could just be a black bear</a>.<br>+ Novak Djokovic has a special relationship with a <a href=\"https://www.theguardian.com/sport/2024/jan/20/novak-djokovic-has-a-special-relationship-with-an-australian-tree-naturally-i-had-to-find-it\">tree</a> in Melbourne, as you do. <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f333.png\" alt=\"🌳\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /><br>+ <a href=\"https://twitter.com/historyinmemes/status/1749267893131280653\">Voldemort’s laugh</a> across different languages is highly lol-worthy.<br>+ If you didn’t get fed up of making <a href=\"https://www.goodhousekeeping.com/food-recipes/cooking/a32416409/how-to-make-a-sourdough-starter/\">sourdough</a> in lockdown, here’s a refresher on how to get started.<br>+ These <a href=\"https://www.thrillist.com/travel/nation/most-beautiful-places-to-visit-things-to-do-in-japan\">Japanese sites</a> are simply breathtaking.</p>\n\n\n\n<p></p>\n\n\n\n<p><em>Correction: The story has been updated to clarify that Cruise’s October accident was not fatal. The victim was hospitalized with serious injuries but survived.</em></p>\n"}},{"title":"What’s next for robotaxis in 2024","link":"https://www.technologyreview.com/2024/01/23/1086936/whats-next-for-robotaxis-2024/","dc:creator":{"#cdata-section":"Zeyi Yang"},"pubDate":"Tue, 23 Jan 2024 11:00:00 +0000","category":[{"#cdata-section":"Artificial intelligence"},{"#cdata-section":"App"},{"#cdata-section":"artificial intelligence"},{"#cdata-section":"What's Next in Tech"}],"guid":{"@isPermaLink":"false","#text":"https://www.technologyreview.com/?p=1086936"},"description":{"#cdata-section":"MIT Technology Review’s What’s Next series looks across industries, trends, and technologies to give you a first look at the future. You can read the rest of our series&#160;here. In 2023, it almost felt as if the promise of robotaxis was soon to be fulfilled. Hailing a robotaxi had briefly become the new trendy thing&#8230;"},"content:encoded":{"#cdata-section":"\n<p><em>MIT Technology Review’s What’s Next series looks across industries, trends, and technologies to give you a first look at the future. You can read the rest of our series<strong>&nbsp;<a href=\"https://www.technologyreview.com/tag/whats-next-in-tech/\">here</a></strong>.</em></p>\n\n\n\n<p>In 2023, it almost felt as if the promise of robotaxis was soon to be fulfilled. Hailing a robotaxi had briefly become the new trendy thing to do in San Francisco, as simple and everyday as ordering a delivery via app. However, that dream crashed and burned in October, when a serious accident in downtown San Francisco involving a vehicle belonging to Cruise, one of the leading US robotaxi companies, ignited distrust, casting a long shadow over the technology’s future. </p>\n\n\n\n<p>Following that and another accident, the state of California suspended Cruise’s operations there indefinitely, and the National Highway Traffic Safety Administration launched an investigation of the company. Since then, Cruise has pulled all its vehicles from the road and laid off 24% of its workforce.</p>\n\n\n\n<p>Despite that, other robotaxi companies are still forging ahead. In half a dozen cities in the US and China, fleets of robotaxis run by companies such as Waymo and Baidu are still serving anyone who would like to try them. Regulators in places like San Francisco, Phoenix, Beijing, and Shanghai now allow these vehicles to drive without human safety operators.&nbsp;</p>\n\n\n\n<p>However, other perils loom. Robotaxi companies need to make a return on the vast sums that have been invested into getting them up and running. Until robotaxis become cheaper, they can’t meaningfully compete with conventional taxis and Uber. Yet at the same time, if companies try to increase adoption too fast, they risk following in Cruise’s footsteps. Waymo, another major robotaxi operator, has been going more slowly and cautiously. But no one is immune to accidents.&nbsp;</p>\n\n\n\n<p>“If they have an accident, it’s going to be big news, and it will hurt everyone,” says Missy Cummings, a professor and director of the Mason Autonomy and Robotics Center at George Mason University. “That’s the big lesson of this year. The whole industry is on thin ice.”</p>\n\n\n\n<p><em>MIT Technology Review</em> talked to experts about how to understand the challenges facing the robotaxi industry. Here’s how they expect it to change in 2024.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Money, money, money</strong></h3>\n\n\n\n<p>After years of testing robotaxis on the road, companies have demonstrated that a version of the autonomous driving technology is ready today, though with some heavy asterisks. They operate only within strict, pre-set geographical boundaries; while some cars no longer have a human operator in the driver’s seat, they still require remote operators to take control in case of emergencies; and they are limited to warmer climates, because snow can be challenging for the cars’ cameras and sensors.&nbsp;</p>\n\n\n\n<p>“From what has been disclosed publicly, these systems still rely on some remote human supervision to operate safely. This is why I am calling them automated rather than autonomous,” says Ramanarayan Vasudevan, an associate professor of robotics and mechanical engineering at the University of Michigan.</p>\n\n\n\n\n\n<p>The problem is that this version of automated driving is much more costly than traditional taxis. A robotaxi ride can be “several orders of magnitude more expensive than what it costs other taxi companies,” he says. “Unfortunately I don’t think the technology will dramatically change in the coming year to really drive down that cost.”</p>\n\n\n\n<p>That higher ticket price will inevitably suppress demand. If robotaxis want to keep customers—not just those curious to try it out for the first time—they need to make the service cheaper than other forms of transportation.&nbsp;</p>\n\n\n\n<p>Bryant Walker Smith, an associate professor of law at the University of South Carolina, echoes this concern. “These companies are competing with an Uber driver who, in any estimate, makes less than minimum wage, has a midpriced car, and probably maintains it themselves,” he says.&nbsp;</p>\n\n\n\n<p>By way of contrast, robotaxis are expensive vehicles packed full of cameras, sensors, and advanced software systems, and they require constant monitoring and help from humans. It’s almost impossible for them to compete with ride-sharing services yet, at least until a lot more robotaxis can hit the road.</p>\n\n\n\n<p>And as robotaxi companies keep burning the cash from investors, concerns are growing that they are not getting enough in return for their vast expenditure, says Smith. That means even more pressure to produce results, while balancing the potential revenues and costs.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The resistance to scaling up</strong></h3>\n\n\n\n<p>In the US, there are currently four cities where people can take a robotaxi: San Francisco, Phoenix, Los Angeles, and Las Vegas.&nbsp;</p>\n\n\n\n<p>The terms differ by city. Some require you to sign up for a waitlist first, which could take months to clear, while others only operate the vehicles in a small area.</p>\n\n\n\n<p>Expanding robotaxi services into a new city involves a huge upfront effort and cost: the new area has to be thoroughly mapped (and that map has to be kept up to date), and the operator has to buy more autonomous vehicles to keep up with demand.&nbsp;</p>\n\n\n\n<p>Also, cars whose autonomous systems are geared toward, say, San Francisco have a limited ability to adapt to Austin, says Cummings, who’s researching how to measure this type of adaptability. “If I’m looking at that as a basic research question, it probably means the companies haven’t learned something important yet,” she says.&nbsp;</p>\n\n\n\n<p>These factors have combined to cause renewed concern about robotaxis’ profitability. Even after Cruise removed its vehicles from the road, Waymo, the other major robotaxi company in the US, hasn’t jumped in to fill the vacuum. Since each robotaxi ride currently costs the company more money than it makes, there’s hardly an appetite for endless expansion.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Worldwide development</strong></h3>\n\n\n\n<p>It’s not just the US where robotaxis are being researched, tested, and even deployed.&nbsp;</p>\n\n\n\n<p>China is the other leader right now, and it is proceeding on roughly the same timeline as the US. In 2023, a few cities in China, including Beijing and Shanghai, received government clearance to run robotaxies on the road without any safety operators. However, the cars can only run in certain small and relatively remote areas of the cities, making the service tricky to access for most people.</p>\n\n\n\n\n\n<p>The Middle East is also quickly gaining a foothold in the sector, with the help of Chinese and American companies. Saudi Arabia <a href=\"https://electrek.co/2023/10/25/pony-ai-secures-100-million-investment-autonomous-rides-neom-middle-east/\">invested $100 million</a> in the Chinese robotaxi startup Pony.AI to bring its cars to Neom, a futuristic city it’s constructing that will supposedly be built with all the latest technologies. Meanwhile, Dubai and Abu Dhabi <a href=\"https://www.globalfleet.com/en/smart-mobility/africa-middle-east/features/successful-robotaxi-trial-puts-abu-dhabi-ahead-dubai?a=FJA05&amp;t%5B0%5D=WeRide&amp;curl=1\">are competing with each other</a> to become the first city in the Middle East to pilot driverless vehicles on the road, with vehicles made by Cruise and the Chinese company WeRide.</p>\n\n\n\n<p>Chinese robotaxi companies face the same central challenge as their US peers: proving their profitability. A push to monetize permeated the Chinese industry in 2023 and launched a new trend: <a href=\"https://www.technologyreview.com/2023/08/15/1077895/china-city-race-autonomous-driving/\">Chinese self-driving companies are now racing to sell their autopilot systems</a> to other companies. This lets them make some quick cash by repackaging their technologies into less advanced but more in-demand services, like urban autopilot systems that can be sold to carmakers.</p>\n\n\n\n<p>Meanwhile, robotaxi development in Europe has lagged behind, partly because countries there prefer deploying autonomous vehicles in mass transit. While Germany, <a href=\"https://www.technologyreview.com/2023/09/14/1079458/this-driverless-car-company-is-using-chatbots-to-make-its-vehicles-smarter/\">the UK</a>, and France have seen robotaxis running road tests, commercial operations remain a distant hope.&nbsp;</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lessons from Cruise’s fiasco</strong></h3>\n\n\n\n<p>Cruise’s dreadful experience points to one major remaining roadblock for robotaxis: they still sometimes behave erratically. When a human driver (in a non-autonomous vehicle) hit a pedestrian in San Francisco in October and drove away from the scene, a passing Cruise car then ran over the victim and dragged her 20 feet before stopping.&nbsp;</p>\n\n\n\n<p>“We are deeply concerned that more people will be killed, more first responders will be obstructed, more sudden stops will happen,” says Cathy Chase, president of Advocates for Highway and Auto Safety, an activist group based in Washington, DC. “We are not against autonomous vehicles. We are concerned about the unsafe deployment and a rush to the market at the expense of the traveling public.”</p>\n\n\n\n<p>These companies are simply not reporting enough data to show us how safe their vehicles are, she says. While they are required to submit data to the National Highway Traffic Safety Administration, the data is heavily redacted in the name of protecting trade secrets before it’s released to the public. Some federal bills proposed in the last year, which haven’t passed, could even lighten these reporting requirements, Chase says.</p>\n\n\n\n<p>“If there’s a silver lining in this accident, it’s that people were forced to reckon with the fact that these operations are not simple and not that straightforward,” Cummings says. It will likely cause the industry to rely more on remote human operators, something that could have changed the Cruise vehicle’s response in the October accident. But introducing more humans will further tip the balance away from profitability.</p>\n\n\n\n<p>Meanwhile, Cruise was accused by the California Public Utilities Commission of misleading the public and regulators about its involvement in the incident. “If we cannot trust these companies, then they have no businesses on our roads,” says Smith.&nbsp;</p>\n\n\n\n<p>A Cruise spokesperson told <em>MIT Technology Review</em> the company has no updates to share currently but pointed to <a href=\"https://getcruise.com/news/blog/2023/important-updates-from-cruise/\">a blog post from November</a> saying it had hired third-party law firms and technology consultants to review the accident and Cruise’s responses to the regulators. In a settlement proposal to CPUC, Cruise also offered to share more data, including “collision reporting as well as regular reports detailing incidents involving stopped AVs.”</p>\n\n\n\n<p>The future of Cruise remains unclear, and so does the company’s original plan to launch operations in several more cities soon. Meanwhile, though, Waymo is applying to expand its services in Los Angeles while taking its vehicles to the highways of Phoenix. Zoox, an autonomous-driving startup owned by Amazon, could launch commercial service in Las Vegas this year. For residents of these cities, more and more robotaxis may be on the road in 2024.</p>\n\n\n\n<p></p>\n\n\n\n<p><em>Correction: The story has been updated to clarify that Cruise’s October 2 accident was not fatal. The victim was hospitalized with serious injuries but survived.</em></p>\n"}}]}}}