{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Webroot Blog","atom:link":{"@href":"https://www.webroot.com/blog/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://www.webroot.com/blog","description":"Internet security threat updates and insights.","lastBuildDate":"Fri, 19 Jan 2024 19:30:05 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.1.4","image":{"url":"https://blog-en.webroot.com/wp-content/uploads/2018/01/webroot-favicon.png","title":"Webroot Blog","link":"https://www.webroot.com/blog","width":"32","height":"32"},"item":[{"title":"Uncover the nastiest malware of 2023","link":"https://www.webroot.com/blog/2023/10/25/uncover-the-nastiest-malware-of-2023/","dc:creator":{"#cdata-section":"Tyler Moffitt"},"pubDate":"Wed, 25 Oct 2023 14:59:44 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://wordpressblog.webroot.com/?p=32163"},"description":{"#cdata-section":"<p>Our annual analysis of the most notorious malware has arrived. As always, it covers the trends, malware groups, and tips for how to protect yourself and your organization. This post covers highlights of our analysis, including the rise of ransomware as a service (RaaS), the six nastiest malware groups, and the role of artificial intelligence [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/10/25/uncover-the-nastiest-malware-of-2023/\">Uncover the nastiest malware of 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>Our annual analysis of the most notorious malware has arrived. As always, it covers the trends, malware groups, and tips for how to protect yourself and your organization.</p>\n\n\n\n<p>This post covers highlights of our analysis, including the rise of ransomware as a service (RaaS), the six nastiest malware groups, and the role of artificial intelligence in both cybersecurity and cyberthreats.</p>\n\n\n\n<h2>Malware shifts to RaaS</h2>\n\n\n\n<p>To say cybercriminals have come a long way since their humble beginnings—when floppy disks were used to spread malware infections—is an understatement. Their tactics have evolved significantly over the years, with ransomware now the malware of choice for cybercriminals.</p>\n\n\n\n<p>The allure of ransomware is not surprising given the combination of financial gains and potential for anonymity. Never satisfied in their quest to scale operations and increase revenue potential, criminal actors have shifted their focus to a relatively new “business model” that is proving very successful—ransomware-as-a-service (RaaS). By removing the technical barriers for prospective affiliates, RaaS makes it easy for big players to grow their “enterprise.”</p>\n\n\n\n<h2>Who made this year’s malware list?</h2>\n\n\n\n<p>Topping this year’s nastiest malware is CI0p. This ransomware group made a name for itself with the MOVEit campaign, which drove up the average ransom payment to nearly three-quarters of a million dollars. To date, this campaign is&nbsp;known to have impacted&nbsp;more than 1,150 organizations and over 60 million individuals, <a rel=\"noreferrer noopener\" href=\"https://www.wired.com/story/moveit-breach-victims/\" data-type=\"URL\" data-id=\"https://www.wired.com/story/moveit-breach-victims/\" target=\"_blank\">putting its global cost at close to $11 billion</a>.</p>\n\n\n\n<p>Also on the list are four new ransomware gangs—Black Cat, Akira, Royal, and Black Basta—believed to be the next generations of previous big players. They join a familiar name on the list, Lockbit.</p>\n\n\n\n<p>We ranked these six malware groups accordingly:</p>\n\n\n\n<ol>\n<li>Cl0p, a RaaS platform, became famous following a series of cyberattacks that exploited a zero-day vulnerability in the MOVEit file transfer software developed by Progress Software.&nbsp;&nbsp;</li>\n\n\n\n<li>Black Cat, believed to be the successor to the REvil ransomware group, built its RaaS platform on the Rust programming language. Black Cat made headlines for taking down MGM Casino Resorts.&nbsp;</li>\n\n\n\n<li>Akira, presumed to be a descendant of Conti, primarily targets small- to medium-sized businesses. Most notably, Akira ransomware targeted Cisco virtual private network (VPN) products to breach corporate networks, steal data, and encrypt it.&nbsp;</li>\n\n\n\n<li>Royal, suspected heir to Ryuk, uses whitehat penetration testing tools to move laterally in an environment and gain control of the entire network. A unique partial encryption approach allows the threat actor to choose a specific percentage of data in a file to encrypt.</li>\n\n\n\n<li>Lockbit 3.0, a main stain on the list and last year’s winner, continues to wreak havoc. Now in its third epoch, Lockbit 3.0 is more modular and evasive than its predecessors. &nbsp;</li>\n\n\n\n<li>Black Basta, one of the most active RaaS threat actors, is considered to be yet another descendant of the Conti ransomware group. It has gained a reputation for targeting all types of industries.&nbsp;</li>\n</ol>\n\n\n\n<h2>An intelligent future: artificial intelligence and machine learning</h2>\n\n\n\n<p>For six years, the OpenText<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> Cybersecurity threat intelligence team has witnessed a steady increase in the number and sophistication of malware attacks—which show no signs of slowing down. Threat actors are creative and resourceful in their attempts to trick users and exploit software and computer vulnerabilities. And while the use of artificial intelligence (AI) and machine learning (ML) in cybersecurity is still in its early stages, it is rapidly evolving. This is good and bad news.</p>\n\n\n\n<p>AI and ML have the potential to make the world a safer place, but they could also be used for malicious purposes. Rather than taking a wait-and-see approach, businesses of every size must take steps to protect themselves and mitigate the risks.</p>\n\n\n\n<p>For a more detailed analysis of the 2023 malware landscape and tips from OpenText Cybersecurity threat experts on how to protect against ransomware attacks, visit: <a href=\"https://community.webroot.com/preview/article/1442?t=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ0b3BpY0lkIjoiMTQ0MiIsImNvbnRlbnRUeXBlIjoiYXJ0aWNsZSJ9.uj4ntz0MEXT27vicd9YSUBskiZx8zRkJB9nQ2ilFSWE\" target=\"_blank\" rel=\"noreferrer noopener\">Ask your question | Webroot Community</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/10/25/uncover-the-nastiest-malware-of-2023/\">Uncover the nastiest malware of 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"Building a Cyber Resilient Business: The Protection Layer","link":"https://www.webroot.com/blog/2023/09/07/building-a-cyber-resilient-business-the-protection-layer/","dc:creator":{"#cdata-section":"Olivia Pramas"},"pubDate":"Thu, 07 Sep 2023 15:27:07 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://wordpressblog.webroot.com/?p=32001"},"description":{"#cdata-section":"<p>Cybercrime is on the rise. The number of ransomware attacks has increased by 18%, while the worldwide volume of phishing attacks doubled to 500 million in 2022. Depending on the size of the business, one-third to two-thirds of businesses suffer malware attacks in any given year. And those attacks are costing companies a lot of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/09/07/building-a-cyber-resilient-business-the-protection-layer/\">Building a Cyber Resilient Business: The Protection Layer</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>Cybercrime is on the rise. The number of ransomware attacks has <a href=\"https://www.statista.com/statistics/1315826/ransomware-attacks-worldwide\" target=\"_blank\" rel=\"noreferrer noopener\">increased by 18%</a>, while the worldwide volume of phishing attacks <a href=\"https://www.kaspersky.com/about/press-releases/2023_the-number-of-phishing-attacks-doubled-to-reach-over-500-million-in-2022\" target=\"_blank\" rel=\"noreferrer noopener\">doubled to 500 million</a> in 2022. Depending on the size of the business, <a href=\"https://www.opentextcybersecurity.com/threat-report\" target=\"_blank\" rel=\"noreferrer noopener\">one-third to two-thirds of businesses</a> suffer malware attacks in any given year.</p>\n\n\n\n<p>And those attacks are costing companies a lot of money. In 2022, American businesses lost <a href=\"https://www.fbi.gov/contact-us/field-offices/springfield/news/internet-crime-complaint-center-releases-2022-statistics\" target=\"_blank\" rel=\"noreferrer noopener\">$10.3 billion</a> to data breaches and cybercrime.</p>\n\n\n\n<p>This is all happening while companies are <a href=\"https://www.statista.com/statistics/870924/worldwide-digital-transformation-market-size\" target=\"_blank\" rel=\"noreferrer noopener\">spending trillions</a> digitizing their business operations and trying to obtain secure cyber insurance while keeping up with regulatory changes in GDPR, HIPAA, and Sarbanes-Oxley.</p>\n\n\n\n<p>The best way to weather these challenges is to become a cyber resilient business. That means implementing a layered security and data management strategy that encompasses prevention, protection, and recovery so that your data, your bottom line, and your reputation remain secure.</p>\n\n\n\n<p>In this article, we’ll discuss the importance of data security and protection.</p>\n\n\n\n<h2><a></a>How to protect your data</h2>\n\n\n\n<p>A sophisticated, layered security strategy will already have prevention tools like <a href=\"https://www.webroot.com/us/en/business/products/endpoint-protection\" target=\"_blank\" rel=\"noreferrer noopener\">endpoint</a> and <a href=\"https://www.webroot.com/us/en/business/products/dns-protection\" target=\"_blank\" rel=\"noreferrer noopener\">DNS</a> protection in place as well as <a href=\"https://www.webroot.com/us/en/business/products/security-awareness-training\" target=\"_blank\" rel=\"noreferrer noopener\">security awareness training</a> to stop threats before they reach your network.</p>\n\n\n\n<p>Unfortunately, that’s not enough. Attacks are becoming increasingly sophisticated and complex, and that first line of defense may not catch them all.</p>\n\n\n\n<p>If a threat can penetrate the prevention layer, protection-layer tools kick in to neutralize the threat or minimize the damage of an attack.</p>\n\n\n\n<p>Here are two tools that can protect your data:</p>\n\n\n\n<h3><a></a>1.&nbsp;&nbsp; Email threat protection and email continuity</h3>\n\n\n\n<p>Email is one of the most common entry points for attacks, from phishing links to ransomware and business email compromise (BEC) to malicious attachments. Cyber criminals can mimic trustworthy senders so you need a tool that helps you tell the difference between a safe email and suspicious one.</p>\n\n\n\n<p>Tools like Webroot’s Advanced Email Threat Protection analyze the links and attachments in messages to detect malware and keep your systems secure against threats. Webroot Email Continuity can continue to send and receive emails for up to 30 days even if the infrastructure is down.</p>\n\n\n\n<h3><a></a>2.&nbsp;&nbsp; Email encryption</h3>\n\n\n\n<p>Companies rely on email to distribute important information, but when that information is confidential and sensitive, you need an encryption tool to protect it. If a cyber criminal gets access to emails, they won’t be able to access that sensitive data if it’s encrypted.</p>\n\n\n\n<p>Webroot Advanced Email Encryption powered by Zix is an industry-grade encryption tool that runs in the background, without disrupting workflows or requiring any input from the user. It’s invisible to the user and requires no extra training, while keeping your communications confidential. Also, default and customizable Data Loss Prevention (DLP) policies are available at no additional cost to prevent unauthorized users from emailing sensitive data to parties outside the organization.</p>\n\n\n\n<h2><a></a>Customer stories</h2>\n\n\n\n<p>When Spitzer Automotive’s new Chief Information Officer joined the company in 2019, he realized there was a big problem that affected the company’s security and employee productivity: employees were spending too much time reviewing emails for spam. One phishing attack slipping through human review could cause big problems for the company in downtime, financial loss, and reputational damage.</p>\n\n\n\n<p>Spitzer chose Webroot’s Advanced Email Threat Protection and Email Continuity as a cloud-based solution to pair with Microsoft 365. Not only were they able to save money by bundling the two together, but it also allowed the company to automate email protection by reducing the number of email threats and quarantining malicious emails.</p>\n\n\n\n<p>Allery, Asthma, and Sinus Center had a different reason for using Webroot Email Threat Protection and Email Continuity. As a healthcare group, they had sensitive patient data to protect and a ransomware attack from malicious emails could put that at risk.</p>\n\n\n\n<p>Once they put the Webroot system in place, they were able to focus on other IT matters while knowing that patient data was safe. It also allowed them to be HIPAA compliant.</p>\n\n\n\n<p>To learn more about building cyber resilience with layered security, <a href=\"https://go.zixcorp.com/ES-SecBrief.html\" target=\"_blank\" rel=\"noreferrer noopener\">download our guide</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/09/07/building-a-cyber-resilient-business-the-protection-layer/\">Building a Cyber Resilient Business: The Protection Layer</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"How Easy is Email Encryption? You’d Be Surprised.","link":"https://www.webroot.com/blog/2023/09/07/how-easy-is-email-encryption-youd-be-surprised/","dc:creator":{"#cdata-section":"Olivia Pramas"},"pubDate":"Thu, 07 Sep 2023 15:07:39 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://wordpressblog.webroot.com/?p=32007"},"description":{"#cdata-section":"<p>When it comes to keeping sensitive data safe, email encryption is a necessity. But it doesn’t have to be a necessary evil. Too many employees and IT experts have experienced the pain of trying to use a needlessly complicated email encryption solution. There’s the endless steps, the hard-to-navigate portals, and the time-consuming processes that add [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/09/07/how-easy-is-email-encryption-youd-be-surprised/\">How Easy is Email Encryption? You’d Be Surprised.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>When it comes to keeping sensitive data safe, email encryption is a necessity. But it doesn’t have to be a necessary evil.</p>\n\n\n\n<p>Too many employees and IT experts have experienced the pain of trying to use a needlessly complicated email encryption solution. There’s the endless steps, the hard-to-navigate portals, and the time-consuming processes that add up to a frustrating experience for most.</p>\n\n\n\n<p>If this is the experience you’ve come to expect, Webroot Email Encryption powered by Zix is here to surprise you. Webroot simplifies, streamlines, and secures the encryption process making email security easier than ever.</p>\n\n\n\n<h2><a></a>Transparent Delivery Simplifies the Recipient Process</h2>\n\n\n\n<p>The recipient process has historically been one of the biggest pain points for email encryption software customers. It’s often complicated and cumbersome, filled with portals, secret passwords, and extra steps. It shouldn’t be that difficult just to read an email, and now it doesn’t have to be.</p>\n\n\n\n<p>Webroot Email Encryption drastically simplifies the email recipient process. When both the sender and the recipient are Webroot clients, the software will encrypt the outgoing email from one customer, and send it to the recipient completely transparently—regardless of the email content. No portal, no passwords, no extra steps – just a blue bar at the top of the email confirming it was sent securely. From there, the recipient can reply to the email exactly as they would a regular email.</p>\n\n\n\n<p>Even without transparent delivery, Webroot’s Email Encryption makes the recipient process intuitive for non-Webroot clients. The recipient secure email portal is designed for non-technical people to be able to access, read, and reply to encrypted emails easily.</p>\n\n\n\n<h2><a></a>State of the Art Filters Enable Automatic Encryption</h2>\n\n\n\n<p>Security tools only work when people use them, and even with the best IT policies in place, it’s difficult to stop employees from sending sensitive information without encryption. While many organizations have increased their employee training amid an increased threat landscape, training only goes so far.</p>\n\n\n\n<p>Exposing sensitive information isn’t just an organizational problem, it’s also a regulatory one. The Health Insurance Portability and Accountability Act (HIPAA) requires that all patient data is kept secure and private. With traditional email encryption solutions, this burden falls on employees every time. For healthcare organizations, this is an added layer of complication on top of an often hectic landscape for employees.</p>\n\n\n\n<p>Thankfully, Webroot’s Email Encryption offers automatic encryption, removing the burden from employees of having to remember to encrypt sensitive emails every time they send one. Webroot Email Encryption provides out-of-the-box automatic policies for HIPAA, Social Security numbers, and financial information. When a policy is triggered—whether the sender has elected to encrypt the email or not—emails can be encrypted, blocked or quarantined.</p>\n\n\n\n<p>The result? Any email containing sensitive information is automatically encrypted, saving both employees and the organization at large from the threat of a security breach.</p>\n\n\n\n<h2><a></a>Purpose-Built Add-Ons Make Integration Seamless</h2>\n\n\n\n<p>Email encryption is just one piece of the cybersecurity puzzle. Every organization has a unique set of security needs, and a threat could severely affect operations at any time.</p>\n\n\n\n<p>That’s why it’s important to ensure your email encryption solution comes along with purpose-built add-ons and can also seamlessly integrate with other security solutions. Webroot Email Encryption can be easily integrated and is also part of a larger network of threat protection that keeps your organization safe.</p>\n\n\n\n<p>OpenText Cybersecurity brings together a number of product families (Webroot, Carbonite and Zix) that can be brought in to improve and enhance the overall user experience, like:</p>\n\n\n\n<p><strong>Single Sign-On with SAML 2.0:</strong> Allows a user to login to their Webroot Secure Message Portal with their own credentials they’ve already created through the customer’s website. Without having to login again, users click a link to be taken directly to their secure inbox. This feature is implemented in using SAML 2.0, which authorizes user access to web services across organizations.</p>\n\n\n\n<p><strong>Webroot Email Threat Protection:</strong>&nbsp; Email Encryption provides multilayered filtering for both inbound and outbound emails that lets the right emails through while blocking malicious threats such as phishing, ransomware, impersonation, business email compromise (BEC) and spam. It also offers attachment quarantine, link protections, message retraction, and a round-the-clock live threat analyst team.</p>\n\n\n\n<h2><a></a>Ready to Learn More?</h2>\n\n\n\n<p>Seeing how simple email encryption can be is surprising, we know. And we’ve only just scratched the surface. If you want to learn more about how OpenText Cybersecurity can help make email surprisingly secure and simple, you can <a href=\"https://go.zixcorp.com/Email-Encryption.html\">request a demo here</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/09/07/how-easy-is-email-encryption-youd-be-surprised/\">How Easy is Email Encryption? You’d Be Surprised.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"Educating girls on how to be their own cyber hero","link":"https://www.webroot.com/blog/2023/03/13/educating-girls-on-how-to-be-their-own-cyber-hero/","dc:creator":{"#cdata-section":"Lauren Beliveau"},"pubDate":"Mon, 13 Mar 2023 06:16:00 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://wordpressblog.webroot.com/?p=31937"},"description":{"#cdata-section":"<p>No matter how old you are, it is important to learn how to stay safe online! According to a study conducted by Learning Innovation, more than 93% of students have access to smartphones and laptops. Cyber threats show no sign of slowing down, which is why it is important to stay up to date on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/03/13/educating-girls-on-how-to-be-their-own-cyber-hero/\">Educating girls on how to be their own cyber hero</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>No matter how old you are, it is important to learn how to stay safe online! According to a study conducted by <a href=\"https://www.learninginnovation.info/smart-tech/student-device-usage-report-april-2022\" target=\"_blank\" rel=\"noreferrer noopener\"><em>Learning Innovation</em></a>, more than 93% of students have access to smartphones and laptops. Cyber threats show no sign of slowing down, which is why it is important to stay up to date on security best practices.</p>\n\n\n\n<p>That’s one of the many reasons why we are so passionate about partnering with the Girl Scouts of Greater Chicago and Northwest Indiana to help girls be more cyber aware. Girl Scouts is a volunteer led organization that stretches from coast to coast to help girls bring their dreams to life and build a better world.</p>\n\n\n\n<p>Together, we aim to educate Girl Scouts through lessons that focus on simulations of existing and emerging cyber threats, how to safely preserve important files and memories and what to look out for when browsing online.</p>\n\n\n\n<h2>Becoming a cyber hero</h2>\n\n\n\n<p>Our <a href=\"https://www.webroot.com/blog/2022/06/13/girl-scouts-and-opentext-empower-future-leaders-of-tomorrow-with-cyber-resilience/\" target=\"_blank\" rel=\"noreferrer noopener\">Cyber Resilience patch program</a> provides Girl Scouts with the opportunity to engage in fun and educational hands-on activities that ignite awareness and create better online behaviors.</p>\n\n\n\n<p>Last month, we joined the Girl Scouts at their annual Cookie Rally that had over 2,000 girls and their families in attendance. We shared cybersecurity and safe online practices with the girls before they kicked-off their cookie season. While selling cookies is done primarily via in-person buying, selling cookies online has grown in popularity.</p>\n\n\n\n<p>This past October we kicked off our first patch program for the Brownies (grades 2-3) and Juniors (grades 4-5) and through a series of fun activities, the girls can learn how to navigate online dangers and stay safe online.</p>\n\n\n\n<p>This is just the beginning! We are in the process of rolling out more programs to teach more girls (and age groups) about the importance of cybersecurity and being safe online.</p>\n\n\n\n<p>Interested in learning more about our security products? Visit us at <a href=\"https://www.webroot.com/us/en\">webroot.com</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/03/13/educating-girls-on-how-to-be-their-own-cyber-hero/\">Educating girls on how to be their own cyber hero</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"Online Romance Scams Take Aim at Your Heart and Identity. Avoid these Red Flags","link":"https://www.webroot.com/blog/2023/02/14/online-romance-scams-take-aim-at-your-heart-and-identity-avoid-these-red-flags/","dc:creator":{"#cdata-section":"Kyle Machado"},"pubDate":"Tue, 14 Feb 2023 20:54:00 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://www.webroot.com/blog/?p=31925"},"description":{"#cdata-section":"<p>Online dating scams are on the RiseAccording to the FBI, Americans lost $1 billion in 2021 due to online dating scams; 2022 numbers are expected to be higher.&#160;&#160; Romance scammers are masters of disguise. They lead people on with talk of love and then attempt to trick them into giving money or personal data. As [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/02/14/online-romance-scams-take-aim-at-your-heart-and-identity-avoid-these-red-flags/\">Online Romance Scams Take Aim at Your Heart and Identity. &lt;strong&gt;Avoid these Red Flags&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>Online dating scams are on the RiseAccording to the FBI, Americans lost $1 billion in 2021 due to online dating scams; 2022 numbers are expected to be higher.&nbsp;&nbsp;</p>\n\n\n\n<p>Romance scammers are masters of disguise. They lead people on with talk of love and then attempt to trick them into giving money or personal data. As demonstrated by The Tinder Swindler, anyone at any age can be manipulated into a romance scam.&nbsp;</p>\n\n\n\n<p>Dating sites and apps are a convenient and easy way to find a match. They also present an ideal opportunity to fool unsuspecting hearts with common scams like: &nbsp;&nbsp;</p>\n\n\n\n<ul>\n<li>pretending to be in a financial crisis&nbsp;&nbsp;</li>\n\n\n\n<li>living out of state (and needing money to travel to meet you)&nbsp;</li>\n\n\n\n<li>always having an excuse as to why they can’t meet in person&nbsp;</li>\n</ul>\n\n\n\n<p>Of course, not all tactics are as obvious as the above. Be suspicious of someone who asks you to move your communication off the dating site/app to a different platform; this could be a sign that the person is trying to avoid detection, being flagged or that they want to share a malicious link for you to click on.&nbsp;</p>\n\n\n\n<p>To protect your heart, data and identity while online dating:&nbsp;</p>\n\n\n\n<ul>\n<li>Never give money or private data like birth dates and bank account numbers.&nbsp;&nbsp;&nbsp;</li>\n</ul>\n\n\n\n<ul>\n<li>Trust your instincts; if it feels too fast or good to be true, it probably is. Scammers often claim to have fallen in love very quickly or without having met their “match” in person.&nbsp;&nbsp;</li>\n</ul>\n\n\n\n<ul>\n<li>Don’t send intimate pictures or videos. Scammers may use them to extort money from you.&nbsp;</li>\n</ul>\n\n\n\n<ul>\n<li>Don’t share your address, daily routine or places you visit frequently&nbsp;&nbsp;</li>\n</ul>\n\n\n\n<ul>\n<li>Use a dating site/app that offers security features, such as the ability to verify the identity of others.&nbsp;</li>\n</ul>\n\n\n\n<ul>\n<li>Do your research, consider using a background check service to verify a person’s identity. And don’t forget about your own identity. Enroll in an identity and data protection service to further protect yourself.&nbsp;&nbsp;</li>\n</ul>\n\n\n\n<p><a href=\"https://www.webroot.com/us/en/home/products/premium\" target=\"_blank\" rel=\"noreferrer noopener\">Webroot Antivirus with Allstate Identity Protectio</a>n provides the much-needed extra layers to protect your data and identity from scammers looking for more than your heart.  To learn more visit <a href=\"http://www.webroot.com\" target=\"_blank\" rel=\"noreferrer noopener\">webroot.com</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/02/14/online-romance-scams-take-aim-at-your-heart-and-identity-avoid-these-red-flags/\">Online Romance Scams Take Aim at Your Heart and Identity. &lt;strong&gt;Avoid these Red Flags&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"Forget the Gym – Start 2023 Right by Getting Your Digital Life in Shape","link":"https://www.webroot.com/blog/2023/01/04/forget-the-gym-start-2023-right-by-getting-your-digital-life-in-shape/","dc:creator":{"#cdata-section":"Tyler Moffitt"},"pubDate":"Wed, 04 Jan 2023 18:02:08 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://www.webroot.com/blog/?p=31915"},"description":{"#cdata-section":"<p>The welcoming of a new year also welcomes the return of one of the most overused sayings in our shared lexicon: “New Year, New Me!” While there are countless overused resolutions like starting a workout regimen, the new year does provide an opportunity for additional self-improvement that most people never consider – bolstering cybersecurity protections. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/01/04/forget-the-gym-start-2023-right-by-getting-your-digital-life-in-shape/\">Forget the Gym &#8211; Start 2023 Right by Getting Your Digital Life in Shape</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>The welcoming of a new year also welcomes the return of one of the most overused sayings in our shared lexicon: “New Year, New Me!” While there are countless overused resolutions like starting a workout regimen, the new year does provide an opportunity for additional self-improvement that most people never consider – bolstering cybersecurity protections.</p>\n\n\n\n<p>If the beginning of the new year follows the trends of the last, there’s a good chance phishing will <a href=\"https://community.webroot.com/news-announcements-3/nastiest-malware-2022-352579\" target=\"_blank\" rel=\"noreferrer noopener\">spike in the first four months</a> of 2023. Rather than take a vacation to spend their holiday earnings, cybercriminals are using the new year as a prime opportunity to access bank accounts, install malicious software, and steal identities to commit fraud. These threats are especially prevalent as millions of people set up new devices, facilitate online shopping returns, and shop online with money and gift cards received throughout the holiday season.</p>\n\n\n\n<p>Fortunately, through its new partnership with <a href=\"https://www.allstate.com/identity-protection\" target=\"_blank\" rel=\"noreferrer noopener\">Allstate Identity Protection</a> (AIP), Webroot will help you easily protect your devices, identity, and privacy. The partnership combines Webroot’s digital device protection with AIP, which shields the personal information and data you share online. Together, the two services offer multi-layer protection against cyber threats to protect your digital life.</p>\n\n\n\n<p>Webroot Premium with AIP includes anti-virus protection for up to five devices, identity protection for one individual with up to $500,000 in fraud expense reimbursement*, up to $50,000 in stolen funds reimbursement*, and a password manager and secure browser for privacy. But the protection doesn’t stop there; additional benefits include:</p>\n\n\n\n<p>Device protection:</p>\n\n\n\n<ul><li>Real-time anti-phishing, malware, and ransomware protection against emerging threats</li><li>Lightning-fast threat scans without interruption</li><li>Proactive alerts with firewall and network connection monitoring</li><li>Cleans devices and improves performance</li></ul>\n\n\n\n<p>Identity protection:</p>\n\n\n\n<ul><li>Dark web monitoring</li><li>Credit monitoring (one bureau)</li><li>Financial monitoring including account takeover alerts</li><li>Identity monitoring with identity health status updates</li><li>24/7 U.S.-based identity restoration</li></ul>\n\n\n\n<p>Privacy protection:</p>\n\n\n\n<ul><li>Secure browser with alerts for malicious sites and apps</li><li>Deletes traces of online activity</li></ul>\n\n\n\n<p>As we kick off this new year, don’t sweat the gym or stress about a resolutions list. Start 2023 off right with comprehensive device and identity protection. To learn more, visit <a href=\"https://www.webroot.com/us/en/home/products/premium\">Webroot Premium with Allstate Identity Protection</a>.</p>\n\n\n\n<p>*Allstate Identity Protection Legal Disclaimer</p>\n\n\n\n<p>Identity theft insurance covering expense and stolen funds reimbursement is underwritten by American Bankers Insurance Company of Florida, an Assurant company. The description herein is a summary and intended for informational purposes only and does not include all terms, conditions, and exclusions of the policies described. Please refer to the actual policies for terms, conditions, and exclusions of coverage. Coverage may not be available in all jurisdictions. Product may be updated or modified. Certain features require additional activation.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2023/01/04/forget-the-gym-start-2023-right-by-getting-your-digital-life-in-shape/\">Forget the Gym &#8211; Start 2023 Right by Getting Your Digital Life in Shape</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"The 5 most important rules for online shopping","link":"https://www.webroot.com/blog/2022/11/29/the-5-most-important-rules-for-online-shopping/","dc:creator":{"#cdata-section":"Kyle Machado"},"pubDate":"Tue, 29 Nov 2022 17:29:14 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://www.webroot.com/blog/?p=31893"},"description":{"#cdata-section":"<p>The end of year holidays mark the busiest time of the year for online shoppers. We’re all rushing around trying to find the right gift that doesn’t break the budget. Throw in family time and stress can get out of hand. Sadly, this time also marks one of the busiest times of year for online [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/11/29/the-5-most-important-rules-for-online-shopping/\">The 5 most important rules for online shopping</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>The end of year holidays mark the busiest time of the year for online shoppers. We’re all rushing around trying to find the right gift that doesn’t break the budget. Throw in family time and stress can get out of hand.</p>\n\n\n\n<p>Sadly, this time also marks one of the busiest times of year for online hackers. With the flurry of activity online, they know they’ve got ample targets.</p>\n\n\n\n<p>Of course, not all targets are equal. Hackers would rather make a quick buck than spend their time forcing their way through in-depth security. That’s why it’s so important to follow the 5 most important rules for online shopping.</p>\n\n\n\n<p><strong>1. Strengthen your passwords</strong></p>\n\n\n\n<p>There’s no reason to still use the same password you came up with in high school. It’s a dirty truth that big businesses suffer data breaches – that means the longer you use a password the more likely it’s been hacked. Even if you’re not using that old website, hackers might know your information and will try logging in to common sites using your old email + password combination. We know it can be a pain to keep track of everything, and that’s why we recommend using a password manager service.</p>\n\n\n\n<p><strong>2. Visit reputable sites</strong></p>\n\n\n\n<p>We all want to score the best deals on holiday shopping, but the old adage is true – if it seems too good to be true, it probably is. You don’t need to go to sketchy sites to find the best prices. The biggest retailers have deals all season long. Plus, when you use a big site you don’t run the risk of getting a knockoff product.</p>\n\n\n\n<p><strong>3. Protect your WiFi</strong></p>\n\n\n\n<p>So much of our life is on the go, and holiday shopping is no different. Did you know that WiFi networks are often targeted by hackers and scammers? Even the one in your home can be spoofed, allowing thieves to steal your information. That’s even more true when you’re connected at the local coffee shop. With a VPN (Virtual Private Network – something all the best antivirus options offer), your information is secure no matter where you connect.</p>\n\n\n\n<p><strong>4. Invest in antivirus</strong></p>\n\n\n\n<p>You get what you pay for doesn’t just apply to your shopping. If you really want to make sure you’re safe online during the holidays, you want to make sure to invest in a reputable antivirus. No one wants a knock-off gifts – they’re low quality and unreliable. So why would you settle for a knock-off antivirus? Look for an option that has lots of good reviews, or even better go to a big box store and ask their experts for recommendations.</p>\n\n\n\n<p><strong>5. It pays to be suspicious</strong></p>\n\n\n\n<p>A healthy amount of suspicion can go a long way in protecting yourself while you’re shopping online (and let’s not get started on the sketchy ads we all get on social media). It’s always important to trust your gut. It’s also important to be wary of free money, unexpected calls from financial institutions and sites asking for personal information (rather than just billing info). And let’s not get started on the sketchy ads we all get on social media.</p>\n\n\n\n<p>Holiday shopping can be stressful enough, don’t let it get worse with a stolen credit card or hacked computer. Follow the 5 most important rules for staying safe online and you can shop worry free and get back to celebrating.</p>\n\n\n\n<p>Interested in learning about award-winning antivirus?</p>\n\n\n\n<p><a href=\"https://www.webroot.com/us/en/home/products/av\" data-type=\"URL\" data-id=\"https://www.webroot.com/us/en/home/products/av\">Discover Webroot</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/11/29/the-5-most-important-rules-for-online-shopping/\">The 5 most important rules for online shopping</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"Webroot™ Premium: The all-in-one protection for your devices and identity","link":"https://www.webroot.com/blog/2022/11/17/webroot-premium-the-all-in-one-protection-for-your-devices-and-identity/","dc:creator":{"#cdata-section":"Sabrina Lavi"},"pubDate":"Thu, 17 Nov 2022 16:50:00 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://www.webroot.com/blog/?p=31881"},"description":{"#cdata-section":"<p>The risk of becoming a victim of identity theft has never been greater We are increasingly living our lives in the digital realm. Whether we’re banking, purchasing or browsing, our daily activities are most likely taking place online. Not only has this sped up our efficiency, but it has also expanded our exposure to a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/11/17/webroot-premium-the-all-in-one-protection-for-your-devices-and-identity/\">Webroot™ Premium: The all-in-one protection for your devices and identity</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p><strong>The risk of becoming a victim of identity theft has never been greater</strong></p>\n\n\n\n<p>We are increasingly living our lives in the digital realm. Whether we’re banking, purchasing or browsing, our daily activities are most likely taking place online. Not only has this sped up our efficiency, but it has also expanded our exposure to a host of cybercriminals who are eager to use our personal information.</p>\n\n\n\n<p>According to the Federal Trade Commissioner (FTC), incidents of identity theft and related fraud rose nationwide in the United State in 2021. <a href=\"https://www.cnbc.com/2022/02/22/consumers-lost-5point8-billion-to-fraud-last-year-up-70percent-over-2020.html\">Consumers lost more than 5.8 billion</a>, skyrocketing over 70% from the previous year. The FTC received <a href=\"https://identitytheft.org/statistics/\">5.7 million fraud and identity theft reports</a> in 2021. Over a million of these reports were consumer identity theft cases.</p>\n\n\n\n<p>The rise in identity theft and fraud means it’s especially important to secure not only the devices you use but also your personal identity.</p>\n\n\n\n<p><strong>Your identity is unique to you. Keep it that way with Webroot and Allstate Identity Protection</strong></p>\n\n\n\n<p>There are many steps you can take to ensure your identity isn’t compromised:</p>\n\n\n\n<ul><li>Shredding bank statements</li><li>Securing important documents</li><li>Ensuring your passwords are effectively managed</li><li>Investing in a quality antivirus for your devices</li></ul>\n\n\n\n<p>However, these actions won’t help you regularly monitor your financial accounts, scan for emerging threats or provide fraud or stolen funds reimbursement.</p>\n\n\n\n<p>That’s where Webroot can help. Webroot has partnered with Allstate Identity Protection to offer two unique ways to preserve both your devices and identity: Webroot<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /> Premium and Allstate Identity Protection Add-on.</p>\n\n\n\n<p><strong>The same trusted antivirus but with the added bonus of identity protection</strong></p>\n\n\n\n<p>Webroot Premium is a combination of our top-of-the-line antivirus protection and Allstate Identity Protection.</p>\n\n\n\n<p>Enjoy all the great benefits of our antivirus plus these great features:</p>\n\n\n\n<ul><li>Dark Web, financial and identity monitoring: Credit card and bank account transactions, 401(k) and account takeover</li><li>24/7 U.S.-based customer care</li><li>1 bureau credit monitoring</li><li>550K in fraud expense and stolen funds reimbursement*</li></ul>\n\n\n\n<p>In addition to Webroot Premium, we’re offering <strong>existing customers</strong> the chance to keep their current Webroot subscription and just add identity protection with Allstate Identity Protection Add-on.</p>\n\n\n\n<p>Experience the benefits of your current Webroot antivirus plus:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n\n\n<ul><li>Dark Web monitoring with social security trace</li><li>Financial monitoring with account takeover alerts</li><li>Identity monitoring, including identity health status updates</li><li>24/7 U.S.-based restoration</li><li>$25K fraud expense reimbursement*</li></ul>\n\n\n\n<p>This holiday season, ensure your online shopping purchases remain secure while safeguarding your devices and identity with Webroot and Allstate Identity Protection.</p>\n\n\n\n<p>Learn more about <a href=\"https://www.webroot.com/us/en/home/products/premium\">Webroot Premium</a>&nbsp;and discover what our comprehensive protection can do for you.</p>\n\n\n\n<p><strong>Allstate Identity Protection Legal Disclaimer</strong></p>\n\n\n\n<p>*Identity theft insurance covering expense and stolen funds reimbursement is underwritten by American Bankers Insurance Company of Florida, an Assurant company. The description herein is a summary and intended for informational purposes only and does not include all terms, conditions, and exclusions of the policies described. Please refer to the actual policies for terms, conditions, and exclusions of coverage. Coverage may not be available in all jurisdictions.&nbsp;<strong>Product may be updated or modified. Certain features require additional activation.</strong></p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p><a></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/11/17/webroot-premium-the-all-in-one-protection-for-your-devices-and-identity/\">Webroot™ Premium: The all-in-one protection for your devices and identity</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"OpenText Security Solutions 2022 Global SMB Ransomware Survey: Fighting More… with Less","link":"https://www.webroot.com/blog/2022/11/07/opentext-security-solutions-2022-global-smb-ransomware-survey-fighting-more-with-less/","dc:creator":{"#cdata-section":"Tyler Moffitt"},"pubDate":"Mon, 07 Nov 2022 16:00:00 +0000","category":[{"#cdata-section":"Business + Partners"},{"#cdata-section":"SMBs"},{"#cdata-section":"cyber resilience"},{"#cdata-section":"ransomware"}],"guid":{"@isPermaLink":"false","#text":"https://www.webroot.com/blog/?p=31857"},"description":{"#cdata-section":"<p>Small and medium-size business (SMB) leaders have a lot on their minds. The looming recession and inflation have created financial uncertainty. Meanwhile, the global rise in sophisticated ransomware threats and geo-political tensions are escalating cyber threats. With so many factors and pressures at play, how are SMBs navigating this challenging business landscape while fighting back [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/11/07/opentext-security-solutions-2022-global-smb-ransomware-survey-fighting-more-with-less/\">OpenText Security Solutions 2022 Global SMB Ransomware Survey: Fighting More… with Less</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>Small and medium-size business (SMB) leaders have a lot on their minds. The looming recession and inflation have created financial uncertainty. Meanwhile, the <a href=\"https://www.cisa.gov/uscert/ncas/alerts/aa22-040a\">global rise</a> in sophisticated ransomware threats and geo-political tensions are <a href=\"https://www.gartner.com/en/newsroom/press-releases/2022-06-10-how-geopolitics-impacts-the-cyber-threat-landscape\">escalating cyber threats</a>.</p>\n\n\n\n<p>With so many factors and pressures at play, how are SMBs navigating this challenging business landscape while fighting back against cybercriminals?</p>\n\n\n\n<p>Insight from OpenText Security Solutions’ 2022 Global Ransomware SMB Survey sheds light on security priorities, concerns and posture. Feedback from SMBs across multiple industries and countries confirm security teams and the C-suite are worried about increasingly sophisticated and relentless attacks.</p>\n\n\n\n<p><strong>Ransomware is a top concern for SMBs:</strong></p>\n\n\n\n<p>An overwhelming majority (88%) of SMBs indicated they are concerned or extremely concerned about an attack impacting their businesses. This worry is heightened by increasing geopolitical tensions. In fact, more than half (52%) of respondents now feel more at risk of suffering a ransomware attack due to these unfolding events.</p>\n\n\n\n<p>SMBs’ ransomware concerns are already becoming a reality. Nearly half (46%) of SMBs have experienced a ransomware attack. Meanwhile, 66% of respondents are not confident or only somewhat confident that they can fend off a ransomware attack. Budget constraints and small security teams were cited as the primary roadblocks.</p>\n\n\n\n<p><strong>Despite concern, security awareness training is infrequent:</strong></p>\n\n\n\n<p>The vast majority of SMBs believe a successful ransom attack is the result of someone clicking on a malicious link or opening an email attachment. Yet despite this knowledge of users as the preferred attack surface, many SMBs (based on action) don’t view their employees as a first line of defense.</p>\n\n\n\n<p>Sixty-seven percent of SMBs conduct security awareness training twice a year or less. Of these SMBs, 31% conduct security awareness trainings only once a year; 10% only if an employee fails a phishing test.</p>\n\n\n\n<p><strong>Fear of small security budgets getting smaller:</strong></p>\n\n\n\n<p>Sixty-seven percent of SMBs spend less than $50,000 annually on cybersecurity. While 59% reported plans to increase their security budget in 2023, 57% fear inflation will lead to a change in plans resulting in budget cuts.</p>\n\n\n\n<p><strong>SMB security teams are spread thin; MSPs are an appealing option:</strong></p>\n\n\n\n<p>The majority (68%) of SMBs have fewer than five people on their security team. To help alleviate resource constraints, more than half (58%) of respondents use external security management support. In the future, 65% of SMBs that don’t currently use a managed services provider (MSP) for their security needs would consider doing so.&nbsp;</p>\n\n\n\n<h2>Fighting more, with less</h2>\n\n\n\n<p>Adversaries have become increasingly sophisticated and relentless as the surface area of attacks only grows. Meanwhile, fear of looming budget cuts impacting already over-stretched security teams put SMBs in a vulnerable position.</p>\n\n\n\n<p>Ongoing education and awareness of new attack vectors and defense against common channels such as email are critical for achieving a cyber resilience posture. Monthly phishing simulations are a great way to keep users current and accountable. A multi-layered approach that includes email security, DNS filtering, endpoint protection, and backup and recovery is essential to mitigating risk and exposure from attacks.</p>\n\n\n\n<p>To learn more, go to: <a href=\"https://www.opentext.com/products/security-cloud\">https://www.opentext.com/products/security-cloud</a> &nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/11/07/opentext-security-solutions-2022-global-smb-ransomware-survey-fighting-more-with-less/\">OpenText Security Solutions 2022 Global SMB Ransomware Survey: Fighting More… with Less</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}},{"title":"Discover 2022’s Nastiest Malware","link":"https://www.webroot.com/blog/2022/10/14/discover-2022s-nastiest-malware/","dc:creator":{"#cdata-section":"Tyler Moffitt"},"pubDate":"Fri, 14 Oct 2022 13:13:00 +0000","category":{"#cdata-section":"Threat Lab"},"guid":{"@isPermaLink":"false","#text":"https://www.webroot.com/blog/?p=31873"},"description":{"#cdata-section":"<p>For the past year, hackers have been following close behind businesses and families just waiting for the right time to strike. In other words, 2022 has been an eventful year in the threat landscape, with malware continuing to take center stage. The 6 Nastiest Malware of 2022 Since the mainstreaming of ransomware payloads and the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/10/14/discover-2022s-nastiest-malware/\">Discover 2022&#8217;s Nastiest Malware</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p>For the past year, hackers have been following close behind businesses and families just waiting for the right time to strike. In other words, 2022 has been an eventful year in the threat landscape, with malware continuing to take center stage.</p>\n\n\n\n<p><strong>The 6 Nastiest Malware of 2022</strong></p>\n\n\n\n<p>Since the mainstreaming of ransomware payloads and the adoption of cryptocurrencies that facilitate untraceable payments, malicious actors have been innovating new methods and tactics to evade the latest defenses. 2022 was no different.</p>\n\n\n\n<p>The ransomware double extortion tactic continues to wreak havoc, with ransomware attackers threating to both steal your data and also leak it if you don’t pay up. But this year also saw the onset of the triple extortion method – with this type of attack, hackers threaten to steal your data, leak it and then also execute DDoS attack if you don’t pay up. As a result, many organizations are shifting away from cyber insurance and adopting layered defenses in an effort to achieve cyber resilience.</p>\n\n\n\n<p>Ransom payments continued to balloon – last year at this time the average was just below $150,000 but it now stands close to $225,000 (that’s increasing faster than the rate of inflation, for those counting at home!).</p>\n\n\n\n<p>In bad news (as if we needed more), malicious actors seem to have settled on a favorite target: small and medium sized businesses. Large-scale attacks make headlines, but hackers have found that smaller environments make for easier targets.</p>\n\n\n\n<p>But it’s not all bad news… after all, the first step in defeating your enemy is to learn their tactics. Our researchers have been hard at work uncovering the worst offenders to better build defenses against them. With that, here are the 6 Nastiest Malware of 2022.</p>\n\n\n\n<p><strong><u>Here are this year’s wicked winners</u></strong></p>\n\n\n\n<p><strong>Emotet</strong></p>\n\n\n\n<ul><li>Persisting botnet with cryptomining payload and more</li><li>Infects via emails, brute force, exploits and more</li><li>Removes competing malware, ensuring they’re the only infection</li></ul>\n\n\n\n<p><strong>Lockbit</strong></p>\n\n\n\n<ul><li>The year’s most successful ransomware group</li><li>Introduced the triple extortion method – encryption + data leak + DDOS attack</li><li>Accept payments in two untraceable cryptocurrencies Monero and Zcash as well as Bitcoin</li></ul>\n\n\n\n<p><strong>Conti</strong></p>\n\n\n\n<ul><li>&nbsp;Longstanding ransomware group also known as Ryuk and a favorite payload of trickbot</li><li>&nbsp;Shutdown attempts by US gov have made them rebrand into other operations such as Hive, BlackCat, BlackByte, and AvosLockerWill leak or auction off your data if you don’t pay the ransom</li></ul>\n\n\n\n<p><strong>Qbot</strong></p>\n\n\n\n<ul><li>The oldest info stealing trojan still in operation</li><li>Works to infect an entire environment to ‘case the joint’ before its final stage</li><li>Creates ransomware Voltrons through partnerships with Conti, ProLock and Egregor</li></ul>\n\n\n\n<p><strong>Valyria</strong></p>\n\n\n\n<ul><li>Malspam botnet that starts with email attachments containing malicious scripts</li><li>Known for their complex payloads that can overwhelm defenses and evade detection</li><li>Partners with Emotet to create a two-headed monster</li></ul>\n\n\n\n<p><strong>Cobalt Strike / Brute Ratel</strong></p>\n\n\n\n<ul><li>White hat designed pen testing tool, that’s been corrupted and used for evil.</li><li>Very powerful features like process injection, privilege escalation, and credential harvesting.</li><li>The customizability and scalability are just too GOOD not to be abused by BAD actors</li></ul>\n\n\n\n<p><strong>Protect yourself and your business</strong></p>\n\n\n\n<p>The key to staying safe is a layered approach to cybersecurity backed up by a cyber resilience strategy. Here are tips from our experts.</p>\n\n\n\n<p><strong>Strategies for business continuity</strong></p>\n\n\n\n<ul><li>Lock down Remote Desktop Protocols (RDP)</li><li>Educate end users</li><li>Install reputable cybersecurity software</li><li>Set up a strong backup and disaster recovery plan</li></ul>\n\n\n\n<p><strong>Strategies for individuals</strong></p>\n\n\n\n<ul><li>Develop a healthy dose of suspicion toward messages</li><li>Protect devices with antivirus and data with a VPN</li><li>Keep your antivirus software and other apps up to date</li><li>Use a secure cloud backup with immutable copies</li><li>Create strong, unique passwords (and don’t reuse them across accounts)</li><li>If a download asks to enable macros, DON’T DO IT</li></ul>\n\n\n\n<p><a></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.webroot.com/blog/2022/10/14/discover-2022s-nastiest-malware/\">Discover 2022&#8217;s Nastiest Malware</a> appeared first on <a rel=\"nofollow\" href=\"https://www.webroot.com/blog\">Webroot Blog</a>.</p>\n"}}]}}}