{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@version":"2.0","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:admin":"http://webns.net/mvcb/","@xmlns:rdf":"http://www.w3.org/1999/02/22-rdf-syntax-ns#","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","channel":{"title":"AlienVault Blogs","link":"https://cybersecurity.att.com/blogs","description":"The most recent posts from across the AlienVault blogs.","dc:language":"en","dc:creator":"hello@alienvault.com","dc:rights":"Copyright 2024","dc:date":"2024-01-26T11:00:00+00:00","admin:generatorAgent":{"@rdf:resource":"http://expressionengine.com/"},"item":[{"title":"Cybersecurity for Industrial Control Systems: Best practices ","link":"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-for-industrial-control-systems-best-practices","guid":"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-for-industrial-control-systems-best-practices#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>Network segmentation, software patching, and continual threats monitoring are key cybersecurity best practices for Industrial Control Systems (ICS). Although ICSs significantly improve health and safety by automating dangerous tasks, facilitating remote monitoring and control, and activating safety protocols in the case of emergency, they&rsquo;re increasingly&nbsp;<a href=\"https://cybersecurity.att.com/blogs/security-essentials/physical-threats-to-cybersecurity-that-you-must-address\" target=\"_blank\">exposed to cybersecurity threats</a>. In 2022,&nbsp;<a href=\"https://www.prnewswire.com/ae/news-releases/new-research-finds-cyberattacks-against-critical-infrastructure-on-the-rise-state-affiliated-groups-responsible-for-nearly-60-301931728.html\" target=\"_blank\">there was a 2,000% increase</a>&nbsp;in adversarial reconnaissance targeting Modbus/TCP port 502 &mdash; a widely-used industrial protocol &mdash; allowing malicious actors to exploit vulnerabilities in operational technology systems. Fortunately, by taking steps to improve and maintain ICS cybersecurity, manufacturers can successfully reduce the attack surface of their critical infrastructure and keep threats (including phishing, denial-of-service attacks, ransomware, and malware) at bay.&nbsp;</p>\n\n<h2>ICS cyberattacks on the rise&nbsp;</h2>\n\n<p>ICS cyberattacks are on the rise, with almost 27% of ICS systems affected by malicious objects in the second quarter of 2023, data from Kaspersky reveals. Cyberattacks have the power to devastate ICS systems, damage equipment and infrastructure, disrupt business, and endanger health and safety. For example, the U.S. government has warned of a malware strain called Pipedream:&nbsp;<a href=\"https://www.techtarget.com/searchsecurity/news/252515987/US-government-security-vendors-warn-of-new-ICS-malware\" target=\"_blank\">&ldquo;a modular ICS attack framework</a>&nbsp;that contains several components designed to give threat actors control of such systems, and either disrupt the environment or disable safety controls&rdquo;. Although Pipedream has the ability to devastate industrial systems, it fortunately hasn&rsquo;t yet been used to that effect. And, last year, a notorious hacking group called Predatory Sparrow launched a cyberattack on an Iranian steel manufacturer, resulting in a serious fire. In addition to causing equipment damage, the hackers caused a malfunctioning foundry to start spewing hot molten steel and fire. This breach only highlights the importance of safety protocols in the manufacturing and heavy industry sectors. By&nbsp;<a href=\"https://trdsf.com/blogs/news/technology-and-safety-within-manufacturing-and-heavy-industry\">leveraging the latest safety tech</a>&nbsp;and strengthening cybersecurity, safety, security, and operational efficiency can all be improved.</p>\n\n<h2>Segment networks</h2>\n\n<p>By separating critical systems from the internet and other non-critical systems, network segmentation plays a key role in improving ICS cybersecurity. Network segmentation is a security practice that divides a network into smaller, distinct subnetworks based on security level, functionality, or access control, for example. As a result, you can effectively prevent attacker lateral movement within your network &mdash; this is a common way hackers disguise themselves as legitimate users and their activities as expected traffic, making it hard to spot this method. Network segmentation also lets you create tailored and unique security policies and controls for each segment based on their defined profile. Each individual segment is therefore adequately protected. And, since network segmentation also provides you with increased visibility in terms of network activity, you&rsquo;re also better able to spot and respond to problems with greater speed and efficiency.&nbsp;</p>\n\n<p>When it comes to&nbsp;<a href=\"https://www.forbes.com/sites/forbestechcouncil/2023/11/28/17-key-strategies-for-designing-a-secure-efficient-network/\" target=\"_blank\">effective network segmentation methods</a>, these can be based either on physical boundaries &mdash; involving physical infrastructure like network hardware, routers, and firewalls &mdash; or logical boundaries established via logical means like virtual local area networks (VLANs), access control lists (ACLs), and virtual private networks (VPNs). To simplify the management of firewall rules, in particular, network teams should use different firewalls, particularly instead of dealing with numerous applications in one firewall &mdash; something that quickly becomes complicated and difficult to maintain. By opting to use separate firewalls based on virtual machine implementations, you can streamline and simplify the set rules for each firewall. In turn, you can facilitate easier auditing, and make it easier to change outdated rules when needed.&nbsp;</p>\n\n<h2>Regularly patch and update software</h2>\n\n<p>Patching and updating software involves improving or repairing software to optimize performance and get rid of bugs and vulnerabilities. In addition to minimizing risk of cyberattack, software patches and updates can also ensure regulatory compliance, therefore helping you avoid fines and sanctions. When it comes to software patching best practices for ICS, it&rsquo;s important to stay up-to-date with the latest vendor releases. The newest releases are designed to address newly-discovered security risks, allowing you to better protect your systems. Establishing a regular, scheduled patching cycle for ICS systems also helps ensure patches are applied on a consistent basis, further minimizing security vulnerabilities. You can also schedule downtime as needed in order to apply patches or updates without disrupting operations.&nbsp;</p>\n\n<h2>Threats monitoring</h2>\n\n<p><a href=\"https://www.computerweekly.com/news/366549265/Cyber-attacks-in-2023-develop-quicker-as-average-dwell-times-plummet\" target=\"_blank\">Cyber threats are constantly evolving</a>, which means ICS threats monitoring needs to be ongoing &mdash; you need to be able to quickly spot and respond to emerging threats before they have a chance to exploit vulnerabilities. Minimizing dwell times &mdash; the amount of time a malicious agent has access to a compromised system before detection &mdash; also works to limit potential damage and destruction. So, be sure to implement anomaly detection algorithms tailored to the unique needs of your ICS system. Designed to maintain operational stability, control loops should be paid particular consideration here. A baseline of expected behavior within control loops should be established, in turn making it easier to detect anomalies.&nbsp;</p>\n\n<p>By facilitating remote monitoring and control, automating dangerous tasks, and activating safety protocols, ICSs significantly improve health and safety in the manufacturing industry. By taking steps to strengthen cybersecurity, you can successfully keep ICS cyberthreats at bay.&nbsp;&nbsp;</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-26T11:00:00+00:00"},{"title":"The dark side of 2023 Cybersecurity: Malware evolution and Cyber threats","link":"https://cybersecurity.att.com/blogs/labs-research/the-dark-side-of-2023-cybersecurity-malware-evolution-and-cyber-threats","guid":"https://cybersecurity.att.com/blogs/labs-research/the-dark-side-of-2023-cybersecurity-malware-evolution-and-cyber-threats#When:11:00:00Z","description":{"#cdata-section":"\n<p>In the ever-evolving cybersecurity landscape, 2023 witnessed a dramatic surge in the sophistication of cyber threats and malware. <a href=\"https://cybersecurity.att.com/alien-labs\" target=\"_blank\">AT&amp;T Cybersecurity Alien Labs</a> reviewed the big events of 2023 and how malware morphed this year to try new ways to breach and wreak havoc.</p>\n\n<p>This year&#39;s events kept cybersecurity experts on their toes, from expanding malware variants to introducing new threat actors and attack techniques. Here are some of the most compelling developments, highlighting malware&#39;s evolving capabilities and the challenges defenders face.</p>\n\n<h2>Highlights of the year: Emerging trends and notable incidents</h2>\n\n<p>As the year unfolded, several trends and incidents left an indelible mark on the cybersecurity landscape:</p>\n\n<h3>Exploiting OneNote for malicious payloads</h3>\n\n<p><a href=\"https://www.bleepingcomputer.com/news/security/hackers-now-use-microsoft-onenote-attachments-to-spread-malware/\" target=\"_blank\">Cybercriminals leveraged Microsoft OneNote</a> to deliver many malicious payloads to victims, including Redline, AgentTesla, Quasar RAT, and others. This previously underutilized Office program became a favored tool due to its low suspicion and widespread usage.</p>\n\n<h3>SEO poisoning and Google Ads</h3>\n\n<p>Malicious actors resorted to <a href=\"https://www.techrepublic.com/article/seo-poisoning-brand-reputation/\" target=\"_blank\">SEO poisoning tactics</a>, deploying phishing links through Google Ads to deceive unsuspecting victims. These links led to cloned, benign web pages, avoiding Google&#39;s detection and remaining active for extended periods. Prominent malware families, including Raccoon Stealer and IcedID, capitalized on this strategy.</p>\n\n<h3>Exploiting geopolitical events</h3>\n\n<p><a href=\"https://www.csoonline.com/article/655734/improve-your-cyber-threat-understanding-with-geopolitical-context.html\" target=\"_blank\">Cybercriminals exploited the geopolitical climate</a>, particularly the Middle East conflict, as a lure for their attacks. This trend mirrored the previous year&#39;s Ukraine-related phishing campaigns and crypto scams.</p>\n\n<h3>APTs: State-sponsored espionage continues to present challenges</h3>\n\n<p><a href=\"https://cybersecurity.att.com/blogs/security-essentials/advanced-persistent-threat-explained\" target=\"_blank\">Advanced Persistent Threats</a> (APTs) continued to pose a significant threat in 2023:</p>\n\n<ul>\n\t<li>Snake: CISA reported on the Snake APT, an advanced cyber-espionage tool associated with the Russian Federal Security Service (FSB). This malware had been in use for nearly two decades.</li>\n\t<li>Volt Typhoon: A campaign targeting critical infrastructure organizations in the United States was attributed to Volt Typhoon, a state-sponsored actor based in China. Their focus lay on espionage and information gathering.</li>\n\t<li>Storm-0558: This highly sophisticated intrusion campaign, orchestrated by the Storm-0558 APT from China, infiltrated the email accounts of approximately 25 organizations, including government agencies.</li>\n</ul>\n\n<h3>Ransomware&#39;s relentless rise</h3>\n\n<p><a href=\"https://cybersecurity.att.com/resource-center/infographics/fast-facts-ransomware\" target=\"_blank\">Ransomware</a> remained a prevalent and lucrative threat throughout the year:</p>\n\n<ul>\n\t<li>Cuba and Snatch: Ransomware groups like Cuba and Snatch targeted critical infrastructure in the United States, causing concern for national security.</li>\n\t<li>ALPHV/BlackCat: Beyond SEO poisoning, this group compromised the computer systems of Caesar and MGM casinos. They also resorted to filing complaints with the US Securities and Exchange Commission (SEC) against their victims, applying additional pressure to pay ransoms.</li>\n\t<li>Exploiting new vulnerabilities: Cybercriminals wasted no time exploiting newly discovered vulnerabilities, such as CVE-2023-22518 in Atlassian&#39;s Confluence, CVE-2023-4966 (Citrix bleed), and others. These vulnerabilities became gateways for ransomware attacks.</li>\n\t<li>Evolving ransomware families: New ransomware variants like Trash Panda emerged while existing families adapted to target Linux and ESXi servers, further expanding their reach.</li>\n</ul>\n\n<h2>Notable blogs of the year</h2>\n\n<p><b>1. BlackGuard: Elevating Malware-as-a-Service</b></p>\n\n<p>One of the year&#39;s standout stories was the evolution of <a href=\"https://cybersecurity.att.com/blogs/labs-research/blackguard-stealer-extends-its-capabilities-in-new-variant\" target=\"_blank\">BlackGuard</a>, a formidable Malware-as-a-Service (MaaS) offered in underground forums and Telegram channels. This insidious tool underwent a significant upgrade, amplifying its capabilities. Already known for its ability to pilfer sensitive data from browsers, games, chats, and cryptocurrencies, the new BlackGuard variant upped the ante.</p>\n\n<p>BlackGuard improved its Anti-Reversing and Sandboxing capabilities, making it even more elusive to security experts. Moreover, it could now tamper with cryptocurrency wallets copied to the clipboard. This enhancement posed a severe threat to cryptocurrency enthusiasts and investors. Additionally, BlackGuard incorporated advanced Loader capabilities, enabling it to propagate through shared or removable devices and mask its communications via public and private proxies or the anonymous Tor network.</p>\n\n<p><b>2. SeroXen: A RAT&#39;s rapid ascent and fall</b></p>\n\n<p>In a twist of fate, 2023 witnessed the meteoric rise and fall of <a href=\"https://cybersecurity.att.com/blogs/labs-research/seroxen-rat-for-sale\" target=\"_blank\">SeroXen</a>, a new variant of the Quasar Remote Access Trojan (RAT). This modified branch of the open-source RAT added significant modifications to its original framework, enhancing its capabilities.</p>\n\n<p>SeroXen achieved quick notoriety, with hundreds of samples identified within the first few months of the year. However, shortly after the blog highlighting its emergence was published, the SeroXen website announced its shutdown and implemented a kill-switch, rendering infected PCs useless to malicious actors. It was a rare instance where the publication of research inadvertently led to the downfall of a malware tool.</p>\n\n<p><b>3. AdLoad: Mac systems turned into proxy servers</b></p>\n\n<p><a href=\"https://cybersecurity.att.com/blogs/labs-research/proxynation-the-dark-nexus-between-proxy-apps-and-malware\" target=\"_blank\">AT&amp;T Cybersecurity Alien Labs uncovered</a> a devious malware campaign involving AdLoad. This malware ingeniously transformed users&#39; Mac systems into proxy servers, then sold to third parties, including some with illicit purposes. The threat actor behind AdLoad infected target systems surreptitiously installed a proxy application in the background.</p>\n\n<p>These infected systems were subsequently offered to proxy companies, portraying themselves as legitimate entities. Buyers exploited the benefits of these residential proxy botnets, enjoying anonymity, wide geographical availability, and high IP rotation for conducting nefarious activities, including SPAM campaigns.</p>\n\n<p>Following the publication of the research blog, a similar campaign targeting Windows systems emerged. The modus operandi mirrored that of the Mac version but was tailored for Windows OS, significantly expanding the potential target pool and the impact of the proxy network.</p>\n\n<p><b>4. AsyncRAT: The persistent phishing threat</b></p>\n\n<p>Throughout 2023, cybersecurity experts observed a continuous <a href=\"https://cybersecurity.att.com/blogs/labs-research/seroxen-rat-for-sale\" target=\"_blank\">influx of phishing emails using advanced techniques</a>. These emails enticed victims to download a malicious JavaScript file, heavily obfuscated and armed with anti-sandboxing measures to evade detection. These attacks aimed to execute an AsyncRAT client on the compromised systems, granting attackers full remote access.&nbsp;</p>\n\n<h2>About us</h2>\n\n<p>AT&amp;T Alien Labs is the threat intelligence unit of AT&amp;T Cybersecurity. We help fuel our cybersecurity consulting and managed security services with the most up-to-date threat intelligence information. We work with the <a href=\"https://otx.alienvault.com/\" target=\"_blank\">Open Threat Exchange (OTX)</a> to provide actionable and community-powered threat data. Watch the AT&amp;T Cybersecurity blog for more observations and research from the Alien Labs team.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-25T11:00:00+00:00"},{"title":"Get the AT&amp;T Cybersecurity Insights Report: Focus on Finance","link":"https://cybersecurity.att.com/blogs/security-essentials/get-the-att-cybersecurity-insights-report-focus-on-finance","guid":"https://cybersecurity.att.com/blogs/security-essentials/get-the-att-cybersecurity-insights-report-focus-on-finance#When:11:00:00Z","description":{"#cdata-section":"\n<p>We&rsquo;re pleased to announce the availability of the 2023 AT&amp;T Cybersecurity Insights Report: Focus on Finance. The report examines the edge ecosystem, surveying finance IT leaders from around the world, and provides benchmarks for assessing your edge computing plans. This is the 12th edition of our vendor-neutral and forward-looking report. Last year&rsquo;s focus on finance report documented how we secure the data, applications, and endpoints that rely on edge computing (<a href=\"https://cdn-cybersecurity.att.com/docs/infographics/cyber-security-insights-report-2022-manufacturing.pdf\" target=\"_blank\">get the 2022 report</a>).</p>\n\n<p><a href=\"https://cybersecurity.att.com/resource-center/insights-reports/2023-cybersecurity-insights-report-focus-on-finance\" target=\"_blank\"><b>Get the complimentary 2023 report.&nbsp;&nbsp;</b></a></p>\n\n<p>The robust quantitative field survey reached 1,418 security, IT, application development, and line of business professionals worldwide. The qualitative research tapped subject matter experts across the cybersecurity industry. Finance-specific respondents equal 204.</p>\n\n<p>At the onset of our research, we established the following hypotheses.</p>\n\n<ul>\n\t<li>Momentum edge computing has in the market.</li>\n\t<li>Approaches to connecting and securing the edge ecosystem &ndash; including the role of trusted advisors to achieve edge goals.</li>\n\t<li>Perceived risk and perceived benefit of the common use cases in each industry surveyed.</li>\n</ul>\n\n<p>The results focus on common edge use cases in seven vertical industries &ndash; healthcare, retail, finance, manufacturing, energy and utilities, transportation, and U.S. SLED - delivering actionable advice for securing and connecting an edge ecosystem, including external trusted advisors. Finally, it examines cybersecurity and the broader edge ecosystem of networking, service providers, and top use cases.</p>\n\n<h2>The role of IT is shifting, embracing stakeholders at the ideation phase of development.</h2>\n\n<p>Edge computing is a transformative technology that brings together various stakeholders and aligns their interests to drive integrated business outcomes. The emergence of edge computing has been fueled by a generation of visionaries who grew up in the era of smartphones and limitless possibilities. Look at the infographic below for a topline summary of key findings in the finance industry.</p>\n\n<p>In this paradigm, the role of IT has shifted from being the sole leader to a collaborative partner in delivering innovative edge computing solutions. In addition, we found that finance leaders are budgeting differently for edge use cases. These two things, along with an expanded approach to securing edge computing, were prioritized by our respondents in the <a href=\"https://cybersecurity.att.com/insights-report\" target=\"_blank\">2023 AT&amp;T Cybersecurity Insights Report: Edge Ecosystem</a>.</p>\n\n<p>One of the most promising aspects of edge computing is its potential to effectively use near-real-time data for tighter control of variable operations such as inventory and supply chain management that deliver improved operational efficiency. Adding new endpoints is essential for collecting the data, but how they&rsquo;re connected can make them vulnerable to cyberattacks. Successful cyberattacks can disrupt services, highlighting the need for robust cybersecurity measures.</p>\n\n<h2>Edge computing brings the data closer to where decisions are made.</h2>\n\n<p>With edge computing, the intelligence required to make decisions, the networks used to capture and transmit data, and the use case management are distributed. Distributed means things work faster because nothing is backhauled to a central processing area such as a data center and delivers the near-real-time experience.</p>\n\n<p>With this level of complexity, it&rsquo;s common to re-evaluate decisions regarding security, data storage, or networking. The report shares emerging trends as finance continues exploring edge computing use cases. One area that&rsquo;s examined is expense allocation, and what we found may surprise you. The research reveals the allocation of investments across overall strategy and planning, network, application, and security for the anticipated use cases that organizations plan to implement within the next three years.</p>\n\n<h2>Preparing to secure your finance edge ecosystem.</h2>\n\n<p><b>Develop your edge computing profile</b>. It is essential to break down the barriers that typically separate the internal line of business teams, application development teams, network teams, and security teams. Technology decisions should not be made in isolation but rather through collaboration with line of business partners. Understanding the capabilities and limitations of existing business and technology partners makes it easier to identify gaps in evolving project plans.</p>\n\n<p>The edge ecosystem is expanding, and expertise is available to offer solutions that address cost, implementation, mitigating risks, and more. Including expertise from the broader finance edge ecosystem increases the chances of outstanding performance and alignment with organizational goals.</p>\n\n<p><b>Develop an investment strategy. </b>During finance edge use case development, organizations should carefully determine where and how much to invest. Think of it as part of monetizing the use case. Building security into the use case from the start allows the organization to consider security as part of the overall cost of goods (COG). It&#39;s important to note that no one-size-fits-all solution can provide complete protection for all aspects of edge computing. Instead, organizations should consider a comprehensive and multi-layered approach to address the unique security challenges of each use case.</p>\n\n<p><b>increase your compliance capabilities. </b>Regulations in finance can vary significantly. This underscores the importance of not relying solely on a checkbox approach or conducting annual reviews to help ensure compliance with the growing number of regulations. Keeping up with technology-related mandates and helping to ensure compliance requires ongoing effort and expertise. If navigating compliance requirements is not within your organization&#39;s expertise, seek outside help from professionals specializing in this area.</p>\n\n<p><b>Align resources with emerging priorities.</b> External collaboration allows organizations to utilize expertise and reduce resource costs. It goes beyond relying solely on internal teams within the organization. It involves tapping into the expanding ecosystem of edge computing experts who offer strategic and practical guidance. Engaging external subject matter experts (SMEs) to enhance decision-making can help prevent costly mistakes and accelerate deployment. These external experts can help optimize use case implementation, ultimately saving time and resources.</p>\n\n<p><b>Build-in resilience. </b>Consider approaching edge computing with a layered mindset. Take the time to ideate on various \"what-if\" scenarios and anticipate potential challenges. For example, what measures exist if a private 5G network experiences an outage? Can data remain secure when utilizing a public 4G network? How can business-as-usual operations continue in the event of a ransomware attack?</p>\n\n<p>Successful edge computing implementations in the finance industry require a holistic approach encompassing collaboration, compliance, resilience, and adaptability. By considering these factors and proactively engaging with the expertise available, finance will continue to unlock the potential of edge computing to deliver improved operational efficiency, allowing the industry to focus on innovation rather than operations.</p>\n\n<p><img alt=\"2023 Finance Infographic\" data-original=\"https://cdn-cybersecurity.att.com/docs/infographics/2023-insights-report-focus-on-finance.png\" src=\"https://cdn-cybersecurity.att.com/docs/infographics/2023-insights-report-focus-on-finance.png\" /></p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-24T11:00:00+00:00"},{"title":"The rise of ransomware: Strategies for prevention","link":"https://cybersecurity.att.com/blogs/security-essentials/the-rise-of-ransomware-strategies-for-prevention","guid":"https://cybersecurity.att.com/blogs/security-essentials/the-rise-of-ransomware-strategies-for-prevention#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>The exponential rise of <a href=\"https://cybersecurity.att.com/blogs/security-essentials/5-reasons-were-seeing-more-ransomware-attacks-than-ever-before\" target=\"_blank\">ransomware</a> attacks in recent times has become a critical concern for organizations across various industries. Ransomware, a malicious software that encrypts data and demands a ransom for its release, can wreak havoc on an organization&#39;s operations, finances, and reputation. This comprehensive guide delves into the intricate landscape of ransomware, exploring sophisticated attack vectors, common vulnerabilities, and providing detailed strategies for prevention.</p>\n\n<p>Ransomware is a type of malicious software designed to deny access to a computer system or data until a sum of money is paid. It often gains unauthorized access through exploiting vulnerabilities or employing social engineering tactics like phishing emails and malicious attachments.</p>\n\n<p>Over the years, ransomware attacks have evolved from indiscriminate campaigns to highly targeted and sophisticated operations. Notorious strains such as <a href=\"https://cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-wannacry-malware\" target=\"_blank\">WannaCry</a>, Ryuk, and Maze have demonstrated the devastating impact of these attacks on organizations worldwide.</p>\n\n<h2>Common vulnerabilities exploited</h2>\n\n<p><i>Outdated software and patch management:</i> Ransomware often exploits vulnerabilities in outdated software. Robust patch management is crucial for closing these security gaps.</p>\n\n<p><i><a href=\"https://cybersecurity.att.com/blogs/security-essentials/social-engineering-attacks-real-life-examples-and-how-to-avoid-them\" target=\"_blank\">Social engineering</a> and <a href=\"https://cybersecurity.att.com/blogs/security-essentials/10-ways-to-spot-a-phishing-attempt\" target=\"_blank\">phishing</a>:</i> Human error remains a significant factor in ransomware attacks. Employees need comprehensive training to recognize and avoid phishing attempts.</p>\n\n<p><i>Weak authentication practices:</i> Inadequate password policies and the absence of multi-factor authentication create entry points for threat actors.</p>\n\n<p><i>Poorly configured remote desktop protocol (RDP):</i> RDP misconfigurations can provide a direct path for ransomware to infiltrate a network.</p>\n\n<h2>Comprehensive prevention strategies</h2>\n\n<p><i>Regular software updates and patch management:</i> Implement a proactive approach to software updates and patch vulnerabilities promptly.</p>\n\n<p><i>Employee training and awareness:</i> Conduct regular cybersecurity training sessions to educate employees about the dangers of phishing and best practices for online security.</p>\n\n<p><i>Multi-factor authentication (MFA):</i> Enforce MFA to add an additional layer of security, mitigating the risk of unauthorized access.</p>\n\n<p><i><a href=\"https://cybersecurity.att.com/blogs/security-essentials/network-segmentation-explained\" target=\"_blank\">Network segmentation</a>:</i> Divide networks into segments to contain the spread of ransomware in case of a breach.</p>\n\n<p><i>Data backup and recovery:</i> Establish regular backups of critical data and ensure that recovery processes are tested and reliable.</p>\n\n<h2>Post-infection recovery plans:</h2>\n\n<p>The aftermath of a ransomware attack can be chaotic and detrimental to an organization&#39;s operations. Developing a robust post-infection recovery plan is essential to minimize damage, restore functionality, and ensure a swift return to normalcy. This detailed guide outlines the key components of an effective recovery plan tailored for organizations recovering from a ransomware incident.</p>\n\n<p>Key components of post-infection recovery plans:</p>\n\n<p><b>Incident response team activation:</b></p>\n\n<p><i>Swift action:</i> Activate the incident response team immediately upon detecting a ransomware attack.</p>\n\n<p><i>Communication protocols:</i> Establish clear communication channels among team members, ensuring rapid coordination and decision-making.</p>\n\n<p><i>Roles and responsibilities:</i> Clearly define the roles and responsibilities of each team member to streamline the response process.</p>\n\n<p><b>Isolation of affected systems:</b></p>\n\n<p><i>Identify compromised systems:</i> Conduct a thorough assessment to identify systems and networks affected by the ransomware.</p>\n\n<p><i>Isolation protocols:</i> Isolate compromised systems from the network to prevent the spread of the ransomware to unaffected areas.</p>\n\n<p><b>Forensic analysis:</b></p>\n\n<p><i>Determine entry points:</i> Conduct a forensic analysis to identify the entry points and methods used by the attackers.</p>\n\n<p><i>Scope assessment:</i> Determine the extent of the breach, including compromised data and potential unauthorized access.</p>\n\n<p><b>Restoration from backups:</b></p>\n\n<p><i>Backup verification:</i> Confirm the integrity and availability of backups to ensure they have not been compromised.</p>\n\n<p><i>Prioritization:</i> Prioritize critical systems and data for restoration to minimize downtime.</p>\n\n<p><i>Testing:</i> Test the restoration process to verify that recovered data is accurate and functional.</p>\n\n<p><b>Legal and regulatory compliance measures:</b></p>\n\n<p><i>Data breach notifications:</i> Comply with legal requirements regarding data breach notifications to affected parties and regulatory authorities.</p>\n\n<p><i>Documentation:</i> Maintain detailed documentation of the incident, actions taken, and compliance measures to demonstrate due diligence.</p>\n\n<p><b>Communication strategy:</b></p>\n\n<p><i>Internal communication:</i> Keep internal stakeholders, including employees and management, informed about the situation, recovery progress, and preventive measures.</p>\n\n<p><i>External communication:</i> Develop a communication strategy for external stakeholders, such as customers, partners, and regulatory bodies.</p>\n\n<p><b>Continuous monitoring and analysis:</b></p>\n\n<p><i><a href=\"https://cybersecurity.att.com/blogs/security-essentials/cyber-threat-intelligence-explained\" target=\"_blank\">Threat intelligence</a>:</i> Stay informed about emerging threats and vulnerabilities by leveraging threat intelligence sources.</p>\n\n<p><i>Continuous monitoring:</i> Implement continuous monitoring of network activities to detect any residual threats or signs of reinfection.</p>\n\n<h2>Lessons learned and improvements:</h2>\n\n<p><i>After-action review:</i> Conduct a comprehensive after-action review to analyze incident response and recovery efforts.</p>\n\n<p><i>Update policies and procedures:</i> Revise security policies and procedures based on lessons learned to enhance future incident response capabilities.</p>\n\n<h2>Conclusion</h2>\n\n<p>Ransomware represents a persistent and evolving threat, demanding a multifaceted approach to cybersecurity. This guide serves as a comprehensive resource for organizations aiming to fortify their defenses against ransomware. By understanding the threat landscape, addressing vulnerabilities, and implementing robust prevention and recovery strategies, organizations can significantly enhance their resilience in the face of this growing menace.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-23T11:00:00+00:00"},{"title":"Best practices to implement self-doxxing in organizations","link":"https://cybersecurity.att.com/blogs/security-essentials/best-practices-to-implement-self-doxxing-in-organizations","guid":"https://cybersecurity.att.com/blogs/security-essentials/best-practices-to-implement-self-doxxing-in-organizations#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>Organizations face a constant challenge to balance transparency and security in today&#39;s rapidly evolving digital landscape. One emerging concept that has gained traction in recent years is the practice of \"self-doxxing.\" This seemingly counterintuitive term refers to the deliberate and controlled sharing of an organization&#39;s information, often sensitive, to enhance transparency, accountability, and trust. While it might sound paradoxical to disclose information that could be exploited by malicious actors voluntarily, the strategic implementation of self-doxing can indeed be a powerful tool in an organization&#39;s arsenal.</p>\n\n<h2>What does it mean by self-doxxing?</h2>\n\n<p>Self-doxing, short for \"self-documenting,\" is a proactive approach where organizations voluntarily share information about themselves, their operations, and their practices with the public, stakeholders, and competitors.</p>\n\n<p>This practice is in direct contrast to traditional security measures that aim to limit the exposure of sensitive data. Traditionally, data privacy measures rely on endpoint security tools such as <a href=\"https://vpnoverview.com/vpn-information/what-is-a-vpn/\" target=\"_blank\">VPNs</a>, antivirus, password managers, etc, to ensure security. These tools help implement a zero-trust security module within an organization to ensure data privacy and security.</p>\n\n<p>In contrast to this traditional zero-trust security method, self-doxing is a strategic move to foster transparency, build trust, and engage with a broader audience. It&#39;s about taking control of the narrative surrounding your organization and providing the public with a clearer picture of who you are and what you stand for.</p>\n\n<p>By voluntarily sharing information, organizations aim to shape perceptions, demonstrate accountability, and minimize the potential for unauthorized leaks or misinformation. However, successful self-doxxing requires careful planning and a deep understanding of what to share and protect.</p>\n\n<h2>Why should you implement self-doxxing in an organization?</h2>\n\n<p>Self-doxing, when executed thoughtfully, offers many advantages for organizations looking to thrive in a digitally connected world.</p>\n\n<ul>\n\t<li>&nbsp;<b>Enhanced transparency:</b></li>\n</ul>\n\n<p>One of the primary benefits of self-doxxing is the promotion of transparency. By willingly sharing information about your organization&#39;s operations, practices, and ethical standards, you signal stakeholders and the public that you have nothing to hide. This transparency can foster trust and credibility, making your organization more attractive to customers, investors, and partners.</p>\n\n<ul>\n\t<li>&nbsp;<b>Reputation management:</b></li>\n</ul>\n\n<p>Self-doxxing allows you to control the narrative about your organization. By providing accurate and comprehensive information, you can preemptively address potential issues, correct misunderstandings, and mitigate reputational risks. This proactive approach to reputation management can be invaluable in an age where public perception can impact an organization&#39;s success.</p>\n\n<ul>\n\t<li>&nbsp;<b>Stakeholder engagement:</b></li>\n</ul>\n\n<p>Sharing information about your organization can also enhance stakeholder engagement, including customers, employees, and shareholders. When people feel that an organization is open and honest about its practices, they are more likely to engage positively with it.</p>\n\n<ul>\n\t<li>&nbsp;<b>Competitive advantage: </b></li>\n</ul>\n\n<p>Self-doxxing can also provide a competitive edge. By openly sharing your organization&#39;s strengths, innovations, and accomplishments, you can demonstrate industry leadership and attract talent, partners, and customers who align with your values and goals.</p>\n\n<ul>\n\t<li>&nbsp;<b>Regulatory compliance:</b></li>\n</ul>\n\n<p>&nbsp;In many industries, regulatory compliance requires organizations to disclose specific information. Self-doxing ensures you consistently meet these requirements and avoid potential legal issues.</p>\n\n<p>In short, self-doxing is a strategic approach that can contribute to an organization&#39;s long-term success by promoting transparency, managing reputation, engaging stakeholders, gaining a competitive advantage, and ensuring compliance with regulatory standards. However, it&#39;s essential to implement self-doxing practices carefully to reap these benefits while safeguarding sensitive information.</p>\n\n<h2>How to implement self-doxxing in an organization</h2>\n\n<p>Implementing self-doxing effectively requires a well-thought-out strategy and careful execution. Here are vital steps to consider:</p>\n\n<ol>\n\t<li>Start by identifying the information appropriate for sharing, such as your organization&#39;s mission, values, governance structure, environmental and social practices, and key performance indicators. Consider the most relevant information to your stakeholders and align with your goals.</li>\n\t<li>Develop comprehensive guidelines and policies that outline what can and cannot be shared. Ensure that your team understands these guidelines and is trained on the importance of responsible self-doxing.</li>\n\t<li>While sharing information, maintain a strong focus on security. Protect sensitive data by implementing robust cybersecurity measures, encryption protocols, and access controls. Regularly assess and update security measures to adapt to evolving threats.</li>\n\t<li>Select appropriate channels for sharing information. These may include your organization&#39;s website, social media platforms, annual reports, and press releases. Tailor your approach to your target audience and the nature of the information being shared.</li>\n\t<li>Actively monitor the responses to your self-doxing efforts. Listen to feedback, engage with your audience, and be prepared to respond to questions or concerns promptly. Transparency also involves addressing issues and problems openly and honestly.</li>\n\t<li>Ensure that all departments within your organization are on the same page regarding self-doxing efforts. Collaborate to gather and verify information for sharing and maintain consistency in messaging.</li>\n\t<li>Recognize that self-doxing is not a one-time effort but an ongoing commitment. Continually assess and update your strategy to reflect changes in your organization, industry, and stakeholder expectations.</li>\n</ol>\n\n<p>These steps can help implement self-doxing as a strategic tool to foster transparency, build trust, and engage effectively with stakeholders. When executed thoughtfully, self-doxing can become an influential asset in your organization&#39;s toolkit for success.</p>\n\n<h2>Best practices to implement self-doxxing in organizations</h2>\n\n<p>Implementing self-doxxing in organizations requires a careful and thorough approach. Here are some essential things to consider while implementing self-doxxing in your organization:</p>\n\n<ul>\n\t<li><b>Purpose and strategy: </b>Clearly define why you want to engage in self-doxxing and what you hope to achieve. Determine your goals and how sharing personal information aligns with your organization&#39;s values and communication strategy.</li>\n\t<li><b>Consent and privacy: </b>Respect individuals&#39; privacy by seeking permission before sharing personal information. Make sure they understand the implications and potential risks involved. Moreover, it is essential to provide options for participation and honor their privacy preferences.</li>\n\t<li><b>Transparency and authenticity: </b>Emphasize the importance of transparency and authenticity in your self-doxxing efforts. Communicate openly about why you are sharing personal information and stay true to your values.</li>\n\t<li><b>Empower individuals: </b>Encourage individuals within your organization to participate voluntarily. Provide guidance, training, and support to help them navigate self-doxxing responsibly.</li>\n\t<li><b>Mitigate risks: </b>Monitor online presence, manage privacy settings, and implement security measures to protect confidential information from unauthorized access or misuse. Stay proactive in updating security protocols to address evolving threats.</li>\n\t<li><b>Regular evaluation and adaptation: </b>Continuously evaluate the impact of your self-doxxing initiatives. Gather participant and audience feedback to refine your strategy, address concerns, and adapt as necessary.</li>\n</ul>\n\n<p>By following these practical steps, organizations can implement self-doxxing thoughtfully and responsibly, balancing the benefits of increased transparency with the need to protect the privacy and maintain ethical standards.</p>\n\n<h2>Conclusion</h2>\n\n<p>Self-doxxing is a practice that challenges traditional concepts of online identity, as individuals voluntarily share personal information publicly. Some organizations view self-doxxing as promoting transparency, trust, and stronger connections among members.</p>\n\n<p>However, it is crucial to recognize the potential risks and heightened vulnerability to security threats that come with this practice. Organizations should prioritize implementing effective cybersecurity measures and robust privacy policies.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-22T11:00:00+00:00"},{"title":"Four cybersecurity trends you should know for 2024","link":"https://cybersecurity.att.com/blogs/security-essentials/four-cybersecurity-trends-you-should-know-for-2024","guid":"https://cybersecurity.att.com/blogs/security-essentials/four-cybersecurity-trends-you-should-know-for-2024#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>This is part three of a three-part series written by AT&amp;T Cybersecurity evangelist Theresa Lanowitz. It&rsquo;s intended to be future-looking, provocative, and encourage discussion. The author wants to assure you that no generative AI was used in any part of this blog.</i></p>\n\n<p><i>Part one</i><b>: <a href=\"https://cybersecurity.att.com/blogs/security-essentials/unusual-thought-provoking-predictions-for-cybersecurity-in-2024\" target=\"_blank\">Unusual, thought-provoking predictions for cybersecurity in 2024</a></b></p>\n\n<p><i>Part two: </i><a href=\"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-operations-in-2024-the-soc-of-the-future\" target=\"_blank\"><b>Cybersecurity operations in 2024: The SOC of the future</b></a></p>\n\n<p>While there are many big things to prepare for in 2024 (see first two posts), some important smaller things don&rsquo;t get the same attention. Yet, these things are good to know and probably won&rsquo;t come as a huge surprise. Because they, too, are evolving, it&rsquo;s important <a href=\"https://www.merriam-webster.com/dictionary/keep%20one%27s%20eye%20on%20the%20ball\" target=\"_blank\">not to take your eye off the ball</a>.</p>\n\n<h2>Compliance creates a new code of conduct and a new need for compliance logic.</h2>\n\n<p>Compliance and governance are often overlooked when developing software because a different part of the business typically owns those responsibilities. That is all about to change. Cybersecurity policies (internal and external, including new regulations) need to move upstream in the software development lifecycle and need compliance logic built in to simplify the process. Software is designed to work globally; however, the world is becoming more segmented and parsed. Regulations are being created at country, regional, and municipal levels. To be realistic, the only way to handle compliance is via automation.</p>\n\n<p>To avoid the constant forking of software, compliance logic will need to be a part of modern applications. Compliance logic will allow software to function globally but adjust based on code sets that address geographic locations and corresponding regulations.</p>\n\n<p>In 2024, expect compliance logic to become a part of the larger conversation regarding compliance, governance, regulation, and policy. This will require cross-functional collaboration across IT, security, legal, line of business, finance, and other organizational stakeholders.</p>\n\n<h2>MFA gets physical.</h2>\n\n<p>Multi-factor authentication (MFA) is a way of life. The benefits far outweigh the slight inconvenience imposed. Think about why MFA is so critical. MFA helps with authorization and authentication for mission-critical and safety-critical work. It prevents unauthorized access to critical information. MFA is an easy-to-implement step for good cyber hygiene.</p>\n\n<p>Our current way of thinking about MFA is generally based on three things: something you know, a passcode; something you have, a device; and something you are, a fingerprint, your face, etc.</p>\n\n<p>Now, let&rsquo;s take this a step further and look at how the <i>something you are</i> part of MFA can improve safety. Today, MFA routinely accepts fingerprints, facial recognition, or retina scans. That&rsquo;s just the beginning. MFA can go a step further in helping with business outcomes; here&rsquo;s how.</p>\n\n<p>Biometric and behavioral MFA can help with identifying the veracity of an individual as well as the fitness to perform a function. For example, a surgeon can access the hospital, restricted areas, and the operating room through MFA verifications.</p>\n\n<p>But, once in the operating room, how is it determined that the surgeon is fit to perform the surgical task? Behavioral MFA will soon be in play to ensure the surgeon is fit by adding another layer of <i>something you are</i>. Behavioral MFA will determine fitness for a task by identifying things such as entering a series of numbers on a keypad, handwriting on a tablet, or voice analysis. The goal is to compare current behavior with past behavior to ensure no cognitive compromise.</p>\n\n<p>In 2024, expect to see more discussion of expanding MFA and the <i>something you are</i> aspect to include fitness for a task. This is an outstanding bit of innovation that will continue to evolve our digital world.</p>\n\n<h2>Beef-up your AI lexicon.</h2>\n\n<p>This blog would be remiss without mentioning AI. In 2023, AI became a media sweetheart because of the broad use of generative AI for everything from writing term papers to marketing materials to legal briefs. The lowest common denominator of AI usage was released. However, generative AI has struggles with hallucination (creating non-sensical or inaccurate output because of pattern matching in a large language model), collapse (the generation of repetitive output because of data limitations), and a garbage-in-garbage-out irony.</p>\n\n<p>Generative AI will impact social engineering and make <a href=\"https://cybersecurity.att.com/blogs/security-essentials/the-evolution-of-phishing-attacks\" target=\"_blank\">phishing</a>, squishing (the new phishing using QR codes), and smishing (sending counterfeit text messages) more difficult to detect. Intentionally malicious code may be more difficult to detect and, in some cases, may be integrated into legitimate source code branches. All of this means we must be more aware and vigilant.</p>\n\n<p>Machine learning has long been a tool for data scientists, security researchers, and threat intelligence teams. The technology is superb at scanning large data sets and pattern matching.</p>\n\n<p>Next up in the AI frenzy is something that few are discussing: deep learning. Deep learning is about producing predictions based on complexities in data. This can help in predicting a threat before it happens. Deep learning models have a large enough dataset to use past observations to predict future activity.</p>\n\n<p>In 2024, expect deep learning to enter the cybersecurity conversation to take the industry to places that machine learning can&rsquo;t take us. More data and more observations help hone future predictions.</p>\n\n<h2>Social engineering is still hard to beat</h2>\n\n<p>Despite the technology we have to protect our networks, applications, and data, the human element is still the weakest link. And social engineering is a major contributor to security events. <a href=\"https://cybersecurity.att.com/blogs/security-essentials/what-are-bec-scams-and-how-to-avoid-them\" target=\"_blank\">Business email compromise</a> was the second most common attack concern in our <a href=\"https://cybersecurity.att.com/insights-report\" target=\"_blank\">2023 research</a>. Compromised credentials can easily allow a bad actor access to the digital kingdom.</p>\n\n<p>Stolen or compromised credentials are a treasure trove for social engineers. Bad actors can use inexpensive technology to spoof voices and gain access to accounts or be given access to credentials. Social engineers prey on emotions and always want the target to act out of a sense of urgency. Frequent social engineering tactics will include phrases such as &ldquo;I&rsquo;m rushing to get on a plane and need this right now,&rdquo; &ldquo;your family member needs this cash right now,&rdquo; or &ldquo;your family/friend is in danger and needs your help&rdquo;. Being alert and aware are the best ways to counteract these social engineering scams. As cybersecurity professionals, we need to talk to our colleagues, friends, and family about the tactics of social engineers.</p>\n\n<p>In 2024, unfortunately, expect social engineering tactics to continue to evolve and reap payouts from unsuspecting people. Being a cybersecurity ambassador can go a long way to helping the public understand what social engineering is and how to avoid it.</p>\n\n<h2>Looking ahead</h2>\n\n<p>A new year is always exciting and moving into 2024 is no exception. Technology continues to surprise and delight us.</p>\n\n<p>The time is ripe for innovation, and we were treated to a glimpse of the future in 2023.</p>\n\n<p>Looking ahead, 2024 is the year of the business understanding security and security starting to understand the business.</p>\n\n<p>Here&rsquo;s to a year of innovation!</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-18T11:00:00+00:00"},{"title":"Cybersecurity operations in 2024: The SOC of the future","link":"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-operations-in-2024-the-soc-of-the-future","guid":"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-operations-in-2024-the-soc-of-the-future#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>This is part two of a three-part series written by AT&amp;T Cybersecurity evangelist Theresa Lanowitz. It&rsquo;s intended to be future-looking, provocative, and encourage discussion. The author wants to assure you that no generative AI was used in any part of this blog.</i></p>\n\n<p><a href=\"https://cybersecurity.att.com/blogs/security-essentials/unusual-thought-provoking-predictions-for-cybersecurity-in-2024\" target=\"_blank\"><i>Part one</i><b>: Unusual, thought-provoking predictions for cybersecurity in 2024</b></a></p>\n\n<p><a href=\"https://cybersecurity.att.com/blogs/security-essentials/four-cybersecurity-trends-you-should-know-for-2024\" target=\"_blank\"><i>Part three: </i><b>Four cybersecurity trends you should know for 2024</b></a></p>\n\n<p>With the democratization of computing comes attack surface expansion. <a href=\"https://www.gartner.com/en/newsroom/press-releases/2022-10-19-gartner-says-89-percent-of-board-directors-say-digital-is-embedded-in-all-business-growth-strategies\" target=\"_blank\">According to Gartner</a>, 91% of businesses are engaged in some form of digital initiative, and 87% of senior business leaders say digitalization is a priority.&nbsp;89% of all companies have already adopted a digital-first business strategy or are planning to do so.</p>\n\n<p>The more digital the world becomes the greater the attack surface. This is simply a fact. Securing that ever-expanding attack surface is where we will see innovation.</p>\n\n<p>The security operations center (SOC) must modernize to keep pace with the always-on and digital-first world delivered through innovations such as edge computing, AI, and IoT. The SOC of the future will need to expand to address:</p>\n\n<h2>Edge computing</h2>\n\n<p>Edge computing is happening all around us. Defined by three primary characteristics: software-defined, data-driven, and distributed, <a href=\"https://cybersecurity.att.com/resource-center/insights-reports/cybersecurity-insights-report-edge-ecosystem\">edge computing use cases are expanding</a> to deliver business outcomes.</p>\n\n<p>Edge computing is a sea-change in the world of computing.</p>\n\n<p>As edge use cases deliver business value and competitive advantage, the technology changes &ndash; networks with lower latency, ephemeral applets, and a digital-first experience, are the requirements for all edge computing use cases.</p>\n\n<p>Edge computing needs to be embraced and managed by the SOC. There are diverse endpoints, new software stacks, and a rapidly changing attack surface that needs to be mapped and understood.</p>\n\n<p>In 2024, expect to see SOC teams, with roles that include security engineer/architect, security analyst, SOC manager, forensics investigator, threat responder, security analyst, and compliance auditor, begin to determine how edge computing needs to be secured. SOCs will explore various management activities, including understanding diverse and intentional endpoints, complete mapping of the attack surface, and ways to manage the fast-paced addition or subtraction of endpoints.</p>\n\n<h2>Application security</h2>\n\n<p>Without a doubt, we are living in a world built on software. Software is only as secure as the development requirements. Software controls our traditional applications that are still batch-based, sigh, and near-real-time edge interactions. Software is how the world works.</p>\n\n<p>With innovations in computing, software is changing; it is no longer about graphical user interface (GUI) applications that require some keyboard input to produce output. Edge computing is taking software to the next level of sophistication, with non-GUI or headless applets becoming the norm.</p>\n\n<p>While the software bill of materials (SBoM) requirements advance the cause of application security, edge computing and its reliance on functioning, performant, and secure software will make application security a necessity.</p>\n\n<p>In 2024, expect to see software engineering practices emphasizing security emerge. Simply being able to write code will no longer be enough; developers will increase their sophistication and require more security expertise to complement their already deep skill sets. Educational institutions at secondary and university levels are already advancing this much-needed emphasis on security for developers and software engineering.</p>\n\n<h2>Data security</h2>\n\n<p>The next generation of computing is all about data. Applications, workloads, and hosting are closer to where data is generated and consumed. It&rsquo;s all about a near-real-time, digital-first experience based on the collection, processing, and use of that data.</p>\n\n<p>The data needs to be free of corruption to assist with making or suggesting decisions to the user. This means the data needs to be protected, trusted, and usable.</p>\n\n<p>In 2024, expect data lifecycle governance and management to be a requirement for business computing use cases. Data security is something a SOC team will begin to manage as part of its responsibility.</p>\n\n<h2>Endpoints will expand to embrace new kinds of data capture</h2>\n\n<p>Endpoints are diversifying, expanding, and maturing. Industry analyst firm IDC projects the worldwide spending on IoT to surpass <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS50936423\" target=\"_blank\">$1 trillion in 2026</a>. The <a href=\"https://cybersecurity.att.com/resource-center/insights-reports/cybersecurity-insights-report-edge-ecosystem\" target=\"_blank\">2023 AT&amp;T Cybersecurity Insights Report</a> shows 30% of participants expanding their endpoints to include new diverse and intentional assets such as robots, wearables, and autonomous drones &ndash; while 48% use traditional endpoints such as phones, tablets, laptops, and desktops. Endpoints are critical to business.</p>\n\n<p>Today, most SOCs offer some endpoint detection and response (EDR) or extended detection and response (XDR). However, how are SOC teams preparing to precisely identify the status, location, make, and model of this rapidly expanding world of endpoints?</p>\n\n<p>In a world of computing comprised of diverse and intentional endpoints, SOC teams need to know the precise location of the endpoint, what it does, the manufacturer, whether the firmware is up to date, if the endpoint is actively participating in computing or if it should be decommissioned, and a host of other pieces of pertinent information. Computing is anywhere the endpoint is &ndash; and that endpoint needs to be understood at a granular level.</p>\n\n<p>In 2024, expect startups to provide solutions to deliver granular details of an endpoint, including attributes such as physical location, IP address, type of endpoint, manufacturer, firmware/operating system data, and active/non-active participant in data collection. Endpoints need to be mapped, identified, and properly managed to deliver the outcomes needed by the business. An endpoint cannot be left to languish and act as an unguarded entry point for an adversary.</p>\n\n<p>In addition to granular identification and mapping of endpoints, expect to see intentional endpoints built to achieve a specific goal, such as ease of use, use in harsh environments, and energy efficiency. These intentional endpoints will use a subset of a full-stack operating system. SOC teams must manage these intentional endpoints differently than endpoints with the full operating system.</p>\n\n<p>Look for significant advancements in how SOCs manage and monitor endpoints.</p>\n\n<h2>Mapping the attack surface</h2>\n\n<p>The attack surface continues to expand. We continue to add diverse endpoints and new types of computing. As we add new computing, legacy computing is not retired &ndash; complexity and the attack surface continue to grow.</p>\n\n<p>SOC teams of the future need to visually understand the attack surface. This sounds simple, but it isn&#39;t easy to distill the complex into a simple representation.</p>\n\n<p>In 2024, expect SOC teams to seek a way to easily map the attack surface and correlate relevant threat intelligence to the mapping. To effectively do this, other aspects of the SOC of the future will need to be realities.</p>\n\n<p>I&rsquo;ll be talking about this a lot more in 2024 as we endeavor to provide you with insights on how the industry is changing as we move forward. Bookmark our blog. There is a lot of great information coming in the months ahead.</p>\n\n<div style=\"page-break-after: always\"><span style=\"display: none;\">&nbsp;</span></div>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-17T11:00:00+00:00"},{"title":"Unusual, thought-provoking predictions for cybersecurity in 2024","link":"https://cybersecurity.att.com/blogs/security-essentials/unusual-thought-provoking-predictions-for-cybersecurity-in-2024","guid":"https://cybersecurity.att.com/blogs/security-essentials/unusual-thought-provoking-predictions-for-cybersecurity-in-2024#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>This is part one of a three-part series written by AT&amp;T Cybersecurity evangelist </i><a href=\"https://cybersecurity.att.com/blogs/author/theresa-lanowitz\" target=\"_blank\"><i>Theresa Lanowitz</i></a><i>. It&rsquo;s intended to be future-looking and provocative and to encourage discussion. The author wants to assure you that no generative AI was used in any part of this blog.</i></p>\n\n<h2>Entering 2024 brings us well into the third decade of the new millennium.</h2>\n\n<p>Do you recall how tentatively and maybe naively we approached the year 2000, otherwise <a href=\"https://en.wikipedia.org/wiki/Year_2000_problem\" target=\"_blank\">known as Y2K</a>? We stressed over two bytes in COBOL programs and regression tested every line of code to ensure our systems were ready to go at midnight on January 1, 2000. The clock struck 12, and the world breathed a collective sigh of relief &ndash; we survived the predicted digital disaster.</p>\n\n<p>And just like that, off we went - to create web, mobile, and cloud apps, to turn embedded software into the Internet of Things (IoT), and to democratize computing in a way that was only a dream just 23 years ago.</p>\n\n<p>With massive shifts and changes in computing in the wake, it&rsquo;s time to ask: where are we going in 2024, and what cybersecurity opportunities and challenges lie ahead?</p>\n\n<h2>Maturing the industry: It&rsquo;s the business that matters.</h2>\n\n<p>Cybersecurity is not about fear, uncertainty, and doubt (<a href=\"https://www.urbandictionary.com/define.php?term=FUD\">FUD</a>). It is about delivering business outcomes such as boarding a plane quicker to mitigate flight delay penalties, heating or cooling my house efficiently to manage energy consumption in various climates, or reducing waste in manufacturing to minimize product recalls.</p>\n\n<p>Notice there was no mention of security, data, network, coding, or anything remotely IT-centric or technical in the stated business outcomes above. We must aspire to this when thinking about our businesses and cybersecurity. It must be about the business first, advancing the customer experience, and removing friction.</p>\n\n<p><a href=\"https://cybersecurity.att.com/resource-center/insights-reports/cybersecurity-insights-report-edge-ecosystem\" target=\"_blank\">Cybersecurity is now a business requirement.</a> For cybersecurity to be part of business planning, cybersecurity teams need to become members of the business teams.</p>\n\n<p>Over the past three years, the cybersecurity market has rapidly matured. We are in the midst of market consolidation, with individual point products being acquired and integrated into platform offerings. These platform offerings will continue to evolve by acquiring smaller vendors, partnering, and innovating.</p>\n\n<p>The platform vendors clearly see the need for cybersecurity to be a part of the business conversation and want to act as a business partner and trusted advisor, not merely a product provider.</p>\n\n<h2>Cybersecurity budgets are changing, creating an approach to get funding differently.</h2>\n\n<p>This year, <a href=\"https://cybersecurity.att.com/resource-center/insights-reports/cybersecurity-insights-report-edge-ecosystem\" target=\"_blank\">our research</a> revealed an unexpected change: money is being redistributed as computing moves closer to the data source. Our respondents reported they are investing in new computing development &ndash; in this case, edge computing - in a way that&rsquo;s different from what we&rsquo;ve seen in the past. They are <i>proactively investing</i> in strategy and planning, the network, application development, and security to create a balanced, collaborative ecosystem.</p>\n\n<p>The big surprise isn&rsquo;t a new secret weapon or killer application. The surprise is what&rsquo;s needed: a new way of thinking about resource allocation. You&rsquo;ll still need your usual hardware, software, storage, and security buckets. How you balance those expenses is what&rsquo;s different.</p>\n\n<p>As computing moves closer to the data source, every deployment should contribute to the bottom line. By working closely with your business partners, I believe business leaders will be able to identify how to cost-justify use cases that include investments by IT.</p>\n\n<h2>Cybersecurity-as-a-service (CSaaS) will help organizations do more with less.</h2>\n\n<p>In 2024, expect the continued maturation of the cybersecurity business, and platform vendors embrace the idea of delivering on cybersecurity-as-a-service. The tooling companies of yesterday want to be today&#39;s business partners. There is far more value in the relationship of being a business partner vs. being a provider of a technology solution that becomes commodified. Platforms are critical to a business, while tools are tactical to help at a given time.</p>\n\n<p>Watch for traditional cybersecurity product vendors to enter the consulting or managed security services market. These platform vendors will offer specific and targeted services with other closely aligned vendors. Platform vendors will form alliances with startups that offer new technology to complement the platform. Organizations of all sizes and types are seeking an extension of their cybersecurity teams, and services from a trusted vendor are the next step.</p>\n\n<p>Part 2: Cybersecurity operations in 2024: The SOC of the future is <a href=\"https://cybersecurity.att.com/blogs/security-essentials/cybersecurity-operations-in-2024-the-soc-of-the-future\" target=\"_blank\">here</a>.</p>\n\n<p>Part 3: Four cybersecurity trends in 2024 is <a href=\"https://cybersecurity.att.com/blogs/security-essentials/four-cybersecurity-trends-you-should-know-for-2024\">here</a>.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-16T11:00:00+00:00"},{"title":"AI and privacy - Addressing the issues and challenges","link":"https://cybersecurity.att.com/blogs/security-essentials/ai-and-privacy-addressing-the-issues-and-challenges","guid":"https://cybersecurity.att.com/blogs/security-essentials/ai-and-privacy-addressing-the-issues-and-challenges#When:11:00:00Z","description":{"#cdata-section":"\n<p><i>The content of this post is solely the responsibility of the author.&nbsp; AT&amp;T does not adopt or endorse any of the views, positions, or information provided by the author in this article.&nbsp;</i></p>\n\n<p>Artificial intelligence (AI) has seamlessly woven itself into the fabric of our digital landscape, revolutionizing industries from healthcare to finance. As AI applications proliferate, the shadow of privacy concerns looms large.</p>\n\n<p>The convergence of <a href=\"https://cybersecurity.att.com/blogs/security-essentials/understanding-ai-risks-and-how-to-secure-using-zero-trust\">AI</a><a href=\"https://cybersecurity.att.com/blogs/security-essentials/understanding-ai-risks-and-how-to-secure-using-zero-trust\" target=\"_blank\"> </a>and privacy gives rise to a complex interplay where innovative technologies and individual privacy rights collide. In this exploration, we&#39;ll delve into the nuances of this intersection, dissecting the issues and challenges that accompany the integration of AI and privacy.</p>\n\n<h2>The intersection of AI and privacy</h2>\n\n<p>At the core of the AI and privacy nexus lie powerful technologies like machine learning (ML), natural language processing (NLP), and computer vision. ML algorithms, for instance, learn from vast datasets to make predictions or decisions without explicit programming.</p>\n\n<p>NLP enables machines to comprehend and respond to human language, while computer vision empowers systems to interpret and make decisions based on visual data. As AI seamlessly integrates into our daily lives, from virtual assistants to facial recognition systems to <a href=\"https://maze.co/guides/ux-research/ux-research-tools/\" target=\"_blank\">UX research tools</a>, the collection and processing of personal data become inevitable.</p>\n\n<p>AI&#39;s hunger for data is insatiable, and this appetite raises concerns about how personal information is collected and utilized. From your search history influencing your online shopping recommendations to facial recognition systems tracking your movements, AI has become a silent observer of your digital life.</p>\n\n<p>The challenge lies not only in the sheer volume of data but in the potential for misuse and unintended consequences, raising critical questions about consent, security, and the implications of biased decision-making.</p>\n\n<h2>Key issues and challenges</h2>\n\n<p>The first issue is informed consent. Obtaining meaningful consent in the age of AI is challenging. Often, complex algorithms and data processing methods make it difficult for individuals to understand the extent of data usage.</p>\n\n<p>In automated decision-making scenarios, such as loan approvals or job recruitment, the lack of transparency in how AI reaches conclusions poses a significant hurdle in obtaining informed consent.</p>\n\n<p>Another is <a href=\"https://cybersecurity.att.com/blogs/security-essentials/top-29-data-security-best-practices-for-your-enterprise\" target=\"_blank\">data security and breaches</a>. The vulnerabilities in AI systems, especially when handling sensitive personal data for identity verification, make them potential targets for cyberattacks. A data breach in an AI-driven ecosystem not only jeopardizes personal privacy but also has far-reaching consequences, affecting individuals, businesses, and society at large.</p>\n\n<p>You also need to be watchful for <a href=\"https://hbr.org/2019/10/what-do-we-do-about-the-biases-in-ai\" target=\"_blank\">bias and discrimination</a>. Bias in AI algorithms can perpetuate and amplify existing societal prejudices, leading to discriminatory outcomes.</p>\n\n<p>The impact of biased AI goes beyond <a href=\"https://cybersecurity.att.com/blogs/security-essentials/centralized-privacy-center-the-key-to-meeting-data-privacy-obligations\" target=\"_blank\">privacy concerns</a>, raising ethical questions about fairness, equality, and the potential reinforcement of societal stereotypes.</p>\n\n<h2>Regulations and frameworks</h2>\n\n<p>In response to the escalating concerns surrounding AI and privacy, regulatory frameworks have emerged as beacons of guidance. The General Data Protection Regulation (GDPR) in Europe and the California Privacy Rights Act (<a href=\"https://cybersecurity.att.com/blogs/security-essentials/the-cpra-compliance-checklist-every-business-should-follow-in-2023\" target=\"_blank\">CPRA</a>) in the United States set the stage for safeguarding individual privacy rights.</p>\n\n<p>These regulations impose stringent requirements on businesses, mandating transparent data practices, user consent, and mechanisms for individuals to control their data.</p>\n\n<p>While regulations are essential, ethical AI guidelines play an equally crucial role. Implementing responsible AI practices involves considering the broader societal impact, ensuring fairness, transparency, and accountability in the development and deployment of AI systems especially when it comes to things like digital identity.</p>\n\n<p>As an expert navigating this landscape, you must champion both compliance with existing regulations and the integration of ethical considerations into AI development.</p>\n\n<h2>Balancing innovation and privacy protection</h2>\n\n<p>Striking a delicate balance between innovation and privacy protection is the key to advancing AI responsibly.</p>\n\n<p>As industries push the boundaries of what AI can achieve, the challenge lies in mitigating risks without stifling progress. Incorporating privacy measures into the design phase, known as &ldquo;privacy by design&rdquo;, becomes paramount. Transparency in AI systems, allowing individuals to understand how their data is processed and used, is a linchpin in building trust.</p>\n\n<h2>Industry initiatives and best practices:</h2>\n\n<ul>\n\t<li>Embedding privacy considerations into the initial stages of AI development ensures that protection mechanisms are integral to the system.</li>\n\t<li>Transparency fosters a sense of trust between users and AI systems, providing clarity on data usage and minimizing the risk of unintended consequences.</li>\n</ul>\n\n<h2>Future trends and implications</h2>\n\n<p>As we peer into the future, the trajectory of AI and privacy holds both promise and trepidation. Emerging AI technologies, like federated learning and homomorphic encryption, aim to enhance privacy preservation by enabling machine learning on decentralized and encrypted data.</p>\n\n<p>The landscape of privacy regulations is expected to evolve, with more regions adopting comprehensive frameworks to govern AI applications.</p>\n\n<h2>Anticipated challenges and solutions:</h2>\n\n<ul>\n\t<li>The continual evolution of AI technologies poses challenges in keeping regulatory frameworks abreast of the rapidly changing landscape.</li>\n\t<li>Collaborative efforts between industry stakeholders, regulators, and technologists are crucial in addressing challenges and devising adaptive solutions.</li>\n</ul>\n\n<h2>Ethical considerations in AI development</h2>\n\n<p>Ethical considerations form the bedrock of responsible AI development, and as an expert, navigating the ethical landscape is integral to ensuring the harmonious coexistence of AI and privacy.</p>\n\n<p>Ethical frameworks guide the conception, creation, and deployment of AI systems, placing a premium on fairness, transparency, and accountability. The ethical dimensions of AI extend beyond individual privacy concerns to encompass broader societal impacts, reinforcing the need for a conscientious approach.</p>\n\n<h2>Ethical frameworks in AI design and deployment:</h2>\n\n<p>Ethical AI frameworks emphasize the need for fairness and impartiality in algorithmic decision-making, reducing the risk of biased outcomes. Accountability is a cornerstone of ethical AI, necessitating transparency in how decisions are reached and allocating responsibility for the consequences of AI actions.</p>\n\n<p>Especially important in this equation are the various external and internal stakeholders. Developers, businesses, and policymakers all play pivotal roles in upholding ethical AI practices and regular ethical assessments and audits should be integrated into the AI development lifecycle to identify and rectify potential ethical issues.</p>\n\n<h2>Conclusion</h2>\n\n<p>In navigating the intricate terrain of AI and privacy, you, as an expert, are tasked with a delicate dance between technological innovation and safeguarding individual privacy rights. The issues and challenges are formidable, but with a commitment to ethical practices, transparency, and ongoing collaboration, the harmonious integration of AI and privacy becomes an achievable goal.</p>\n\n<p>As the digital landscape evolves, so must our approach, ensuring that the benefits of AI innovation are harnessed responsibly, respecting the sanctity of individual privacy in an ever-changing world.</p>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-12T11:00:00+00:00"},{"title":"Stories from the SOC: BlackCat on the prowl","link":"https://cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-blackcat-on-the-prowl","guid":"https://cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-blackcat-on-the-prowl#When:11:00:00Z","description":{"#cdata-section":"\n<p><em>This blog was co-authored with Josue Gomez and Ofer Caspi.</em></p>\n\n<h2>Executive summary</h2>\n\n<p>BlackCat is and has been one of the more prolific malware strains in recent years. Believed to be the successor of <a href=\"https://cybersecurity.att.com/blogs/labs-research/revils-new-linux-version\" target=\"_blank\">REvil</a>, which has links to operators in Russia, it first was observed in the wild back in 2021, according to <a href=\"https://www.cisecurity.org/insights/blog/breaking-down-the-blackcat-ransomware-operation\" target=\"_blank\">researchers</a>. BlackCat is written in the Rust language, which offers better performance and efficiencies than other languages previously used.&nbsp; BlackCat is indiscriminate in how it targets its victims, which range from healthcare to entertainment industries. This blog will cover a recent incident impacting one of the AT&amp;T Managed Detection and Response (MDR) Security Operations Center &nbsp;SOC&rsquo;s customers and discuss how in partnering with <a href=\"https://cybersecurity.att.com/alien-labs\" target=\"_blank\">AT&amp;T Alien Labs</a>, the MDR SOC was able to detect and remediate the incident.&nbsp;</p>\n\n<h2>Building the investigation</h2>\n\n<p>On September 14th, 2023, the AT&amp;T MDR SOC received multiple alarms indicating that lateral movement was occurring for one of our clients. The alarm detections were generated after activity in SentinelOne for multiple users attempting to perform network traversing through the clients&rsquo; environment.</p>\n\n<p>&shy;&shy;&shy;&shy;&shy;&shy;<img alt=\"BlackCat infection detected\" src=\"blog-content/BlackCat_infection.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 1.&nbsp;Alarm Detection</p>\n\n<p>The AT&amp;T SOC immediately generated an investigation that included a call to the client to notify them of the activity as well as escalate the detection to the AT&amp;T MDR Incident Response (IR) Team and the client&#39;s dedicated Threat Hunter. The IR team and Threat Hunter began the engagement by creating a timeline and searching through SentinelOne Deep Visibility tool. Within its events, they found a user was successfully logged into the client&rsquo;s internal network on multiple endpoints using lsass.exe.. &nbsp;Additionally, multiple files were logged as being encrypted, which resulted in the team designating the incident a ransomware attack. &nbsp;&nbsp;</p>\n\n<p><img alt=\"lsass activity\" src=\"blog-content/lsass_activity.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 2. Lsass Activity in SentinelOne</p>\n\n<p>During the review of the lsass.exe activity, a specific file was located with a suspicious process tree. A command line was recorded with the file execution that included an internal IP address and the user <b>ADMIN$</b>. The activity from the suspicious file prompted an immediate blocklist for the SHA 1 file hash to ensure that the file was unable to be executed within the client&rsquo;s environment. Following the block of the file hash, multiple detections from SentinelOne populated, indicating that the file was successfully killed and quarantined and that the client&rsquo;s devices were protected.</p>\n\n<p><img alt=\"BlackCat command line\" src=\"blog-content/BlackCat_command_line.jpg\" /></p>\n\n<p style=\"text-align:center\">&nbsp;Figure 3. File execution command line</p>\n\n<p style=\"text-align:center\">After initiating the blocklist, the Threat Hunter utilized the SentinelOne &ldquo;<b>file fetch&rdquo;</b> feature, which enabled them to download the malicious file and save a copy locally. The AT&amp;T SOC then worked with the AT&amp;T Alien Labs team to perform a deeper analysis of the file in order to more understand &nbsp;the true nature of the ransomware attack.</p>\n\n<h2>Technical analyses</h2>\n\n<p>As previously mentioned, BlackCat ransomware is developed in the Rust programming language, providing the attacker with the versatility to compile and run it on both Windows and Linux operating systems.The ransomware employs encryption to conceal its strings. Upon execution, each string undergoes decryption through its own dedicated function, often utilizing a single-byte XOR key. Initially, the main payload is decrypted. If the provided arguments are accurate, the ransomware proceeds to decrypt its configuration and other essential strings, ensuring a smooth and secure operation. (See Figure 4.)</p>\n\n<p style=\"text-align:center\"><img alt=\"BlackCat decryption\" src=\"blog-content/blackcat_decryption.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 4. Single string decryption routine.</p>\n\n<p>The malware decrypts its configuration using the AES algorithm. (See Figure 5.)</p>\n\n<p style=\"text-align:center\"><img alt=\"AES decryption\" src=\"blog-content/AES_decryption.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 5. AES algorithm.</p>\n\n<p>BlackCat ransomware configuration includes the following details:</p>\n\n<ul>\n\t<li>File extension for encrypted files</li>\n\t<li>Specific domains, users, and passwords or password hashes belonging to the targeted company(These credentials were likely acquired during the initial stages of the infection by other malware.)</li>\n\t<li>The victim user panel on the Tor network containing the ransom demands made by the attackers</li>\n\t<li>A list of folders and file extensions to be skipped during encryption (e.g., *.exe, *.drv, *.msc, *.dll, *.lock, *.sys, *.msu, *.lnk).</li>\n\t<li>Particular folders to be handled (for both Windows and Linux, as the malware is written in Rust and can be compiled for both systems)</li>\n\t<li>The ransom note</li>\n</ul>\n\n<p>The malware uses the decrypted credentials to start services and to move laterally within the network. It utilizes the <a href=\"https://github.com/fortra/impacket\" target=\"_blank\">Impacket</a> Python library to carry out the actions. Impacket provides a wide range of functions for working with network protocols and creating network applications. It is particularly known for its ability to manipulate and interact with network packets and perform various tasks related to network penetration testing, security assessment, and exploitation. BlackCat uses Impacket in a Python script, which is responsible for creating and starting a service on a remote machine on the network with the ransomware binary. (See Figure 6.)</p>\n\n<p style=\"text-align:center\"><img alt=\"BlackCat Impacket\" src=\"blog-content/blackcat_impacket.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 6. Python script for lateral movement using Impacket.</p>\n\n<p>In addition, the malware enhances its impact by deleting Windows shadow copies, making data recovery more challenging. It accomplishes this through the commands shown in Figure 7:</p>\n\n<ul>\n\t<li>\"cmd\" /c \"vssadmin.exe Delete Shadows /all /quiet\"</li>\n\t<li>\"cmd\" /c \"wmic.exe Shadowcopy Delete\"</li>\n</ul>\n\n<p style=\"text-align:center\"><img alt=\"BlackCat delete shadow content\" src=\"blog-content/blackcat_delete_shadow_copies.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 7. Executing cmd command to delete shadow copies.</p>\n\n<p>Figure 8 shows a list of the commands supported by the malware:</p>\n\n<p style=\"text-align:center\"><img alt=\"BlackCat help\" src=\"blog-content/blackcat_help.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 8. BlackCat &ldquo;help&rdquo; page.</p>\n\n<p>Finally, the victim accesses the page on the Tor network that reveals the ransom price, live chat support, and a decryption trial. (See Figure 9.)</p>\n\n<p style=\"text-align:center\"><img alt=\"BlackCat victim access page\" src=\"blog-content/blackcat_victim_access_page.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure 9. BlackCat ransomware victim access page.</p>\n\n<h2>Detections</h2>\n\n<p>Using Impacket in the Python script should leave remnants of suspicious process executions. As previously mentioned, the creation and start of the new service should have a process tree of services.exe spawning new service/payload onto the $ADMIN share on the target asset.</p>\n\n<p><img alt=\"detecting sus process\" src=\"blog-content/detect_suspicious_process.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure10. Suspicious Process</p>\n\n<p>Once the payload is executed, the attacker begins deleting the shadow copy files. This is a common technique ransomware attacks use to ensure that recovery efforts are unsuccessful. The LOLBAS utilities utilized to undertake this task were vssadmin.exe and wmic.exe. Detection for this activity should focus on the process command line being run.</p>\n\n<p><img alt=\"attacker deleting shadows\" src=\"blog-content/attacker_deleting_shadows.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure11. Vssadmin.exe</p>\n\n<p><img alt=\"wmic\" src=\"blog-content/wmic.jpg\" /></p>\n\n<p style=\"text-align:center\">Figure12.Wmic.exe</p>\n\n<p style=\"text-align:center\"><img alt=\"impacket rule\" src=\"blog-content/Impacket_rule.png\" /></p>\n\n<p style=\"text-align:center\"><img alt=\"deletion shadow rule\" src=\"blog-content/DeletionShadowRule.png\" /></p>\n\n<p>\n&#10;&nbsp;</p>\n\n<p>The following <a href=\"https://cybersecurity.att.com/products/usm-anywhere\" target=\"_blank\">USM Anywhere </a>&nbsp;correlation rules could aid in detecting some of the activity described in the malware.</p>\n\n<table style=\"border-collapse:collapse\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td style=\"background-color:#d9d9d9; border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:1px solid black; width:623px\">\n\t\t\t<p>USM Anywhere correlation rules</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:none; width:623px\">\n\t\t\t<p>Windows Shadow Copies Deletion</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:none; width:623px\">\n\t\t\t<p>Possible Impacket Lateral Movement Activity</p>\n\t\t\t</td>\n\t\t</tr>\n\t</tbody>\n</table>\n\n<h2>&nbsp;</h2>\n\n<h2>Remediation</h2>\n\n<p>Following the incident, the information from the AT&amp;T Alien Labs team was provided to the client. The client then worked closely with the assigned Threat Hunter to implement the recommended remediation steps, which were as follows:</p>\n\n<ul>\n\t<li>Verify any new groups or admins that were created</li>\n\t<li>Initiate a password reset for all admin users</li>\n\t<li>Force a password reset for all users during their next login</li>\n\t<li>Reboot any servers affected by the incident\n\t<ul style=\"list-style-type:circle\">\n\t\t<li>This step will close all active remote desktop sessions</li>\n\t</ul>\n\t</li>\n\t<li>Verify any installation of remote management software</li>\n\t<li>Review all current software installed within the environment</li>\n\t<li>Review any external facing portals in the environment</li>\n\t<li>Rotate the Kerberos password twice</li>\n\t<li>Blacklist the file attempting to execute the ransomware</li>\n\t<li>Rebuild any infected Domain Controllers</li>\n\t<li>Review the list of users listed in the data pulled from Alien Labs\n\t<ul style=\"list-style-type:circle\">\n\t\t<li>Compromised user passwords</li>\n\t</ul>\n\t</li>\n</ul>\n\n<p>With the assistance of the AT&amp;T Alien Labs team, Incident Response team, and Threat Hunter, the client was able to review the information and ensure the threat was unable to gain access into their environment post-incident.</p>\n\n<table style=\"border-collapse:collapse\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td style=\"background-color:#d9d9d9; border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:1px solid black; width:623px\">\n\t\t\t<p>Pulses related to BlackCat Indicators</p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:none; width:623px\">\n\t\t\t<p><a href=\"https://otx.alienvault.com/pulse/6532fad4104f6577740b7a15\" target=\"_blank\">https://otx.alienvault.com/pulse/6532fad4104f6577740b7a15</a></p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:none; width:623px\">\n\t\t\t<p><a href=\"https://otx.alienvault.com/pulse/64a31b647e34ec2626fc3c26\" target=\"_blank\">https://otx.alienvault.com/pulse/64a31b647e34ec2626fc3c26</a></p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:none; width:623px\">\n\t\t\t<p><a href=\"https://otx.alienvault.com/pulse/646ba99ab25604f67ffda2ad\" target=\"_blank\">https://otx.alienvault.com/pulse/646ba99ab25604f67ffda2ad</a></p>\n\t\t\t</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"border-bottom:1px solid black; border-left:1px solid black; border-right:1px solid black; border-top:none; width:623px\">\n\t\t\t<p><a href=\"https://otx.alienvault.com/pulse/64304e379620a4a8159e2d2a\" target=\"_blank\">https://otx.alienvault.com/pulse/64304e379620a4a8159e2d2a</a></p>\n\t\t\t</td>\n\t\t</tr>\n\t</tbody>\n</table>\n"},"dc:subject":{"#cdata-section":""},"dc:date":"2024-01-11T11:00:00+00:00"}]}}}