{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@xmlns:dc":"http://purl.org/dc/elements/1.1/","@version":"2.0","@xml:base":"https://www.tripwire.com/","channel":{"title":"Blog RSS Feed","link":"https://www.tripwire.com/","description":"HelpSystems Blog","language":"en","item":[{"title":"NCSC Warns That AI is Already Being Used by Ransomware Gangs","link":"https://www.tripwire.com/state-of-security/ncsc-warns-ai-already-being-used-ransomware-gangs","description":"  In a newly published report , the UK's National Cyber Security Centre (NCSC) has warned that malicious attackers are already taking advantage of artificial intelligence and that the volume and impact of threats - including ransomware - will increase in the next two years. The NCSC , which is part of GCHQ - the UK's intelligence, security and cyber agency, assesses that AI has enabled relatively unskilled hackers to \"carry out more effective access and information gathering operations... by lowering the barrier of entry to novice cybercriminals, hacker-for-hire and hacktivists.\" We've seen...\n\n","pubDate":"Thu, 25 Jan 2024 09:50:55 -0600","dc:creator":"Graham Cluley","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/ncsc-warns-ai-already-being-used-ransomware-gangs"}},{"title":"WaterISAC: 15 Security Fundamentals You Need to Know","link":"https://www.tripwire.com/state-of-security/waterisac-security-fundamentals","description":"  2023 saw two concerning attacks on public water systems, highlighting the fragility and risk to utility systems. In Pennsylvania, malicious hackers breached the Municipal Water Authority of Aliquippa system the night after Thanksgiving. The criminals were making a political statement: the technology used to manage water pressure was developed by Israel, and the criminals used this opportunity to choose a side in the ongoing conflict. The Pennsylvania attack occurred only days after the North Texas Municipal Water District suffered a breach, potentially affecting over 2 million people in 13...\n\n","pubDate":"Wed, 24 Jan 2024 03:00:11 -0600","dc:creator":"Stefanie Shank","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/waterisac-security-fundamentals"}},{"title":"Four Takeaways from the McKinsey AI Report","link":"https://www.tripwire.com/state-of-security/four-takeaways-mckinsey-ai-report","description":"  Artificial intelligence (AI) has been a hot topic of discussion this year among tech and cybersecurity professionals and the wider public. With the recent advent and rapid advancement of a number of publicly available generative AI tools—ChatGPT, Dall-E, and others—the subject of AI is at the top of many minds. Organizations and individuals alike have adopted these tools for a wide range of business and personal functions. The latest global survey from McKinsey Global Publishing polled thousands of executives and managers on the current state of AI. The results of the survey provide valuable...\n\n","pubDate":"Wed, 24 Jan 2024 02:32:22 -0600","dc:creator":"PJ Bradley","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/four-takeaways-mckinsey-ai-report"}},{"title":"Navigating the New Waters of AI-Powered Phishing Attacks","link":"https://www.tripwire.com/state-of-security/navigating-new-waters-ai-powered-phishing-attacks","description":"  The dynamism of Artificial Intelligence (AI) is transforming not only the tech landscape but also various sectors of human activity at breakneck speeds. Unfortunately, with any progress in technology, these advances aren’t only being applied in beneficial ways. The sad fact is that some of the most tech-savvy people have chosen a criminal path, combining the technological potential of AI with an attack method that’s aimed at what is usually the weakest link in a cybersecurity system — the human element. The result is AI-powered phishing attacks tailored toward specific personnel and capable of...\n\n","pubDate":"Tue, 23 Jan 2024 02:50:10 -0600","dc:creator":"Isla Sibanda","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/navigating-new-waters-ai-powered-phishing-attacks"}},{"title":"Cultivating a Cybersecurity Culture","link":"https://www.tripwire.com/state-of-security/cultivating-cybersecurity-culture","description":"  When I attend a networking event and ask a business owner, “Who’s responsible for Information Security?” The usual reply is “IT”. But in today’s hyper-connected world, where digital landscapes are constantly evolving, and data breaches and cyberattacks are becoming alarmingly common, organizations must recognise that information security is not solely the responsibility of the IT department. We can’t simply point at the IT team and say, “Make me secure”. In the same way that we can’t point at the Finance department and say, “Save us money.” It's a collective effort that involves every employee...\n\n","pubDate":"Tue, 23 Jan 2024 02:30:30 -0600","dc:creator":"Gary Hibberd","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/cultivating-cybersecurity-culture"}},{"title":"US Agencies Issue Cybersecurity Guide in Response to Cybercriminals Targeting Water Systems","link":"https://www.tripwire.com/state-of-security/us-agencies-issue-cybersecurity-guide-response-cybercriminals-targeting-water","description":"  US federal agencies have teamed up to release a cybersecurity best practice guidance for the water and wastewater sector (WWS). The Cybersecurity and Infrastructure Security Agency (CISA), United States Environmental Protection Agency (EPA), and Federal Bureau of Investigation (FBI) have published the guide in an attempt to promote cybersecurity resilience and improve incident response in the WWS sector. The guide's publication comes less than two weeks after a report from the Office of the Inspector General (OIG) called on CISA to enhance the cybersecurity resiliency of the water and...\n\n","pubDate":"Mon, 22 Jan 2024 05:00:00 -0600","dc:creator":"Graham Cluley","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/us-agencies-issue-cybersecurity-guide-response-cybercriminals-targeting-water"}},{"title":"Resolving Top Security Misconfigurations: What you need to know","link":"https://www.tripwire.com/state-of-security/resolving-top-security-misconfigurations-what-you-need-know","description":"  One of the most common factors that can lead to cybersecurity incidents is a security misconfiguration in software or application settings. The default settings that come with the implementation of these tools and solutions are often not configured securely, and many organizations do not invest the time and resources into ensuring that they are. Several regulatory organizations have established standards for avoiding security misconfigurations in order to prevent cyberattacks and accidental security breaches, maintain compliance with regulations, and strengthen the overall cybersecurity...\n\n","pubDate":"Mon, 22 Jan 2024 04:25:00 -0600","dc:creator":"Jeff Moline","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/resolving-top-security-misconfigurations-what-you-need-know"}},{"title":"5 Things to Consider Before Buying a File Integrity Monitoring (FIM) Solution","link":"https://www.tripwire.com/state-of-security/things-consider-buying-file-integrity-monitoring-fim-solution","description":"  Imagine you’re on the tail end of installing a 100-line script. It’s five o’clock, and you’re ready to head out early for once. You run the startup script on a new server, and then – the fated error message. Something isn’t working, and only after painstakingly reviewing 67 lines of code do you realize you had the IP address wrong. This could have been prevented. File Integrity Monitoring (FIM) solutions exist to make sure files stay intact, unaltered, and as you expect them. The best of them not only detect unauthorized changes but also provide an option to automatically take action to...\n\n","pubDate":"Fri, 19 Jan 2024 05:08:22 -0600","dc:creator":"David Henderson","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/things-consider-buying-file-integrity-monitoring-fim-solution"}},{"title":"What is the Windows Security Account Manager (SAM)?","link":"https://www.tripwire.com/state-of-security/what-windows-security-account-manager-sam","description":"  To most people, the process of logging into a Microsoft Windows machine is a simple process of entering a username and a password. However, for a cybersecurity professional, the process is a carefully orchestrated mechanism. Unfortunately, throughout the history of the various Windows operating system versions, criminals have also sought ways to disrupt this process in order to breach a network. The primary target of these attacks is the Security Account Manager (SAM). The Security Account Manager (SAM) is a critical Windows database housing user account credentials, including usernames and...\n\n","pubDate":"Thu, 18 Jan 2024 04:30:30 -0600","dc:creator":"Dilki Rathnayake","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/what-windows-security-account-manager-sam"}},{"title":"Tips for Ensuring HIPAA Compliance","link":"https://www.tripwire.com/state-of-security/tips-ensuring-hipaa-compliance","description":"  Like every other industry, the healthcare sector is barely recognizable when compared to its state 20 years ago. It, too, has been transfigured by technology. While this has brought many impactful benefits, it has also introduced at least one major challenge: keeping sensitive patient information private. At the heart of this privacy challenge stands the venerable Health Insurance Portability and Accountability Act ( HIPAA ), passed almost 30 years ago, a foundational and comprehensive set of regulations designed to protect the confidentiality and security of healthcare data. A lot has changed...\n\n","pubDate":"Wed, 17 Jan 2024 03:10:11 -0600","dc:creator":"Tripwire Guest Authors","guid":{"@isPermaLink":"true","#text":"https://www.tripwire.com/state-of-security/tips-ensuring-hipaa-compliance"}}]}}}