{"?xml":{"@version":"1.0","@encoding":"utf-8"},"rss":{"@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:foaf":"http://xmlns.com/foaf/0.1/","@xmlns:og":"http://ogp.me/ns#","@xmlns:rdfs":"http://www.w3.org/2000/01/rdf-schema#","@xmlns:schema":"http://schema.org/","@xmlns:sioc":"http://rdfs.org/sioc/ns#","@xmlns:sioct":"http://rdfs.org/sioc/types#","@xmlns:skos":"http://www.w3.org/2004/02/skos/core#","@xmlns:xsd":"http://www.w3.org/2001/XMLSchema#","@xmlns:media":"http://search.yahoo.com/mrss/","@version":"2.0","@xml:base":"https://www.nist.gov/","channel":{"title":"Cybersecurity Insights","link":"https://www.nist.gov/","description":"Cybersecurity Insights blog posts","language":"en","atom:link":{"@href":"https://www.nist.gov/blogs/cybersecurity-insights/rss.xml","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"The Importance of Transparency – Fueling Trust and Security Through Communication","link":"https://www.nist.gov/blogs/cybersecurity-insights/importance-transparency-fueling-trust-and-security-through","description":"Who needs to know ‘What,’ ‘When,’ and ‘How’ to tell them The Challenge There are many challenges to providing and maintaining cybersecurity in today’s connected world. While product developers increasingly consider security as they design and build products, they may not always communicate critical cybersecurity information about their connected products. Information gaps present a challenge to stakeholders—especially customers—who have limited insight into the security processes, functions and features that protect connected products, components, and services. Effective communication is the","pubDate":"Mon, 03 Apr 2023 12:00:00 +0000","dc:creator":"Katerina Megas, Angela Smith, Dr. Elaine Newton, Dr. Amit Elazari , Barbara Cuthill","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1738381"}},{"title":"Phishing Resistance – Protecting the Keys to Your Kingdom","link":"https://www.nist.gov/blogs/cybersecurity-insights/phishing-resistance-protecting-keys-your-kingdom","description":"If you own a computer, watch the news, or spend virtually any time online these days you have probably heard the term “phishing.” Never in a positive context…and possibly because you have been a victim yourself. Phishing refers to a variety of attacks that are intended to convince you to forfeit sensitive data to an imposter. These attacks can take a number of different forms; from spear-phishing (which targets a specific individual within an organization), to whaling (which goes one step further and targets senior executives or leaders). Furthermore, phishing attacks take place over multiple","pubDate":"Wed, 01 Feb 2023 12:00:00 +0000","dc:creator":"Andrew Regenscheid, Ryan Galluzzo","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1732071"}},{"title":"Data Analytics for Small Businesses: How to Manage Privacy Risks","link":"https://www.nist.gov/blogs/cybersecurity-insights/data-analytics-small-businesses-how-manage-privacy-risks","description":"Perhaps you’ve been hearing about data analytics, which is being promoted as a way for even small businesses to analyze communications with customers, enhance customer experience, save money, and ultimately improve your brand. However, data analytics can have big privacy implications. You may think of managing privacy risk as protecting sensitive customer information, such as credit cards. As the Venn diagram to the right demonstrates, data security is certainly one aspect of privacy risk, but privacy risks can also arise by means unrelated to cybersecurity incidents. People can experience","pubDate":"Fri, 27 Jan 2023 12:00:00 +0000","dc:creator":"Meghan Anderson","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1730071"}},{"title":"International Engagement Blog: Singapore International Cyber Week, the Regional Initiative for Cybersecurity Education and Training, and More","link":"https://www.nist.gov/blogs/cybersecurity-insights/international-engagement-blog-singapore-international-cyber-week","description":"NIST has continued to collaborate into the fall season with partners throughout the world on the Cybersecurity Framework 2.0 update. International engagement and alignment with international standards are important themes for the 2.0 update and will drive changes to ensure global relevance. As part of this ongoing international engagement, NIST welcomed visitors to the NCCoE and NIST headquarters to discuss various cybersecurity topics and explore areas for mutual collaboration. In the past few weeks, NIST met with visitors from Italy, Singapore, New Zealand, Germany, and Brazil at the NCCoE","pubDate":"Wed, 14 Dec 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1726541"}},{"title":"Why Employers Should Embrace Competency-Based Learning in Cybersecurity","link":"https://www.nist.gov/blogs/cybersecurity-insights/why-employers-should-embrace-competency-based-learning-cybersecurity","description":"There is a growing movement toward increasing the use of competency and skills-based education and hiring practices in both the public and private sectors. For example, the Executive Order on Modernizing and Reforming the Assessment and Hiring of Federal Job Candidates calls upon the Federal Government to “ensure that the individuals most capable of performing the roles and responsibilities required of a specific position are those hired for that position”—resulting in “merit-based reforms that will replace degree-based hiring with skills- and competency-based hiring.” Similarly, the","pubDate":"Tue, 25 Oct 2022 12:00:00 +0000","dc:creator":"Marni Baker-Stein, Bridgett Paradise, Rodney Petersen","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720716"}},{"title":"Cybersecurity Awareness Month 2022: Recognizing &amp; Reporting Phishing","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-recognizing-reporting-phishing","description":"This blog will officially wrap up our 2022 Cybersecurity Awareness Month blog series — today we have a special interview from Marian Merritt, deputy director, lead for industry engagement for the National Initiative for Cybersecurity Education (NICE)! Marian will be discussing the importance of recognizing and reporting phishing incidents in detail. A phishing attack is an attempt to fool an individual into sharing private information or taking an action that gives criminals access to your accounts, your computer, login credentials or even your network. This week’s Cybersecurity Awareness","pubDate":"Mon, 24 Oct 2022 12:00:00 +0000","dc:creator":"Marian Merritt","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1718901"}},{"title":"Student Insights on Cybersecurity Careers","link":"https://www.nist.gov/blogs/cybersecurity-insights/student-insights-cybersecurity-careers","description":"Hi, our names are Aubrie, Kyle, and Lindsey! We participated in internships at the National Initiative for Cybersecurity Education (NICE) Program Office this past year. This is a career pivot for Aubrie, meaning this is her introduction to cybersecurity from another career; she is earning her master’s with a concentration in cybersecurity. Kyle was an undergraduate intern majoring in Computer Engineering. He is almost finished with his education and will soon be transitioning into the workforce. Lindsey is a high school member of the program. The three of us come from different academic and","pubDate":"Thu, 20 Oct 2022 12:00:00 +0000","dc:creator":"Aubrie Kendall, Kyle Truong, Lindsey Walter","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720901"}},{"title":"Cybersecurity Awareness Month 2022: Updating Software","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-updating-software","description":"Cybersecurity Awareness Month is flying by, and today’s blog identifies different security vulnerabilities that can be exposed if you are unable to keep up with your software updates. We interviewed NIST’s Michael Ogata, a computer scientist in the Applied Cybersecurity Division, and he walked us through different strategies to minimize your cybersecurity risks. Michael also was able to provide cyber tips to improve online safety. This week’s Cybersecurity Awareness Month theme is updating software. How does your work/specialty area at NIST tie into this behavior? Today, mobile applications","pubDate":"Mon, 17 Oct 2022 12:00:00 +0000","dc:creator":"Michael Ogata","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720266"}},{"title":"Cybersecurity Awareness Month 2022: Using Strong Passwords and a Password Manager","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-using-strong-passwords-and-password","description":"The key behavior that we are highlighting this week for Cybersecurity Awareness Month is using strong passwords and a password manager. In today’s blog we interviewed NIST’s Connie LaSalle, a senior technology policy advisor, and she offers four specific ways to mitigate your cybersecurity risks online while discussing the importance of adopting strong passwords. Take a look at her responses to our questions below… This week’s Cybersecurity Awareness Month theme is using strong passwords and a password manager. How does your work/specialty area at NIST tie into this behavior? As a senior","pubDate":"Thu, 13 Oct 2022 12:00:00 +0000","dc:creator":"Connie LaSalle","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1720231"}},{"title":"Cybersecurity Awareness Month 2022: Enabling Multi-factor Authentication Key behavior: Multi-factor Authentication","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-2022-enabling-multi-factor-authentication","description":"In celebration of Cybersecurity Awareness Month, NIST will be publishing a dedicated blog series throughout October; we will be sharing blogs each week that will match up to four key behaviors identified by the National Cybersecurity Alliance (NCA). Today’s interview-style blog features two NIST experts —Bill Newhouse and Ryan Galluzzo—discussing different reasons to enable multi-factor authentication (a mechanism to verify an individual’s identity by requiring them to provide more information than just a username and password). Here are the questions they both were asked, along with their","pubDate":"Tue, 04 Oct 2022 12:00:00 +0000","dc:creator":"Bill Newhouse, Ryan Galluzzo","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1719181"}},{"title":"NIST International Engagement Updates:  CSF 2.0 Update Workshop and More","link":"https://www.nist.gov/blogs/cybersecurity-insights/nist-international-engagement-updates-csf-20-update-workshop-and-more","description":"The subject of international alignment and alignment with international resources continues to be an important focus for NIST, particularly with the process for the Cybersecurity Framework (CSF) 2.0 update. This was an important area for many of our stakeholders, as described in the summary of analysis of the Request for Information (RFI) from February. NIST hosted its first virtual workshop on the journey to the CSF 2.0 update process in August. During the workshop, NIST described the importance of international alignment as well as the feedback we heard on continuing our international","pubDate":"Fri, 30 Sep 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1718536"}},{"title":"The Final Countdown to Cybersecurity Awareness Month 2022: “It&#039;s easy to stay safe online!”","link":"https://www.nist.gov/blogs/cybersecurity-insights/final-countdown-cybersecurity-awareness-month-2022-its-easy-stay-safe","description":"Today’s blog will jumpstart NIST’s celebration of Cybersecurity Awareness Month 2022! We have a lot in store for October and are looking forward to sharing our work, progress, events, and news with you. This year’s theme is \"See Yourself In Cyber\" and will cover four key behaviors: Enabling multi-factor authentication Using strong passwords and a password manager Updating software Recognizing and reporting phishing As a repeat Cybersecurity Awareness Month Champion, NIST is dedicated to promoting a safer online environment and helping others learn and understand the complex world of","pubDate":"Thu, 29 Sep 2022 12:00:00 +0000","dc:creator":"Kevin Stine","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1718896"}},{"title":"NIST’s Expanding International Engagement on Cybersecurity","link":"https://www.nist.gov/blogs/cybersecurity-insights/nists-expanding-international-engagement-cybersecurity","description":"In providing a foundation for cybersecurity advancements over the years, NIST has taken the global context into account when determining priorities and approaches. Our participation in Standards Developing Organizations (SDOs) has expanded steadily, and we encourage international participation in the development of our own programs and resources. As we celebrate the 50th anniversary of cybersecurity at NIST, it is more important than ever that we work with our partners around the world. NIST’s growing impact on the international stage is reflected in the many translations of our signature","pubDate":"Wed, 27 Jul 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1710041"}},{"title":"Standards: The CPSO’s Best Friend","link":"https://www.nist.gov/blogs/cybersecurity-insights/standards-cpsos-best-friend","description":"Workshop Shines Light on Role of Standards in Cybersecurity for IoT What do Chief Product Security Officers (CPSOs) want to make their job easier? As it turns out, standards. This insight was one of many shared at a public virtual workshop NIST held June 22, 2022, to discuss the next steps for the Cybersecurity for the Internet of Things (IoT) program. As we move forward in developing cybersecurity guidance for IoT products, NIST remains committed to an open and transparent process that builds on input from stakeholders, including industry and the broader public. Our June 22 workshop explored","pubDate":"Fri, 15 Jul 2022 12:00:00 +0000","dc:creator":"Katerina Megas","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1709661"}},{"title":"Next Up: Integrating Information and Communication Technology Risk Programs with Enterprise Risk Management","link":"https://www.nist.gov/blogs/cybersecurity-insights/next-integrating-information-and-communication-technology-risk-programs","description":"Given the increasing reliance of organizations on technologies over the past 50 years, a number of risk disciplines have evolved into full-fledged risk programs. In recent years, cybersecurity, supply chain, and privacy risk management programs have formalized best practices. Yet the rapid evolution of these disciplines sometimes has led to miscommunication and inefficiencies between those risk programs and overarching enterprise risk management (ERM) portfolio. The years ahead will focus on optimizing coordination and communication between all risk programs and ERM. To be supportive of","pubDate":"Tue, 05 Jul 2022 12:00:00 +0000","dc:creator":"Stephen Quinn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1708441"}},{"title":"Identity and Access Management at NIST: A Rich History and Dynamic Future","link":"https://www.nist.gov/blogs/cybersecurity-insights/identity-and-access-management-nist-rich-history-and-dynamic-future","description":"Digital identity for access control is a fundamental and critical cybersecurity capability that ensures the right people and things have the right access to the right resources at the right time. NIST has a rich history in digital identity standardization spanning more than 50 years. We have conducted research, developed prototypes and reference implementations, and supported pilots to better understand new and emerging technologies that inform our digital identity standards, guidelines, and resources. Also, NIST participates and leads in the development of national and international standards","pubDate":"Thu, 23 Jun 2022 12:00:00 +0000","dc:creator":"Nelson Hastings, Andrew Regenscheid, Hildegard Ferraiolo, David Temoshok, Bill Fisher","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1706881"}},{"title":"NIST International Outreach Strengthened through Additional Translations and Engagement","link":"https://www.nist.gov/blogs/cybersecurity-insights/nist-international-outreach-strengthened-through-additional","description":"With the update to the Cybersecurity Framework in full swing, NIST continues to prioritize international engagement through conversations and collaborations on cybersecurity. This work is critical to NIST’s efforts to ensure international alignment on cybersecurity and privacy resources. Here’s a quick summary of some recent engagements, with more to come in the next few weeks! Under Secretary of Commerce for Standards and Technology and NIST Director Laurie Locascio participated virtually in the G7 Digital Ministers meeting on May 10th alongside the State Department. She spoke about current","pubDate":"Thu, 09 Jun 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1704756"}},{"title":"Setting off on the Journey to the NIST Cybersecurity Framework (CSF) 2.0","link":"https://www.nist.gov/blogs/cybersecurity-insights/setting-journey-nist-cybersecurity-framework-csf-20","description":"Over the past few months, NIST has been seeking feedback on the use and improvements to its cybersecurity resources through the Request for Information (RFI) on “Evaluating and Improving NIST Cybersecurity Resources: The Cybersecurity Framework and Cybersecurity Supply Chain Risk Management.” In this RFI, NIST asked about evaluating and improving the NIST Cybersecurity Framework (CSF or Framework), use of the Framework in conjunction with other resources, and improving supply chain cybersecurity risk management. The RFI garnered 134 comments (at date of publication) from a diverse range of","pubDate":"Fri, 03 Jun 2022 12:00:00 +0000","dc:creator":"Cherilyn Pascoe","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1704676"}},{"title":"The Cornerstone of Cybersecurity – Cryptographic Standards and a 50-Year Evolution","link":"https://www.nist.gov/blogs/cybersecurity-insights/cornerstone-cybersecurity-cryptographic-standards-and-50-year-evolution","description":"In today’s connected digital world, cryptographic algorithms are implemented in every device and applied to every link to protect information in transmission and in storage. Over the past 50 years, the use of cryptographic tools has expanded dramatically, from limited environments like ATM encryption to every digital application used today. Throughout this long journey, NIST has played a unique leading role in developing critical cryptographic standards. Data Encryption Standard (DES) In the early 1970s, there was little public understanding of cryptography, although most people knew that","pubDate":"Thu, 26 May 2022 12:00:00 +0000","dc:creator":"Lily Chen, Matthew Scholl","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1703211"}},{"title":"Cybersecurity for IoT: The Road We’ve Traveled, The Road Ahead","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-iot-road-weve-traveled-road-ahead","description":"The NIST Cybersecurity for IoT program published Considerations for Managing Internet of Things (IoT) Cybersecurity and Privacy Risks (NISTIR 8228) in June 2019, nearly 3 years ago. Since then, IoT technology has continued to develop and be adopted across sectors and markets. NIST’s own work, both in and outside IoT, has also progressed since the publication of NISTIR 8228. These developments warrant a new look at the contents of NISTIR 8228 and at future IoT cybersecurity priorities at NIST. As the Cybersecurity for IoT program has progressed through guidance for IoT device manufacturers","pubDate":"Mon, 16 May 2022 12:00:00 +0000","dc:creator":"Michael Fagan","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1702341"}},{"title":"The Application of Cybersecurity for IoT Capabilities to Real-World Scenarios","link":"https://www.nist.gov/blogs/cybersecurity-insights/application-cybersecurity-iot-capabilities-real-world-scenarios","description":"NIST has a history of collaboration between its programs, which helps maximize project impacts and practicality to industry. One great example is between NIST’s National Cybersecurity Center of Excellence (NCCoE) and the Cybersecurity for the Internet of Things (IoT) Program. Recent project reports from the NCCoE include mappings of relevant IoT device cybersecurity capabilities and nontechnical supporting capabilities; these three mappings align NIST’s IoT cybersecurity guidance with real-world implementation approaches: Securing Telehealth Remote Patient Monitoring Ecosystem Securing","pubDate":"Mon, 25 Apr 2022 12:00:00 +0000","dc:creator":"Jeff Marron","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1700611"}},{"title":"A Peek at Privacy: Where We Started, Where We are Now, and What’s Next","link":"https://www.nist.gov/blogs/cybersecurity-insights/peek-privacy-where-we-started-where-we-are-now-and-whats-next","description":"As part of NIST’s 50th anniversary of cybersecurity, this month’s blog post is centered on privacy at NIST. Since many of you have become familiar with the Privacy Engineering Program’s popular Venn diagram showing the relationship between cybersecurity and privacy risks, let’s use it to show how NIST has expanded and matured its understanding of privacy over the last 50 years. If we go back in time to the 1960s, data privacy really came into focus when the growing use of computers created concerns about secret databases of people’s information. The report, Records, Computers, and the Rights","pubDate":"Wed, 06 Apr 2022 12:00:00 +0000","dc:creator":"Meghan Anderson","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1699526"}},{"title":"NIST Seeks Input on International Aspects of the Cybersecurity Framework, Other Resources","link":"https://www.nist.gov/blogs/cybersecurity-insights/nist-seeks-input-international-aspects-cybersecurity-framework-other","description":"Addressing global needs is a critical part of NIST’s work in the evolution of the Cybersecurity Framework, especially as we continue to see international adaptions and use cases to address emerging risks. Recently translated into French and Ukrainian, the Framework is now available in 10 languages, and additional translations are in the works. With a growing user base around the world, the Framework is primed for an update that draws more deeply on international viewpoints. The recently released Request for Information (RFI) on “Evaluating and Improving NIST Cybersecurity Resources: The","pubDate":"Mon, 04 Apr 2022 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1699516"}},{"title":"Cybersecurity Education and Workforce Development: Employer-Driven and Learner-Centered","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-education-and-workforce-development-employer-driven-and","description":"In this installment of our 50th Anniversary of Cybersecurity series, we hear from NIST’s Rodney Petersen, Director of the National Initiative for Cybersecurity Education (NICE). In this look back, Rodney offers a brief history of NICE, discusses recent advances in cybersecurity education and workforce development, and shares a few memories from around the community. In this year-long celebration of cybersecurity at NIST, we at the National Initiative for Cybersecurity Education (NICE) are proud to be the first to take a detailed look at some of the advances that have taken place to address","pubDate":"Wed, 23 Mar 2022 12:00:00 +0000","dc:creator":"Rodney Petersen","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1697931"}},{"title":"Celebrating 50 Years of Cybersecurity at NIST!","link":"https://www.nist.gov/blogs/cybersecurity-insights/celebrating-50-years-cybersecurity-nist","description":"With each day bringing new cybersecurity challenges and advances, it is easy to understand why people feel like it’s hard to keep up. It is important to be agile and move quickly to avoid the consequences of cybersecurity attacks—and that need extends to government agencies, like NIST, as we work collaboratively with industry, academia, and government to help meet these challenges. Those of us at NIST realize that we have a responsibility to keep an eye on current needs AND on potential future needs including changes in technologies and threats that could affect the ability of organizations to","pubDate":"Mon, 07 Mar 2022 12:00:00 +0000","dc:creator":"Kevin Stine","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1696471"}},{"title":"Our Quest: Advancing Product Labels to Help Consumers Consider Cybersecurity","link":"https://www.nist.gov/blogs/cybersecurity-insights/our-quest-advancing-product-labels-help-consumers-consider","description":"For many decades, consumers have relied on labels to help them make decisions about which products to buy. Sometimes the labels make assertions about what ingredients or components the product uses. (What’s in that peanut butter?) Other times labels claim a level of performance. (How much storage does that laptop have?) These statements may come from the manufacturer or from a third party who has reviewed and perhaps tested the product. (This appliance has been tested to meet specific electrical safety standards) Labels have assisted manufacturers and retailers to help consumers make more","pubDate":"Wed, 16 Feb 2022 12:00:00 +0000","dc:creator":"Katerina Megas, Michael Ogata","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1695631"}},{"title":"Help Celebrate Data Privacy Week &amp; NIST Privacy Framework’s 2nd Birthday!","link":"https://www.nist.gov/blogs/cybersecurity-insights/help-celebrate-data-privacy-week-nist-privacy-frameworks-2nd-birthday","description":"Today’s blog celebrates Data Privacy Week, an international awareness initiative led by the National Cyber Security Alliance to help spread awareness about online privacy. NIST is very proud to participate again this year in this initiative that was successfully expanded from a single day event to a weeklong effort. At NIST, our NIST Privacy Engineering Program plays an integral role in establishing trustworthiness in information system technologies. This blog aims to highlight NIST’s accomplishments in the privacy field, as well as celebrate the two-year anniversary of the NIST Privacy","pubDate":"Fri, 28 Jan 2022 12:00:00 +0000","dc:creator":"Naomi Lefkovitz","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1693576"}},{"title":"Differential Privacy: Future Work &amp; Open Challenges","link":"https://www.nist.gov/blogs/cybersecurity-insights/differential-privacy-future-work-open-challenges","description":"In this series of blog posts, we have tried to give an accessible overview of the state-of-the-art in differential privacy. In this final post, we review some of the open challenges in the practical use of differential privacy, and conclude with a summary of contexts where differential privacy is already ready for deployment and what comes next. Setting the Privacy Parameter The impact of the privacy parameter (or privacy budget) ε has been a consistent theme throughout this series. Conceptually, the privacy parameter is simple: smaller values of ε yield better privacy, and larger values yield","pubDate":"Mon, 24 Jan 2022 12:00:00 +0000","dc:creator":"Joseph Near, David Darais","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1692406"}},{"title":"Hot Topics in Consumer Cybersecurity Labeling – Our December 2021 Workshop","link":"https://www.nist.gov/blogs/cybersecurity-insights/hot-topics-consumer-cybersecurity-labeling-our-december-2021-workshop","description":"On May 12, 2021 the White House released an Executive Order (EO) on Improving the Nation’s Cybersecurity which, among other things, tasked NIST to develop cybersecurity criteria and labeling approaches for consumer software and Internet of Things (IoT) products. Activity since then includes a call for papers, multiple workshops, draft criteria, and processing all of the feedback received. The goal of the latest workshop on December 9th was to provide the community an update, answer questions, and gather a final round of feedback which will be factored into final criteria to be released at the","pubDate":"Wed, 12 Jan 2022 12:00:00 +0000","dc:creator":"Katerina Megas","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1692411"}},{"title":"How to deploy machine learning with differential privacy","link":"https://www.nist.gov/blogs/cybersecurity-insights/how-deploy-machine-learning-differential-privacy","description":"We are delighted to introduce the final guest authors in our blog series, Nicolas Papernot and Abhradeep Thakurta, research scientists at Google Brain, whose research explores applications of differential privacy to machine learning. - Joseph Near and David Darais Previous posts in this series have explored differential privacy for traditional data analytics tasks, such as aggregate queries over database tables. What if we want to use state-of-the-art techniques like machine learning? Can we achieve differential privacy for these tasks, too? Machine learning is increasingly being used for","pubDate":"Tue, 21 Dec 2021 12:00:00 +0000","dc:creator":"Nicolas Papernot, Abhradeep Guha Thakurta","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1691106"}},{"title":"NIST Launches New International Cybersecurity and Privacy Resources Website","link":"https://www.nist.gov/blogs/cybersecurity-insights/nist-launches-new-international-cybersecurity-and-privacy-resources","description":"Every day, NIST cybersecurity and privacy resources are being used throughout the world to help organizations manage cybersecurity and privacy risks. To assist our international colleagues, NIST has launched a new International Cybersecurity and Privacy Resources Site. The site includes translations of the Cybersecurity Framework, including a newly published Indonesian translation. You can get more information and add to this list by reaching out to <span class=\"spamspan\"><span class=\"u\">intl-cyber-privacy</span> [at] <span class=\"d\">nist.gov</span></span>. Check out this site for information on upcoming international events with NIST participation, links to these","pubDate":"Wed, 15 Dec 2021 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1690896"}},{"title":"Convergent Evolution: SP 800-213, the Federal Profile, and the IoT Cybersecurity Catalog","link":"https://www.nist.gov/blogs/cybersecurity-insights/convergent-evolution-sp-800-213-federal-profile-and-iot-cybersecurity","description":"NIST has been engaged for several years in developing guidance for Internet of Things (IoT) cybersecurity. We’ve held workshops, talked with stakeholders, published drafts, listened to your feedback, refined the content and presentation of our draft guidance, and now are proud to present the updated SP 800-213 and the updated catalog of capabilities in SP 800-213A. But always remember: The goal is to manage your risk … The IoT Cybersecurity Act of 2020 stated requirements for NIST to provide guidance for federal agencies on “the appropriate use and management by agencies of [IoT] devices”","pubDate":"Thu, 02 Dec 2021 12:00:00 +0000","dc:creator":"Katerina Megas","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1688211"}},{"title":"Utility Metrics for Differential Privacy: No One-Size-Fits-All","link":"https://www.nist.gov/blogs/cybersecurity-insights/utility-metrics-differential-privacy-no-one-size-fits-all","description":"In previous posts we discussed different ways to implement differential privacy, each of which offers some trade-off between privacy and utility. But what does “utility” mean, and how do we know we are preserving it? To discuss this topic, we are delighted to introduce another guest author in our blog series, Claire McKay Bowen, Lead Data Scientist for Privacy and Data Security at the Urban Institute. Claire’s research focuses on assessing the quality of differentially private data synthesis methods and science communication. In 2021, the Committee of Presidents of Statistical Societies","pubDate":"Mon, 29 Nov 2021 12:00:00 +0000","dc:creator":"Claire McKay Bowen","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1688206"}},{"title":"Privacy-Enhancing Cryptography to Complement Differential Privacy","link":"https://www.nist.gov/blogs/cybersecurity-insights/privacy-enhancing-cryptography-complement-differential-privacy","description":"In previous posts we discussed many aspects of differential privacy: what it is, what it is useful for, and how it is applied to data analysis problems. All of those ideas can be applied once you get your hands on a whole dataset. What if the data you are interested in extracting insights from belongs to mutually distrusting organizations? For example, say you run a pumpkin spice latte stand and are wondering if your pumpkin spice supplier is overcharging you compared to the industry-wide average. You are willing to participate in a study that computes this average, but not comfortable giving","pubDate":"Wed, 03 Nov 2021 12:00:00 +0000","dc:creator":"Luís T.A.N. Brandão, René Peralta","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1686606"}},{"title":"Cybersecurity Awareness Month: Cybersecurity First","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-cybersecurity-first","description":"This week’s blog post highlighting Cybersecurity Awareness Month is from NIST’s Marian Merritt, Deputy Director and Lead for Industry Engagement for the National Initiative for Cybersecurity Education (NICE). In this post, Marian discusses ways to minimize cybersecurity risks for small businesses. How did you end up at NIST working on small business cybersecurity projects? Like many in the cybersecurity industry, my career path to my current role was anything but a straight line. I began in the marketing field, working in consumer-packaged goods. It was that experience translating consumer","pubDate":"Wed, 27 Oct 2021 12:00:00 +0000","dc:creator":"Marian Merritt","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1680871"}},{"title":"Cybersecurity Awareness Month: Explore. Experience. Share","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-explore-experience-share","description":"This week’s blog post highlighting Cybersecurity Awareness Month is from NIST’s Rodney Petersen, Director of the National Initiative for Cybersecurity Education (NICE). In this post, Rodney discusses Cybersecurity Career Awareness Week, a week-long campaign that inspires and promotes the exploration of cybersecurity careers. What is your job at NIST? I am the Director of the National Initiative for Cybersecurity Education (NICE) in the Applied Cybersecurity Division that is part of the Information Technology Lab. I am also the informal lead for the “National Cybersecurity Awareness and","pubDate":"Tue, 19 Oct 2021 12:00:00 +0000","dc:creator":"Rodney Petersen","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1680671"}},{"title":"Cybersecurity Awareness Month: Fight the Phish","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-fight-phish","description":"This week’s blog post highlighting Cybersecurity Awareness Month is from NIST’s Dr. Shaneé Dawkins, Computer Scientist in ITL’s Visualization and Usability Group. In this post, Shaneé discusses Phishing attacks and scams, as well as ways to keep your information protected. How did you end up at NIST working on cybersecurity projects? I have been a computer scientist in ITL’s Visualization and Usability Group for about 10 years conducting research on the human aspects of information technology. At the end of 2019, an opportunity was presented to join the group’s Usable Cybersecurity program and","pubDate":"Tue, 12 Oct 2021 12:00:00 +0000","dc:creator":"Shaneé Dawkins","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1680666"}},{"title":"Cybersecurity Awareness Month: Be Cyber Smart","link":"https://www.nist.gov/blogs/cybersecurity-insights/cybersecurity-awareness-month-be-cyber-smart","description":"This week’s blog post highlighting Cybersecurity Awareness Month kicks off our series and is from NIST’s Dave Temoshok, Senior Advisor in the Information Technology Laboratory Applied Cybersecurity Division. In this post, Dave discusses how to “Be Cyber Smart” with passwords by using Multifactor Authentication best practices. How did you end up at NIST working on cybersecurity projects? I currently serve as the Senior Advisor in the NIST Information Technology Laboratory Applied Cybersecurity Division. In general, I am responsible for digital identity management standards, guidance, and","pubDate":"Mon, 04 Oct 2021 12:00:00 +0000","dc:creator":"David Temoshok","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1680661"}},{"title":"Virtual Events Amplify NIST’s Cybersecurity and Privacy International Engagements","link":"https://www.nist.gov/blogs/cybersecurity-insights/virtual-events-amplify-nists-cybersecurity-and-privacy-international","description":"For the past many months, NIST has taken advantage of the shift to online events to deepen our international engagement. NIST looked overseas as we kicked off our virtual Cybersecurity Risk Management webinar series in May, along with our co-hosts from the Center for Cybersecurity Policy and Law. The event on May 25 drew registrants from over 70 countries and we shared and heard perspectives on international cybersecurity risk management. The event featured a panel discussion with speakers from Microsoft, NTT, the National Cyber Security Centre Ireland, and NIST focusing on the release of","pubDate":"Mon, 13 Sep 2021 12:00:00 +0000","dc:creator":"Amy Mahn","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1680541"}},{"title":"Staff Spotlight: NIST’s Human Factors Scientist","link":"https://www.nist.gov/blogs/cybersecurity-insights/staff-spotlight-nists-human-factors-scientist","description":"For years, NIST has been conducting research in the areas of human-centered design and evaluation, usable cybersecurity, public safety communication technology, augmented-reality usability, biometrics usability, human factors, and cognitive engineering. We asked Yee-Yin Choong, a Human Factors Scientist in the Visualization and Usability Group, Information Technology Laboratory at NIST about her research and experience working in this unique field. Yee-Yin’s research goal is to understand people’s perceptions, expectations, experiences, and behaviors of human-system interactions – including","pubDate":"Wed, 11 Aug 2021 12:00:00 +0000","dc:creator":"Yee-Yin Choong","guid":{"@isPermaLink":"true","#text":"https://www.nist.gov/node/1674716"}}]}}}