{
    "?xml": {
        "@version": "1.0",
        "@encoding": "utf-8"
    },
    "rss": {
        "@xmlns:dc": "http://purl.org/dc/elements/1.1/",
        "@version": "2.0",
        "@xml:base": "https://www.tripwire.com/",
        "channel": {
            "title": "HelpSystems Blog",
            "link": "https://www.tripwire.com/",
            "description": "HelpSystems Blog",
            "language": "en",
            "item": [
                {
                    "title": "We’re All in this Together: Thoughts on the PwC 2023 Global Digital Trust Insights Report",
                    "link": "https://www.tripwire.com/state-of-security/were-all-together-pwc-global-digital-trust-insights-report",
                    "description": "What do you need to know from PwC’s 2023 Global Digital Trust Insights report? The short answer: Teamwork. If you don’t have a lot of time today, just remember that. Based on the recommendations in this report, if you want your business to make progress in cybersecurity, C-suite executives need to come together and unitedly work towards a more secure future. Who was included in this Survey? The data in this survey comes from 3,522 business, technology, and security executives from around the world. Some of the questions were asked to all participants, and others were specific to certain types...",
                    "pubDate": "Thu, 06 Apr 2023 02:54:10 -0500",
                    "dc:creator": "Tripwire Guest Authors",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/were-all-together-pwc-global-digital-trust-insights-report"
                    }
                },
                {
                    "title": "Tripwire and Fortra: Helping Secure IT and OT Environments Better than Ever",
                    "link": "https://www.tripwire.com/state-of-security/tripwire-and-fortra-helping-secure-it-and-ot-environments-better-ever",
                    "description": "When I was younger, you could add a second processor to a computer, but it didn’t double the workload it handled. Natural inefficiencies meant that 1+1 was approximately 1.5 or maybe 1.75 times the workload. Today, multiprocessing and multithreading is so common that even the Windows calculator takes advantage of the benefits. So, when I look at the recent acquisition of Tripwire by Fortra, how do I calculate the result of 1 + 1? Company mergers are commonplace these days. In many cases, it presents a challenge to the “absorbed” organization to avoid feeling like they were swallowed up by the...",
                    "pubDate": "Wed, 05 Apr 2023 03:05:58 -0500",
                    "dc:creator": "David Bruce",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/tripwire-and-fortra-helping-secure-it-and-ot-environments-better-ever"
                    }
                },
                {
                    "title": "Securing your Digital Life: MFA, Password Managers and Risk",
                    "link": "https://www.tripwire.com/state-of-security/securing-your-digital-life-mfa-password-managers-and-risk",
                    "description": "In security, there are always tensions; the balancing act between security, convenience, and functionality. While these three, often competing interests cause many people to become frustrated, there are some simple steps that can ease the security struggle: Any Multi-Factor Authentication (MFA) is better than no MFA. Any password manager is better than not using one. Determine your current level of risk, your risk exposure, and act in the way that best protects you. A look at the Trio Securing your digital life is a never-ending pursuit, but, while it can seem overwhelming at times, don’t let...",
                    "pubDate": "Wed, 05 Apr 2023 03:05:54 -0500",
                    "dc:creator": "Editorial Staff",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/securing-your-digital-life-mfa-password-managers-and-risk"
                    }
                },
                {
                    "title": "Tripwire Patch Priority Index for March 2023",
                    "link": "https://www.tripwire.com/state-of-security/tripwire-patch-priority-index-march-2023",
                    "description": "Tripwire's March 2023 Patch Priority Index (PPI) brings together important vulnerabilities for Google and Microsoft. First on the patch priority list this month is a patch for Microsoft Office Outlook that resolves a critical elevation of privilege vulnerability (CVE-2023-23397) that should be patched as soon as possible. This vulnerability has seen exploitation in the wild and allows attackers to perform an NTLM Relay attack. Please refer to the following link for a detailed technical discussion for this issue (https://www.microsoft.com/en-us/security/blog/2023/03/24/guidance-for...",
                    "pubDate": "Tue, 04 Apr 2023 08:15:41 -0500",
                    "dc:creator": "Lane Thames",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/tripwire-patch-priority-index-march-2023"
                    }
                },
                {
                    "title": "Distributed Energy Resources and Grid Security",
                    "link": "https://www.tripwire.com/state-of-security/distributed-energy-resources-and-grid-security",
                    "description": "As the United States government, the energy industry, and individual consumers work toward cleaner and more sustainable energy solutions, it is crucial to consider how new and advancing technologies affect, and are affected by, cybersecurity concerns. ­­­­Increasing use of smart energy devices can be useful for consumers to have more control over their energy consumption, but can also pose a security risk if the devices and systems are not adequately protected. The United States Department of Energy (DOE) recently released a report discussing certain trends and challenges to consider as the...",
                    "pubDate": "Tue, 04 Apr 2023 02:48:43 -0500",
                    "dc:creator": "Tripwire Guest Authors",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/distributed-energy-resources-and-grid-security"
                    }
                },
                {
                    "title": "5 Secure Ways to Avoid Crypto Theft in 2023",
                    "link": "https://www.tripwire.com/state-of-security/secure-ways-avoid-crypto-theft",
                    "description": "The rise in popularity of cryptocurrencies has brought about significant concerns regarding wallet vulnerabilities and digital theft among individuals and businesses transacting in the market. While the meteoric rise in the value of cryptocurrency has attracted legitimate investors, it has also caught the attention of malicious actors who are constantly searching for vulnerabilities to exploit. According to blockchain analytics company, Chainalysis, the illegal utilization of cryptocurrencies reached an all-time high of $20.1 billion in the previous year, primarily due to a surge in...",
                    "pubDate": "Mon, 03 Apr 2023 04:00:42 -0500",
                    "dc:creator": "Tripwire Guest Authors",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/secure-ways-avoid-crypto-theft"
                    }
                },
                {
                    "title": "The impact of Quantum Computing on cybersecurity",
                    "link": "https://www.tripwire.com/state-of-security/impact-quantum-computing-cybersecurity",
                    "description": "Quantum computers can solve highly complex problems faster than any of its predecessors. We are currently in a period of a quantum revolution. Many organizations are currently investing in the quantum computer industry, and it is predicted that the quantum computing market may increase by 500% by 2028. Due to their powerful computing capabilities, the Cloud Security Alliance (CSA) has estimated that by April 2030, RSA, Diffie-Hellman (DH), and Elliptic-Curve Cryptography (ECC) algorithms will become vulnerable to quantum attacks. This makes many organizations vulnerable to “harvest now...",
                    "pubDate": "Mon, 03 Apr 2023 04:00:39 -0500",
                    "dc:creator": "Tripwire Guest Authors",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/impact-quantum-computing-cybersecurity"
                    }
                },
                {
                    "title": "How to Secure Your Mobile Device: 8 Tips for 2023",
                    "link": "https://www.tripwire.com/state-of-security/secure-mobile-device-six-steps",
                    "description": "The rapidly changing technology and portability of mobile devices have forced people to rely heavily on those products. With their increased functionalities, mobile devices carry out a number of our day-to-day activities, such as surfing the web, booking appointments, setting up reminders, sharing files, instant messaging, video calling, and even mobile banking. Given all these functionalities, mobile devices are vulnerable to online threats and susceptible to physical attacks due to their portability. Some security threats include malware specifically designed for mobile devices, i.e., worms...",
                    "pubDate": "Tue, 28 Mar 2023 04:10:27 -0500",
                    "dc:creator": "Tripwire Guest Authors",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/secure-mobile-device-six-steps"
                    }
                },
                {
                    "title": "Motivations for Insider Threats: What to Watch Out For",
                    "link": "https://www.tripwire.com/state-of-security/motivations-insider-threats-what-watch-out",
                    "description": "While a majority of discourse in the cybersecurity industry is focused on external threats – malicious hacking, phishing, and the like – the fact is that internal actors are just as capable of causing damage to an enterprise, if not more so. An insider threat may have access to resources or areas of the network that someone outside the organization would need to do extra work to obtain. Insider threats, similarly to external ones, come in a wide variety of packages and can be motivated by many different factors. Malicious Insider Threats 1. Financial Gain Many internal actors who perpetrate...",
                    "pubDate": "Tue, 28 Mar 2023 03:13:17 -0500",
                    "dc:creator": "Tripwire Guest Authors",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/motivations-insider-threats-what-watch-out"
                    }
                },
                {
                    "title": "VERT Reads All About It - Cybersecurity News March 27, 2023",
                    "link": "https://www.tripwire.com/state-of-security/vert-reads-all-about-it-cybersecurity-news-march-27-2023",
                    "description": "The Tripwire Vulnerability Exposure and Research Team (VERT) keeps its finger on the cybersecurity pulse. Check out some of the stories that stood out for us recently: WordPress forced the patching of WooCommerce Plugin The WooCommerce Plugin is subject to a privilege escalation vulnerability where an unauthenticated attacker could gain admin access to vulnerable stores. This vulnerability allows attackers to impersonate administrators and take over vulnerable websites. At this point, the vulnerability was not publicly exploited on the internet. Admins that host their own installation of...",
                    "pubDate": "Mon, 27 Mar 2023 05:38:59 -0500",
                    "dc:creator": "Andrew Swoboda",
                    "guid": {
                        "@isPermaLink": "true",
                        "#text": "https://www.tripwire.com/state-of-security/vert-reads-all-about-it-cybersecurity-news-march-27-2023"
                    }
                }
            ]
        }
    }
}