{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@version":"2.0","channel":{"title":"Ubuntu security notices","link":"https://ubuntu.com/security/notices/rss.xml","description":"Recent content on Ubuntu security notices","atom:link":{"@href":"https://ubuntu.com/security/notices/rss.xml","@rel":"self"},"copyright":"2023 Canonical Ltd. Ubuntu and Canonical are registered trademarks of Canonical Ltd.","docs":"http://www.rssboard.org/rss-specification","generator":"Feedgen","lastBuildDate":"Sat, 08 Apr 2023 03:30:31 +0000","item":[{"title":"USN-6003-1: Emacs vulnerability","link":"https://ubuntu.com/security/notices/USN-6003-1","description":"Xi Lu discovered that Emacs did not properly handle certain\ninputs. An attacker could possibly use this issue to execute\narbitrary commands.\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6003-1"},"pubDate":"Thu, 06 Apr 2023 16:15:35 +0000"},{"title":"USN-6001-1: Linux kernel (AWS) vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6001-1","description":"\nXuewei Feng, Chuanpu Fu, Qi Li, Kun Sun, and Ke Xu discovered that the TCP\nimplementation in the Linux kernel did not properly handle IPID assignment.\nA remote attacker could use this to cause a denial of service (connection\ntermination) or inject forged data. (CVE-2020-36516)\n\nKe Sun, Alyssa Milburn, Henrique Kawakami, Emma Benoit, Igor Chervatyuk,\nLisa Aichele, and Thais Moreira Hamasaki discovered that the Spectre\nVariant 2 mitigations for AMD processors on Linux were insufficient in some\nsituations. A local attacker could possibly use this to expose sensitive\ninformation. (CVE-2021-26401)\n\nJürgen Groß discovered that the Xen subsystem within the Linux kernel did\nnot adequately limit the number of events driver domains (unprivileged PV\nbackends) could send to other guest VMs. An attacker in a driver domain\ncould use this to cause a denial of service in other guest VMs.\n(CVE-2021-28712, CVE-2021-28713)\n\nWolfgang Frisch discovered that the ext4 file system implementation in the\nLinux kernel contained an integer overflow when handling metadata inode\nextents. An attacker could use this to construct a malicious ext4 file\nsystem image that, when mounted, could cause a denial of service (system\ncrash). (CVE-2021-3428)\n\nIt was discovered that the IEEE 802.15.4 wireless network subsystem in the\nLinux kernel did not properly handle certain error conditions, leading to a\nnull pointer dereference vulnerability. A local attacker could possibly use\nthis to cause a denial of service (system crash). (CVE-2021-3659)\n\nIt was discovered that the System V IPC implementation in the Linux kernel\ndid not properly handle large shared memory counts. A local attacker could\nuse this to cause a denial of service (memory exhaustion). (CVE-2021-3669)\n\nAlois Wohlschlager discovered that the overlay file system in the Linux\nkernel did not restrict private clones in some situations. An attacker\ncould use this to expose sensitive information. (CVE-2021-3732)\n\nIt was discovered that the SCTP protocol implementation in the Linux kernel\ndid not properly verify VTAGs in some situations. A remote attacker could\npossibly use this to cause a denial of service (connection disassociation).\n(CVE-2021-3772)\n\nIt was discovered that the btrfs file system implementation in the Linux\nkernel did not properly handle locking in certain error conditions. A local\nattacker could use this to cause a denial of service (kernel deadlock).\n(CVE-2021-4149)\n\nJann Horn discovered that the socket subsystem in the Linux kernel\ncontained a race condition when handling listen() and connect() operations,\nleading to a read-after-free vulnerability. A local attacker could use this\nto cause a denial of service (system crash) or possibly expose sensitive\ninformation. (CVE-2021-4203)\n\nIt was discovered that the file system quotas implementation in the Linux\nkernel did not properly validate the quota block number. An attacker could\nuse this to construct a malicious file system image that, when mounted and\noperated on, could cause a denial of service (system crash).\n(CVE-2021-45868)\n\nZhihua Yao discovered that the MOXART SD/MMC driver in the Linux kernel did\nnot properly handle device removal, leading to a use-after-free\nvulnerability. A physically proximate attacker could possibly use this to\ncause a denial of service (system crash). (CVE-2022-0487)\n\nIt was discovered that the block layer subsystem in the Linux kernel did\nnot properly initialize memory in some situations. A privileged local\nattacker could use this to expose sensitive information (kernel memory).\n(CVE-2022-0494)\n\nIt was discovered that the UDF file system implementation in the Linux\nkernel could attempt to dereference a null pointer in some situations. An\nattacker could use this to construct a malicious UDF image that, when\nmounted and operated on, could cause a denial of service (system crash).\n(CVE-2022-0617)\n\nDavid Bouman discovered that the netfilter subsystem in the Linux kernel\ndid not initialize memory in some situations. A local attacker could use\nthis to expose sensitive information (kernel memory). (CVE-2022-1016)\n\nIt was discovered that the implementation of the 6pack and mkiss protocols\nin the Linux kernel did not handle detach events properly in some\nsituations, leading to a use-after-free vulnerability. A local attacker\ncould possibly use this to cause a denial of service (system crash).\n(CVE-2022-1195)\n\nDuoming Zhou discovered race conditions in the AX.25 amateur radio protocol\nimplementation in the Linux kernel, leading to use-after-free\nvulnerabilities. A local attacker could possibly use this to cause a denial\nof service (system crash). (CVE-2022-1205)\n\nIt was discovered that the tty subsystem in the Linux kernel contained a\nrace condition in certain situations, leading to an out-of-bounds read\nvulnerability. A local attacker could possibly use this to cause a denial\nof service (system crash) or expose sensitive information. (CVE-2022-1462)\n\nIt was discovered that the implementation of X.25 network protocols in the\nLinux kernel did not terminate link layer sessions properly. A local\nattacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2022-1516)\n\nDuoming Zhou discovered a race condition in the NFC subsystem in the Linux\nkernel, leading to a use-after-free vulnerability. A privileged local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2022-1974)\n\nDuoming Zhou discovered that the NFC subsystem in the Linux kernel did not\nproperly prevent context switches from occurring during certain atomic\ncontext operations. A privileged local attacker could use this to cause a\ndenial of service (system crash). (CVE-2022-1975)\n\nIt was discovered that the HID subsystem in the Linux kernel did not\nproperly validate inputs in certain conditions. A local attacker with\nphysical access could plug in a specially crafted USB device to expose\nsensitive information. (CVE-2022-20132)\n\nIt was discovered that the device-mapper verity (dm-verity) driver in the\nLinux kernel did not properly verify targets being loaded into the device-\nmapper table. A privileged attacker could use this to cause a denial of\nservice (system crash) or possibly execute arbitrary code. (CVE-2022-20572,\nCVE-2022-2503)\n\nDuoming Zhou discovered that race conditions existed in the timer handling\nimplementation of the Linux kernel's Rose X.25 protocol layer, resulting in\nuse-after-free vulnerabilities. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2022-2318)\n\nZheyu Ma discovered that the Silicon Motion SM712 framebuffer driver in the\nLinux kernel did not properly handle very small reads. A local attacker\ncould use this to cause a denial of service (system crash). (CVE-2022-2380)\n\nDavid Leadbeater discovered that the netfilter IRC protocol tracking\nimplementation in the Linux Kernel incorrectly handled certain message\npayloads in some situations. A remote attacker could possibly use this to\ncause a denial of service or bypass firewall filtering. (CVE-2022-2663)\n\nLucas Leong discovered that the LightNVM subsystem in the Linux kernel did\nnot properly handle data lengths in certain situations. A privileged\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2022-2991)\n\nIt was discovered that the Intel 740 frame buffer driver in the Linux\nkernel contained a divide by zero vulnerability. A local attacker could use\nthis to cause a denial of service (system crash). (CVE-2022-3061)\n\nJiasheng Jiang discovered that the wm8350 charger driver in the Linux\nkernel did not properly deallocate memory, leading to a null pointer\ndereference vulnerability. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2022-3111)\n\nIt was discovered that the sound subsystem in the Linux kernel contained a\nrace condition in some situations. A local attacker could use this to cause\na denial of service (system crash). (CVE-2022-3303)\n\nIt was discovered that the Broadcom FullMAC USB WiFi driver in the Linux\nkernel did not properly perform bounds checking in some situations. A\nphysically proximate attacker could use this to craft a malicious USB\ndevice that when inserted, could cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2022-3628)\n\nZiming Zhang discovered that the VMware Virtual GPU DRM driver in the Linux\nkernel contained an out-of-bounds write vulnerability. A local attacker\ncould use this to cause a denial of service (system crash).\n(CVE-2022-36280)\n\nIt was discovered that the NILFS2 file system implementation in the Linux\nkernel did not properly deallocate memory in certain error conditions. An\nattacker could use this to cause a denial of service (memory exhaustion).\n(CVE-2022-3646)\n\nIt was discovered that the Netlink Transformation (XFRM) subsystem in the\nLinux kernel contained a reference counting error. A local attacker could\nuse this to cause a denial of service (system crash). (CVE-2022-36879)\n\nIt was discovered that the infrared transceiver USB driver did not properly\nhandle USB control messages. A local attacker with physical access could\nplug in a specially crafted USB device to cause a denial of service (memory\nexhaustion). (CVE-2022-3903)\n\nJann Horn discovered a race condition existed in the Linux kernel when\nunmapping VMAs in certain situations, resulting in possible use-after-free\nvulnerabilities. A local attacker could possibly use this to cause a denial\nof service (system crash) or execute arbitrary code. (CVE-2022-39188)\n\nHyunwoo Kim discovered that the DVB Core driver in the Linux kernel did not\nproperly perform reference counting in some situations, leading to a use-\nafter-free vulnerability. A local attacker could use this to cause a denial\nof service (system crash) or possibly execute arbitrary code.\n(CVE-2022-41218)\n\nIt was discovered that a race condition existed in the SMSC UFX USB driver\nimplementation in the Linux kernel, leading to a use-after-free\nvulnerability. A physically proximate attacker could use this to cause a\ndenial of service (system crash) or possibly execute arbitrary code.\n(CVE-2022-41849)\n\nIt was discovered that a race condition existed in the Roccat HID driver in\nthe Linux kernel, leading to a use-after-free vulnerability. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2022-41850)\n\nIt was discovered that the USB core subsystem in the Linux kernel did not\nproperly handle nested reset events. A local attacker with physical access\ncould plug in a specially crafted USB device to cause a denial of service\n(kernel deadlock). (CVE-2022-4662)\n\nIt was discovered that the network queuing discipline implementation in the\nLinux kernel contained a null pointer dereference in some situations. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2022-47929)\n\nKyle Zeng discovered that the IPv6 implementation in the Linux kernel\ncontained a NULL pointer dereference vulnerability in certain situations. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2023-0394)\n\nIt was discovered that a memory leak existed in the SCTP protocol\nimplementation in the Linux kernel. A local attacker could use this to\ncause a denial of service (memory exhaustion). (CVE-2023-1074)\n\nMingi Cho discovered that the netfilter subsystem in the Linux kernel did\nnot properly initialize a data structure, leading to a null pointer\ndereference vulnerability. An attacker could use this to cause a denial of\nservice (system crash). (CVE-2023-1095)\n\nKyle Zeng discovered that the ATM VC queuing discipline implementation in\nthe Linux kernel contained a type confusion vulnerability in some\nsituations. An attacker could use this to cause a denial of service (system\ncrash). (CVE-2023-23455)\n\nLianhui Tang discovered that the MPLS implementation in the Linux kernel\ndid not properly handle certain sysctl allocation failure conditions,\nleading to a double-free vulnerability. An attacker could use this to cause\na denial of service or possibly execute arbitrary code. (CVE-2023-26545)\n\nIt was discovered that the NTFS file system implementation in the Linux\nkernel did not properly validate attributes in certain situations, leading\nto an out-of-bounds read vulnerability. A local attacker could possibly use\nthis to expose sensitive information (kernel memory). (CVE-2023-26607)\n\nDuoming Zhou discovered that a race condition existed in the infrared\nreceiver/transceiver driver in the Linux kernel, leading to a use-after-\nfree vulnerability. A privileged attacker could use this to cause a denial\nof service (system crash) or possibly execute arbitrary code.\n(CVE-2023-1118)\n\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6001-1"},"pubDate":"Thu, 06 Apr 2023 00:13:53 +0000"},{"title":"USN-6000-1: Linux kernel (BlueField) vulnerabilities","link":"https://ubuntu.com/security/notices/USN-6000-1","description":"It was discovered that the Upper Level Protocol (ULP) subsystem in the\nLinux kernel did not properly handle sockets entering the LISTEN state in\ncertain protocols, leading to a use-after-free vulnerability. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2023-0461)\n\nIt was discovered that the NVMe driver in the Linux kernel did not properly\nhandle reset events in some situations. A local attacker could use this to\ncause a denial of service (system crash). (CVE-2022-3169)\n\nIt was discovered that a use-after-free vulnerability existed in the SGI\nGRU driver in the Linux kernel. A local attacker could possibly use this to\ncause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2022-3424)\n\nGwangun Jung discovered a race condition in the IPv4 implementation in the\nLinux kernel when deleting multipath routes, resulting in an out-of-bounds\nread. An attacker could use this to cause a denial of service (system\ncrash) or possibly expose sensitive information (kernel memory).\n(CVE-2022-3435)\n\nIt was discovered that a race condition existed in the Kernel Connection\nMultiplexor (KCM) socket implementation in the Linux kernel when releasing\nsockets in certain situations. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2022-3521)\n\nIt was discovered that the Netronome Ethernet driver in the Linux kernel\ncontained a use-after-free vulnerability. A local attacker could use this\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2022-3545)\n\nIt was discovered that the hugetlb implementation in the Linux kernel\ncontained a race condition in some situations. A local attacker could use\nthis to cause a denial of service (system crash) or expose sensitive\ninformation (kernel memory). (CVE-2022-3623)\n\nZiming Zhang discovered that the VMware Virtual GPU DRM driver in the Linux\nkernel contained an out-of-bounds write vulnerability. A local attacker\ncould use this to cause a denial of service (system crash).\n(CVE-2022-36280)\n\nHyunwoo Kim discovered that the DVB Core driver in the Linux kernel did not\nproperly perform reference counting in some situations, leading to a use-\nafter-free vulnerability. A local attacker could use this to cause a denial\nof service (system crash) or possibly execute arbitrary code.\n(CVE-2022-41218)\n\nIt was discovered that the Intel i915 graphics driver in the Linux kernel\ndid not perform a GPU TLB flush in some situations. A local attacker could\nuse this to cause a denial of service or possibly execute arbitrary code.\n(CVE-2022-4139)\n\nIt was discovered that a race condition existed in the Xen network backend\ndriver in the Linux kernel when handling dropped packets in certain\ncircumstances. An attacker could use this to cause a denial of service\n(kernel deadlock). (CVE-2022-42328, CVE-2022-42329)\n\nIt was discovered that the Atmel WILC1000 driver in the Linux kernel did\nnot properly validate offsets, leading to an out-of-bounds read\nvulnerability. An attacker could use this to cause a denial of service\n(system crash). (CVE-2022-47520)\n\nIt was discovered that the network queuing discipline implementation in the\nLinux kernel contained a null pointer dereference in some situations. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2022-47929)\n\nJosé Oliveira and Rodrigo Branco discovered that the prctl syscall\nimplementation in the Linux kernel did not properly protect against\nindirect branch prediction attacks in some situations. A local attacker\ncould possibly use this to expose sensitive information. (CVE-2023-0045)\n\nIt was discovered that a use-after-free vulnerability existed in the\nAdvanced Linux Sound Architecture (ALSA) subsystem. A local attacker could\nuse this to cause a denial of service (system crash). (CVE-2023-0266)\n\nKyle Zeng discovered that the IPv6 implementation in the Linux kernel\ncontained a NULL pointer dereference vulnerability in certain situations. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2023-0394)\n\nWei Chen discovered that a race condition existed in the TIPC protocol\nimplementation in the Linux kernel, leading to a null pointer dereference\nvulnerability. A local attacker could use this to cause a denial of service\n(system crash). (CVE-2023-1382)\n\nIt was discovered that the Android Binder IPC subsystem in the Linux kernel\ndid not properly validate inputs in some situations, leading to a use-\nafter-free vulnerability. A local attacker could use this to cause a denial\nof service (system crash) or possibly execute arbitrary code.\n(CVE-2023-20938)\n\nKyle Zeng discovered that the class-based queuing discipline implementation\nin the Linux kernel contained a type confusion vulnerability in some\nsituations. An attacker could use this to cause a denial of service (system\ncrash). (CVE-2023-23454)\n\nKyle Zeng discovered that the ATM VC queuing discipline implementation in\nthe Linux kernel contained a type confusion vulnerability in some\nsituations. An attacker could use this to cause a denial of service (system\ncrash). (CVE-2023-23455)\n\nIt was discovered that the NTFS file system implementation in the Linux\nkernel did not properly validate attributes in certain situations, leading\nto an out-of-bounds read vulnerability. A local attacker could possibly use\nthis to expose sensitive information (kernel memory). (CVE-2023-26607)\n\nWei Chen discovered that the DVB USB AZ6027 driver in the Linux kernel\ncontained a null pointer dereference when handling certain messages from\nuser space. A local attacker could use this to cause a denial of service\n(system crash). (CVE-2023-28328)\n\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-6000-1"},"pubDate":"Wed, 05 Apr 2023 22:53:45 +0000"},{"title":"USN-5998-1: Apache Log4j vulnerabilities","link":"https://ubuntu.com/security/notices/USN-5998-1","description":"It was discovered that the SocketServer component of Apache Log4j 1.2\nincorrectly handled deserialization. An attacker could possibly use this issue\nto execute arbitrary code. This issue only affected Ubuntu 16.04 ESM.\n(CVE-2019-17571)\n\nIt was discovered that the JMSSink component of Apache Log4j 1.2 incorrectly\nhandled deserialization. An attacker could possibly use this issue to execute\narbitrary code. (CVE-2022-23302)\n\nIt was discovered that Apache Log4j 1.2 incorrectly handled certain SQL\nstatements. A remote attacker could possibly use this issue to perform an SQL\ninjection attack and alter the database. This issue was only fixed in Ubuntu\n18.04 LTS and Ubuntu 20.04 LTS. (CVE-2022-23305)\n\nIt was discovered that the Chainsaw component of Apache Log4j 1.2 incorrectly\nhandled deserialization. An attacker could possibly use this issue to execute\narbitrary code. This issue was only fixed in Ubuntu 18.04 LTS and Ubuntu 20.04\nLTS. (CVE-2022-23307)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-5998-1"},"pubDate":"Wed, 05 Apr 2023 21:26:34 +0000"},{"title":"USN-5999-1: trim-newlines vulnerability","link":"https://ubuntu.com/security/notices/USN-5999-1","description":"It was discovered that trim-newlines incorrectly handled certain inputs. If a\nuser or an automated system were tricked into opening a specially crafted\ninput file, a remote attacker could possibly use this issue to cause a\ndenial of service. (CVE-2021-33623)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-5999-1"},"pubDate":"Wed, 05 Apr 2023 10:22:58 +0000"},{"title":"USN-5997-1: IPMItool vulnerability","link":"https://ubuntu.com/security/notices/USN-5997-1","description":"It was discovered that IPMItool was not properly checking the data received\nfrom a remote LAN party. A remote attacker could possibly use this issue to\nto cause a crash or arbitrary code execution.\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-5997-1"},"pubDate":"Tue, 04 Apr 2023 19:01:03 +0000"},{"title":"USN-5996-1: Liblouis vulnerabilities","link":"https://ubuntu.com/security/notices/USN-5996-1","description":"It was discovered that Liblouis incorrectly handled certain files.\nAn attacker could possibly use this issue to cause a denial of service.\n(CVE-2023-26767, CVE-2023-26768, CVE-2023-26769)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-5996-1"},"pubDate":"Tue, 04 Apr 2023 10:51:32 +0000"},{"title":"USN-5995-1: Vim vulnerabilities","link":"https://ubuntu.com/security/notices/USN-5995-1","description":"It was discovered that Vim incorrectly handled memory when opening certain\nfiles. If an attacker could trick a user into opening a specially crafted\nfile, it could cause Vim to crash, or possible execute arbitrary code. This\nissue only affected Ubuntu 14.04 ESM, Ubuntu 18.04 LTS, Ubuntu 20.04 LTS,\nand Ubuntu 22.04 LTS. (CVE-2022-0413, CVE-2022-1629, CVE-2022-1674,\nCVE-2022-1733, CVE-2022-1735, CVE-2022-1785, CVE-2022-1796, CVE-2022-1851,\nCVE-2022-1898, CVE-2022-1942, CVE-2022-1968, CVE-2022-2124, CVE-2022-2125,\nCVE-2022-2126, CVE-2022-2129, CVE-2022-2175, CVE-2022-2183, CVE-2022-2206,\nCVE-2022-2304, CVE-2022-2345, CVE-2022-2581)\n\nIt was discovered that Vim incorrectly handled memory when opening certain\nfiles. If an attacker could trick a user into opening a specially crafted\nfile, it could cause Vim to crash, or possible execute arbitrary code. This\nissue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, and Ubuntu 22.04\nLTS. (CVE-2022-1720, CVE-2022-2571, CVE-2022-2845, CVE-2022-2849,\nCVE-2022-2923)\n\nIt was discovered that Vim incorrectly handled memory when opening certain\nfiles. If an attacker could trick a user into opening a specially crafted\nfile, it could cause Vim to crash, or possible execute arbitrary code. This\nissue only affected Ubuntu 20.04 LTS and Ubuntu 22.04 LTS. (CVE-2022-1927,\nCVE-2022-2344)\n\nIt was discovered that Vim incorrectly handled memory when opening certain\nfiles. If an attacker could trick a user into opening a specially crafted\nfile, it could cause Vim to crash, or possible execute arbitrary code. This\nissue only affected Ubuntu 18.04 LTS, Ubuntu 20.04 LTS, Ubuntu 22.04 LTS,\nand Ubuntu 22.10. (CVE-2022-2946)\n\nIt was discovered that Vim incorrectly handled memory when opening certain\nfiles. If an attacker could trick a user into opening a specially crafted\nfile, it could cause Vim to crash, or possible execute arbitrary code. This\nissue only affected Ubuntu 20.04 LTS, Ubuntu 22.04 LTS, and Ubuntu 22.10.\n(CVE-2022-2980)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-5995-1"},"pubDate":"Tue, 04 Apr 2023 08:58:38 +0000"},{"title":"USN-5994-1: HAProxy vulnerability","link":"https://ubuntu.com/security/notices/USN-5994-1","description":"It was discovered that HAProxy incorrectly initialized certain connection\nbuffers. A remote attacker could possibly use this issue to obtain\nsensitive information.\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-5994-1"},"pubDate":"Mon, 03 Apr 2023 13:09:47 +0000"},{"title":"USN-5993-1: Samba vulnerabilities","link":"https://ubuntu.com/security/notices/USN-5993-1","description":"Demi Marie Obenour discovered that the Samba LDAP server incorrectly\nhandled certain confidential attribute values. A remote authenticated\nattacker could possibly use this issue to obtain certain sensitive\ninformation. (CVE-2023-0614)\n\nAndrew Bartlett discovered that the Samba AD DC admin tool incorrectly\nsent passwords in cleartext. A remote attacker could possibly use this\nissue to obtain sensitive information. (CVE-2023-0922)\n","guid":{"@isPermaLink":"false","#text":"https://ubuntu.com/security/notices/USN-5993-1"},"pubDate":"Mon, 03 Apr 2023 13:02:17 +0000"}]}}}