{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:atom":"http://www.w3.org/2005/Atom","@version":"2.0","@xmlns:media":"http://search.yahoo.com/mrss/","channel":{"title":{"#cdata-section":"Troy Hunt"},"description":{"#cdata-section":"Hi, I'm Troy Hunt, I write this blog, run \"Have I Been Pwned\" and am a Microsoft Regional Director and MVP who travels the world speaking at events and training technology professionals"},"link":"https://www.troyhunt.com/","image":{"url":"https://www.troyhunt.com/favicon.png","title":"Troy Hunt","link":"https://www.troyhunt.com/"},"generator":"Ghost 5.42","lastBuildDate":"Fri, 07 Apr 2023 08:22:41 GMT","atom:link":{"@href":"https://www.troyhunt.com/rss/","@rel":"self","@type":"application/rss+xml"},"ttl":"60","item":[{"title":{"#cdata-section":"Weekly Update 342"},"description":{"#cdata-section":"<p>Next time I post a poll about something as simple as &quot;when is next Friday&quot;, I don&apos;t expect I&apos;ll get as much interest. Of course &quot;next time&quot; will be whatever poll follows the last one, not the poll that falls <em>after</em> that</p>"},"link":"https://www.troyhunt.com/weekly-update-342/","guid":{"@isPermaLink":"false","#text":"642f6bd863b370003d36e87b"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Fri, 07 Apr 2023 06:51:04 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/04/Splash-Template.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/04/Splash-Template.jpg\" alt=\"Weekly Update 342\"><p>Next time I post a poll about something as simple as &quot;when is next Friday&quot;, I don&apos;t expect I&apos;ll get as much interest. Of course &quot;next time&quot; will be whatever poll follows the last one, not the poll that falls <em>after</em> that one! But more seriously, I cannot think of a better example of ambiguous language that&apos;s open to interpretation and so easily avoided (hello MM-DD people!)</p><p>Also, Genesis Market and Operation Cookie Monster. This is just amazing stuff and a testament to a coalition of law enforcement agencies across the globe that have now made well over 100 arrests. Off the back of <a href=\"https://www.nationalcrimeagency.gov.uk/news/nca-infiltrates-cyber-crime-market-with-disguised-ddos-sites?ref=troyhunt.com\">the NCA&apos;s DDoS market honeypot</a>, <a href=\"https://www.scmagazine.com/brief/cybercrime/breachforums-admin-takedown-detailed?ref=troyhunt.com\">the BreachForums admin arrest</a> and <a href=\"https://www.techtarget.com/searchsecurity/news/252515896/Law-enforcement-takedowns-continue-with-RaidForums-seizure?ref=troyhunt.com\">the takedown of RaidForums before that</a>, if you&apos;re playing in this space you&apos;d have to be looking over your shoulder by now. Interesting times in cyber(crime) space.</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 342\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;%3B%3Bisi=691797987&amp;%3B%3Bius=googleplaymusic&amp;%3B%3Bapn=com.google.android.music&amp;%3B%3Blink=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;%3B%3Bref=troy-hunt&amp;%3Bref=troy-hunt&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 342\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 342\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 342\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/SKalOpHIQac\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://twitter.com/troyhunt/status/1643584454693376000?ref=troyhunt.com\">I&apos;ll be in New Zealand next Friday, which is the Friday that falls at the end of next week, not the week after</a> (what is wrong with 78% of people?! &#x1F923;)</li><li><a href=\"https://twitter.com/troyhunt/status/1643892592869015552?ref=troyhunt.com\">And now I know how an epoxy floor is laid</a> (think of it as &quot;feeding chickens&quot;)</li><li><a href=\"https://www.troyhunt.com/seized-genesis-market-data-is-now-searchable-in-have-i-been-pwned-courtesy-of-the-fbi-and-operation-cookie-monster/\">&quot;Operation Cookie Monster&quot; is a fascinating story of identity theft, a coalition of law enforcement agencies, and HIBP &#x1F60A;</a> (millions of email addresses and passwords provided by the FBI are now searchable)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Zero Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Seized Genesis Market Data is Now Searchable in Have I Been Pwned, Courtesy of the FBI and \"Operation Cookie Monster\""},"description":{"#cdata-section":"<!--kg-card-begin: html--><style>\n.fbi-statement {\n    background-color: rgba(174,145,93,.9);\n}\n    \n#fbi-statement {\n    padding: 20px;\n    margin-bottom: 25px;\n}\n    \n#fbi-statement p, #fbi-statement li, .fbi-statement {\n    color: #000;\n}\n    \n#fbi-statement ol:last-of-type {\n    padding-bottom: 0;\n}   \n</style>\n\n<p>A quick summary first before the details: This week, the FBI in cooperation with international law enforcement partners took down a notorious marketplace trading in stolen</p>"},"link":"https://www.troyhunt.com/seized-genesis-market-data-is-now-searchable-in-have-i-been-pwned-courtesy-of-the-fbi-and-operation-cookie-monster/","guid":{"@isPermaLink":"false","#text":"642b6a1b95fdc2004d2d9acd"},"category":{"#cdata-section":"Have I Been Pwned"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Wed, 05 Apr 2023 12:02:44 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/04/FBISplashPage.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<!--kg-card-begin: html--><style>\n.fbi-statement {\n    background-color: rgba(174,145,93,.9);\n}\n    \n#fbi-statement {\n    padding: 20px;\n    margin-bottom: 25px;\n}\n    \n#fbi-statement p, #fbi-statement li, .fbi-statement {\n    color: #000;\n}\n    \n#fbi-statement ol:last-of-type {\n    padding-bottom: 0;\n}   \n</style>\n\n<img src=\"https://www.troyhunt.com/content/images/2023/04/FBISplashPage.jpg\" alt=\"Seized Genesis Market Data is Now Searchable in Have I Been Pwned, Courtesy of the FBI and &quot;Operation Cookie Monster&quot;\"><p>A quick summary first before the details: This week, the FBI in cooperation with international law enforcement partners took down a notorious marketplace trading in stolen identity data in an effort they&apos;ve named &quot;Operation Cookie Monster&quot;. They&apos;ve provided millions of impacted email addresses and passwords to Have I Been Pwned (HIBP) so that victims of the incident can discover if they have been exposed. This breach has been flagged as &quot;sensitive&quot; which means <em>it is not publicly searchable</em>, rather you must demonstrate you control the email address being searched before the results are shown. This can be done via <a href=\"https://haveibeenpwned.com/NotifyMe?ref=troyhunt.com\">the free notification service on HIBP</a> and involves you entering the email address then clicking on the link sent to your inbox. Specific guidance prepared by the FBI in conjunction with the Dutch police on further steps you can take to protect yourself are detailed <span class=\"fbi-statement\">at the end of this blog post on the gold background</span>. That&apos;s the short version, here&apos;s the whole story:</p><!--kg-card-end: html--><hr><p>Ever heard that saying about how &quot;data is the new oil&quot;? Or that &quot;data is the currency of the digital economy&quot;? You&apos;ve probably seen stories and infographics about how much your personal information is worth, both to legitimate organisations and criminal networks. Like any valuable commodity, marketplaces selling data inevitably emerge, some operating as legal businesses and others, well, not so much. In its simplest form, the illegal data marketplace has long involved the exchange of currency for personal records containing attributes such as email addresses, passwords, names, etc. Cybercriminals then use this data for purposes ranging from identity theft to phishing attacks to <a href=\"https://www.troyhunt.com/password-reuse-credential-stuffing-and-another-1-billion-records-in-have-i-been-pwned/\">credential stuffing</a>. So, we (the good guys) adapt and build better defences. <a href=\"https://www.troyhunt.com/introducing-306-million-freely-downloadable-pwned-passwords/\">We block known breached passwords</a>. We implement two factor authentication. We roll out user behavioural analytics that identifies abnormalities in logins (why is Joe suddenly logging in from the other side of the world with a new machine?) And in turn, the criminals adapt, which brings us to Genesis Market.</p><p>Until this week, <a href=\"https://www.zdnet.com/article/cybercrime-market-selling-full-digital-fingerprints-of-over-60000-users/?ref=troyhunt.com\">Genesis had been up and running for 4 years</a>. This is an excellent primer from Catalin Cimpanu, and it describes how in order to circumvent the aforementioned fraud protection measures, cybercriminals are increasingly relying on obtaining more abstract pieces of information from victims in order to gain access to their accounts. Rather than relying on the credentials themselves and then being subject to all the modern fraud detection services mentioned above, criminals instead began to trade in a combination of &quot;fingerprints&quot; and &quot;cookies&quot;. The latter will be a familiar term to most people (and was obviously the inspiration for the name behind the FBI&apos;s operation), whilst the former refers to observable attributes of the user and their browser. To see a very easy demonstration of what fingerprinting involves, go and check out <a href=\"https://amiunique.org/?ref=troyhunt.com\">amiunique.org</a> and hit the &quot;View my browser fingerprint&quot; button. You&apos;ll get something similar to this:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/04/image.png\" class=\"kg-image\" alt=\"Seized Genesis Market Data is Now Searchable in Have I Been Pwned, Courtesy of the FBI and &quot;Operation Cookie Monster&quot;\" loading=\"lazy\" width=\"816\" height=\"410\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/04/image.png 600w, https://www.troyhunt.com/content/images/2023/04/image.png 816w\"></figure><p>Among more than 1.6M sampled clients, nobody has the same fingerprint as me. Somehow, using the current version of Chrome on the current version of Windows, I am a unique snowflake. Why I&apos;m so unique is partly explained by my time zone which is shared by less than half a percent of people, but it&apos;s when that&apos;s combined with the other observable fingerprint attributes that you realise just how special I really am. For example, less than 0.01% of people have a content language request header of &quot;en-US,en,en-AU&quot;. Only 0.12% of people share a screen width of 5,120 pixel (<a href=\"https://www.troyhunt.com/building-the-ultimate-home-office-again/\">I&apos;m using an ultrawide monitor</a>). And so on and so forth. Because they&apos;re so unique, fingerprints are increasingly used as a fraud detection method such that if a malicious party attempts to impersonate a legitimate users with otherwise correct attributes (for example, the correct cookies) but the wrong fingerprint, they&apos;re rejected. Which is why we now have IMPaaS.</p><p>There&apos;s an excellent IMPaaS explanation from the Eindhoven University of Technology in the Netherlands via a paper titled <a href=\"https://arxiv.org/pdf/2009.04344.pdf?ref=troyhunt.com\">Impersonation-as-a-Service: Characterising the Emerging Criminal Infrastructure for User Impersonation at Scale</a>. Released only a year and a half after the emergence of Genesis, the paper explains the mechanics of IMPaaS:</p><blockquote>IMPaaS allows attackers to systematically collect and enforce user profiles (consisting of user credentials, cookies, device and behavioural fingerprints, and other metadata) to circumvent risk-based authentication system and effectively bypass multifactor authentication mechanisms</blockquote><p>In other words, if you have all the bits of information a website requires to persist authenticated state <em>after the login process has successfully completed</em> (including after any 2FA requirements), you can perform a modern equivalent of <a href=\"https://www.troyhunt.com/owasp-top-10-for-net-developers-part-3/\">session hijacking</a>. Obtaining this level of information is typically done via malicious software running on the victim&apos;s machine which can then grab anything useful and send it off to a C2 server where it can then be sold and used to commit fraud (from the IMPaaS paper):</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/04/image-1.png\" class=\"kg-image\" alt=\"Seized Genesis Market Data is Now Searchable in Have I Been Pwned, Courtesy of the FBI and &quot;Operation Cookie Monster&quot;\" loading=\"lazy\" width=\"1602\" height=\"529\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/04/image-1.png 600w, https://www.troyhunt.com/content/images/size/w1000/2023/04/image-1.png 1000w, https://www.troyhunt.com/content/images/size/w1600/2023/04/image-1.png 1600w, https://www.troyhunt.com/content/images/2023/04/image-1.png 1602w\"></figure><p>Catalin&apos;s story from the early days of Genesis showed how buyers could browse through a list of compromised victims and pick their target based on the various services they had authenticated too, along with their operating system and location. Pricing was inevitably based on the value of those services with the examples below going for $41.30 each (and just like a legitimate marketplace, these were marked down prices so a real bargain!)</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/04/genesis-marketplace.png\" class=\"kg-image\" alt=\"Seized Genesis Market Data is Now Searchable in Have I Been Pwned, Courtesy of the FBI and &quot;Operation Cookie Monster&quot;\" loading=\"lazy\" width=\"1280\" height=\"821\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/04/genesis-marketplace.png 600w, https://www.troyhunt.com/content/images/size/w1000/2023/04/genesis-marketplace.png 1000w, https://www.troyhunt.com/content/images/2023/04/genesis-marketplace.png 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><p>To make things as turn-key as possible for the criminals, buyers would then run a browser extension from Genesis that would reconstruct the required fingerprint based on the information the malware had obtained and grant them access to the victims&apos; accounts (I&apos;m having flashbacks of <a href=\"https://en.wikipedia.org/wiki/Firesheep?ref=troyhunt.com\">Firesheep</a> here). It was that simple... until this week. As of now, the following banner greets anyone browsing to the Genesis website:</p><!--kg-card-begin: html--><figure><img src=\"https://www.troyhunt.com/content/images/2023/04/FBISplashPage.jpg\" alt=\"Seized Genesis Market Data is Now Searchable in Have I Been Pwned, Courtesy of the FBI and &quot;Operation Cookie Monster&quot;\"></figure><!--kg-card-end: html--><p>The aptly named &quot;Operation Cookie Monster&quot; is a joint effort between the FBI and a coalition of law enforcement agencies across the globe who have now put an abrupt end to Genesis. I imagine they&apos;ll be having some &quot;discussions&quot; with those involved in running the service, but what about the individuals who are the victims? These are the people whose identities have been put up for sale, purchased by other criminals and then abused to their detriment. The FBI approached me and asked if HIBP could be used as a mechanism to help warn victims of their exposure in the same way as <a href=\"https://www.troyhunt.com/data-from-the-emotet-malware-is-now-searchable-in-have-i-been-pwned-courtesy-of-the-fbi-and-nhtcu/\">we&apos;d previously done with the Emotet malware a couple of years ago</a>. This is well aligned with the mantra of HIBP - <em>to do good and constructive things with data breaches after they occur</em> - and I was happy to provide support.</p><p>There are 2 separate things that have now been loaded into HIBP, each disassociated from the other:</p><ol><li>Millions of compromised passwords that are now searchable via <a href=\"https://haveibeenpwned.com/Passwords?ref=troyhunt.com\">Pwned Passwords</a></li><li>Millions of email addresses that are now searchable after verifying control of the address using <a href=\"https://haveibeenpwned.com/NotifyMe?ref=troyhunt.com\">the notification service</a></li></ol><p>The Pwned Passwords API is presently hit <a href=\"https://twitter.com/troyhunt/status/1640852641583599617?ref=troyhunt.com\">more than 4 <em>billion </em>times each month</a>, and the downloadable data set is hit, well, I don&apos;t know because anyone can grab it run it offline. The point is that password corpuses loaded into HIBP have huge reach and are used by thousands of different online services to help people make better password choices. You&apos;re probably using it without even knowing it when you signup or login to various services but if you want to check it directly, you can browse to <a href=\"https://haveibeenpwned.com/Passwords?ref=troyhunt.com\">the web interface</a>. (If you&apos;re worried about the privacy of your password, there&apos;s <a href=\"https://www.troyhunt.com/understanding-have-i-been-pwneds-use-of-sha-1-and-k-anonymity/\">a full explainer on how the service preserves anonymity</a> but I also suggest testing it <em>after</em> you&apos;ve changed it as a generally good practice.)</p><p>The email address search is what HIBP is so well known for and that&apos;s obviously what will help you understand if you&apos;ve been impacted. Per the opening paragraph, this breach is flagged as &quot;sensitive&quot; so you <em>will not</em> get a result when searching directly from the front page or via the API, rather you&apos;ll need to use <a href=\"https://haveibeenpwned.com/NotifyMe?ref=troyhunt.com\">the free notification service</a>. This approach was chosen to avoid the risk of people being further targeted as a result of their inclusion in Genesis. All existing HIBP subscribers have been sent notification emails and between individuals and those monitoring domains, tens of thousands of emails have now been sent out. Whilst the volume of accounts represented is &quot;8M&quot;, please note that this is merely an approximation (hence the perfectly round number on HIBP), intended to be an indicative representation of scale as many of the breached accounts didn&apos;t include email addresses. This number only represents the number of unique email addresses which showed up in the data set so consider it a subset of a much larger corpus.</p><p>Let me add some final context and this is important if you do find yourself in the Genesis data: due to the nature of how the malware collected personal information and the broad range of different services victims may have been using at the time, the exposed data can differ significantly person by person. What&apos;s been provided by the FBI is one set of passwords (incidentally, as SHA-1 and NTLM hash pairs fed into <a href=\"https://github.com/HaveIBeenPwned/PwnedPasswordsAzureFunction?ref=troyhunt.com\">the law enforcement ingestion pipeline</a>), one set of email addresses and a list of meta data. Beyond the data already listed here, the meta data includes names, physical addresses, phone numbers and full credit card details among other personal attributes. <strong>This does not mean that all impacted individuals had each of those data classes exposed.</strong> The hope is that by listing these fields it will help victims understand, for example, why they may have observed fraudulent transactions on their card, and they can then take informed and appropriate steps to better protect themselves.</p><p>Lastly, as flagged in the intro, following is the guidance prepared by the FBI and Dutch police on how people can safeguard themselves if they get a hit in the Genesis data or frankly, just want to better protect themselves in future:</p><!--kg-card-begin: html--><div id=\"fbi-statement\" class=\"fbi-statement\">\n<p>The FBI reached out to Have I Been Pwned (HIBP) to continue sharing efforts to help victims determine if they&apos;ve been victimized. In this instance, the data shared emanates from the Initial Access Broker Marketplace Genesis Market. The FBI has taken action against Genesis Market, and in the process has been able to extract victim information for the purposes of alerting victims.</p>\n \n<p>In all, millions of passwords and email addresses were provided which span a wide range of countries and domains. These emails and passwords were sold on Genesis Market and were used by Genesis Market users to access the various accounts and platforms that were for sale.</p>\n \n<p>Prepared in conjunction with the FBI, following is the recommended guidance for those that find themselves in this collection of data:</p>\n \n<p>To safeguard yourself against fraud in the future, it is important that you immediately remove the malware from your computer and then change all your passwords. Do this as follows:</p>\n \n<ol>\n    <li>Log out of all open sessions in all web browsers on your computer.</li>\n    <li>Remove all cookies and temporary internet files.</li>\n<li>Then choose one of the following two options:\n<ol>\n    <li>Update the virus scanner on your computer.\n        <ol>\n    <li>Then carry out a virus scan on your computer.</li>\n    <li>The malware will be removed.</li>\n    <li>Then (and only then) change all your passwords. Don&#x2019;t do this any earlier, as otherwise the cybercriminals will see the new passwords.\n<br><br>OR<br><br></li>\n        </ol>\n        </li>\n    <li>Reset the infected computer to the factory default settings:\n        <ol>\n<li>Then (and only then) change all your passwords. Don&#x2019;t do this any earlier, as otherwise the cybercriminals will see the new passwords.</li>\n        </ol>\n        </li>\n    </ol>\n    </li>\n    </ol>\n \n    <p>How can I prevent my data being stolen (again)?</p>\n    <ol>\n        <li>Use a virus scanner and keep it up to date.</li>\n        <li>Use strong passwords that are unique for each account/website.</li>\n<li>Use multifactor authentication. If you use a fingerprint, facial recognition, or approval on another device (such as a phone) to confirm your identity on login, it is harder for someone to access your accounts.</li>\n<li>Never download or install illegal software. This is a very common source of malware infection.</li>\n        <li>When installing legal software, always check that the website is genuine.</li>\n    </ol>\n</div><!--kg-card-end: html--><p>Just one more thing to end on a lighter note: a quick shoutout to whoever at the bureau slipped a half-eaten cookie into the takedown image, having been munched on by what I can only assume is a very satisfied FBI agent after a successful &quot;Operation Cookie Monster&quot; &#x1F60A;</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/04/MmmmCookies.jpg\" class=\"kg-image\" alt=\"Seized Genesis Market Data is Now Searchable in Have I Been Pwned, Courtesy of the FBI and &quot;Operation Cookie Monster&quot;\" loading=\"lazy\" width=\"609\" height=\"245\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/04/MmmmCookies.jpg 600w, https://www.troyhunt.com/content/images/2023/04/MmmmCookies.jpg 609w\"></figure>"}},{"title":{"#cdata-section":"Weekly Update 341"},"description":{"#cdata-section":"<p>Most of this week&apos;s video went on talking about the UniFi Dream Wall. <em>What a unit!</em> I mean it&apos;s big, but then it wraps a lot of stuff up in the one device too. If you watch this and have thoughts on how I can integrate</p>"},"link":"https://www.troyhunt.com/weekly-update-341/","guid":{"@isPermaLink":"false","#text":"6426b98595fdc2004d2d99dc"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Sun, 02 Apr 2023 06:12:32 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/03/Splash-Template-4.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/03/Splash-Template-4.jpg\" alt=\"Weekly Update 341\"><p>Most of this week&apos;s video went on talking about the UniFi Dream Wall. <em>What a unit!</em> I mean it&apos;s big, but then it wraps a lot of stuff up in the one device too. If you watch this and have thoughts on how I can integrate it into the new garage such that it doesn&apos;t clash with the dark theme, I&apos;d love to hear about it. I&apos;ll share more once I set it up in the coming weeks but for now, enjoy this week&apos;s video &#x1F642;</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 341\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;%3B%3Bisi=691797987&amp;%3B%3Bius=googleplaymusic&amp;%3B%3Bapn=com.google.android.music&amp;%3B%3Blink=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;%3B%3Bref=troy-hunt&amp;%3Bref=troy-hunt&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 341\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 341\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 341\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/zH03WkseCf4\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://www.youtube.com/watch?v=RjP3Z-qn_Lg&amp;ref=troyhunt.com\">The UniFi Dream Wall is an impressive unit</a> (that&apos;s a link to the video I was referring to and it does show 2 HDDs so... &#x1F937;&#x200D;&#x2642;&#xFE0F;)</li><li><a href=\"https://twitter.com/troyhunt/status/1640095846095261697?ref=troyhunt.com\">The tweet that went nuts</a> (can we all just agree that Twitter - and Elon - are polarising, but both are still here, still working and probably not going anywhere soon?)</li><li><a href=\"https://twitter.com/troyhunt/status/1640852641583599617?ref=troyhunt.com\">Pwned Passwords has now surpassed 4 <em>billion</em> monthly requests!</a> (I&apos;m getting kinda curious as to just how big this thing is going to get...)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Zero Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Weekly Update 340"},"description":{"#cdata-section":"<p>I&apos;m excited about coming to Prague. One more country to check off the list, apparently a beautiful city and perhaps what I&apos;m most stoked about, it&apos;s the home of Prusa 3D. Writing this as I wrangle prints out of my trusty MK3S+, I&apos;</p>"},"link":"https://www.troyhunt.com/weekly-update-340/","guid":{"@isPermaLink":"false","#text":"641fdcba5cedff003d3c67f3"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Sun, 26 Mar 2023 06:12:14 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/03/Splash-Template-3.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/03/Splash-Template-3.jpg\" alt=\"Weekly Update 340\"><p>I&apos;m excited about coming to Prague. One more country to check off the list, apparently a beautiful city and perhaps what I&apos;m most stoked about, it&apos;s the home of Prusa 3D. Writing this as I wrangle prints out of my trusty MK3S+, I&apos;m going to do my best to catch up with folks there and see some of the super cool stuff they&apos;re doing. Other than that, this week is full of the usual; data breaches, IoT and a cold &#x1F37A;</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 340\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;%3B%3Bisi=691797987&amp;%3B%3Bius=googleplaymusic&amp;%3B%3Bapn=com.google.android.music&amp;%3B%3Blink=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;%3B%3Bref=troy-hunt&amp;%3Bref=troy-hunt&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 340\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 340\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 340\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/d4Ptn7wqptI\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://www.expertslive.eu/?ref=troyhunt.com\">I&apos;m coming to Prague!</a> (Experts Live Europe, see you there September 18)</li><li><a href=\"https://twitter.com/troyhunt/status/1637966167548780544?s=61&amp;t=beHN95Zd9G3fQiuO1h_jzA&amp;ref=troyhunt.com\">I&apos;m crow-sourcing a new and improved version of the HIBP email extractor</a> (and no, it&apos;s not going to facilitate cybercrime &#x1F926;&#x200D;&#x2642;&#xFE0F;)</li><li><a href=\"https://twitter.com/haveibeenpwned/status/1639120007568424960?ref=troyhunt.com\">TheGradCafe was breached</a> (they apparently know about it, but just won&apos;t reply to anyone trying to reach them on it)</li><li><a href=\"https://twitter.com/troyhunt/status/1639020013272322049?ref=troyhunt.com\">The kitchen shall be black!</a> (as you can probably glean from this thread, there&apos;s a huge amount of thought going into this)</li><li><a href=\"https://twitter.com/troyhunt/status/1638086216917860352?ref=troyhunt.com\">My network got, uh, too big &#x1F632;</a> (it was always going to be better to VLAN the IoT devices anyway, and now it&apos;s done)</li><li><a href=\"https://twitter.com/troyhunt/status/1638676840402550784?ref=troyhunt.com\">The garage is now starting to look more finished</a> (within the next couple of weeks, other than the joinery work it should look pretty complete)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Device Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Weekly Update 339"},"description":{"#cdata-section":"<p>Why can&apos;t I audio right? It&apos;s my 339th video and I still make mistakes &#x1F642; But it came good and we got a decent show out of it with lots of interesting engagement even though doing this a lot later in the day than usual. I</p>"},"link":"https://www.troyhunt.com/weekly-update-339/","guid":{"@isPermaLink":"false","#text":"6413e53fc9411b003d212803"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Fri, 17 Mar 2023 08:46:16 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/03/Splash-Template-2.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/03/Splash-Template-2.jpg\" alt=\"Weekly Update 339\"><p>Why can&apos;t I audio right? It&apos;s my 339th video and I still make mistakes &#x1F642; But it came good and we got a decent show out of it with lots of interesting engagement even though doing this a lot later in the day than usual. I found the discussion around IoT door locks especially interesting as it&apos;s a real nexus of security, usability and a bit of critical thinking about real world risks. That term &quot;security absolutism&quot; that came up in the comments is gold, I hope you enjoy watching this episode.</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 339\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;%3Bisi=691797987&amp;%3Bius=googleplaymusic&amp;%3Bapn=com.google.android.music&amp;%3Blink=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;%3Bref=troy-hunt&amp;ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 339\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 339\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 339\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/SgkVqJlTogI\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://twitter.com/troyhunt/status/1635927396741447682?ref=troyhunt.com\">Yale IoT door locks seem to be the least bad ones you can buy!</a> (you can have that slogan for free guys &#x1F642;)</li><li><a href=\"https://economictimes.indiatimes.com/industry/banking/finance/banking/hdb-financial-services-flags-data-breach-at-service-provider/articleshow/98483482.cms?ref=troyhunt.com\">The HDB Financial Services breach went into HIBP</a> (after their parent company denied the breach...)</li><li><a href=\"https://twitter.com/MikeSafariMusic/status/1634251270817980424?ref=troyhunt.com\">Canada&apos;s Shopper+ also went into HIBP</a> (another 878k records dating back to 2020)</li><li><a href=\"https://www.itnews.com.au/news/latitude-financial-breach-impacts-225000-customers-592152?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=scmagazine_autopost\">Latitude Financial announced a breach this week</a> (another major one down under as Australia continues representing in data breach land)</li><li><a href=\"https://twitter.com/troyhunt/status/1635727393091633153?ref=troyhunt.com\">At long last, Eye4Fraud has acknowledged their breach...</a> (via one the most half-arsed disclosure statements I&apos;ve ever seen)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Device Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Weekly Update 338"},"description":{"#cdata-section":"<p>I&apos;m going lead this post with where I finished the video because it brought the biggest smile to Charlotte&apos;s and my faces this week:</p><!--kg-card-begin: html--><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This. Is. Amazing &#x1F60D; <a href=\"https://t.co/wOl4kpK841?ref=troyhunt.com\">pic.twitter.com/wOl4kpK841</a></p>&#x2014; Troy Hunt (@troyhunt) <a href=\"https://twitter.com/troyhunt/status/1631788751453294592?ref_src=twsrc%5Etfw&amp;ref=troyhunt.com\">March 3, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><!--kg-card-end: html--><p>When I talked about the McLaren in</p>"},"link":"https://www.troyhunt.com/weekly-update-338/","guid":{"@isPermaLink":"false","#text":"640c1f38813442003d8412a5"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Sat, 11 Mar 2023 06:48:11 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/03/Splash-Template-1.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/03/Splash-Template-1.jpg\" alt=\"Weekly Update 338\"><p>I&apos;m going lead this post with where I finished the video because it brought the biggest smile to Charlotte&apos;s and my faces this week:</p><!--kg-card-begin: html--><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This. Is. Amazing &#x1F60D; <a href=\"https://t.co/wOl4kpK841?ref=troyhunt.com\">pic.twitter.com/wOl4kpK841</a></p>&#x2014; Troy Hunt (@troyhunt) <a href=\"https://twitter.com/troyhunt/status/1631788751453294592?ref_src=twsrc%5Etfw&amp;ref=troyhunt.com\">March 3, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><!--kg-card-end: html--><p>When I talked about the McLaren in this week&apos;s video, Frits made the comment &quot;the smile on your face says it all&quot;, which absolutely nailed it. But more than that, it brings a smile to the face of <em>everyone</em> who sees it (I suspect the colour helps), we&apos;re just loving seeing the excitement expressed by kids and adults alike. It&apos;s so much fun &#x1F60A;</p><p>Less fun is dealing with Eye4Fraud. 24 hours on from recording this video, there&apos;s still zero visible progress and I lament that this one is just going to slip beneath the radar. If you&apos;re in the breach, do push for answers, it really shouldn&apos;t be this hard. All that and more in this week&apos;s video, enjoy!</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 338\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;isi=691797987&amp;ius=googleplaymusic&amp;apn=com.google.android.music&amp;link=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 338\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 338\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 338\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/QLF7WW2IFKQ\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://twitter.com/troyhunt/status/1633609014474084357?ref=troyhunt.com\">Oh Namesco, you do provide entertainment!</a> (still selling SSL like it&apos;s 2015)</li><li><a href=\"https://twitter.com/troyhunt/status/1632625619354918915?ref=troyhunt.com\">Eye4Fraud - the one that gives merchants &quot;guaranteed protection&quot; - had lots of millions of their merchant&apos;s transactions dumped</a> (and to date, they don&apos;t appear to have actually told anyone)</li><li><a href=\"https://www.troyhunt.com/to-infinity-and-beyond-with-cloudflare-cache-reserve/\">Cloudflare&apos;s cache reserve is pretty amazing stuff</a> (as expected, the cache hit ratio is even better one day on with 100 less origin requests and only a slight decrease in overall traffic)</li><li><a href=\"https://www.troyhunt.com/gt-r-technology-of-speed/\">It was almost a decade ago when I last wrote about a car</a> (should I do another one for the McLaren?)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Device Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"To Infinity and Beyond, with Cloudflare Cache Reserve"},"description":{"#cdata-section":"<p></p><p>What if I told you... that you could run a website from behind Cloudflare and only have 385 daily requests miss their cache and go through to the origin service?</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"920\" height=\"1107\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/03/image-3.png 600w, https://www.troyhunt.com/content/images/2023/03/image-3.png 920w\"></figure><p>No biggy, unless... that was out of a total of more than 166M requests in the same period:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-11.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"919\" height=\"736\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/03/image-11.png 600w, https://www.troyhunt.com/content/images/2023/03/image-11.png 919w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Yep, we</p>"},"link":"https://www.troyhunt.com/to-infinity-and-beyond-with-cloudflare-cache-reserve/","guid":{"@isPermaLink":"false","#text":"640a5309813442003d841141"},"category":[{"#cdata-section":"Have I Been Pwned"},{"#cdata-section":"Pwned Passwords"},{"#cdata-section":"Cloudflare"}],"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Fri, 10 Mar 2023 06:35:16 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/03/2023-03-10_11-04-37.png","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/03/2023-03-10_11-04-37.png\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\"><p></p><p>What if I told you... that you could run a website from behind Cloudflare and only have 385 daily requests miss their cache and go through to the origin service?</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-3.png\" class=\"kg-image\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\" loading=\"lazy\" width=\"920\" height=\"1107\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/03/image-3.png 600w, https://www.troyhunt.com/content/images/2023/03/image-3.png 920w\"></figure><p>No biggy, unless... that was out of a total of more than 166M requests in the same period:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-11.png\" class=\"kg-image\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\" loading=\"lazy\" width=\"919\" height=\"736\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/03/image-11.png 600w, https://www.troyhunt.com/content/images/2023/03/image-11.png 919w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Yep, we just hit &quot;five nines&quot; of cache hit ratio on Pwned Passwords being 99.999%. Actually, it was 99.9998% but we&apos;re at the point now where that&apos;s just splitting hairs, let&apos;s talk about how we&apos;ve managed to only have two requests in a million hit the origin, beginning with a bit of history:</p><!--kg-card-begin: html--><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Optimising Caching on Pwned Passwords (with Workers)- <a href=\"https://twitter.com/troyhunt?ref_src=twsrc%5Etfw&amp;ref=troyhunt.com\">@troyhunt</a> - <a href=\"https://t.co/KjBtCwmhmT?ref=troyhunt.com\">https://t.co/KjBtCwmhmT</a> <a href=\"https://t.co/BSfJbWyxMy?ref=troyhunt.com\">pic.twitter.com/BSfJbWyxMy</a></p>&#x2014; Cloudflare (@Cloudflare) <a href=\"https://twitter.com/Cloudflare/status/1027581977564774400?ref_src=twsrc%5Etfw&amp;ref=troyhunt.com\">August 9, 2018</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><!--kg-card-end: html--><p>Ah, memories &#x1F60A; Back then, Pwned Passwords was serving way fewer requests in a month than what we do in a day now and the cache hit ratio was somewhere around 92%. Put another way, instead of 2 in every million requests hitting the origin it was 85k. And we were happy with that! As the years progressed, the traffic grew and the caching model was optimised so our stats improved:</p><!--kg-card-begin: html--><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There it is - Pwned Passwords is now doing north of 2 *billion* requests a month, peaking at 91.59M in a day with a cache-hit ratio of 99.52%. All free, open source and out there for the community to do good with &#x1F60A; <a href=\"https://t.co/DSJOjb2CxZ?ref=troyhunt.com\">pic.twitter.com/DSJOjb2CxZ</a></p>&#x2014; Troy Hunt (@troyhunt) <a href=\"https://twitter.com/troyhunt/status/1528911779719286784?ref_src=twsrc%5Etfw&amp;ref=troyhunt.com\">May 24, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><!--kg-card-end: html--><p>And that&apos;s pretty much where we levelled out, at about the 99-and-a-bit percent mark. We were <em>really</em> happy with that as it was now only 5k requests per million hitting the origin. There was bound to be a number somewhere around that mark due to the transient nature of cache and eviction criteria inevitably meaning a Cloudflare edge node somewhere would need to reach back to the origin website and pull a new copy of the data. But what if Cloudflare never had to do that unless explicitly instructed to do so? I mean, what if it just stayed in their cache unless we actually changed the source file and told them to update their version? Welcome to <a href=\"https://developers.cloudflare.com/cache/about/cache-reserve/?ref=troyhunt.com\">Cloudflare Cache Reserve</a>:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/03/content-being-served-97239e18.png\" class=\"kg-image\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\" loading=\"lazy\" width=\"1711\" height=\"368\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/03/content-being-served-97239e18.png 600w, https://www.troyhunt.com/content/images/size/w1000/2023/03/content-being-served-97239e18.png 1000w, https://www.troyhunt.com/content/images/size/w1600/2023/03/content-being-served-97239e18.png 1600w, https://www.troyhunt.com/content/images/2023/03/content-being-served-97239e18.png 1711w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Ok, so I may have annotated the important bit but that&apos;s what it feels like - magic - because you just turn it on and... that&apos;s it. You still serve your content the same way, you still need the appropriate cache headers and you still have the same tiered caching as before, but now there&apos;s a &quot;cache reserve&quot; sitting between that and your origin. It&apos;s backed by R2 which is their persistent data store and you can keep your cached things there for as long as you want. However, per the earlier link, it&apos;s not free:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-7.png\" class=\"kg-image\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\" loading=\"lazy\" width=\"442\" height=\"235\"></figure><p>You pay based on how much you store for how long, how much you write and how much you read. Let&apos;s put that in real terms and just as a brief refresher (longer version <a href=\"https://www.troyhunt.com/understanding-have-i-been-pwneds-use-of-sha-1-and-k-anonymity/\">here</a>), remember that Pwned Passwords is essentially just 16^5 (just over 1 million) text files of about 30kb each for the SHA-1 hashes and a similar number for the NTLM ones (albeit slight smaller file sizes). Here are the Cache Reserve usage stats for the last 9 days:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-8.png\" class=\"kg-image\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\" loading=\"lazy\" width=\"573\" height=\"311\"></figure><p>We can now do some pretty simple maths with that and working on the assumption of 9 days, here&apos;s what we get:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-10.png\" class=\"kg-image\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\" loading=\"lazy\" width=\"761\" height=\"162\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/03/image-10.png 600w, https://www.troyhunt.com/content/images/2023/03/image-10.png 761w\" sizes=\"(min-width: 720px) 720px\"></figure><p>2 bucks a day &#x1F632; But this has taken nearly 16M requests off my origin service over this period of time so I haven&apos;t paid for the <a href=\"https://azure.microsoft.com/en-au/pricing/details/functions/?ref=troyhunt.com\">Azure Function</a> execution (which is cheap) nor the egress bandwidth (<a href=\"https://www.troyhunt.com/how-i-got-pwned-by-my-cloud-costs/\">which is <em>not</em> cheap</a>). But why are there only 16M read operations over 9 days when earlier we saw 167M requests to the API in a single day? Because if you scroll back up to the &quot;insert magic here&quot; diagram, Cache Reserve is only a <em>fallback position</em> and most requests (i.e. 99.52% of them) are still served from the edge caches.</p><p>Note also that there are nearly 1M write operations and there are 2 reasons for this:</p><ol><li>Cache Reserve is being seeded with source data as requests come in <em>and miss the edge cache. </em>This means that our cache hit ratio is going to get much, much better yet as not even half all the potentially cacheable API queries are in Cache Reserve. It also means that the 48c per day cost is going to come way down &#x1F642;</li><li>Every time <a href=\"https://www.troyhunt.com/open-source-pwned-passwords-with-fbi-feed-and-225m-new-nca-passwords-is-now-live/\">the FBI feeds new passwords into the service</a>, the impacted file is purged from cache. This means that there will always be write operations and, of course, read operations as the data flows to the edge cache and makes corresponding hits to the origin service. The prevalence of all this depends on how much data the feds feed in, but it&apos;ll never get to zero whilst they&apos;re seeding new passwords.</li></ol><p>An untold number of businesses rely on Pwned Passwords as an integral part of their registration, login and password reset flows. Seriously, the number is &quot;untold&quot; because we have no idea who&apos;s actually using it, we just know the service got hit three and a quarter <em>billion </em>times in the last 30 days:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/03/image-5.png\" class=\"kg-image\" alt=\"To Infinity and Beyond, with Cloudflare Cache Reserve\" loading=\"lazy\" width=\"899\" height=\"460\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/03/image-5.png 600w, https://www.troyhunt.com/content/images/2023/03/image-5.png 899w\"></figure><p>Giving consumers of the service confidence that not only is it highly resilient, but also massively fast is essential to adoption. In turn, more adoption helps drive better password practices, less account takeovers and more smiles all round &#x1F60A;</p><p>As those remaining hash prefixes populate Cache Reserve, keep an eye on the &quot;cf-cache-status&quot; response header. If you ever see a value of &quot;MISS&quot; then congratulations, you&apos;re literally one in a million!</p><p>Full disclosure: Cloudflare provides services to HIBP for free and they helped in getting Cache Reserve up and running. However, they had no idea I was writing this blog post and reading it live in its entirety is the first anyone there has seen it. Surprise! &#x1F44B;</p>"}},{"title":{"#cdata-section":"Weekly Update 337"},"description":{"#cdata-section":"<p>Guns! You know, the things you kinda want to keep pretty well protected and out of the hands of nefarious parties, like the kinds of folks that following their data breach could match firearms to an individual at an address on a phone number of a gender and specific age.</p>"},"link":"https://www.troyhunt.com/weekly-update-337/","guid":{"@isPermaLink":"false","#text":"6401696f72c982003d807218"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Fri, 03 Mar 2023 07:31:05 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/03/Splash-Template.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/03/Splash-Template.jpg\" alt=\"Weekly Update 337\"><p>Guns! You know, the things you kinda want to keep pretty well protected and out of the hands of nefarious parties, like the kinds of folks that following their data breach could match firearms to an individual at an address on a phone number of a gender and specific age. But don&apos;t worry, no financial information was compromised! &#x1F926;&#x200D;&#x2642;&#xFE0F;</p><p>All that and more in the 337th addition of my weekly update, enjoy!</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 337\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;isi=691797987&amp;ius=googleplaymusic&amp;apn=com.google.android.music&amp;link=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 337\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 337\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troy-hunt\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 337\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/qX_dN3BEIfI\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://techcrunch.com/2023/03/02/hackers-steal-gun-owners-data-from-firearm-auction-website/?ref=troyhunt.com\">GunAuction.com got pwned</a> (it only took them 2 months to tell absolutely nobody about it too)</li><li><a href=\"https://twitter.com/troyhunt/status/1630289643324465152?ref=troyhunt.com\">The Ticketcounter hackers have been pwned</a> (3 kids, surprise surprise)</li><li><a href=\"https://twitter.com/troyhunt/status/1630844936882110464?ref=troyhunt.com\">The office acoustic work is finally complete!</a> (I love this, it&apos;s amazing &#x1F60D;)</li><li><a href=\"https://twitter.com/troyhunt/status/1630865707931152384?ref=troyhunt.com\">The Ubiquiti AI 360 cam is <em>really</em> impressive</a> (check out how that fisheye view can be flatted into frames of other parts of the room)</li><li><a href=\"https://twitter.com/troyhunt/status/1630681663285121024?ref=troyhunt.com\">We got burgled - but only a little bit</a> (I&apos;m more annoyed about the lapses in my own security, but mitigating controls ultimately made this a non-event)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Device Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Weekly Update 336"},"description":{"#cdata-section":"<p>Hey, it&apos;s double-Troy! I&apos;m playing with the Insta360 Link cam, a gimbal-based model that can follow you around the room. It&apos;s tiny and pretty awesome for what it is, I&apos;m doing some back-to-back with that and my usual Sony a6400 this week.</p>"},"link":"https://www.troyhunt.com/weekly-update-336/","guid":{"@isPermaLink":"false","#text":"63fae2e57ba52a003d9cbcc8"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Sun, 26 Feb 2023 05:00:59 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/02/Splash-Template-3.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/02/Splash-Template-3.jpg\" alt=\"Weekly Update 336\"><p>Hey, it&apos;s double-Troy! I&apos;m playing with the Insta360 Link cam, a gimbal-based model that can follow you around the room. It&apos;s tiny and pretty awesome for what it is, I&apos;m doing some back-to-back with that and my usual Sony a6400 this week. A little note on that: during the live stream someone suggested there was some lag from that camera (very minor, they suggested), but others couldn&apos;t see it. I&apos;ve just been watching a bit of the video while writing up this post and I reckon they&apos;re right. Try the 3:02 mark, for example, where on Insta360 Link I have my finger up but on the Sony a6400, I don&apos;t:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/02/2023-02-26_14-58-06.jpg\" class=\"kg-image\" alt=\"Weekly Update 336\" loading=\"lazy\" width=\"2000\" height=\"1124\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/02/2023-02-26_14-58-06.jpg 600w, https://www.troyhunt.com/content/images/size/w1000/2023/02/2023-02-26_14-58-06.jpg 1000w, https://www.troyhunt.com/content/images/size/w1600/2023/02/2023-02-26_14-58-06.jpg 1600w, https://www.troyhunt.com/content/images/size/w2400/2023/02/2023-02-26_14-58-06.jpg 2400w\" sizes=\"(min-width: 720px) 720px\"></figure><p>It&apos;s very minor, but it&apos;s just enough to notice. Anyway, see what you think, all that a much more in weekly update 336:</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 336\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;isi=691797987&amp;ius=googleplaymusic&amp;apn=com.google.android.music&amp;link=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 336\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 336\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 336\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/HpqSe-ZrJTc\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://twitter.com/troyhunt/status/1628216415223422976?ref=troyhunt.com\">I spoke at the Association of Superannuation Funds Australia this week</a> (very happy to see cybersecurity on the agenda at a finance conference)</li><li><a href=\"https://twitter.com/troyhunt/status/1627910695248617472?ref=troyhunt.com\">These Insta360 cameras are kinda blowing my mind &#x1F92F;</a> (super weird to think of 360 video that allows you to later go back and &quot;point the camera&quot; wherever you wanted it to be)</li><li><a href=\"https://www.troyhunt.com/down-the-cloudflare-stripe-owasp-rabbit-hole-a-tale-of-6-rabbits-deep/\">&#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;</a> (maybe I just like putting rabbit emojis in a blog post title, or maybe the firewall stuff with Cloudflare, Stripe and OWASP was an interesting little adventure)</li><li><a href=\"https://twitter.com/troyhunt/status/1626860520031817729?ref=troyhunt.com\">Twitter is killing SMS-based 2FA if you&apos;re not paying them any money</a> (their messaging was poor, but the outcome is probably the right one)</li><li><a href=\"https://twitter.com/troyhunt/status/1628293986866847745?ref=troyhunt.com\">What happens if your DNA get pwned?</a> (probably nothing... yet)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Device Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep      "},"description":{"#cdata-section":"<p>I found myself going down a previously unexplored rabbit hole recently, or more specifically, what I thought was &quot;a&quot; rabbit hole but in actual fact was an ever-expanding series of them that led me to what I refer to in the title of this post as &quot;6</p>"},"link":"https://www.troyhunt.com/down-the-cloudflare-stripe-owasp-rabbit-hole-a-tale-of-6-rabbits-deep/","guid":{"@isPermaLink":"false","#text":"63c9a299c9f60f004dce1c5a"},"category":[{"#cdata-section":"Have I Been Pwned"},{"#cdata-section":"Cloudflare"},{"#cdata-section":"Security"}],"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Mon, 20 Feb 2023 07:47:43 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/02/image-11.png","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/02/image-11.png\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\"><p>I found myself going down a previously unexplored rabbit hole recently, or more specifically, what I thought was &quot;a&quot; rabbit hole but in actual fact was an ever-expanding series of them that led me to what I refer to in the title of this post as &quot;6 rabbits deep&quot;. It&apos;s a tale of firewalls, APIs and sifting through layers and layers of different services to sniff out the root cause of something that seemed very benign, but actually turned out to be highly impactful. Let&apos;s go find the rabbits!</p><h3 id=\"the-back-story\">The Back Story</h3><p>When you <a href=\"https://haveibeenpwned.com/API/Key?ref=troyhunt.com\">buy an API key on Have I Been Pwned</a> (HIBP), Stripe handles all the payment magic. I <em>love</em> Stripe, it&apos;s such an awesome service that abstracts away so much pain and it&apos;s dead simple to integrate via their various APIs. It&apos;s also dead simple to <a href=\"https://stripe.com/docs/webhooks?ref=troyhunt.com\">configure Stripe to send notices back to your own service via webhooks</a>. For example, when an invoice is paid or a customer is updated, Stripe sends information about that event to HIBP and then lists each call on the webhooks dashboard in their portal:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-7.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"705\" height=\"239\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-7.png 600w, https://www.troyhunt.com/content/images/2023/01/image-7.png 705w\"></figure><p>There are a whole range of different events that can be listened to and webhooks fired, here we&apos;re seeing just a couple of them that are self explanatory in name. When an invoice is paid, the callback looks something like this:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-9.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"658\" height=\"546\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-9.png 600w, https://www.troyhunt.com/content/images/2023/01/image-9.png 658w\"></figure><p>HIBP has received this call and updated it&apos;s own DB such that for a new customer, they can now retrieve an API key or for an existing customer whose subscription has renewed, the API key validity period has been extended. The same callback is also issued when someone upgrades an API key, for example when going from 10RPM (requests per minute) to 50RPM. It&apos;s super important that HIBP gets that callback so it can appropriately upgrade the customer&apos;s key and they can immediately begin making more requests. When that call doesn&apos;t happen, well, let&apos;s go down the first rabbit hole.</p><h3 id=\"the-failed-api-key-upgrade-%F0%9F%90%B0\">The Failed API Key Upgrade &#x1F430;</h3><p>This should never happen:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-10.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"714\" height=\"255\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-10.png 600w, https://www.troyhunt.com/content/images/2023/01/image-10.png 714w\"></figure><p>This came in via <a href=\"https://support.haveibeenpwned.com/?ref=troyhunt.com\">HIBP&apos;s API key support portal</a> and is pretty self-explanatory. I checked the customer&apos;s account on Stripe and it did indeed show an active 50RPM subscription, but when drilling down into the associated payment, I found the following:</p><!--kg-card-begin: html--><figure><img src=\"https://www.troyhunt.com/content/images/2023/02/image-11.png\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\"></figure><!--kg-card-end: html--><p>Ok, so at least I know where things have started to go wrong, but why? Over to the webhooks dashboard and into the failed payments and things look... suboptimal:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-12.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"1372\" height=\"802\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-12.png 600w, https://www.troyhunt.com/content/images/size/w1000/2023/01/image-12.png 1000w, https://www.troyhunt.com/content/images/2023/01/image-12.png 1372w\"></figure><p>Dammit! Fortunately this is only a small single-digit percentage of all callbacks, but every time this fails it&apos;s either stopping someone like the guy above from making the requests they&apos;ve paid for or potentially, causing someone&apos;s API key to expire even though they&apos;ve paid for it. The latter in particular I was really worried about as it would nuke their key and whatever they&apos;d built on top of it would cease to function. Fortunately, because that&apos;s such an impactful action I&apos;d built in heaps of buffer for just such an occurrence and I&apos;d gotten onto this issue quickly, but it was disconcerting all the same.</p><p>So, what&apos;s happening? Well, the response is HTTP 403 &quot;Forbidden&quot; and the body is clearly a Cloudflare challenge page so something at their end is being triggered. Looks like it&apos;s time to go down the next rabbit hole.</p><h3 id=\"cloudflares-firewall-and-logs-%F0%9F%90%B0-%F0%9F%90%B0\">Cloudflare&apos;s Firewall and Logs &#x1F430; &#x1F430;</h3><p>Desperate just to quickly restore functionality, I dropped into Cloudflare&apos;s WAF and allowed <a href=\"https://stripe.com/docs/ips?ref=troyhunt.com#webhook-notifications\">all Stripe&apos;s outbound IPs used for webhooks</a> to bypass their security controls:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-13.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"918\" height=\"577\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-13.png 600w, https://www.troyhunt.com/content/images/2023/01/image-13.png 918w\"></figure><p>This wasn&apos;t ideal, but it only created risk for requests originating from Stripe and it got things up and running again quickly. With time up my sleeve I could now delve deeper and work out precisely what was going on, starting with the logs. Cloudflare has a really extensive set of APIs that can control a heap of features of the service, including <a href=\"https://developers.cloudflare.com/api/operations/logs-received-get-logs-received?ref=troyhunt.com\">pulling back logs</a> (note: this is a feature of their Enterprise plan). I queried out a slice of the logs corresponding to when some of the 403s from Stripe&apos;s dashboard occurred and found 2 entries similar to this one:</p><!--kg-card-begin: html--><pre><code>{&quot;BotScore&quot;:1,&quot;BotScoreSrc&quot;:&quot;Verified Bot&quot;,&quot;CacheCacheStatus&quot;:&quot;unknown&quot;,&quot;ClientASN&quot;:16509,&quot;ClientCountry&quot;:&quot;us&quot;,&quot;ClientIP&quot;:&quot;54.187.205.235&quot;,&quot;ClientRequestHost&quot;:&quot;haveibeenpwned.com&quot;,&quot;ClientRequestMethod&quot;:&quot;POST&quot;,&quot;ClientRequestReferer&quot;:&quot;&quot;,&quot;ClientRequestURI&quot;:&quot;[redacted]&quot;,&quot;ClientRequestUserAgent&quot;:&quot;Stripe/1.0 (+https://stripe.com/docs/webhooks)&quot;,&quot;EdgeRateLimitAction&quot;:&quot;&quot;,&quot;EdgeResponseStatus&quot;:403,&quot;EdgeStartTimestamp&quot;:1674073983931000000,&quot;FirewallMatchesActions&quot;:[&quot;managedChallenge&quot;],&quot;FirewallMatchesRuleIDs&quot;:[&quot;6179ae15870a4bb7b2d480d4843b323c&quot;],&quot;FirewallMatchesSources&quot;:[&quot;firewallManaged&quot;],&quot;OriginResponseStatus&quot;:0,&quot;WAFAction&quot;:&quot;unknown&quot;,&quot;WorkerSubrequest&quot;:false}</code></pre><!--kg-card-end: html--><p>That&apos;s one of Stripe&apos;s outbound IP&apos;s on 54.187.205.235 and the &quot;FirewallMatchesRuleIDs&quot; collection has a value in it. Ergo, something about this request triggered the firewall and caused it to be challenged. I&apos;m sure many of us have gone through the following thought process before:</p><p>What did I change?</p><p>Did I change <em>anything?</em></p><p>Did <em>they </em>change something?</p><p>Except &quot;they&quot; could have been either Cloudflare or Stripe; if it wasn&apos;t me (and I was fairly certain it wasn&apos;t), was it a Cloudflare change to the rules or a Stripe change to a webhook payload that was now triggering an existing rule? Time to dig deeper again so it&apos;s over to the Cloudflare dashboard and down into the WAF events for requests to the webhook callback path:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-28.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"879\" height=\"331\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-28.png 600w, https://www.troyhunt.com/content/images/2023/01/image-28.png 879w\"></figure><p>Yep, something proper broke! Let&apos;s drill deeper and look at recent events for that IP:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-16.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"895\" height=\"630\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-16.png 600w, https://www.troyhunt.com/content/images/2023/01/image-16.png 895w\"></figure><p>As you dig deeper through troubleshooting exercises like this, you gradually turn up more and more information that helps piece the entire puzzle together. In this case, it looks like the &quot;Inbound Anomaly Score Exceeded&quot; rule was being triggered. What&apos;s that? And why? Time to go down another rabbit hole.</p><h3 id=\"the-cloudflare-owasp-core-ruleset-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0\">The Cloudflare OWASP Core Ruleset &#x1F430; &#x1F430; &#x1F430;</h3><p>So, deeper and deeper down the rabbit holes we go, this time into the depths of the requests that triggered the managed rule:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-18.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"917\" height=\"1125\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-18.png 600w, https://www.troyhunt.com/content/images/2023/01/image-18.png 917w\"></figure><p>Well that&apos;s comprehensive &#x1F642;</p><p>There&apos;s a lot to unpack here so let&apos;s begin with the ruleset that the previously identified &quot;Inbound Anomaly Score Exceeded&quot; rule belongs to, <a href=\"https://developers.cloudflare.com/waf/managed-rules/reference/owasp-core-ruleset/?ref=troyhunt.com\">the Cloudflare OWASP Core Ruleset</a>:</p><blockquote>The Cloudflare OWASP Core Ruleset is Cloudflare&#x2019;s implementation of the OWASP ModSecurity Core Rule SetOpen external link (CRS). Cloudflare routinely monitors for updates from OWASP based on the latest version available from the official code repository.</blockquote><p>That link is yet another rabbit hole altogether so let me summarise succinctly here: Cloudflare uses OWASP&apos;s rules to identify anomalous traffic based on a customer-defined paranoia level (how strict you want to be) and then applies a score threshold (also customer-defined) at which an action will be taken, for example challenging the request. What I learned as this saga progressed is that the &quot;Inbound Anomoly Score Exceeded&quot; rule is actually a rollup of the rules beneath it. The OWASP score of &quot;26&quot; is the sum of the 6 rules listed beneath it and once it exceeds 25, the superset rule is triggered.</p><p>Further - and this is the really important bit - Cloudflare routinely updates the rules from OWASP which makes sense because these are ever-evolving in response to new threats. And when did they last upgrade the rules? It looks like <a href=\"https://developers.cloudflare.com/waf/change-log/scheduled-changes/?ref=troyhunt.com\">they announced it</a> right before I started having issues:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-19.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"861\" height=\"294\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-19.png 600w, https://www.troyhunt.com/content/images/2023/01/image-19.png 861w\"></figure><p>Whilst it&apos;s not entirely clear from above when this release was scheduled to occur, I did reach out to Cloudflare support and was advised it had already taken place:</p><blockquote>Please note that we did bump the OWASP version, which we are integrating with to 3.3.4 as noted on our scheduled changes.</blockquote><p>So maybe it&apos;s not Cloudflare&apos;s fault <em>or </em>Stripe&apos;s fault, but OWASP&apos;s fault? In fairness to all, I don&apos;t think it&apos;s anyone&apos;s fault per se and is instead just an unfortunate result of everyone doing their best to keep the bad guys out. Unless... it really is Stripe&apos;s fault because there&apos;s something in the request payload that was always fishy and is now being caught? But why for only some requests and not others? Next rabbit!</p><h3 id=\"cloudflare-payload-logging-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0\">Cloudflare Payload Logging &#x1F430; &#x1F430; &#x1F430; &#x1F430;</h3><p>Sometimes, people on the internet lose their minds a bit over things they really shouldn&apos;t. One of those things, in my experience, is Cloudflare&apos;s interception of traffic and it&apos;s something <a href=\"https://www.troyhunt.com/cloudflare-ssl-and-unhealthy-security-absolutism/\">I wrote about in detail nearly 7 years ago now in my piece on security absolutism</a>. Cloudflare plays an <em>enormously</em> valuable role in the internet&apos;s ecosystem and a substantial part of the value comes from being able to inspect, cache, optimise, and yes, even reject traffic. When you use Cloudflare to protect your website, they&apos;re applying rulesets like the aforementioned OWASP ones and in order to do that, <em>they must be able to inspect your traffic!</em> But they don&apos;t log it, not all of it, rather just &quot;metadata generated by our products&quot; as they refer to it on <a href=\"https://developers.cloudflare.com/logs/?ref=troyhunt.com\">their logs page</a>. We saw an example of that earlier on with Stripe&apos;s request from their IP showing it triggered a firewall rule, but what we didn&apos;t see is the <em>contents </em>of that POST request, the actual <em>payload </em>that triggered the rule. Let&apos;s go grab that.</p><p>Because the contents of a POST request can contain sensitive information, Cloudflare doesn&apos;t log it. Obviously they see it in transit (that&apos;s how OWASP&apos;s rules can be applied to it), but it&apos;s not stored anywhere and even if <em>you</em> want to capture it, they don&apos;t want to be able to see it. That&apos;s where <a href=\"https://developers.cloudflare.com/waf/managed-rules/payload-logging/configure/?ref=troyhunt.com\">payload logging</a> (another Enterprise plan feature) comes in and what&apos;s really neat about that is every payload must be encrypted with a public key retained by Cloudflare whilst only you retain the private key. The setup looks like this:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-21.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"517\" height=\"283\"></figure><p>Pretty self-explanatory and once done, right under where we previously saw the additional logs we now have the ability to decrypt the payload:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-25.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"738\" height=\"142\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-25.png 600w, https://www.troyhunt.com/content/images/2023/01/image-25.png 738w\" sizes=\"(min-width: 720px) 720px\"></figure><p>As promised, this requires the private key from earlier:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-24.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"618\" height=\"359\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-24.png 600w, https://www.troyhunt.com/content/images/2023/01/image-24.png 618w\"></figure><p>And now, finally, we have the actual payload that triggered the rule, seen here with my own test data:</p><!--kg-card-begin: html--><pre><code>[ &quot; },\\n \\&quot;billing_reason\\&quot;: \\&quot;subscription_update\\&quot;,\\n \\&quot;charge\\&quot;: null,\\n \\&quot;collection_method\\&quot;: \\&quot;charge_automatically\\&quot;,\\n \\&quot;created\\&quot;: 1674351619,\\n \\&quot;currency\\&quot;: \\&quot;usd\\&quot;,\\n \\&quot;custom_fields\\&quot;: null,\\n \\&quot;customer\\&quot;: \\&quot;cus_MkA71FpZ7XXRlt\\&quot;,\\n \\&quot;customer_address\\&quot;: &quot;, &quot; },\\n \\&quot;customer_email\\&quot;: \\&quot;troy-hunt+1@troyhunt.com\\&quot;,\\n \\&quot;customer_name\\&quot;: \\&quot;Troy Hunt 1\\&quot;,\\n \\&quot;customer_phone\\&quot;: null,\\n \\&quot;customer_shipping\\&quot;: null,\\n \\&quot;customer_tax_exempt\\&quot;: \\&quot;none\\&quot;,\\n \\&quot;customer_tax_ids\\&quot;: [\\n\\n ],\\n \\&quot;default_payment_method\\&quot;: null,\\n \\&quot;default_source\\&quot;: null,\\n \\&quot;default_tax_rates\\&quot;: [\\n\\n ],\\n \\&quot;description\\&quot;: \\&quot;You can manage your subscription (i.e. cancel it or regenerate the API key) at any time by verifying your email address here: https://haveibeenpwned.com/API/Key\\&quot;,\\n \\&quot;discount\\&quot;: null,\\n \\&quot;discounts\\&quot;: [\\n\\n ],\\n \\&quot;due_date\\&quot;: null,\\n \\&quot;ending_balance\\&quot;: -11804,\\n \\&quot;footer\\&quot;: null,\\n \\&quot;from_invoice\\&quot;: null,\\n \\&quot;hosted_invoice_url\\&quot;: \\&quot;https://invoice.stripe.com/i/acct_1EdQYpEF14jWlYDw/test_YWNjdF8xRWRRWXBFRjE0aldsWUR3LF9OREo5SlpqUFFvVnFtQnBVcE91YUFXemtkRHFpQWNWLDY0ODkyNDIw02004bEyljdC?s=ap\\&quot;,\\n \\&quot;invoice_pdf\\&quot;: \\&quot;https://pay.stripe.com/invoice/acct_1EdQYpEF14jWlYDw/test_YWNjdF8xRWRRWXBFRjE0aldsWUR3LF9OREo5SlpqUFFvVnFtQnBVcE91YUFXemtkRHFpQWNWLDY0ODkyNDIw02004bEyljdC/pdf?s=ap\\&quot;,\\n \\&quot;last_finalization_error\\&quot;: null,\\n \\&quot;latest_revision\\&quot;: null,\\n \\&quot;lines\\&quot;: &quot;, &quot; &quot;, &quot; ],\\n \\&quot;discountable\\&quot;: false,\\n \\&quot;discounts\\&quot;: [\\n\\n ],\\n \\&quot;invoice_item\\&quot;: \\&quot;ii_1MSsXfEF14jWlYDwB1nfZvFm\\&quot;,\\n \\&quot;livemode\\&quot;: false,\\n \\&quot;metadata\\&quot;: &quot;, &quot; },\\n \\&quot;period\\&quot;: &quot;, &quot; },\\n \\&quot;plan\\&quot;: &quot;, &quot; },\\n \\&quot;nickname\\&quot;: null,\\n \\&quot;product\\&quot;: \\&quot;prod_Mk4eLcJ7JYF02f\\&quot;,\\n \\&quot;tiers_mode\\&quot;: null,\\n \\&quot;transform_usage\\&quot;: null,\\n \\&quot;trial_period_days\\&quot;: null,\\n \\&quot;usage_type\\&quot;: \\&quot;licensed\\&quot;\\n },\\n \\&quot;price\\&quot;: &quot;, &quot; },\\n \\&quot;nickname\\&quot;: null,\\n \\&quot;product\\&quot;: \\&quot;prod_Mk4eLcJ7JYF02f\\&quot;,\\n \\&quot;recurring\\&quot;: &quot;, &quot; },\\n \\&quot;tax_behavior\\&quot;: \\&quot;unspecified\\&quot;,\\n \\&quot;tiers_mode\\&quot;: null,\\n \\&quot;transform_quantity\\&quot;: null,\\n \\&quot;type\\&quot;: \\&quot;recurring\\&quot;,\\n \\&quot;unit_amount\\&quot;: 15000,\\n \\&quot;unit_amount_decimal\\&quot;: \\&quot;15000\\&quot;\\n },\\n \\&quot;proration\\&quot;: true,\\n \\&quot;proration_details\\&quot;: &quot;, &quot; \\&quot;il_1MMjfcEF14jWlYDwoe7uhDPF\\&quot;\\n ]\\n }\\n },\\n \\&quot;quantity\\&quot;: 1,\\n \\&quot;subscription\\&quot;: \\&quot;sub_1MMjfcEF14jWlYDwi8JWFcxw\\&quot;,\\n \\&quot;subscription_item\\&quot;: \\&quot;si_N6xapJ8gSXdp7W\\&quot;,\\n \\&quot;tax_amounts\\&quot;: [\\n\\n ],\\n \\&quot;tax_rates\\&quot;: [\\n\\n ],\\n \\&quot;type\\&quot;: \\&quot;invoiceitem\\&quot;,\\n \\&quot;unit_amount_excluding_tax\\&quot;: \\&quot;-14304\\&quot;\\n },\\n &quot;, &quot; ],\\n \\&quot;discountable\\&quot;: true,\\n \\&quot;discounts\\&quot;: [\\n\\n ],\\n \\&quot;livemode\\&quot;: false,\\n \\&quot;metadata\\&quot;: &quot;, &quot; },\\n \\&quot;period\\&quot;: &quot;, &quot; },\\n \\&quot;plan\\&quot;: &quot;, &quot; },\\n \\&quot;nickname\\&quot;: null,\\n \\&quot;product\\&quot;: \\&quot;prod_Mk4lTSl4axd9mt\\&quot;,\\n \\&quot;tiers_mode\\&quot;: null,\\n \\&quot;transform_usage\\&quot;: null,\\n \\&quot;trial_period_days\\&quot;: null,\\n \\&quot;usage_type\\&quot;: \\&quot;licensed\\&quot;\\n },\\n \\&quot;price\\&quot;: &quot;, &quot; },\\n \\&quot;nickname\\&quot;: null,\\n \\&quot;product\\&quot;: \\&quot;prod_Mk4lTSl4axd9mt\\&quot;,\\n \\&quot;recurring\\&quot;: &quot;, &quot; },\\n \\&quot;tax_behavior\\&quot;: \\&quot;unspecified\\&quot;,\\n \\&quot;tiers_mode\\&quot;: null,\\n \\&quot;transform_quantity\\&quot;: null,\\n \\&quot;type\\&quot;: \\&quot;recurring\\&quot;,\\n \\&quot;unit_amount\\&quot;: 2500,\\n \\&quot;unit_amount_decimal\\&quot;: \\&quot;2500\\&quot;\\n },\\n \\&quot;proration\\&quot;: false,\\n \\&quot;proration_details\\&quot;: &quot;, &quot; },\\n \\&quot;quantity\\&quot;: 1,\\n \\&quot;subscription\\&quot;: \\&quot;sub_1MMjfcEF14jWlYDwi8JWFcxw\\&quot;,\\n \\&quot;subscription_item\\&quot;: \\&quot;si_NDJ98tQrCcviJf\\&quot;,\\n \\&quot;tax_amounts\\&quot;: [\\n\\n ],\\n \\&quot;tax_rates\\&quot;: [\\n\\n ],\\n \\&quot;type\\&quot;: \\&quot;subscription\\&quot;,\\n \\&quot;unit_amount_excluding_tax\\&quot;: \\&quot;2500\\&quot;\\n }\\n ],\\n \\&quot;has_more\\&quot;: false,\\n \\&quot;total_count\\&quot;: 2,\\n \\&quot;url\\&quot;: \\&quot;/v1/invoices/in_1MSsXfEF14jWlYDwxHKk4ASA/lines\\&quot;\\n },\\n \\&quot;livemode\\&quot;: false,\\n \\&quot;metadata\\&quot;: &quot;, &quot; },\\n \\&quot;next_payment_attempt\\&quot;: null,\\n \\&quot;number\\&quot;: \\&quot;04FC1917-0008\\&quot;,\\n \\&quot;on_behalf_of\\&quot;: null,\\n \\&quot;paid\\&quot;: true,\\n \\&quot;paid_out_of_band\\&quot;: false,\\n \\&quot;payment_intent\\&quot;: null,\\n \\&quot;payment_settings\\&quot;: &quot;, &quot; },\\n \\&quot;period_end\\&quot;: 1674351619,\\n \\&quot;period_start\\&quot;: 1674351619,\\n \\&quot;post_payment_credit_notes_amount\\&quot;: 0,\\n \\&quot;pre_payment_credit_notes_amount\\&quot;: 0,\\n \\&quot;quote\\&quot;: null,\\n \\&quot;receipt_number\\&quot;: null,\\n \\&quot;rendering_options\\&quot;: null,\\n \\&quot;starting_balance\\&quot;: 0,\\n \\&quot;statement_descriptor\\&quot;: null,\\n \\&quot;status\\&quot;: \\&quot;paid\\&quot;,\\n \\&quot;status_transitions\\&quot;: &quot;, &quot; },\\n \\&quot;subscription\\&quot;: \\&quot;sub_1MMjfcEF14jWlYDwi8JWFcxw\\&quot;,\\n \\&quot;subtotal\\&quot;: -11804,\\n \\&quot;subtotal_excluding_tax\\&quot;: -11804,\\n \\&quot;tax\\&quot;: null,\\n \\&quot;test_clock\\&quot;: null,\\n \\&quot;total\\&quot;: -11804,\\n \\&quot;total_discount_amounts\\&quot;: [\\n\\n ],\\n \\&quot;total_excluding_tax\\&quot;: -11804,\\n \\&quot;total_tax_amounts\\&quot;: [\\n\\n ],\\n \\&quot;transfer_data\\&quot;: null,\\n \\&quot;webhooks_delivered_at\\&quot;: 1674351619\\n }\\n },\\n \\&quot;livemode\\&quot;: false,\\n \\&quot;pending_webhooks\\&quot;: 1,\\n \\&quot;request\\&quot;: &quot;, &quot; },\\n \\&quot;type\\&quot;: \\&quot;invoice.paid\\&quot;\\n}&quot; ]</code></pre><!--kg-card-end: html--><p>But enough of what&apos;s <em>present</em> in the payload, it&apos;s what&apos;s <em>absent</em> that especially struck me. No obvious XSS patterns, nor SQL injection or any other suspicious looking strings. The request looked totally benign, so why did it trigger the rule?</p><p>I wanted to compare the payload of a blocked request with a similar request that wasn&apos;t blocked, but they&apos;re only logged at Cloudflare when they trigger a rule. No problem, it&apos;s easy to grab the full request from Stripe&apos;s webhook history so I found one that passed and one that failed and diff&apos;d them both:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/01/image-27.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"805\" height=\"820\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/01/image-27.png 600w, https://www.troyhunt.com/content/images/2023/01/image-27.png 805w\"></figure><p>This clearly isn&apos;t the full 200 lines, but it&apos;s a very similar story over the remainder of the files; tiny differences largely down to dates, IDs, and of course, the customers themselves. No suspicious patterns, no funky characters, nothing visibly abnormal. It&apos;s a bit pointless to even mention it because they&apos;re near identical, but the payload on the left is the one that passed the firewall whilst the payload on the right was blocked.</p><p>Next rabbit hole!</p><h3 id=\"cloudflares-internal-rules-engine-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0\">Cloudflare&apos;s Internal Rules Engine &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;</h3><p>Completely running out of ideas and options, focus moved to the folks inside Cloudflare who were already aware there was an issue:</p><!--kg-card-begin: html--><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">We are actively looking into this and will likely release an update to the Cloudflare OWASP ruleset soon</p>&#x2014; Michael Tremante (@MichaelTremante) <a href=\"https://twitter.com/MichaelTremante/status/1616413793709395971?ref_src=twsrc%5Etfw&amp;ref=troyhunt.com\">January 20, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><!--kg-card-end: html--><p>What followed was a period of back and forth initially with Cloudflare, then Stripe as well with everyone trying to nut out exactly where things were going wrong. Essentially, the process went like this:</p><p><em>Is Cloudflare inadvertently blocking the requests?</em></p><p><em>Is the OWASP ruleset raising false positives?</em></p><p><em>Is Stripe issuing requests that are deemed to be malicious?</em></p><p>And round and round we went. At one time, Cloudflare identified a change in the OWASP ruleset which appeared to have resulted in their implementation inadvertently triggering the WAF. They rolled it back and... the same thing happened. We deferred back to Stripe on the assumption that <em>something</em> must have changed on their end, but they couldn&apos;t identify any change that would have any sort of material impact. We were stumped, but we also had an easy fix just one last rabbit hole away...</p><h3 id=\"fine-tuning-the-cloudflare-waf-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0-%F0%9F%90%B0\">Fine Tuning the Cloudflare WAF &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;</h3><p>The joy of a managed firewall is that someone else takes all the rigmarole of looking after it away. I&apos;m going to talk more about that in the summary shortly but clearly, that also creates risk as you&apos;re delegating control of traffic flow to someone else. Fortunately, Cloudflare gives you a load of configurability with their managed rules which makes it easy to add custom exceptions:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/02/image.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"846\" height=\"277\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/02/image.png 600w, https://www.troyhunt.com/content/images/2023/02/image.png 846w\"></figure><p>This meant I could create a simple exception that was much more intelligent than the previous &quot;just let all outbound Stripe IPs in&quot; by filtering down to the <em>specific </em>path those webhooks were flowing in to:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/02/image-1.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"903\" height=\"926\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/02/image-1.png 600w, https://www.troyhunt.com/content/images/2023/02/image-1.png 903w\"></figure><p>And finally, because sequence matters, I dragged that rule right up to the top of the pile so it would cause matching inbound requests to skip all the other rules:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://www.troyhunt.com/content/images/2023/02/image-2.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"886\" height=\"335\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/02/image-2.png 600w, https://www.troyhunt.com/content/images/2023/02/image-2.png 886w\" sizes=\"(min-width: 720px) 720px\"></figure><p>And finally, there were no more rabbits &#x1F60A;</p><h3 id=\"lessons-learned\">Lessons Learned</h3><p>I know what you&apos;re thinking - &quot;what was the <em>actual</em> root cause?&quot; - and to be honest, I still don&apos;t know. I don&apos;t know if it was Cloudflare or OWASP or Stripe or if it even impacted other customers of these services and to be honest, yes, that&apos;s a little frustrating. But I learned a bunch of stuff and for that alone, this was a worthwhile exercise I took three big lessons away from:</p><p>Firstly, understanding the plumbing of how all these bits work together is super important. I was lucky this wasn&apos;t a time critical issue and I had the luxury of learning without being under duress; how rules, payload inspection and exception management all work together is really valuable stuff to understand. And just like that, as if to underscore my first point, I found this right before hitting the publish button on the blog post:</p><figure class=\"kg-card kg-image-card kg-width-full\"><img src=\"https://www.troyhunt.com/content/images/2023/02/image-3.png\" class=\"kg-image\" alt=\"Down the Cloudflare / Stripe / OWASP Rabbit Hole: A Tale of 6 Rabbits Deep &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430; &#x1F430;\" loading=\"lazy\" width=\"1375\" height=\"720\" srcset=\"https://www.troyhunt.com/content/images/size/w600/2023/02/image-3.png 600w, https://www.troyhunt.com/content/images/size/w1000/2023/02/image-3.png 1000w, https://www.troyhunt.com/content/images/2023/02/image-3.png 1375w\"></figure><p>I added a couple more OWASP rules to the exception in Cloudflare (things like a MySQL rule that was adding 5 points), and we were back in business.</p><p>Secondly, I look at the managed WAF Cloudflare provides <em>more </em>favourably than I did before simply because I have a better understanding of how comprehensive it is. I want to write code and run apps on the web, that&apos;s my focus, and I want someone else to provide that additional layer on top that continuously adapts to block new and emerging threats. I want to <em>understand</em> it (and I now do, at least certainly better than before), but I don&apos;t want managing it day in and day out to be my job.</p><p>And finally, IMHO, Stripe needs a better mechanism to report on webhook failures:</p><!--kg-card-begin: html--><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In live mode you are notified after 3 days of trying. You can also query the events (<a href=\"https://t.co/0mujOPssV0?ref=troyhunt.com\">https://t.co/0mujOPssV0</a>) to create a running list of statuses on web hooks that have been sent and alert on that via your own app.</p>&#x2014; Blake Krone (@blakekrone) <a href=\"https://twitter.com/blakekrone/status/1615903694159073282?ref_src=twsrc%5Etfw&amp;ref=troyhunt.com\">January 19, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><!--kg-card-end: html--><p>Waiting until stuff breaks really isn&apos;t ideal and whilst I&apos;m sure you could plug into the (very extensive) API ecosystem Stripe has, this feels like an easy feature for them to build in. So, Stripe friends, when you read this that&apos;s a big &quot;yes&quot; vote from me for some form of anomalous webhook response alerting.</p><p>This experience was equal parts frustration and fun and whilst the former is probably obvious, the latter is simply due to having an opportunity to learn something new that&apos;s a pretty important part of the service I run. May my frustrated fun story here make your life easier in the future if you face the same problems &#x1F60A;</p>"}},{"title":{"#cdata-section":"Weekly Update 335"},"description":{"#cdata-section":"<p>No cyber. It&apos;s literally a &quot;cyber-free&quot; week, as least far as the term relates to security things. Instead, I&apos;m unboxing an armful of Insta360 goodies and lamenting the state of IoT whilst putting even more IoT things into our massive garage renovation. I&apos;</p>"},"link":"https://www.troyhunt.com/weekly-update-335/","guid":{"@isPermaLink":"false","#text":"63eefc1688053f003d79b20f"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Fri, 17 Feb 2023 06:55:34 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/02/Splash-Template-2.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/02/Splash-Template-2.jpg\" alt=\"Weekly Update 335\"><p>No cyber. It&apos;s literally a &quot;cyber-free&quot; week, as least far as the term relates to security things. Instead, I&apos;m unboxing an armful of Insta360 goodies and lamenting the state of IoT whilst putting even more IoT things into our massive garage renovation. I&apos;m enjoying it though. Honestly. I think...</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 335\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;isi=691797987&amp;ius=googleplaymusic&amp;apn=com.google.android.music&amp;link=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 335\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 335\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 335\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/zjpwBcs_0Qs\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://twitter.com/troyhunt/status/1624138938012270592?ref=troyhunt.com\">The Ubiquiti AI Bullet camera with license plate recognition is... &#x1F632;</a> (as for criticism received for pointing a security camera into a public place, that&apos;s... &#x1F926;&#x200D;&#x2642;&#xFE0F;)</li><li><a href=\"https://twitter.com/troyhunt/status/1624231918995931138?ref=troyhunt.com\">Trying to find an IoT door lock that does everything is... &#x1F92C;</a> (unfortunately, the best one I can find doesn&apos;t actually exist yet)</li><li><a href=\"https://www.theverge.com/2023/1/5/23540309/aqara-ces-smart-home-matter-video-doorbell-sensor-lock-price?ref=troyhunt.com\">When it does launch, the Aqara U100 looks pretty sweet</a> (really liking the Apple Home Key integration in particular)</li><li><a href=\"https://twitter.com/troyhunt/status/1626138407952089089?ref=troyhunt.com\">The digitally rendered video for our upgraded garage is... &#x1F632;</a> (lots of detail needs to change, but you get the idea)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Device Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Weekly Update 334"},"description":{"#cdata-section":"<p>Did I <em>really</em> need to get a connected BBQ? No more than I needed to connect most of the other things in the house which is to say &quot;a bit useful but not entirely necessary&quot;. But it&apos;s a fascinating process when looked at through the lens</p>"},"link":"https://www.troyhunt.com/weekly-update-334/","guid":{"@isPermaLink":"false","#text":"63e71cca515949003dc7e8f0"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Sat, 11 Feb 2023 04:55:27 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/02/Splash-Template-1.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/02/Splash-Template-1.jpg\" alt=\"Weekly Update 334\"><p>Did I <em>really</em> need to get a connected BBQ? No more than I needed to connect most of the other things in the house which is to say &quot;a bit useful but not entirely necessary&quot;. But it&apos;s a fascinating process when looked at through the lens of how accessible the technology is to your average person given it&apos;s embedded in a consumer-orientated product. In short - it&apos;s painful - but listen to this week&apos;s update to hear precisely why. Plus, there&apos;s a heap of new data breach and some really, really good news about the NTLM hashes now being available in Pwned Passwords. Enjoy &#x1F60A;</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 334\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;isi=691797987&amp;ius=googleplaymusic&amp;apn=com.google.android.music&amp;link=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 334\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 334\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 334\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/daGIy_51Y-I\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://twitter.com/troyhunt/status/1620889158482030592?ref=troyhunt.com\">BBQ&apos;ing shouldn&apos;t be this hard</a> (not the cooking, I mean getting the damn thing connected to the network!)</li><li><a href=\"https://www.instantcheckmate.com/security-incident-alert/?ref=troyhunt.com\">Instant Checkmate was breached</a> (12M email addresses right there)</li><li><a href=\"https://www.truthfinder.com/security-incident-alert/?ref=troyhunt.com\">TruthFinder was also breached</a> (same parent company, another 8M addresses there)</li><li><a href=\"https://threatpost.com/hacked-data-limevpn-dark-web/167492/?ref=troyhunt.com\">The LimeVPN breach also went into HIBP</a> (you <em>really</em> want to be able to trust your VPN provider)</li><li><a href=\"https://twitter.com/haveibeenpwned/status/1623463122467184640?ref=troyhunt.com\">Weee was breached too</a> (another case where it was too hard to get in touch with them)</li><li><a href=\"https://www.troyhunt.com/pwned-passwords-adds-ntlm-support-to-the-firehose/\">Full parity for NTLM hashes in Pwned Passwords is now live!</a> (once again, bit shout out to Stef&#xE1;n J&#xF6;kull Sigur&#xF0;arson for his work on this)</li><li><a href=\"https://kolide.com/troyhunt?ref=troyhunt.com\" rel=\"noopener\">Sponsored by: Kolide ensures only secure devices can access your cloud apps. It&apos;s Device Trust tailor-made for Okta. Book a demo today.</a></li></ol>"}},{"title":{"#cdata-section":"Pwned Passwords Adds NTLM Support to the Firehose"},"description":{"#cdata-section":"<p>I think I&apos;ve pretty much captured it all in the title of this post but as of about a day ago, Pwned Passwords now has full parity between the SHA-1 hashes that have been there since day 1 and NTLM hashes. We always had both as a downloadable</p>"},"link":"https://www.troyhunt.com/pwned-passwords-adds-ntlm-support-to-the-firehose/","guid":{"@isPermaLink":"false","#text":"63e478ff1f73cc003de0c6da"},"category":[{"#cdata-section":"Have I Been Pwned"},{"#cdata-section":"Pwned Passwords"}],"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Thu, 09 Feb 2023 08:07:36 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/02/2023-02-09_17-33-03.png","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/02/2023-02-09_17-33-03.png\" alt=\"Pwned Passwords Adds NTLM Support to the Firehose\"><p>I think I&apos;ve pretty much captured it all in the title of this post but as of about a day ago, Pwned Passwords now has full parity between the SHA-1 hashes that have been there since day 1 and NTLM hashes. We always had both as a downloadable corpus but as of just over a year ago with <a href=\"https://www.troyhunt.com/open-source-pwned-passwords-with-fbi-feed-and-225m-new-nca-passwords-is-now-live/\">the introduction of the FBI data feed</a>, we stopped maintaining downloadable behemoths of data.</p><p>A little later, <a href=\"https://www.troyhunt.com/downloading-pwned-passwords-hashes-with-the-hibp-downloader/\">we added the downloader</a> to make it easy to pull down the latest and greatest complete data set directly from the same API that so many of you have integrated into your own apps. But because we only had an API for SHA-1 hashes, the downloader couldn&apos;t grab the NTLM versions and increasingly, we had 2 corpuses well out of parity.</p><p>I don&apos;t know exactly why, but just over the last few weeks we&apos;ve had a marked uptick in requests for an updated NTLM corpus. Obviously there&apos;s still a demand to run this against local Active Directory environments and clearly, the more up to date the hashes are the more effective they are at blocking the use of poor passwords.</p><p>So, <a href=\"https://www.troyhunt.com/expanding-the-have-i-been-pwned-volunteer-community/\">Chief Pwned Passwords Wrangler Stef&#xE1;n J&#xF6;kull Sigur&#xF0;arson</a> got to work and just went ahead and built it all for you. For free. In his spare time. As a community contribution. Seriously, have a look through <a href=\"https://github.com/HaveIBeenPwned?ref=troyhunt.com\">the public GitHub repos</a> and it&apos;s all his work ranging from the API to the Cloudflare Worker to the downloader so if you happen to come across him say, <a href=\"https://ndcoslo.com/speakers/stefn-jkull-sigurarson?ref=troyhunt.com\">at NDC Oslo in a few months&apos; time</a>, show your appreciation and buy the guy a beer &#x1F37A;</p><p>Lastly, every time I look at how much this tool is being used, I&apos;m a bit shocked at how big the numbers are getting:</p><!--kg-card-begin: html--><figure><img src=\"https://www.troyhunt.com/content/images/2023/02/2023-02-09_17-33-03.png\" alt=\"Pwned Passwords Adds NTLM Support to the Firehose\"></figure><!--kg-card-end: html--><p>That&apos;s well more than double the number of monthly requests from when <a href=\"https://www.troyhunt.com/open-source-pwned-passwords-with-fbi-feed-and-225m-new-nca-passwords-is-now-live/\">I wrote the blog post about the FBI and NCA only just over a year ago</a>, and I imagine that will only continue to increase, especially with today&apos;s announcement about NTLM hashes. Thank you to everyone that has taken this data and done great things with it, we&apos;re grateful that it&apos;s been put to good use and has undoubtedly helped an untold number of people to make better password choices &#x1F60A;</p>"}},{"title":{"#cdata-section":"Weekly Update 333"},"description":{"#cdata-section":"<p>Getting everything out nice and early today so we can get out there in hit the wake park in the balmy &quot;well over 30C&quot; weather (the radio is talking about &quot;severe heatwave weather&quot; as I write this). But hey, we&apos;re surrounded by water and</p>"},"link":"https://www.troyhunt.com/weekly-update-333/","guid":{"@isPermaLink":"false","#text":"63dc45dcc140ed003dfc6c9f"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Fri, 03 Feb 2023 00:03:29 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/02/Splash-Template.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/02/Splash-Template.jpg\" alt=\"Weekly Update 333\"><p>Getting everything out nice and early today so we can get out there in hit the wake park in the balmy &quot;well over 30C&quot; weather (the radio is talking about &quot;severe heatwave weather&quot; as I write this). But hey, we&apos;re surrounded by water and a beer delivery is due today so no crisis &#x1F60E; There&apos;s also a heap more data breach news and I&apos;ll be putting that connected BBQ to use for the first time today, stay tuned for epic pics on all of the above over the coming hours!</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 333\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;isi=691797987&amp;ius=googleplaymusic&amp;apn=com.google.android.music&amp;link=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 333\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 333\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 333\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/Zs9-91YJXhA\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://twitter.com/Munnday/status/1620647480978460672?ref=troyhunt.com\">HTTPS still doesn&apos;t equal trust, it never did, it never will and Aussie Broadband were way off the mark to imply otherwise</a> (they did later <a href=\"https://twitter.com/Aussie_BB/status/1620904025922355200?ref=troyhunt.com\">recant on that position</a>, but the messaging still isn&apos;t completely right)</li><li><a href=\"https://twitter.com/NeilFed/status/1620850679987441664?ref=troyhunt.com\">Namesco in the UK sent out messaging to customers which shows they have absolutely no idea about some of the most basic, fundamental tents of how SSL works</a> (hoping we get a follow-up on this, it&apos;s inexcusable in this day and age)</li><li><a href=\"https://www.bristolpost.co.uk/news/bristol-news/bristol-planet-ice-cyber-attack-8076491?ref=troyhunt.com\">Planet Ice in the UK was breached</a> (240k people with 82% of them already in HIBP)</li><li><a href=\"https://www.mapleridgenews.com/news/maple-ridge-pitt-meadows-school-district-suffers-massive-data-breach/?ref=troyhunt.com\">Pitt Meadows School District in British Columbia was breached</a> (only 0.1% of accounts were already in HIBP)</li><li><a href=\"https://twitter.com/EihlJerseyWatch/status/1620335278912307200?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1620335278912307200%7Ctwgr%5E6de82c57634b7b334fd77fc2b8f2ba4b752f9d7c%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.troyhunt.com%2Fp%2F24613518-7cf0-45e7-9cb5-4f355b838eb3%2F&amp;ref=troyhunt.com\">I&apos;m getting seriously sick of the lack of proper disclosure from many organisations</a> (it really isn&apos;t this hard - it <em>shouldn&apos;t</em> be this hard)</li><li><a href=\"https://twitter.com/troyhunt/status/1620889158482030592?ref=troyhunt.com\">I bought a connected BBQ!</a> (stay tuned for deliciousness &#x1F924;)</li><li><a href=\"https://www.crowdsec.net/?mtm_campaign=Troy-Hunt-Jan23&amp;ref=troyhunt.com\" rel=\"noopener\">Sponsored by: CrowdSec - Gain crowd-sourced protection against malicious IPs and benefit from the most accurate CTI in the world. Get started for free.</a></li></ol>"}},{"title":{"#cdata-section":"Weekly Update 332"},"description":{"#cdata-section":"<p>Breaches all over the place today! Well, this past week, and there&apos;s some debate as to whether one of them is a breach, a scrape or if the term just doesn&apos;t matter anyway. Plus, we&apos;ve been kitchen shopping, I&apos;m helping friends out</p>"},"link":"https://www.troyhunt.com/weekly-update-332/","guid":{"@isPermaLink":"false","#text":"63d4be29c140ed003dfc6c16"},"category":{"#cdata-section":"Weekly update"},"dc:creator":{"#cdata-section":"Troy Hunt"},"pubDate":"Sat, 28 Jan 2023 06:38:32 GMT","media:content":{"@url":"https://www.troyhunt.com/content/images/2023/01/Splash-Template-3.jpg","@medium":"image"},"content:encoded":{"#cdata-section":"<img src=\"https://www.troyhunt.com/content/images/2023/01/Splash-Template-3.jpg\" alt=\"Weekly Update 332\"><p>Breaches all over the place today! Well, this past week, and there&apos;s some debate as to whether one of them is a breach, a scrape or if the term just doesn&apos;t matter anyway. Plus, we&apos;ve been kitchen shopping, I&apos;m helping friends out with connected doorbells and other random but somehow related things this week. Enjoy &#x1F60A;</p><!--kg-card-begin: html--><div><div style=\"width: 170px; display: inline-block; margin-right: 3px;\"><a href=\"https://itunes.apple.com/au/podcast/troy-hunts-weekly-update-podcast/id1176454699?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Listen-on-Apple-Podcasts.svg\" alt=\"Weekly Update 332\"></a></div><div style=\"width: 146px; display: inline-block; margin-right: 3px;\"><a href=\"https://playmusic.app.goo.gl/?ibi=com.google.PlayMusic&amp;isi=691797987&amp;ius=googleplaymusic&amp;apn=com.google.android.music&amp;link=https%3A%2F%2Fplay.google.com%2Fmusic%2Fm%2FIf3tw7npymckucxq4q76762ncny%3Ft%3DTroy_Hunt%27s_Weekly_Update_Podcast%26pcampaignid%3DMKT-na-all-co-pr-mu-pod-16&amp;ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/05/Get-it-on-Google-Play.svg\" alt=\"Weekly Update 332\"></a></div><div style=\"width: 118px; display: inline-block; margin-right: 3px;\"><a href=\"https://open.spotify.com/show/7jMtKFohdrw6qmz8AkLqit?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2019/10/spotify.svg\" class=\"kg-image\" alt=\"Weekly Update 332\"></a></div><div style=\"width: 120px; display: inline-block;\"><a href=\"https://omny.fm/shows/troy-hunt-weekly-update/playlists/podcast.rss?ref=troyhunt.com\"><img src=\"https://www.troyhunt.com/content/images/2018/07/Download-via-RSS.svg\" alt=\"Weekly Update 332\"></a></div><iframe width=\"100%\" height=\"480\" src=\"https://www.youtube.com/embed/TfP_bz-xaE4\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></div><!--kg-card-end: html--><h3 id=\"references\">References</h3><ol><li><a href=\"https://gotoaarhus.com/2023?ref=troyhunt.com\">I&apos;ll be &quot;at&quot; GOTO Aarhus in May</a> (there online, but definitely speaking at the show)</li><li><a href=\"https://twitter.com/troyhunt/status/1619219987545329667?ref=troyhunt.com\">Following all the awesome input, we decided to forego the teppanyaki plate on the Bora Professional 3.0</a> (there&apos;s a surprising amount of good culinary advice from my audience!)</li><li><a href=\"https://therecord.media/millions-of-aflac-zurich-insurance-customers-in-japan-have-data-leaked-after-breach/?ref=troyhunt.com\">Zurich Japan was breached</a> (big name, but small portion of people already in HIBP)</li><li><a href=\"https://thecyberexpress.com/data1-4-million-autotrader-user-exposed/?ref=troyhunt.com\">Autotrader had a heap of data breacraped</a> (breached? scraped? does it matter?)</li><li><a href=\"https://www.troyhunt.com/when-is-a-scrape-a-breach/\">Speaking of which, when actually is a scrape a breach?</a> (my more concerted thoughts on the matter all in one place)</li><li><a href=\"https://www.digi.no/artikler/selger-datalekkasje-med-140-000-berorte-kunder-fra-lars-monsens-nettbutikk/525070?ref=troyhunt.com\">Norwegian adventure store KomplettFritid was also breached</a> (apparently, they decided to not tell their customers)</li><li><a href=\"https://www.theverge.com/2023/1/24/23569109/goto-hack-lastpass-breach-encrypted-backups-key?ref=troyhunt.com\">GoTo, the owner of LastPass, &quot;shared more bad news&quot;</a> (I do have some historical views on this organisation...)</li><li><a href=\"https://www.troyhunt.com/how-logmein-is-enabling-scammers-to/\">Hey, it&apos;s my views on GoTo!</a> (nearly 13 years old now, but this remains poor behaviour IMHO)</li><li><a href=\"https://www.crowdsec.net/?mtm_campaign=Troy-Hunt-Jan23&amp;ref=troyhunt.com\" rel=\"noopener\">Sponsored by: CrowdSec - Gain crowd-sourced protection against malicious IPs and benefit from the most accurate CTI in the world. Get started for free.</a></li></ol>"}}]}}}