{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Blogs Archive - Zimperium","atom:link":{"@href":"https://www.zimperium.com/blog/feed/","@rel":"self","@type":"application/rss+xml"},"link":"https://www.zimperium.com/blog/","description":"","lastBuildDate":"Wed, 05 Apr 2023 02:46:50 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","image":{"url":"https://www.zimperium.com/wp-content/uploads/2019/03/cropped-fav-1-32x32.jpg","title":"Blogs Archive - Zimperium","link":"https://www.zimperium.com/blog/","width":"32","height":"32"},"item":[{"title":"Securing Medical Devices: The Critical Role of Mobile Apps in Ensuring Cybersecurity","link":"https://www.zimperium.com/blog/the-critical-role-of-mobile-apps-in-ensuring-medical-device-cybersecurity/","dc:creator":{"#cdata-section":"Krishna Vishnubhotla"},"pubDate":"Wed, 05 Apr 2023 01:15:43 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=12081"},"description":{"#cdata-section":"<p>Connected medical devices are in high demand, and their usage continues to grow. While these provide tremendous value, they also create a new attack surface that is susceptible to vulnerabilities and exploits. Find out how Zimperium's Mobile Application Security Suite (MAPS) helps medical device companies build secure, FDA-compliant mobile applications.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/the-critical-role-of-mobile-apps-in-ensuring-medical-device-cybersecurity/\">Securing Medical Devices: The Critical Role of Mobile Apps in Ensuring Cybersecurity</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>Connected medical devices are in high demand, and their usage continues to grow. This growth has been fueled by increased adoption of compatible devices, expanded internet access, and the substantial growth in IoT technology across medical applications. The demand for real-time remote health monitoring via connected IoT devices is also fueling growth. By 2028, the connected medical device market is projected to reach USD 136.76 billion, growing at an annual rate of around 22%. [<a href=\"https://www.marketwatch.com/press-release/connected-medical-devices-market-size-is-anticipated-to-grow-and-reach-million-during-the-period-of-2023--2028-2023-03-20\">Source</a>]</p>\n<p>Connected medical devices have emerged as life-changing products in such areas as diabetes, neuroscience, and cardiovascular health. These products have a  direct connection to patient health. Consequently, the FDA regulates pre-market submissions related to these devices’ marketing and manufacturing via the 510(k) process.</p>\n<p>Over the last few years, several hacks and security incidents impacted the larger healthcare ecosystem. In response, the FDA has reclassified these devices as <strong>“</strong>cyber devices.” The FDA recognizes that internet connectivity and sophisticated technological features make these medical devices more vulnerable than ever before. Once these products are released to the market, they can be accessed by malicious actors and exposed to a variety of threats. A new round of guidance was issued by the FDA in December 2022 as part of the Omnibus Appropriations Act <a href=\"https://www.fda.gov/media/166614/download\">Section 524B</a>, which went into effect on March 29, 2023, and was explicitly added to ensure post-market cybersecurity of medical devices.</p>\n<p>The new guidance requires that medical device companies have a plan for monitoring, identifying, and addressing postmarket cybersecurity vulnerabilities and exploits and for doing so in a reasonable timeframe. These companies must ensure their devices and related systems are secure and provide any required postmarket updates and patches. A software bill of materials must also be submitted, including for any commercial, open-source, and off-the-shelf software components used.</p>\n<p>The new FDA guidance is a step in the right direction. Medical device companies are highly skilled in building specialized hardware, but they are not security experts. But the cybersecurity concern is not limited to just the software on the actual device. Today’s connected medical device products are no longer just restricted to specialized hardware running proprietary software. Devices now send data to and are controlled by sophisticated mobile applications. Malicious actors looking to compromise the device and health information may find this to be a low-hanging fruit.</p>\n<p>Today, these <a href=\"https://www.zimperium.com/blog/how-to-address-the-mobile-security-implications-posed-by-the-new-mhealth-era/\">mobile health</a> apps, also referred to as digital health apps, are more than just diagnostic monitors; they transmit info to providers and are increasingly controlling the medical devices that administer treatments. While these apps provide tremendous value, they also create a new attack surface that is susceptible to vulnerabilities and exploits. This is compounded by the fact that most mobile applications in public app stores have security gaps, which leave them exposed to emerging security threats.</p>\n<p>Last year, we conducted research into more than a million public applications. This research shows that the security within these apps was lacking in several critical areas.</p>\n<h3><strong>Android Applications</strong></h3>\n<picture><source srcset=\"https://zimpstage.wpengine.com/wp-content/uploads/2023/04/Android-Applications-.png.webp 582w, https://zimpstage.wpengine.com/wp-content/uploads/2023/04/Android-Applications--300x111.png.webp 300w\" type=\"image/webp\" sizes=\"(max-width: 582px) 100vw, 582px\" data-srcset=\"https://zimpstage.wpengine.com/wp-content/uploads/2023/04/Android-Applications-.png.webp 582w, https://zimpstage.wpengine.com/wp-content/uploads/2023/04/Android-Applications--300x111.png.webp 300w\" data-sizes=\"(max-width: 582px) 100vw, 582px\" /><img decoding=\"async\" class=\"alignnone wp-image-12086 size-full\" src=\"https://www.zimperium.com/wp-content/uploads/2023/04/blog-mhealth-04.04.2-Android.png\" alt=\"\" width=\"582\" height=\"215\" srcset=\"https://www.zimperium.com/wp-content/uploads/2023/04/blog-mhealth-04.04.2-Android.png 582w, https://www.zimperium.com/wp-content/uploads/2023/04/blog-mhealth-04.04.2-Android-300x111.png 300w\" sizes=\"(max-width: 582px) 100vw, 582px\" /></picture>\n<h3></h3>\n<h3><strong>iOS Applications</strong></h3>\n<p><img decoding=\"async\" class=\"alignnone wp-image-12084 size-full\" src=\"https://www.zimperium.com/wp-content/uploads/2023/04/blog-mhealth-04.04.2.png\" alt=\"\" width=\"581\" height=\"215\" srcset=\"https://www.zimperium.com/wp-content/uploads/2023/04/blog-mhealth-04.04.2.png 581w, https://www.zimperium.com/wp-content/uploads/2023/04/blog-mhealth-04.04.2-300x111.png 300w\" sizes=\"(max-width: 581px) 100vw, 581px\" /></p>\n<picture><source srcset=\"https://zimpstage.wpengine.com/wp-content/uploads/2023/04/image1.png.webp 581w, https://zimpstage.wpengine.com/wp-content/uploads/2023/04/image1-300x111.png.webp 300w\" type=\"image/webp\" sizes=\"(max-width: 581px) 100vw, 581px\" data-srcset=\"https://zimpstage.wpengine.com/wp-content/uploads/2023/04/image1.png.webp 581w, https://zimpstage.wpengine.com/wp-content/uploads/2023/04/image1-300x111.png.webp 300w\" data-sizes=\"(max-width: 581px) 100vw, 581px\" /></picture>\n<p>In order to ensure that their devices are secure, medical device manufacturers need to secure the digital health apps associated with their products.</p>\n<h2><strong>How Zimperium Helps You Build Secure Digital Health Apps</strong></h2>\n<p>Today, Zimperium secures more than ten mobile apps that the FDA has cleared to connect to medical devices.</p>\n<p>Zimperium’s <a href=\"https://www.zimperium.com/mobile-app-protection/\">Mobile Application Security Suite (MAPS)</a> helps medical device companies build secure, FDA-compliant mobile applications. MAPS is the only unified solution that combines comprehensive in-app protection with centralized threat visibility. The solution offers these advantages:</p>\n<ul>\n<li><strong>Pre-Market Compliance</strong>\n<ul>\n<li>During development and pre-release testing, continuous Mobile Application Security Testing (MAST) enables pre-release visibility into mobile applications.</li>\n</ul>\n</li>\n<li><strong>Post-Market Compliance</strong>\n<ul>\n<li>Our in-app protection includes application shielding, runtime application self-protection (<a href=\"https://www.zimperium.com/runtime-app-self-protection/\">RASP</a>), and anti-malware.</li>\n<li>The solution features RASP capabilities that provide post-release visibility into threats and attacks occurring on the end user’s device.</li>\n</ul>\n</li>\n</ul>\n<p>To learn more about Zimperium MAPS, <a href=\"https://www.zimperium.com/contact-us/?utm_term=securing-medical-devices-the-critical-role-of-mobile-apps-in-ensuring-cybersecurity\">contact us today</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/the-critical-role-of-mobile-apps-in-ensuring-medical-device-cybersecurity/\">Securing Medical Devices: The Critical Role of Mobile Apps in Ensuring Cybersecurity</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"The Persistent Threat Posed by Mobile Spyware: How All Businesses and Government Agencies Continue to Be Exposed","link":"https://www.zimperium.com/blog/the-persistent-threat-posed-by-mobile-spyware-to-government-agencies-and-enterprises/","dc:creator":{"#cdata-section":"Shridhar Mittal"},"pubDate":"Wed, 29 Mar 2023 20:52:15 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=12057"},"description":{"#cdata-section":"<p>The Biden Administration recently issued an Executive Order prohibiting government agencies from using and acquiring hacking tools, such as commercial spyware. Read our blog highlighting the increasing mobile threats caused by spyware and how, with a mobile threat defense solution, you can ensure your employees and enterprise are protected.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/the-persistent-threat-posed-by-mobile-spyware-to-government-agencies-and-enterprises/\">The Persistent Threat Posed by Mobile Spyware: How All Businesses and Government Agencies Continue to Be Exposed</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>On March 27, 2023, the Biden Administration issued an <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2023/03/27/executive-order-on-prohibition-on-use-by-the-united-states-government-of-commercial-spyware-that-poses-risks-to-national-security/\">Executive Order</a> (EO) prohibiting government agencies from using and acquiring hacking tools, such as commercial spyware. According to senior administration officials, the order <i>“is in­tended to grap­ple with the rapidly grow­ing and lu­cra­tive in­ternational mar­ket­place of cy­ber-in­tru­sion tools that can break into some­one’s phone—of­ten with mal­ware that doesn’t re­quire the vic­tim to click on a ma­li­cious link or at­tach­ment—and spy on them un­de­tected for months or years</i>.” (source: <a href=\"https://www.wsj.com/articles/biden-restricts-use-of-commercial-hacking-tools-by-u-s-agencies-f0a4afda\">Wall Street Journal</a>).</p>\n<p>Yesterday, mobile spyware was the subject of two articles in the Wall Street Journal. In one of these articles, it was discussed how Russia supplies Iran with advanced cyber surveillance software, including mobile spyware. The <a href=\"https://www.wsj.com/articles/russia-supplies-iran-with-cyber-weapons-as-military-cooperation-grows-b14b94cd\">Wall Street Journal</a> stated, “<i>Rus­sia’s PRO­TEI Ltd has be­gun pro­vid­ing in­ter­net-cen­sor­ship soft­ware to Iran­ian mo­bile-ser­vices provider Ari­antel, ac­cord­ing to doc­u­ments pub­lished by the Cit­i­zen Lab, a Uni­ver­sity of Toronto-based re­search cen­ter. Cit­i­zen Lab said there is ev­i­dence that the PRO­TEI tools are part of a de­vel­op­ing mo­bile-phone sys­tem that would “en­able state au­thor­i­ties to di­rectly mon­i­tor, in­ter­cept, re­direct, de­grade or deny all Ira­ni­ans’ mo­bile com­mu­ni­ca­tions, in­clud­ing those who are pres­ently chal­leng­ing the regime</i>.”</p>\n<p>This blog is not meant to convey any political messages, but I want to highlight the increasing threats facing government entities and corporations worldwide. It&#8217;s no coincidence that these two articles about mobile spyware appeared on the same day in one of the most trusted media outlets. This should be a wake-up call for all CEOs and CISOs. There is no denying that these threats are real and continue to be a growing problem, which isn’t just impacting government entities and high-profile targets like journalists and activists, but is a threat to all corporate employees. Mobile spyware is here to stay and continues to become more harmful.</p>\n<h2>Have You Checked Your Device for Spyware?</h2>\n<p>Let&#8217;s explore what spyware can do once it&#8217;s on your device. Mobile spyware can track a user&#8217;s location, access their contacts, read SMS and other messaging application messages, record sounds and videos, log keystrokes, and record live video and voice conversations, among other things. There are hardly any differences in the capabilities of state-sponsored spyware versus others that come with applications that are sideloaded or from third-party app stores.</p>\n<p>The installation methodology is the real difference in sophistication. Highly sophisticated spyware like <a href=\"https://www.zimperium.com/blog/pegasus-spyware-found-on-u-s-state-department-iphones/\">Pegasus</a> and Predator can be installed without user interaction. For instance, <a href=\"https://techcrunch.com/2021/12/16/cytrox-predator-phone-hacking-meta/\">the Predator “spyware-for-hire” surveillance software</a> uses a malicious link as the initial vector to drop a payload in the device, which is used to install the spyware. However, spyware can be installed through other mechanisms, such as social engineering and phishing tactics, rogue Wi-Fi networks, and malicious apps. Regardless of how it&#8217;s installed, spyware is dangerous for every corporation.</p>\n<p>Several government agencies and commercial organizations are seeking ways to protect against spyware by banning specific applications on their mobile devices. Although it&#8217;s a step in the right direction, it&#8217;s not scalable. Security teams have very limited visibility into which devices have these rogue or “banned” applications installed. Additionally, many instances of spyware come in the form of an SDK, which can be installed in hundreds of applications. Lastly, new spyware is being released every day, making it nearly impossible to keep track of. In 2022 alone, Zimperium zLabs discovered over 3,000 new samples of spyware.</p>\n<h2>How Zimperium Mobile Threat Defense (MTD) Can Help</h2>\n<p>To understand your risk posture and defend against mobile spyware, corporations need a solution that can proactively protect against the initial attack vectors, such as rogue Wi-Fi networks, phishing, and malicious or sideloaded apps. The solution must be able to identify and block traffic to these malicious backends, even if the spyware is in the form of an SDK inside another approved application.</p>\n<p>Government entities and corporations using the <a href=\"https://www.zimperium.com/mtd/\">Zimperium Mobile Threat Defense (MTD)</a> solution are protected from spyware and associated installation mechanisms. Zimperium’s unique phishing protection is a crucial security feature to prevent users from clicking malicious links via our on-device threat detection engine, delivering privacy focussed on device zero-day detection.</p>\n<p>To ensure your employees and enterprise are protected from spyware and other pervasive mobile threats, <a href=\"https://www.zimperium.com/contact-us/\">contact us today.</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/the-persistent-threat-posed-by-mobile-spyware-to-government-agencies-and-enterprises/\">The Persistent Threat Posed by Mobile Spyware: How All Businesses and Government Agencies Continue to Be Exposed</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"From Development to Deployment: A Comprehensive Guide to Mobile App Security","link":"https://www.zimperium.com/blog/from-development-to-deployment-a-comprehensive-guide-to-mobile-app-security/","dc:creator":{"#cdata-section":"Lisa Bergamo"},"pubDate":"Fri, 24 Mar 2023 22:32:50 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=12051"},"description":{"#cdata-section":"<p>Mobile application security is more crucial than ever, affecting both developers and users alike. Read on to hear the key takeaways from our most recent webinar in conjunction with Riscure and learn the most common mobile app attack vectors and attacker capabilities, how to prioritize and approach mobile application security objectives, and overall best practices for securing the entire mobile application development lifecycle. Learn more. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/from-development-to-deployment-a-comprehensive-guide-to-mobile-app-security/\">From Development to Deployment: A Comprehensive Guide to Mobile App Security</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>As today’s reliance on mobile devices for sensitive activities such as <a href=\"https://get.zimperium.com/mobile-banking-heists/\">banking</a> and communication increases, the risks associated with mobile app attacks continue to skyrocket. As a result, mobile application security is more crucial than ever, affecting both developers and users alike.</p>\n<p>In conjunction with Riscure, Zimperium recently hosted an informative webinar titled, &#8220;<a href=\"https://www.brighttalk.com/webcast/19320/573368\">Top Risks to Address in your Mobile Application Security Journey,</a>&#8221; featuring industry experts Anis Hamdi from Riscure and Tim Hartog and Andrew Snyder from Zimperium.</p>\n<p>The session discussed the most common mobile app attack vectors and attacker capabilities, how to prioritize and approach mobile application security objectives, and overall best practices for securing the entire mobile application development lifecycle.</p>\n<p>Here are some key takeaways from the webinar.</p>\n<h2>The Top Mobile App Attack Vectors and Attacker Capabilities</h2>\n<p>If you are worried about the security of your mobile apps, you’re not alone. The first part of the webinar focused on the top mobile app attack vectors and attacker capabilities. The most common mobile app attack vectors include:</p>\n<ul>\n<li>Rooted or jailbroken devices</li>\n<li>Network attacks</li>\n<li>Malicious apps</li>\n</ul>\n<p>But what do these terms mean, and why are they such a threat?</p>\n<p>Rooted or jailbroken devices are a major security risk for mobile app users because they allow attackers to bypass security measures installed by the device manufacturer, meaning that attackers can access sensitive data or manipulate these types of devices without being detected.</p>\n<p>Network attacks, such as man-in-the-middle attacks, are another common attack vector that allows attackers to intercept and manipulate data transmitted between the mobile application and the server. The results are often stolen data, <a href=\"https://www.zimperium.com/blog/schoolyard-bully-trojan-facebook-credential-stealer/\">unauthorized access</a>, or other nefarious activities.</p>\n<p>Malicious apps are also a significant threat. Attackers can use malicious apps to steal sensitive data, track user activity, or take control of the device.</p>\n<p>Anis Hamdi from Riscure noted, “It is easy for attackers to embed malware into mobile apps, which can be used to steal sensitive data, including <a href=\"https://www.zimperium.com/blog/tale-of-two-phishes-lessons-from-the-twilio-and-cloudflare-sms-spear-phishing-attacks/\">login credentials</a>, banking information, and personal information.”</p>\n<p>Tim Hartog from Zimperium explained that “A<i>ttackers can create fake apps that look legitimate and trick users into downloading them. These apps can contain malicious code that enables attackers to gain control of the device, steal data, or track user activity.</i>”</p>\n<p>Attackers use code injection to modify the behavior of legitimate apps and turn them into malicious ones, enabling attackers to steal sensitive data, track user activity, or even take control of the device.</p>\n<p>Anis Hamdi emphasized, “C<i>ode injection is a significant threat because it allows attackers to modify the code of legitimate apps without raising suspicion.</i>”</p>\n<p>All of these risks make it crucial to prioritize mobile application security objectives and implement best practices to secure the entire mobile application throughout the development lifecycle.</p>\n<h2>How to Prioritize and Approach Your Mobile Application Security Objectives</h2>\n<p>To prioritize your approach to mobile application security objectives, it&#8217;s essential to first understand the potential threats and risks that may impact the application. This requires conducting a thorough risk assessment, identifying and prioritizing assets and threats, and implementing security measures accordingly. As Anis Hamdi from Riscure noted, “<i>It’s really important to have a clear understanding of the assets you are trying to protect and the potential threats that may impact those assets.</i>”</p>\n<h3>Assess &amp; Prioritize</h3>\n<p>Conducting a comprehensive risk assessment involves identifying potential risks and vulnerabilities in the mobile application and determining each risk’s likelihood and potential impact. As Tim Hartog from Zimperium pointed out, &#8220;<i>It&#8217;s important to prioritize your mobile application security objectives based on your organization&#8217;s risk appetite and the potential impact of a security breach.</i>&#8221; This allows developers and security professionals to prioritize their efforts and allocate resources to the most critical threats.</p>\n<h3>Implement Targeted Controls</h3>\n<p>Once you’ve conducted a risk assessment and prioritized threats, controls can be implemented that specifically target higher-risk areas. Rather than creating controls to address every possible avenue of attack, using targeted controls makes more efficient and effective use of resources, allowing your organization to get the most out of its budget.</p>\n<h3>Integrate Security Throughout the Lifecycle</h3>\n<p>Another critical aspect of prioritizing and approaching mobile application security objectives is having a comprehensive understanding of the mobile application development lifecycle. This includes ensuring that security measures are integrated throughout the entire process, from design and development to testing and deployment. As Tim Hartog from Zimperium noted, &#8220;<i>It&#8217;s important to have a good balance between functionality and security, and this can only be achieved by having security integrated throughout the entire development process.</i>&#8221;</p>\n<h2>Best Practices for Securing the Entire Mobile Application Development Lifecycle</h2>\n<p>The webinar discussion included overall best practices for securing the entire mobile application development lifecycle. According to the experts, the best approach is to adopt a proactive security mindset rather than a reactive one. This means incorporating security into every aspect of the development process, from development to deployment and beyond. The experts recommended using secure coding practices, conducting regular security testing, and implementing measures such as encryption and authentication throughout the development lifecycle.</p>\n<p>In addition to incorporating security into the development process, the experts emphasized the importance of ongoing monitoring and management of mobile applications. This means regularly updating and patching mobile applications, monitoring for security threats and vulnerabilities, and implementing measures such as app shielding and device attestation to detect and prevent attacks.</p>\n<h3>1. Start with Security in Mind from the Beginning</h3>\n<p>One of the most important things you can do to ensure the security of your mobile application is to prioritize security from the very beginning of the development process. This means building security requirements into the initial code, conducting security assessments at every stage of development, and integrating security into the testing and deployment phases.</p>\n<h3>2. Use Layered Security</h3>\n<p>Implementing a layered approach to mobile application security is a critical step. Implementing multiple layers of security controls will protect against different types of threats. For example, encryption protects data in transit and at rest. Implementing access controls, restricting access to sensitive information, and using runtime application self-protection (RASP) solutions are all key to detecting and responding to attacks.</p>\n<h3>3. Use a Comprehensive Security Framework</h3>\n<p>A comprehensive security framework can help ensure that your mobile application is secure from end to end. This includes both in-app security features and backend security measures, such as secure APIs and data encryption.</p>\n<h3>4. Implement Strong Authentication and Authorization Controls</h3>\n<p>Authentication and authorization controls are essential for protecting user data and preventing unauthorized access. Best practices include implementing strong password requirements, two-factor authentication, and role-based access controls.</p>\n<h3>5. Regularly Update and Patch Your Application</h3>\n<p>Regular updates and patches are critical for ensuring that your mobile application remains secure over time. This includes addressing known vulnerabilities, implementing new security features, and keeping up with emerging threats.</p>\n<h3>6. Perform Regular Security Assessments</h3>\n<p>Regular security assessments can help identify vulnerabilities and address them before they are exploited by attackers. This includes both manual and automated testing, as well as third-party security assessments from reputable providers.</p>\n<p>Mobile application security is a critical concern for both developers and users. As mobile devices continue to become more prevalent, the risks associated with mobile app attacks continue to increase. To mitigate these risks, it is essential to adopt a risk-based approach to mobile app security, prioritize security measures based on the potential impact of a security breach, and incorporate security into every aspect of the development lifecycle.</p>\n<h2>Mobile App Risks: Addressing Security Throughout the Lifecycle</h2>\n<p>The risks associated with mobile applications begin during development and continue throughout the app’s lifecycle, even when the app is in use on an end user’s device. Zimperium offers a <a href=\"https://www.zimperium.com/mobile-app-protection/\">Mobile Application Protection Suite</a> comprised of four products, which can be accessed through a centralized dashboard. This unique platform provides a holistic approach to mobile app security by integrating inside-out and outside-in security methods. It allows enterprises to view threats and develop response policies while offering comprehensive in-app protection, making it the only solution to provide centralized visibility and security for mobile apps.</p>\n<p>To hear more of the discussion, and learn more about meeting the security challenges of mobile application security, watch the replay of our webcast, &#8220;<a href=\"https://www.brighttalk.com/webcast/19320/573368\">Top Risks to Address in your Mobile Application Security Journey.</a>&#8220;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/from-development-to-deployment-a-comprehensive-guide-to-mobile-app-security/\">From Development to Deployment: A Comprehensive Guide to Mobile App Security</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"Taxed Not Hacked: Preparing for the Risks this Tax Season","link":"https://www.zimperium.com/blog/taxed-not-hacked-preparing-for-the-risks-this-tax-season/","dc:creator":{"#cdata-section":"Monique Becenti"},"pubDate":"Thu, 23 Mar 2023 12:00:00 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=12021"},"description":{"#cdata-section":"<p>A large amount of sensitive data is shared online during tax season, making it extremely vulnerable to exploitation by malicious actors. Additionally, the growing popularity of tax filing via mobile applications has created many new vulnerabilities. Find out how Zimperium can help protect your mobile tax application, employees, and residents filing their taxes from cybercrime during this tax season. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/taxed-not-hacked-preparing-for-the-risks-this-tax-season/\">Taxed Not Hacked: Preparing for the Risks this Tax Season</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>The U.S. tax filing deadline this year is April 18, which is roughly 3 more weeks of open season for hackers looking to scam taxpayers. We have been warned of tax scams in the past, but the pandemic has forced consumers and businesses to reconsider how they file their taxes due to rising cybersecurity concerns. In 2022, <a href=\"https://www.efile.com/efile-tax-return-direct-deposit-statistics/\">the IRS reported</a> that approximately 155 million tax returns were filed online. While online filing options have been available for years, mobile applications are making it easier than ever for taxpayers to file their returns–often in a matter of minutes.</p>\n<p>With mobile apps, users can snap a picture of their W-2s and go through prompts to confirm income and personal information, review their deductions, and file directly from their phone or tablet. In the days leading up to the April 18th deadline, malicious actors will attempt to exploit the tremendous amount of sensitive data shared online during tax season (tax ID numbers, employee records, social security numbers, banking information, etc.) and the increase in tax filing via mobile apps that has opened up many new potential vulnerabilities.</p>\n<h2>Are You Using the Same Tax Filing App That You Used Last Year?</h2>\n<p>There are several ways that malicious actors leverage app security flaws to intercept data or redirect information and payments. In recent years, fake mobile applications have become a prime threat vector for financial fraud and identity theft. A common tactic that malicious actors employ is to download legitimate applications and then reverse engineer the source code. That code is then used to create fake versions of the application that look identical to the original but contain malicious code that can bypass security controls, steal information, and spy on the mobile device activity. The fake apps are then promoted or advertised on websites, blogs, and social media for taxpayers to download from third-party app stores. More times than not, they are not usually available through legitimate device-centric app stores.</p>\n<h2>Beware of IRS Smishing Scams</h2>\n<p>&#8220;Smishing&#8221; is another commonly used technique cybercriminals rely on during tax season to trick users into clicking a link sent via text message. These texts may include messages stating you must call the IRS or that there is an issue with your tax return. When you click on a link in a fraudulent text, you might be redirected to a page that imitates the IRS login page asking you to create an account. Additionally, fake links can download harmful code or redirect users to fraudulent tax filing applications. These are attempts to gather sensitive personal information from taxpayers, such as social security numbers, email addresses, passwords, phone numbers, or payment information.</p>\n<blockquote><p>It is important to note that the IRS will never initiate contact with taxpayers through email, text messages, or social media channels to request personal or financial information.</p></blockquote>\n<h2>Human Resources and Tax Professionals Are Prime Targets</h2>\n<p>HR departments need to be on high alert during tax season. Soliciting W-2 information from payroll and human resources departments through phishing is a common practice leveraged by cybercriminals. Detecting phishing red flags may be easier on a work computer or laptop than on a mobile device, which has a smaller screen.</p>\n<p>Similarly, tax professionals are also frequently targeted by scams. It’s imperative for tax preparers to make securing data a top priority, regardless of whether they’re part of a major accounting firm or the owner of a one-person storefront. Understanding the requirements and penalties for not safeguarding a client’s tax identification number and personally identifiable information (PII) is a great place to start. Securing traditional endpoints such as laptops or computers, networks, and servers can help detect and respond to bad actors trying to gain access to client data.</p>\n<p>However, securing mobile devices from device attacks, malicious networks, phishing attempts, and malware found in mobile applications is critical when conducting business with clients. A Mobile Threat Defense (MTD) solution leverages various techniques, such as behavioral analysis, to counter mobile threats, conduct application vetting, and provide ongoing protection against mobile threats.</p>\n<h2>How Can Zimperium Help</h2>\n<p>Organizations that need to secure their mobile applications at tax time will find the <a href=\"https://www.zimperium.com/mobile-app-protection/\">Zimperium Mobile Application Protection Suite (MAPS)</a> very helpful in a number of ways:</p>\n<ul>\n<li><a href=\"https://www.zimperium.com/zscan/\">zScan:</a> Discover and fix compliance, privacy, and security issues within the development process before you publicly release your apps.</li>\n<li><a href=\"https://www.zimperium.com/zkeybox/\">zKeyBox:</a> Protect confidential data by securing cryptographic keys with white-box cryptography so they cannot be discovered, extracted, or manipulated.</li>\n<li><a href=\"https://www.zimperium.com/zshield/\">zShield:</a> Harden and protect the app with advanced obfuscation and anti-tampering functionality to protect the source code, intellectual property (IP), and data within the application.</li>\n<li><a href=\"https://www.zimperium.com/zdefend/\">zDefend:</a> Enable the mobile application to detect and proactively protect itself by taking actions on the end user’s device, even without network connectivity.</li>\n</ul>\n<p><a href=\"https://www.zimperium.com/mtd/\">Zimperium Mobile Threat Defense (MTD</a>) -formerly zIPS- is the only on-device solution to protect your organization and employees from the top tax scams. Zimperium MTD continuously monitors mobile threats (device compromises, network attacks, malicious apps, and phishing) and performs in-depth scanning of mobile apps for privacy and security risks. By leveraging contextual intelligence and on-device controls, security teams can gain insight into never before seen threats and telemetry.</p>\n<h3>Ensuring Resident Safety with Zimperium</h3>\n<p>Large cities like <a href=\"https://play.google.com/store/apps/details?id=net.metro.zips&amp;hl=en_US&amp;gl=US\">Los Angeles</a>, <a href=\"https://secure.nyc/\">New York City</a>, <a href=\"https://dallascityhall.com/departments/ciservices/Pages/Dallas-Secure.aspx\">Dallas</a>, and the <a href=\"https://www.michigan.gov/dtmb/services/cybersecurity/michigansecure\">State of Michigan</a> have teamed up with Zimperium to provide a turnkey mobile application that protects residents from top tax scams. The good news is that taxpayers can take steps to safeguard their devices and data this tax season. Zimperium solutions protect Android and iOS mobile devices against critical threats. These solutions can alert users when their devices are connecting to unsecured Wi-Fi networks, running unsafe apps in Android or iOS, getting exposed to system tampering, and more.</p>\n<p>If risky behavior is detected, users will receive recommendations on what actions to take to keep their devices safe. Zimperium solutions never collect personal information from mobile devices; they only gather the threat information needed to protect a user&#8217;s phones and tablets from cybercrime like tax scams.</p>\n<p>Zimperium has a variety of solutions to protect your mobile tax application, employees, and residents filing their taxes from cybercrime during tax season. For more information on how Zimperium MTD (zIPS) or Zimperium Mobile Application Protection Suite (MAPS) can help, <a href=\"https://www.zimperium.com/contact-us/\">contact us today.</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/taxed-not-hacked-preparing-for-the-risks-this-tax-season/\">Taxed Not Hacked: Preparing for the Risks this Tax Season</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"New Apple Vulnerabilities Identified: Top Takeaways from Recent Discovery","link":"https://www.zimperium.com/blog/new-apple-vulnerabilities-identified-top-takeaways-from-recent-discovery/","dc:creator":{"#cdata-section":"Sammie Walker"},"pubDate":"Thu, 09 Mar 2023 18:37:36 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=11946"},"description":{"#cdata-section":"<p>In recent weeks, more news has come out about vulnerabilities affecting Apple devices. In the following article, we present some details about these findings and some important lessons we can learn from them.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/new-apple-vulnerabilities-identified-top-takeaways-from-recent-discovery/\">New Apple Vulnerabilities Identified: Top Takeaways from Recent Discovery</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>In recent weeks, more news has come out about vulnerabilities affecting Apple devices. Here are some details about these discoveries and some important lessons to draw from this news.</p>\n<h2>The Vulnerability</h2>\n<p>In February, a researcher at Trellix announced the discovery of a “<a href=\"https://www.trellix.com/en-us/about/newsroom/stories/research/trellix-advanced-research-center-discovers-a-new-privilege-escalation-bug-class-on-macos-and-ios.html\">large new class of bugs</a>” that affects iPhones, iPads, and Macs.</p>\n<p>Once an attacker gains access to a device, they can use this vulnerability to run code that bypasses code-signing safeguards. Through this exploit, an attacker could gain access to pretty much any assets on the victim’s device, including photos, call logs, text messages, calendars, and location data. Further, they can gain remote control over the device’s camera and microphone and even wipe the device completely.</p>\n<h2>How it Works</h2>\n<p>The exploit stems from NSPredicate, which is a class (or capability for creating objects) available to developers. This class is intended to let developers filter lists of objects on a device. While the nature of this capability sounds innocuous, the reality is that it is a complete scripting language—and it’s one that can be exploited to gain unfettered access and control.</p>\n<h2>The Reality: Apple Devices Vulnerable</h2>\n<p>Over the years, Apple has received a lot of recognition for its approach to security, and for good reason. In iOS devices, and increasingly in macOS devices as well, the company has employed code signing. This means apps can only run if they’ve been cryptographically signed by a trusted developer. This undoubtedly makes it harder for malicious actors to run malware on Apple devices.</p>\n<p>However, while it is great these protections are in place, that doesn’t mean you can assume they’re foolproof. NSPredicate is an example of this. Fundamentally, this class enables anyone with access to a device to bypass code signing and run malware.</p>\n<h2>These Vulnerabilities Aren’t the First, Just the Latest</h2>\n<p>The vulnerabilities disclosed in February are just the latest in a series of discoveries surrounding Apple vulnerabilities. It was just in January that <a href=\"https://thehackernews.com/2023/01/apple-issues-updates-for-older-devices.html\">Apple issued an advisory</a> about a critical security flaw affecting older devices. Further, in issuing this advisory, the company cited evidence of active exploitation. They issued patches that remediated a number of security vulnerabilities, including flaws in the WebKit browser engine that could lead to code execution.</p>\n<p>Further, these revelations in February weren’t even the first time NSPredicate was in the news. In fact, it was back in September 2021 that <a href=\"https://citizenlab.ca/2021/09/forcedentry-nso-group-imessage-zero-click-exploit-captured-in-the-wild/\">Citizen Lab announced an exploit known as FORCEDENTRY</a>. This was a zero-click exploit, meaning a device could be infected without the user even clicking a link. FORCEDENTRY was used by the NSO Group, purveyors of Pegasus spyware. One specific example uncovered was that a Saudi activist had their iPhone infected by Pegasus through this exploit.</p>\n<p>This exploit employed two key techniques, one of which was leveraging, you guessed it, NSPredicate to bypass code signing. Since then, Apple has made a number of changes to address the risks posed by NSPredicate, but recent revelations show that these fixes weren’t real, well, fixes.</p>\n<h2>Key Takeaways</h2>\n<p>The most recent developments underscore some key realities for security teams:</p>\n<ul>\n<li><strong>You can’t count on “secure” device architectures.</strong> Any device can prove vulnerable. Old or new, Android or iOS, patched or unpatched, it doesn’t matter. Malicious actors keep finding ways to compromise mobile devices.</li>\n<li><strong>You can’t count on patching and remediation.</strong> The reality is that a vulnerability that surfaced back in 2021 is still posing risks to device users and organizations. While various rounds of remediations have been employed and patches have been issued, gaps remain.</li>\n<li><strong>You can’t count on users.</strong> Even when new updates are available, it may take users weeks, even months, to install them. Further, employees are susceptible to being fooled and rendering many safeguards worthless. As we wrote in a <a href=\"https://www.zimperium.com/blog/tale-of-two-phishes-lessons-from-the-twilio-and-cloudflare-sms-spear-phishing-attacks/\">blog post a while back</a>, if a phishing attack is sophisticated enough, even properly trained employees can be fooled into divulging secrets and opening the door to malware.</li>\n</ul>\n<h2>Moving Past Denial</h2>\n<p>It can always be tempting to reduce our stress levels by denying there’s a risk or hoping we won’t be affected. We can try to comfort ourselves, thinking we’re going to be ok because we’re running a new device, because we keep our devices current with updates, or because we’re using a platform protected by code signing. Recent years have provided way too many examples that contradict these beliefs, however.</p>\n<p>Clinging to denial or false hopes is never a particularly sound strategy, and it is particularly disastrous for security teams. Mobile devices and apps now represent an organization’s largest unprotected vector of attack. Organizations’ assets are increasingly exposed to mobile threats, including phishing, network attacks, malicious applications, and compromised devices. Security strategies, practices, and technologies need to be aligned with these realities.</p>\n<h2>Conclusion</h2>\n<p>To combat the threats posed by vulnerable mobile devices today, it is abundantly clear that security teams must employ <a href=\"https://www.zimperium.com/mobile-threat-defense/\">advanced mobile threat defense capabilities</a> that keep up with today’s mobile threat landscape. These capabilities are paramount if organizations are to guard against the most advanced attacks on mobile devices. Further, these solutions provide the critical data security teams need to stay ahead of increasingly sophisticated cyberattacks.</p>\n<p>Zimperium zIPS is the only on-device solution that provides comprehensive protection against advanced persistent threats across device, network, app, and network attacks. Zimperium leverages machine learning to continuously monitor mobile devices for malicious behavior without relying on signatures, making Zimperium the only mobile threat detection solution capable of detecting and protecting against known and unknown threats. Zimperium alerts security teams and provides them with forensics and threat intelligence to identify and isolate the incident before it becomes a much larger security issue.</p>\n<p>For more information on how you can protect your organization against mobile risks and threats, <a href=\"https://www.zimperium.com/contact-us/\"><span style=\"font-weight: 400;\">contact us today. </span></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/new-apple-vulnerabilities-identified-top-takeaways-from-recent-discovery/\">New Apple Vulnerabilities Identified: Top Takeaways from Recent Discovery</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"Hackers Go to War on Maker Of ‘Call Of Duty’: The Risks and How to Respond to The Recent Activision Attacks","link":"https://www.zimperium.com/blog/how-to-respond-to-the-recent-activision-attacks/","dc:creator":{"#cdata-section":"Monique Becenti"},"pubDate":"Thu, 09 Mar 2023 17:47:49 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=11940"},"description":{"#cdata-section":"<p>In recent months, Activision, the maker of Call of Duty, has been the victim of several malicious attacks. Read on to hear the lessons learned from the these attacks and how Zimperium can help. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/how-to-respond-to-the-recent-activision-attacks/\">Hackers Go to War on Maker Of ‘Call Of Duty’: The Risks and How to Respond to The Recent Activision Attacks</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>Over the last few months, there has been a recent wave of attacks on the maker of Call of Duty. It was reported that in early December, game maker Activision was hacked in a smishing attack. The company confirmed the December 2nd hack in February after research group vx-underground <a href=\"https://twitter.com/vxunderground/status/1627477748359872513?lang=en\">broke the news</a> on Twitter.</p>\n<p>According to reports, the attackers sent a malicious SMS message to several Activision employees, mimicking a two-factor authentication message. Although not all employees clicked on the link, one privileged user did, giving the threat actors access to internal documents, employee information, and unreleased game content. <a href=\"https://insider-gaming.com/activision-breach-2023-plans/\">Insider Gaming </a>reported that the schedule for four seasons of Call of Duty was leaked, as well as other upcoming content.</p>\n<p>The malicious actors continued their attack on Activision’s internal Slack, using the employee’s internal account to phish other employees, finally revealing themselves by dropping a vulgar message on Slack.</p>\n<p><a href=\"https://gizmodo.com/activision-blizzard-call-duty-hacked-no-tell-employees-1850145082\">According to Gizmodo,</a> Activision didn&#8217;t disclose the breach to employees, despite employee information being exposed.</p>\n<h2>Concerns of Malicious Actors “Infesting” Black Ops Game</h2>\n<p>As news of the Activision hack spreads, the gaming community is also raising serious concerns about the company&#8217;s eight-year-old first person shooter in Black Ops III.</p>\n<p>Gamers and streamers have reported vulnerabilities in the game that allow threat actors to remotely control other players’ computers, as long as they are in the same online match, <a href=\"https://techcrunch.com/2023/02/28/gamers-are-fixing-a-video-game-taken-over-by-hackers/\">reports TechCrunch</a>. Streamers have declared the game to be “taken over” by malicious hackers, who they claim have a tool that reveals players’ IP addresses. Although the company told TechCrunch that they are continuing to support Black Ops III, <a href=\"https://github.com/momo5502/boiii\">gamers are starting to build their own patches </a>to fix vulnerabilities in the game.</p>\n<p>“The game has become infested with hackers. There are tons of security vulnerabilities which have a severe impact,” Maurice Heumann, the developer who is developing a fix for the game on his own, told TechCrunch. “You can get hacked just by playing the game. Your data can be stolen and so much more.”</p>\n<h2>Lessons Learned From Activision Attacks</h2>\n<p>It only takes one employee to click a malicious link: Education about phishing will unfortunately only get you so far when it comes to avoiding an attack. Most of the Activision staffers appeared to have spotted the scam and avoided it. That didn’t matter: the scammer only had to trick one person into clicking, and then they could use that person’s account to phish others.</p>\n<p>Gamers’ PII and in-game assets are being stolen: Unpatched games are dangerous for players, who are unknowingly being targeted by the people they are playing against. These vulnerabilities could expose the personal identifiable information (PII) of adults and minors as well as their IP address, revealing a gamer’s location.</p>\n<p>Bad actors are relentless when it comes to code compromise: The malicious actors in Black Ops III appear to be stealing source code and modifying it so they can cheat, steal, and, most worryingly, take over the devices of legitimate players.</p>\n<h2>How Zimperium Can Help</h2>\n<p>Billions of gamers are drawn to mobile gaming, and they’re responsible for half of all video game spending. In 2022, <a href=\"https://newzoo.com/insights/articles/the-games-market-in-2022-the-year-in-numbers\">gamers spent $92.2 billion on mobile games</a> alone. With so much money being spent on gaming, it’s no surprise that criminals are taking aim at companies like Activision.</p>\n<p>Code tampering is a big part of this. Hackers steal code to cheat, bypass in-game purchases, and steal from other players. Protecting your code is a critical part of any defense strategy.&nbsp; <a href=\"https://www.zimperium.com/mobile-app-protection/\">Zimperium’s Mobile Application Protection Suite (MAPS)</a> enables game developers to obfuscate code obfuscation and keep malicious actors from tampering with their games. By protecting code, you can reserve fair play and protect legitimate users’ private data.</p>\n<p>On the other hand, securing mobile endpoints is essential to prevent SMS phishing disguised as two-factor authentication. <a href=\"https://www.zimperium.com/zips-mobile-ips/\">Zimperium zIPS</a> is an advanced mobile threat defense solution built to protect enterprises and employees by providing persistent, on-device protection for Android, iOS, and ChromeOS devices. Zimperium leverages a combination of machine learning and state-of-the-art technology to detect known and unknown phishing threats, including device, app, and network attacks. By securing an employee’s mobile device, phishing and mobile attacks can prevent access to corporate data before it becomes a bigger threat.</p>\n<p>For more information on how to protect your gaming applications and enterprise from attackers, <a href=\"https://www.zimperium.com/contact-us/\">contact us today.</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/how-to-respond-to-the-recent-activision-attacks/\">Hackers Go to War on Maker Of ‘Call Of Duty’: The Risks and How to Respond to The Recent Activision Attacks</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"Zimperium Honored with Three Cybersecurity Excellence Awards","link":"https://www.zimperium.com/blog/zimperium-honored-with-three-cybersecurity-excellence-awards/","dc:creator":{"#cdata-section":"Lisa Bergamo"},"pubDate":"Tue, 07 Mar 2023 21:24:29 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=11929"},"description":{"#cdata-section":"<p>Zimperium is excited to announce that we have been named a Gold winner of three 2023 Cybersecurity Excellence Awards in the following categories: Mobile Application Security, Mobile Security, and Mobile Threat Defense. Learn more about these recognitions. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/zimperium-honored-with-three-cybersecurity-excellence-awards/\">Zimperium Honored with Three Cybersecurity Excellence Awards</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>We’re excited to announce that Zimperium has been named a Gold winner of three <a href=\"https://cybersecurity-excellence-awards.com/2023-cybersecurity-excellence-awards/\">2023 Cybersecurity Excellence Awards</a>! We were recognized in the following Cybersecurity Product categories: <i>Mobile Application Security, Mobile Security, and Mobile Threat Defense</i>. The Cybersecurity Excellence Awards honors products and companies that demonstrate excellence, innovation, and leadership in information security. Finalists and winners are selected based on the strength of their nomination as well as the popular vote by members of the Information Security Community.</p>\n<p>Historically, cyber security solutions were focused on protecting networks, while mobile devices and apps were not considered vulnerable to security threats. In the modern enterprise, however, the threat of ransomware and advanced persistent threats combined with the explosive growth of data and the use of mobile devices and apps have created an environment rich for data theft and manipulation.</p>\n<p>Today, malicious actors are intensifying their focus on the mobile channel as an attack vector. The intent is to breach customer data, stop apps from working, and compromise customer accounts.* As businesses continue to operate in remote or hybrid environments, users more than ever before rely on mobile devices and mobile applications for work. As well, with continued reliance on the mobile channel for personal activities like banking services, social media, healthcare services, and online shopping, the need to secure mobile devices, apps, and data is increasingly critical.</p>\n<p>As we face a perfect storm of security, compliance requirements, and extensive data growth, a traditional network-based “outside-in” approach to mobile security is not sufficient to safeguard critical data. <a href=\"https://www.zimperium.com/zips-mobile-ips/\">Zimperium zIPS</a> and <a href=\"https://www.zimperium.com/mobile-app-protection/\">MAPS</a> security solutions uniquely address these challenges at their core. MAPS secures mobile apps from development to deployment, encompassing centralized visibility with comprehensive in-app protection that combines inside-out and outside-in security approaches to help enterprises build and maintain secure mobile apps. zIPS is the only on-device mobile security solution that protects enterprise mobile devices against known and unknown device, network, app, and phishing attacks at scale.</p>\n<p>&#8220;We congratulate Zimperium for the recognition as a Gold award winner in the Mobile Application Security, Mobile Security, and Mobile Threat Defense categories of the 2023 Cybersecurity Excellence Awards,&#8221; said Holger Schulze, CEO of Cybersecurity Insiders and founder of the 600,000-member Information Security Community on LinkedIn, which organizes the 8th annual Cybersecurity Excellence Awards. &#8220;With over 800 entries in more than 300 award categories, the 2023 Cybersecurity Excellence Awards program is highly competitive. All winners reflect the very best in innovation and excellence in defending against today&#8217;s evolving cybersecurity threats.&#8221;</p>\n<p>For more information about the Cybersecurity Excellence Awards, please visit <a href=\"https://cybersecurity-excellence-awards.com\">https://cybersecurity-excellence-awards.com</a></p>\n<hr />\n<p>*Source: &#8220;The State of Mobile App Security 2022”, Osterman Research</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/zimperium-honored-with-three-cybersecurity-excellence-awards/\">Zimperium Honored with Three Cybersecurity Excellence Awards</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"Zimperium Named in Top 20 Coolest Endpoint and Managed Security Companies","link":"https://www.zimperium.com/blog/zimperium-recognized-on-crns-2023-security-100-list/","dc:creator":{"#cdata-section":"Sammie Walker"},"pubDate":"Tue, 21 Feb 2023 19:57:44 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=11888"},"description":{"#cdata-section":"<p>We are proud to announce that CRN has named Zimperium to its annual Security 100 list as one of the 20 Coolest Endpoint And Managed Security Companies Of 2023. Recipients chosen for this year’s Security 100 list have been specifically selected by CRN editors for their outstanding channel-focused security offerings. Learn more.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/zimperium-recognized-on-crns-2023-security-100-list/\">Zimperium Named in Top 20 Coolest Endpoint and Managed Security Companies</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>We’re proud to announce that CRN®, a brand of The Channel Company, has named Zimperium to its annual Security 100 list. We have been recognized as one of the <a href=\"https://www.crn.com/news/security/the-20-coolest-endpoint-and-managed-security-companies-of-2023-the-security-100/21\">20 Coolest Endpoint And Managed Security Companies Of 2023</a>&nbsp;and are thrilled to be joined by our OEM partners SentinelOne and Trellix.</p>\n<p>Recipients chosen for this year’s Security 100 list have been specifically selected by CRN editors for their outstanding channel-focused security offerings. The list serves as a comprehensive guide for solution providers, helping them to identify the top security vendors to team with as they build innovative solutions for their customers.</p>\n<blockquote><p>“As the only mobile security platform purpose-built for enterprise environments, we take great pride in not only being named to this prestigious list but also being the only mobile threat defense (MTD) provider to receive this accolade,” said Shridhar Mittal, Chief Executive Officer at Zimperium. “This recognition is a testament to the increasing threat mobile devices pose to the overall security of an enterprise, the capabilities Zimperium provides to stop them, and our commitment to being a channel-first organization.”</p></blockquote>\n<p>With machine learning-based protection and a single platform that secures everything from endpoints to applications, Zimperium is the only solution to provide on-device mobile threat defense to protect growing and evolving mobile environments. These unique capabilities are why some of the <a href=\"https://www.zimperium.com/partners/\">leading security vendors</a> trust Zimperium technology to secure mobile devices that have become an integral part of life and business.</p>\n<p>People are relying on their mobile devices more than ever before, and their devices store or provide access to an organization’s most sensitive data – through productivity and email applications, multi-factor authentication, and more. Attackers are taking note, and in this environment, working with our channel partners to reach and help more organizations worldwide enhance their mobile security has become a core component of our business.</p>\n<blockquote><p>“With all the unexpected changes organizations have faced since the beginning of COVID-19, security still remains the most critical factor in business today. This year’s Security 100 list acknowledges industry-leading companies that deliver pioneering security offerings to the IT channel that can withstand a wide range of threats. These companies are laying the groundwork for the most advanced cybersecurity solutions,” said Blaine Raddon, CEO of The Channel Company.</p></blockquote>\n<p>Being recognized in the CRN Security 100 list comes on the heels of other recent award wins and milestones for Zimperium, including being named to the<a href=\"https://www2.deloitte.com/us/en/pages/technology-media-and-telecommunications/articles/fast500-winners.html\"> 2022 Deloitte Technology Fast 500 list</a> and being recognized by the<a href=\"https://cybersecuritybreakthrough.com/2022-winners/\"> 2022 Cybersecurity Breakthrough Awards</a>. The 2023 Security 100 list is featured in the February 2023 issue of CRN and online at <a href=\"http://www.crn.com/security100\">www.crn.com/security100</a>.</p>\n<p>This is an amazing way to start off 2023, and with our partners’ support, we’re looking forward to the year ahead!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/zimperium-recognized-on-crns-2023-security-100-list/\">Zimperium Named in Top 20 Coolest Endpoint and Managed Security Companies</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"NCCoE Issues New Guide for Deploying Zero Trust Architectures","link":"https://www.zimperium.com/blog/nccoe-issues-new-guide-for-deploying-zero-trust-architectures/","dc:creator":{"#cdata-section":"Jim Kovach"},"pubDate":"Fri, 03 Feb 2023 13:30:00 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=11867"},"description":{"#cdata-section":"<p>The NCCoE has released the “Implementing a Zero Trust Architecture\" that outlines how teams can employ commercially available technology to establish zero trust implementations that are interoperable and standards-based. Zimperium was selected by the NCCoE to work on this project. We’re honored to be collaborating with the NCCoE and other technology providers to help advance the knowledge and guidance available in this critical area.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/nccoe-issues-new-guide-for-deploying-zero-trust-architectures/\">NCCoE Issues New Guide for Deploying Zero Trust Architectures</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"<p>The demand for zero trust architectures has long been well understood. However, while the “why” is clear, it’s the “how” that’s far less straightforward. As they pursue a move to zero trust, many teams struggle with devising the specific tools, tactics, and approaches that are optimally aligned with their organizations. Read on to learn more about vital new resources that offer much-needed guidance for teams looking to adopt zero trust in their organizations.</p>\n<h2>Introduction: The Pressing Demands for Zero Trust</h2>\n<p>The need for zero trust architectures continues to get more pressing as the notion of a defensible security perimeter becomes an increasingly distant memory. Particularly since the advent of the pandemic, the reality is that sensitive enterprise data can be anywhere.</p>\n<p>Consequently, the legacy focus on trying to keep the bad actors “out” is now a non-starter. Zero trust architectures represent a key imperative, an approach that’s truly aligned with current realities.</p>\n<h2>Introducing the Zero Trust Architecture Project</h2>\n<p>Back in 2018, the <a href=\"https://www.nccoe.nist.gov/\">National Cybersecurity Center of Excellence</a> (NCCoE) at the National Institute of Standards and Technology (NIST) launched the <a href=\"https://www.nccoe.nist.gov/projects/implementing-zero-trust-architecture\">Zero Trust Architecture project</a>. Through this project, the NCCoE is focused on helping enterprises and government agencies establish end-to-end, zero-trust architectures that reduce the risk of cyber attacks. As part of this project, the NCCoE has been developing an array of resources, including extensive guides for practitioners.</p>\n<p>The preliminary draft of the NCCoE’s practice guide was released on December 21, 2022. This draft includes the second version of NIST Special Publication (SP) 1800-35A-D and the first version of volume E, entitled “<a href=\"https://www.nccoe.nist.gov/projects/implementing-zero-trust-architecture\">Implementing a Zero Trust Architecture</a>.” This guide outlines how teams can employ commercially available technology to establish zero trust implementations that are interoperable and standards-based.</p>\n<p>Back in February 2022, <a href=\"https://www.zimperium.com/blog/zimperium-joins-nist-project-on-zero-trust-architectures/\">Zimperium was selected</a> by the NCCoE to work on this project. We’re honored to be collaborating with the NCCoE and other technology providers to help advance the knowledge and guidance available in this critical area. Through this effort, we’re working to develop practical, interoperable cybersecurity approaches that show how the components of zero trust architectures can securely mitigate risks and address compliance requirements in various industry sectors.</p>\n<p>As part of this effort, we’re helping build several samples of zero trust architecture solutions that demonstrate how teams can secure access to corporate resources. The proposed example solutions will integrate commercial and open-source products that leverage cybersecurity standards and recommended practices to showcase the robust security potential of zero trust.*</p>\n<p>These solutions will enforce corporate security policies dynamically and in near real-time. With these solutions, teams will be able to ensure that only authenticated, authorized users and devices will be able to access sensitive assets. At the same time, these solutions will flexibly enable a complex, diverse set of business use cases, including support for remote workforces, cloud services, partners, and third-party contractors.</p>\n<h2>Conclusion</h2>\n<p>We encourage anyone who’s involved in managing security for their organization to review this draft. This guide will provide solid, proven guidelines for establishing effective zero trust implementations. Commercial mobile network operators, potential private zero trust network operators, and teams managing zero trust enabled technology will find this publication particularly valuable. In addition, the NCCoE is accepting public comments until February 6, 2023. We encourage you to <a href=\"https://www.nccoe.nist.gov/projects/implementing-zero-trust-architecture\">share your feedback and insights</a>. Finally, to receive updates about our progress, please visit the <a href=\"https://www.nccoe.nist.gov/projects/implementing-zero-trust-architecture\">Zero Trust Architecture project page</a>, where you can join the zero trust architecture community of interest.</p>\n<h2>About the National Cybersecurity Center of Excellence</h2>\n<p>The National Cybersecurity Center of Excellence (NCCoE), a part of the National Institute of Standards and Technology (NIST), is a collaborative hub where industry organizations, government agencies, and academic institutions work together to address businesses’ most pressing cybersecurity issues. This public-private partnership enables the creation of practical cybersecurity solutions for specific industries, as well as for broad, cross-sector technology challenges.</p>\n<p>Through consortia under Cooperative Research and Development Agreements (CRADAs), including technology partners—from Fortune 50 market leaders to smaller companies specializing in IT security—the NCCoE applies standards and best practices to develop modular, adaptable example cybersecurity solutions using commercially available technology. The NCCoE documents these example solutions in the NIST Special Publication 1800 series, which maps capabilities to the NIST Cybersecurity Framework and details the steps needed for another entity to recreate the example solution. The NCCoE was established in 2012 by NIST in partnership with the State of Maryland and Montgomery County, Maryland. Information is available at: <a href=\"https://www.nccoe.nist.gov.\">https://www.nccoe.nist.gov.</a></p>\n<h2>About Zimperium</h2>\n<p><a href=\"https://www.zimperium.com/\">Zimperium, Inc.</a> is a global leader in mobile device and application security. Zimperium zIPS™ is an advanced mobile threat defense solution for enterprises, providing persistent, on-device protection on Android, Chrome OS, and iOS-powered mobile endpoints. Leveraging advanced machine learning, zIPS detects threats across the kill chain, including those targeting devices, networks, and applications. By design, zIPS protects end-user privacy, ensuring that Federal agencies comply with zero trust principles and privacy mandates. For more information or to schedule a demo, contact us today.</p>\n<p><em>*While the example implementation uses certain products, NIST and the NCCoE do not endorse these</em><br />\n<em>products. The guide presents the characteristics and capabilities of those products, which an</em><br />\n<em>organization’s security experts can use to identify similar standards-based products that will fit with</em><br />\n<em>their organization’s existing tools and infrastructure.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/nccoe-issues-new-guide-for-deploying-zero-trust-architectures/\">NCCoE Issues New Guide for Deploying Zero Trust Architectures</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}},{"title":"The Security Gaps Left by EDR and How MTD Can Help","link":"https://www.zimperium.com/blog/the-security-gaps-left-by-edr-and-how-mtd-can-help/","dc:creator":{"#cdata-section":"JT Keating"},"pubDate":"Thu, 02 Feb 2023 14:00:00 +0000","guid":{"@isPermaLink":"false","#text":"https://www.zimperium.com/?post_type=blog&p=11852"},"description":{"#cdata-section":"<p>Take a look at the emerging threats and uncover the shortcomings of enterprise detection and response (EDR) solutions in addressing these threats. Read on to learn why mobile threat defense (MTD) solutions represent a critical requirement for today’s enterprises.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/the-security-gaps-left-by-edr-and-how-mtd-can-help/\">The Security Gaps Left by EDR and How MTD Can Help</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"},"content:encoded":{"#cdata-section":"\n<p></p>\n\n\n<p>In some realms, a 40% success rate may be okay. For a batter in baseball, it would be considered great. In security, though? Not so much.</p>\n<p>This post summarizes our <a href=\"https://www.brighttalk.com/webcast/19320/568541?utm_source=Zimperium&amp;utm_medium=brighttalk&amp;utm_term=blog\">recent webinar discussion</a> with Rick Bosworth from SentinelOne about the emerging threats that unprotected mobile devices present to enterprises and&nbsp;why <a href=\"https://www.zimperium.com/mobile-edr/\">enterprise detection and response (EDR) solutions</a> working in tandem with mobile threat defense (MTD) represent a critical requirement for today’s enterprises.</p>\n<h2>Introduction: The Dangers Posed by Unprotected Mobile Devices</h2>\n<p>For any security team, there’s a fundamental calculation that needs to be made in order to intelligently determine where to apply precious effort and investments. When determining whether to secure any specific class of assets, leaders need to consider two key questions:</p>\n<ul>\n<li>Does the asset hold value? In this case, value can be assessed in terms of whether the asset houses proprietary data or credentials or has the potential to provide access to other assets or services that do have value</li>\n<li>Is the asset vulnerable to attack, and are malicious actors actually targeting those types of assets?</li>\n</ul>\n<p><!-- /wp:list --> <!-- wp:paragraph --></p>\n<p>When the answer to either question is “no,” teams can move on to other assets. When it comes to mobile devices, however, the answer to both of these questions is a resounding “absolutely.”</p>\n<h3>Mobile Devices House and Access Assets of Value</h3>\n<p>First, more than ever, mobile devices are now integral to the way people work. According to our <a href=\"https://www.zimperium.com/blog/mobile-threat-report-endpoint-security-risks-in-2022/\">2022 Global Threat Report</a>, 60% of the endpoints accessing enterprise assets are now mobile endpoints. Mobile devices are integral to multi-factor authentication (MFA), and they play a significant role in terms of how we communicate, stay apprised, and get our jobs done. On average, <a href=\"https://www.zimperium.com/global-mobile-threat-report/\">10% of the apps on employee-owned mobile devices</a> are enterprise-focused, including apps for MFA, email, instant messaging, and so on.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>Consequently, in this respect, there’s no real distinction between mobile devices and the traditional endpoints (that is, the laptops and desktops) that teams have had to secure for years now. Quite simply, like traditional endpoints, mobile devices house and access critical enterprise assets. By gaining access to a mobile device, an attacker can get access to sensitive corporate networks, services, and assets.</p>\n<h3>Mobile Devices are Subject to Attack</h3>\n<p>In recent years, there’s been ample evidence that mobile devices are becoming the go-to attack vector for many malicious actors. Here are just a few of the many statistics from our <a href=\"https://www.zimperium.com/global-mobile-threat-report/\">2022 Global Threat Report</a> that illustrate this point:</p>\n<ul>\n<li>In 2021, we saw a 466% increase in exploited zero-day vulnerabilities used in attacks against mobile endpoints.</li>\n<li>42% of security incidents organizations reported were tied to mobile devices or web applications.</li>\n<li>Every day, the Zimperium team uncovered 5,000 new mobile malware samples. Every day. That amounts to more than two million samples discovered over the course of the year.</li>\n</ul>\n<p>Beyond these stats, there are plenty of high-profile attacks that made the news in the past year. <a href=\"https://www.wired.com/story/slack-data-breach-security-news-roundup/\">Slack</a>, <a href=\"https://thehackernews.com/2022/08/hackers-behind-twilio-breach-also_10.html\">Twilio</a>, <a href=\"https://www.uber.com/newsroom/security-update\">Uber</a>, and many other organizations were victimized by attackers that targeted mobile devices in some fashion. Mobile malware like <a href=\"https://www.bleepingcomputer.com/news/security/newly-found-zero-click-iphone-exploit-used-in-nso-spyware-attacks/\">Pegasus</a> and, perhaps even more disturbingly, examples of open-source malware that bears many of the same characteristics of Pegasus continue to be employed in attacks.</p>\n<p>Last year, mobile device manufacturers put out a record number of patches. This only underscores this fundamental reality: Mobile devices are being actively targeted—and successfully exploited.</p>\n<h2>Why Traditional Endpoint Detection and Response Falls Short</h2>\n<p>For years, security teams have relied on endpoint detection and response (EDR) solutions to safeguard corporate endpoints like laptops and desktops. However, these traditional solutions are not equipped to address mobile device security, and given the 60% stat cited above, that means they only address about 40% of the endpoints accessing corporate assets today.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>Further, this means they offer little defense against one of the most common methods of attack. In study after study, it is proven that phishing is the most common cause of breaches that afflict enterprises. Our <a href=\"https://www.zimperium.com/global-mobile-threat-report/\">2022 Global Threat Report </a>showed that 90% of breaches started with phishing.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>Given the ubiquity of mobile device usage, it’s no surprise that these devices are the focal point of phishing attempts. Attackers predominantly employ email, text, and instant messaging to target mobile device users. Further, mobile devices are expressly being targeted because attackers know these devices lack effective defenses. Last year, Zimperium found that <a href=\"https://www.zimperium.com/global-mobile-threat-report/\">75% of the phishing sites analyzed</a> (that is, the pages that phishing messages point unwitting victims too) are specifically targeted toward mobile devices. In many cases, the malware on these sites won’t even run on a traditional endpoint, where they may be more likely to be detected.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>Consequently, traditional EDR and even traditional anti-phishing tools, which are focused on corporate email on laptops, are ill-equipped to address these types of threats.</p>\n<h2>How Zimperium Can Help</h2>\n<p>To recap, mobile devices can expose some of the most precious corporate assets and services, and they’re actively being targeted by malicious actors looking to gain access to those assets. Given this, it is clear teams need to augment their traditional EDR tools and approaches and establish robust defenses that are specifically designed for the realities of mobile devices.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>That’s where Zimperium comes in. With Zimperium <a href=\"https://www.zimperium.com/mobile-threat-defense/\">mobile threat defense (MTD)</a> solutions, teams can address the security gaps left by traditional EDR solutions. Zimperium zIPS is an advanced MTD solution that secures mobile devices, apps, and data—and in the process, it safeguards the corporate resources and services that these devices can access. zIPS detects mobile threats, notifies security teams of incidents, and blocks unauthorized access to resources.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>With <a href=\"https://www.zimperium.com/zips-mobile-ips/\">Zimperium zIPS</a>, your organization can leverage the only on-device MTD solution that protects Android, iOS, and ChromeOS devices. The solution offers robust safeguards against known and zero-day, advanced persistent threats. zIPS keeps mobile devices secure—without relying on cloud-based lookups, content scanning, or other privacy-invasive techniques.</p>\n<h3>zIPS: Powered by z9</h3>\n<p>zIPS is powered by Zimperium’s z9, a dynamically updatable engine. z9 offers behavioral and machine learning techniques that detect device, network, phishing, and mobile application attacks without having to rely on updates or <a href=\"https://get.zimperium.com/av-test-evaluation/\">an active network connection</a>.</p>\n<h3>Zimperium’s Advanced App Analysis</h3>\n<p><a href=\"https://www.zimperium.com/z3a-advanced-app-analysis/\">Zimperium’s Advanced App Analysis (z3A)</a> enables zIPS to perform in-depth mobile application scanning for privacy and security risks. The solution delivers detailed privacy ratings, malware classifications, security ratings, and customizable app privacy settings.</p>\n<h2>Conclusion</h2>\n<p>The time to safeguard mobile devices is today. That means employing <a href=\"https://www.zimperium.com/mobile-threat-defense/\">MTD solution</a><a href=\"https://www.zimperium.com/mobile-threat-defense/\">s</a> that address the unique security threats and usage realities of mobile devices. That’s why so many leading organizations are moving to Zimperium zIPS.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>For more information on how Zimperium zIPS or the <a href=\"https://www.zimperium.com/mobile-app-protection/\">Zimperium Mobile Application Protection Suite (MAPS)</a> can help you secure your mobile endpoints and applications, <a href=\"https://www.zimperium.com/contact-us/\">contact us today</a>.</p>\n<p><!-- /wp:paragraph --></p><p>The post <a rel=\"nofollow\" href=\"https://www.zimperium.com/blog/the-security-gaps-left-by-edr-and-how-mtd-can-help/\">The Security Gaps Left by EDR and How MTD Can Help</a> appeared first on <a rel=\"nofollow\" href=\"https://www.zimperium.com\">Zimperium</a>.</p>\n"}}]}}}