{"?xml":{"@version":"1.0","@encoding":"UTF-8"},"rss":{"@version":"2.0","@xmlns:content":"http://purl.org/rss/1.0/modules/content/","@xmlns:wfw":"http://wellformedweb.org/CommentAPI/","@xmlns:dc":"http://purl.org/dc/elements/1.1/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:sy":"http://purl.org/rss/1.0/modules/syndication/","@xmlns:slash":"http://purl.org/rss/1.0/modules/slash/","channel":{"title":"Krebs on Security","atom:link":{"@href":"https://krebsonsecurity.com/feed/?","@rel":"self","@type":"application/rss+xml"},"link":"https://krebsonsecurity.com","description":"In-depth security news and investigation","lastBuildDate":"Wed, 05 Apr 2023 18:17:51 +0000","language":"en-US","sy:updatePeriod":"\n\thourly\t","sy:updateFrequency":"\n\t1\t","generator":"https://wordpress.org/?v=6.2","item":[{"title":"FBI Seizes Bot Shop ‘Genesis Market’ Amid Arrests Targeting Operators, Suppliers","link":"https://krebsonsecurity.com/2023/04/fbi-seizes-bot-shop-genesis-market-amid-arrests-targeting-operators-suppliers/","comments":"https://krebsonsecurity.com/2023/04/fbi-seizes-bot-shop-genesis-market-amid-arrests-targeting-operators-suppliers/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Tue, 04 Apr 2023 21:04:11 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"fbi"},{"#cdata-section":"Flashpoint"},{"#cdata-section":"Genesis Market"},{"#cdata-section":"Genesis Security"},{"#cdata-section":"Intel 471"},{"#cdata-section":"U.S. District Court for the Eastern District of Wisconsin"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63148"},"description":{"#cdata-section":"Several domain names tied to Genesis Market, a bustling cybercrime store that sold access to passwords and other data stolen from millions of computers infected with malicious software, were seized by the Federal Bureau of Investigation (FBI) today. Sources tell KrebsOnsecurity the domain seizures coincided with \"dozens\" of arrests in the United States and abroad targeting those who allegedly operated the service, as well as suppliers who continuously fed Genesis Market with freshly-stolen data."},"content:encoded":{"#cdata-section":"<p>Several domain names tied to <strong>Genesis Market</strong>, a bustling cybercrime store that sold access to passwords and other data stolen from millions of computers infected with malicious software, were seized by the <strong>Federal Bureau of Investigation</strong> (FBI) today. The domain seizures coincided with more than a hundred arrests in the United States and abroad targeting those who allegedly operated the service, as well as suppliers who continuously fed Genesis Market with freshly-stolen data.</p>\n<div id=\"attachment_63290\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/g3n3siss31z3d.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-63290\" decoding=\"async\" class=\"wp-image-63290\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/g3n3siss31z3d.png\" alt=\"\" width=\"750\" height=\"458\" /></a><p id=\"caption-attachment-63290\" class=\"wp-caption-text\">Several websites tied to the cybercrime store Genesis Market had their homepages changed today to this seizure notice.</p></div>\n<p>Active since 2018, Genesis Market&#8217;s slogan was, &#8220;Our store sells bots with logs, cookies, and their real fingerprints.&#8221; Customers could search for infected systems with a variety of options, including by Internet address or by specific domain names associated with stolen credentials.</p>\n<p>But earlier today, multiple domains associated with Genesis had their homepages replaced with a seizure notice from the FBI, which said the domains were seized pursuant to a warrant issued by the <strong>U.S. District Court for the Eastern District of Wisconsin</strong>.</p>\n<p>The U.S. Attorney&#8217;s Office for the Eastern District of Wisconsin did not respond to requests for comment. The FBI declined to comment.</p>\n<p><strong>Update, April 5, 11:40 a.m. ET:</strong> The U.S. Department of Justice just released <a href=\"https://www.justice.gov/opa/pr/criminal-marketplace-disrupted-international-cyber-operation\" target=\"_blank\" rel=\"noopener\">a statement</a> on its investigation into Genesis Market. In a press briefing this morning, FBI and DOJ officials said the international law enforcement investigation involved 14 countries and resulted in 400 law enforcement actions, including 119 arrests and 208 searches and interviews worldwide. The FBI confirmed that some American suspects are among those arrested, although officials declined to share more details on the arrests.</p>\n<p>The DOJ said investigators were able to access the user database for Genesis Market, and found the invite-only service had more than 59,000 registered users. The database contained the purchase and activity history on all users, which the feds say helped them uncover the true identities of many users.</p>\n<p><em>Original story:</em> But sources close to the investigation tell KrebsOnSecurity that law enforcement agencies in the United States, Canada and across Europe are currently serving arrest warrants on dozens of individuals thought to support Genesis, either by maintaining the site or selling the service bot logs from infected systems.</p>\n<p>The seizure notice includes the seals of law enforcement entities from several countries, including Australia, Canada, Denmark, Germany, the Netherlands, Spain, Sweden and the United Kingdom.</p>\n<p>When Genesis customers purchase a bot, they&#8217;re purchasing the ability to have all of the victim&#8217;s authentication cookies loaded into their browser, so that online accounts belonging to that victim can be accessed without the need of a password, and in some cases without multi-factor authentication.</p>\n<p>&#8220;You can buy a bot with a real fingerprint, access to e-mail, social networks, bank accounts, payment systems!,&#8221; a cybercrime forum ad for Genesis enthused. &#8220;You also get all previous digital life (history) of the bot – most services won’t even ask for login and password and identify you as their returning customer. Purchasing a bot kit with the fingerprint, cookies and accesses, you become the unique user of all his or her services and other web-sites. The other use of our kit of real fingerprints is to cover-up the traces of your real internet activity.&#8221;</p>\n<div id=\"attachment_63291\" style=\"width: 683px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63291\" decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-63291\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/genesis3-21.png\" alt=\"\" width=\"673\" height=\"784\" /><p id=\"caption-attachment-63291\" class=\"wp-caption-text\">The Genesis Store had more than 450,000 bots for sale as of Mar. 21, 2023. Image: KrebsOnSecurity.</p></div>\n<p>The pricing for Genesis bots ranged quite a bit, but in general bots with large amounts of passwords and authentication cookies &#8212; or those with access to specific financial websites such as <strong>PayPal</strong> and <strong>Coinbase</strong> &#8212; tended to fetch far higher prices.</p>\n<p>New York based cyber intelligence firm <a href=\"https://www.flashpoint-intel.com\" target=\"_blank\" rel=\"noopener\">Flashpoint</a> says that in addition to containing a large number of resources, the most expensive bots overwhelmingly seem to have access to accounts that are easy to monetize.</p>\n<p>&#8220;The high incidence of Google and Facebook is expected, as they are such widely used platforms,&#8221; Flashpoint noted in an analysis of Genesis Market, observing that all ten of the ten most expensive bots at the time included Coinbase credentials.</p>\n<p>Genesis Market has introduced a number of cybercriminal innovations throughout its existence. Probably the best example is <strong>Genesis Security</strong>, a custom Web browser plugin which can load a Genesis bot profile so that the browser mimics virtually every important aspect of the victim&#8217;s device, from screen size and refresh rate to the unique user agent string tied to the victim&#8217;s web browser.<span id=\"more-63148\"></span></p>\n<p>Flashpoint said the administrators of Genesis Market claim they are a team of specialists with &#8220;extensive experience in the field of systems metrics.&#8221; They say they developed the Genesis Security software by analyzing the top forty-seven browser fingerprinting and tracking systems, as well as those utilized by 283 different banking and payment systems.</p>\n<p>Cybersecurity experts say Genesis and a handful of other bot shops are also popular among cybercriminals who work to identify and purchase bots inside corporate networks, and then turn around and resell that access to ransomware gangs.</p>\n<p><strong>Michael Debolt</strong>, chief intelligence officer for <a href=\"https://www.intel471.com\" target=\"_blank\" rel=\"noopener\">Intel 471,</a> said so-called &#8220;network access brokers&#8221; will scour automated bot shops for high value targets, and then resell them for a bigger profit.</p>\n<p>&#8220;From &#8216;used&#8217; or &#8216;processed&#8217; logs — it is actually quite common for the same log to be used by multiple different actors who are all using it for different purposes &#8211; for instance, some actors are only interested in crypto wallet or banking credentials so they bypass credentials that network access brokers are interested in,&#8221; Debolt said. &#8220;These network access brokers buy these &#8216;used&#8217; logs for very cheap (or sometimes for free) and search for big fish targets from there.&#8221;</p>\n<p>In June 2021, hackers who broke into and stole a wealth of source code and game data from the computer gaming giant EA <a href=\"https://www.vice.com/en/article/n7b3jm/genesis-market-buy-cookies-slack\" target=\"_blank\" rel=\"noopener\">told Motherboard</a> they gained access by purchasing a $10 bot from Genesis Market that let them log into a company Slack account.</p>\n<p>One feature of Genesis that sets it apart from other bot shops is that customers can retain access to infected systems in real-time, so that if the rightful owner of an infected system creates a new account online, those new credentials will get stolen and displayed in the web-based panel of the Genesis customer who purchased that bot.</p>\n<p>&#8220;While some infostealers are designed to remove themselves after execution, others create persistent access,&#8221; reads a March 2023 report from cybersecurity firm <strong>SpyCloud</strong>. &#8220;That means bad actors have access to the current data for as long as the device remains infected, even if the user changes passwords.&#8221;</p>\n<p>SpyCloud says Genesis even advertises its commitment to keep the stolen data and the compromised systems’ fingerprints up to date.</p>\n<p>&#8220;According to our research, Genesis Market had more than 430,000 stolen identities for sale as of early last year – and there are many other marketplaces like this one,&#8221; the SpyCloud report concludes.</p>\n<p>It appears this week&#8217;s action targeted only the clear web versions of Genesis Market, and that the store is still operating on a dark web address that is only reachable through <a href=\"https://en.wikipedia.org/wiki/Tor_(network)\" target=\"_blank\" rel=\"noopener\">the Tor network</a>. In today&#8217;s press briefing, DOJ officials said their investigation is ongoing, and that actions taken already have allowed them to disrupt Genesis in a way that may not be readily apparent.</p>\n<p>In a blog post today, security firm <a href=\"https://www.trellix.com/en-us/about/newsroom/stories/research/genesis-market-no-longer-feeds-the-evil-cookie-monster.html\" target=\"_blank\" rel=\"noopener\">Trellix said</a> it was approached by the Dutch Police, who were seeking assistance with the analysis and detection of the malicious files linked to Genesis Market.</p>\n<p>&#8220;The primary goal was to render the market&#8217;s scripts and binaries useless,&#8221; Trellix researchers wrote.</p>\n<p>As described in the Trellix blog, a major part of this effort against Genesis Market involves targeting its suppliers, or cybercriminals who are constantly feeding the market with freshly-stolen bot data. The company says Genesis partnered with multiple cybercriminals responsible for selling, distributing and maintaining different strains of infostealer malware, including malware families such as <a href=\"https://krebsonsecurity.com/tag/raccoon-stealer/\" target=\"_blank\" rel=\"noopener\">Raccoon Stealer</a>.</p>\n<p>&#8220;Over the years, Genesis Market has worked with a large variety of malware families to infect victims, where their info stealing scripts were used to steal information, which was used to populate the Genesis Market store,&#8221; the Trellix researchers continued. &#8220;It comes as no surprise that the malware families linked to Genesis Market belong to the usual suspects of common info-stealers, like AZORult, Raccoon, Redline and DanaBot. In February 2023, Genesis Market started to actively recruit sellers. We believe with a moderate level of confidence that this was done to keep up with the growing demand of their users.&#8221;</p>\n<p>How does one&#8217;s computer become a bot in one of these fraud networks? Infostealers are continuously mass-deployed via several methods, including malicious attachments in email; manipulating search engine results for popular software titles; and malware that is secretly attached to legitimate software made available for download via software crack websites and file-sharing networks.</p>\n<p><strong>John Fokker</strong>, head of threat intelligence at Trellix, told KrebsOnSecurity that the Dutch Police tracked down several people whose data was for sale on Genesis Market, and discovered that the victims had installed infostealer malware that was bundled with pirated software.</p>\n<p>The Dutch Police <a href=\"https://www.politie.nl/en/information/checkyourhack.html\" target=\"_blank\" rel=\"noopener\">have stood up a website</a> that lets visitors check whether their information was part of the stolen data for sale on Genesis. <strong>Troy Hunt</strong>&#8216;s <a href=\"https://www.troyhunt.com/seized-genesis-market-data-is-now-searchable-in-have-i-been-pwned-courtesy-of-the-fbi-and-operation-cookie-monster/\" target=\"_blank\" rel=\"noopener\">Have I Been Pwned website</a> is also offering a lookup service based on data seized by the FBI.</p>\n<p><strong>Ruben van Well</strong>, team leader of the Dutch police cybercrime unit in Rotterdam, said more than 800,000 visitors have already checked their website, and that more than 2,000 of those visitors were alerted to active infostealer malware infections.</p>\n<p>Van Well said Dutch authorities executed at least 17 arrests in connection with the investigation so far. He added that while the cybercriminals running Genesis Market promised their customers that user account security was a high priority, the service stored all of its data in plain text.</p>\n<p>&#8220;If users would say can you please delete my account, they&#8217;d do it, but we can still see in the logs that they asked for that,&#8221; van Well said. &#8220;Genesis Market was not very good at protecting the security of its users, which made a mess for them but it&#8217;s been great for law enforcement.&#8221;</p>\n<p>According to the Dutch Police, Microsoft this morning shipped an update to supported Windows computers that can remove infections from infostealer malware families associated with Genesis Market.</p>\n<p>The Dutch computer security firm <strong>Computest</strong> worked with Trellix and the Dutch Police to analyze the Genesis Market malware. Their highly technical deep-dive is available <a href=\"https://sector7.computest.nl/post/2023-04-technical-analysis-genesis-market/\" target=\"_blank\" rel=\"noopener\">here</a>.</p>\n<p>This is a developing story. Any updates will be added with notice and timestamp here.</p>\n<p><strong>Apr. 5, 11:00 am ET:</strong> Added statement from Justice Department, and background from a press briefing this morning.</p>\n<p><strong>Apr. 5, 12:24 pm ET:</strong> Added perspective from Trellix, and context from DOJ officials.</p>\n<p><strong>Apr. 5, 1:27 pm ET:</strong> Added links to lookup services by the Dutch Police and Troy Hunt.</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/04/fbi-seizes-bot-shop-genesis-market-amid-arrests-targeting-operators-suppliers/feed/","slash:comments":"24"},{"title":"A Serial Tech Investment Scammer Takes Up Coding?","link":"https://krebsonsecurity.com/2023/04/a-serial-tech-investment-scammer-takes-up-coding/","comments":"https://krebsonsecurity.com/2023/04/a-serial-tech-investment-scammer-takes-up-coding/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Mon, 03 Apr 2023 16:13:42 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"Breadcrumbs"},{"#cdata-section":"Ne'er-Do-Well News"},{"#cdata-section":"Alan John Mykhailov"},{"#cdata-section":"Blackstone Corporate Alliance Ltd"},{"#cdata-section":"CodesToYou"},{"#cdata-section":"Colette Davies"},{"#cdata-section":"David Bruno"},{"#cdata-section":"DomainTools.com"},{"#cdata-section":"Drydennow.com"},{"#cdata-section":"Igor Gubskyi"},{"#cdata-section":"Igor Hubskyi"},{"#cdata-section":"Iryna Davies"},{"#cdata-section":"John Bernard"},{"#cdata-section":"John Clifton Davies"},{"#cdata-section":"Maria Yakovleva"},{"#cdata-section":"Mariya Kulikova"},{"#cdata-section":"MySolve"},{"#cdata-section":"SafeSwiss Secure Communication AG"},{"#cdata-section":"Secure Swiss Data"},{"#cdata-section":"The Inside Knowledge GmbH"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63152"},"description":{"#cdata-section":"John Clifton Davies, a 60-year-old con man from the United Kingdom who fled the country in 2015 before being sentenced to 12 years in prison for fraud, has enjoyed a successful life abroad swindling technology startups by pretending to be a billionaire investor. Davies' newest invention appears to be \"CodesToYou,\" which purports to be a \"full cycle software development company\" based in the U.K."},"content:encoded":{"#cdata-section":"<p><strong>John Clifton Davies</strong>, a 60-year-old con man from the United Kingdom who fled the country in 2015 before being sentenced to 12 years in prison for fraud, has enjoyed a successful life abroad swindling technology startups by pretending to be a billionaire investor. Davies&#8217; newest invention appears to be &#8220;<strong>CodesToYou</strong>,&#8221; which purports to be a &#8220;full cycle software development company&#8221; based in the U.K.</p>\n<div id=\"attachment_53032\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-53032\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-53032\" src=\"https://krebsonsecurity.com/wp-content/uploads/2020/09/Bernard-sbs.png\" alt=\"\" width=\"750\" height=\"397\" /><p id=\"caption-attachment-53032\" class=\"wp-caption-text\">The scam artist John Bernard a.k.a. Alan John Mykailov (left) in a recent Zoom call, and a mugshot of John Clifton Davies from nearly a decade earlier.</p></div>\n<p>Several articles here have delved into the history of <strong>John Bernard</strong>, the pseudonym used by a fake billionaire technology investor who <a href=\"https://krebsonsecurity.com/2020/10/promising-infusions-of-cash-fake-investor-john-bernard-walked-away-with-30m/\" target=\"_blank\" rel=\"noopener\">tricked dozens of startups into giving him tens of millions of dollars</a>.</p>\n<p>John Bernard&#8217;s real name is John Clifton Davies, a convicted fraudster from the United Kingdom who is currently a fugitive from justice. For several years until reinventing himself again quite recently, Bernard pretended to be a billionaire Swiss investor who made his fortunes in the dot-com boom 20 years ago.</p>\n<p>&#8220;<a href=\"https://web.archive.org/web/20200917102043/https://the-private-office.ch/\" target=\"_blank\" rel=\"noopener\">The Private Office of John Bernard</a>&#8221; let it be known to investment brokers that he had tens of millions of dollars to invest in tech startups, and he attracted a stream of new victims by offering extraordinarily generous finder’s fees to brokers who helped him secure new clients. But those brokers would eventually get stiffed because Bernard’s company would never consummate a deal.</p>\n<div id=\"attachment_53031\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-53031\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-53031\" src=\"https://krebsonsecurity.com/wp-content/uploads/2020/09/privateoffice.png\" alt=\"\" width=\"750\" height=\"517\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2020/09/privateoffice.png 853w, https://krebsonsecurity.com/wp-content/uploads/2020/09/privateoffice-768x529.png 768w\" sizes=\"(max-width: 750px) 100vw, 750px\" /><p id=\"caption-attachment-53031\" class=\"wp-caption-text\">John Bernard&#8217;s former website, where he pretended to be a billionaire tech investor.</p></div>\n<p>Bernard would promise to invest millions in tech startups, and then insist that companies <a href=\"https://krebsonsecurity.com/2020/09/due-diligence-that-money-cant-buy/\" target=\"_blank\" rel=\"noopener\">pay tens of thousands of dollars worth of due diligence fees up front</a>. However, the due diligence company he insisted on using — another Swiss firm called <strong>The Inside Knowledge GmbH</strong> — also was secretly owned by Bernard, who would invariably <a href=\"https://krebsonsecurity.com/2020/09/who-is-tech-investor-john-bernard/\" target=\"_blank\" rel=\"noopener\">pull out of the deal after receiving the due diligence money</a>.</p>\n<p>A variety of clues suggest Davies has recently adopted at least one other identity &#8212; <strong>Alan John Mykhailov</strong> &#8212; who is listed as chairman of a British concern called <strong>CodesToYou LTD</strong>, incorporated in May 2022. The CodesToYou website says the company employs talented coders in several countries, and that its programmers offer &#8220;your ultimate balance between speed, cost and quality.&#8221;</p>\n<div id=\"attachment_63230\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63230\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-63230\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/codestoyouteam.png\" alt=\"\" width=\"751\" height=\"517\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/codestoyouteam.png 1131w, https://krebsonsecurity.com/wp-content/uploads/2023/03/codestoyouteam-768x529.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/03/codestoyouteam-782x539.png 782w, https://krebsonsecurity.com/wp-content/uploads/2023/03/codestoyouteam-100x70.png 100w\" sizes=\"(max-width: 751px) 100vw, 751px\" /><p id=\"caption-attachment-63230\" class=\"wp-caption-text\">The team from CodesToYou.</p></div>\n<p>In response to questions from KrebsOnSecurity, CodesToYou&#8217;s marketing manager &#8212; who gave their name only as &#8220;Zhena&#8221; &#8212; said the company was not affiliated with any John Bernard or John Clifton Davies, and maintained that CodesToYou is a legitimate enterprise.</p>\n<p>But publicly available information about this company and its leadership suggests otherwise. Official <a href=\"https://find-and-update.company-information.service.gov.uk/company/12219758/officers\" target=\"_blank\" rel=\"noopener\">incorporation documents</a> from the U.K.&#8217;s <strong>Companies House</strong> represent that CodesToYou is headed by an Alan John Mykhailov, a British citizen born in March 1958.</p>\n<p>Companies House says Mykhailov is an officer in three other companies, including one called <strong>Blackstone Corporate Alliance Ltd</strong>. According to the Swiss business tracking service <a href=\"https://business-monitor.ch/en/companies/717576-the-inside-knowledge-gmbh-in-liquidation\" target=\"_blank\" rel=\"noopener\">business-monitor.ch</a>, Blackstone Corporate Alliance Ltd. is currently the entity holding a decision-making role in John Bernard&#8217;s fake due diligence company &#8212; The Inside Knowledge GmbH &#8212; which is <a href=\"https://web.archive.org/web/20201208035644/https://the-private-office.ch/\" target=\"_blank\" rel=\"noopener\">now in liquidation</a>.</p>\n<div id=\"attachment_63282\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/johnbernardarchive.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-63282\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-63282\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/johnbernardarchive.png\" alt=\"\" width=\"750\" height=\"426\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/johnbernardarchive.png 1242w, https://krebsonsecurity.com/wp-content/uploads/2023/04/johnbernardarchive-768x436.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/04/johnbernardarchive-782x444.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\" /></a><p id=\"caption-attachment-63282\" class=\"wp-caption-text\">A screen shot of the stock photos and corporate-speak on John Bernard&#8217;s old website. Image: Archive.org</p></div>\n<p>Also listed as a partner in Blackstone Corporate Alliance Limited is <strong>Igor Hubskyi</strong> (a.k.a. Igor Gubskyi), a Ukrainian man who was <a href=\"https://www.monetas.ch/de/684/Donn%C3%A9es-personnelles-Ihor-Hubskyi-UKRAINE-Kiew.htm?ident=1RVUi1vB%2B4o%2BKL0xwGXMWnSwCiE%2BX9D%2FstMCtwHkLBs%3D\" target=\"_blank\" rel=\"noopener\">previously president of The Inside Knowledge GmbH</a>.</p>\n<p>The CodesToYou website says the company&#8217;s marketing team lead is <strong>Maria Yakovleva</strong>, and the photo of this employee matches the profile for the <a href=\"https://www.linkedin.com/in/maria-y-84b58248/\" target=\"_blank\" rel=\"noopener\">LinkedIn account name &#8220;Maria Y.&#8221;</a> That same LinkedIn profile and photo previously listed Maria by a different first and last name &#8212; <strong>Mariya Kulikova</strong>; back then, <a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/m-kulikova.png\" target=\"_blank\" rel=\"noopener\">Ms. Kulikova&#8217;s LinkedIn profile</a> said she was an executive assistant in The Private Office of Mr. John Bernard.</p>\n<p>Companies House lists Alan John Mykhailov as a current officer in two other companies, including <a href=\"https://find-and-update.company-information.service.gov.uk/company/13813302\" target=\"_blank\" rel=\"noopener\">Frisor Limited</a>, and <a href=\"https://find-and-update.company-information.service.gov.uk/company/14191897\" target=\"_blank\" rel=\"noopener\">Ardelis Solutions Limited</a>. <a href=\"https://web.archive.org/web/20210730143454/https://ardelissolutions.com/\" target=\"_blank\" rel=\"noopener\">A cached copy of the now-defunct Ardelis Solutions website</a> says it was a private equity firm.</p>\n<p>CodesToYou&#8217;s Maria also included Ardelis Solutions in the work history section of her LinkedIn resume. That is, until being contacted by this author on LinkedIn, after which Maria&#8217;s profile picture and any mention of Ardelis Solutions were deleted.<span id=\"more-63152\"></span></p>\n<p>Listed as head of business development at CodesToYou is <strong>David Bruno</strong>, a Canadian man whose <a href=\"https://www.linkedin.com/in/david-bruno-62864512/\" target=\"_blank\" rel=\"noopener\">LinkedIn profile</a> says he is founder of an organization called &#8220;World Privacy Resource.&#8221; As KrebsOnSecurity reported in 2020, Bruno was at the time promoting himself as the co-CEO of a company called <strong>SafeSwiss Secure Communication AG</strong>, and the founder of another tech startup called <strong>Secure Swiss Data</strong>.</p>\n<p>Secure Swiss Data&#8217;s domain &#8212; secureswissdata.com &#8212; is a Swiss concern that sells encrypted email and data services. According to <a href=\"https://www.domaintools.com\" target=\"_blank\" rel=\"noopener\">DomainTools.com</a>, that website name was registered in 2015 by The Inside Knowledge GmbH. In February 2020, a press release announced that Secure Swiss Data was purchased in an &#8220;undisclosed multimillion buyout&#8221; by SafeSwiss Secure Communication AG.</p>\n<div id=\"attachment_63283\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/ardelisarchive.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-63283\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-63283\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/ardelisarchive.png\" alt=\"\" width=\"749\" height=\"345\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/04/ardelisarchive.png 1450w, https://krebsonsecurity.com/wp-content/uploads/2023/04/ardelisarchive-768x354.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/04/ardelisarchive-782x360.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /></a><p id=\"caption-attachment-63283\" class=\"wp-caption-text\">A cached copy of the Ardelis Solutions website, which said it was a private equity firm and included similar stock images as John Bernard&#8217;s investment website.</p></div>\n<p>When reached in 2020 and asked about his relationship to Mr. Bernard, Mr. Bruno said the two were business partners and that he couldn&#8217;t imagine that Mr. Bernard would be involved in anything improper. To this day Mr. Bruno is the only person I&#8217;ve spoken to who has had <a href=\"https://krebsonsecurity.com/2020/09/due-diligence-that-money-cant-buy/\" target=\"_blank\" rel=\"noopener\">anything positive to say about Mr. Bernard</a>.</p>\n<p>Mr. Bruno did not respond to requests for comment this time around, but his LinkedIn profile no longer makes any mention of Secure Swiss Data or SafeSwiss &#8212; both companies he claimed to run for many years. Nor does it mention CodesToYou. However, Mr. Bruno&#8217;s former company SafeSwiss <em>is</em> listed as one of the six &#8220;portfolio&#8221; companies whose services are promoted on the CodesToYou website.</p>\n<p>In mid-2021, Bruno announced he was running for public office in Ontario.</p>\n<p>&#8220;The Kenora resident is no stranger to the government as he contributed to Canada’s new Digital Charter, Bill C-11, which is a new Cyber Security policy,&#8221; <a href=\"https://www.drydennow.com/articles/david-bruno-announced-liberal-candidacy-for-kenora-riding\" target=\"_blank\" rel=\"noopener\">reported Drydennow.com</a>, a news website that covers Northwestern Ontario. Drydennow says the next federal election is expected to be held on or before Oct. 16, 2023.</p>\n<p>John Clifton Davies was <a href=\"https://www.heart.co.uk/fourcounties/news/local/mk-man-convicted-of-mass-fraud/\" target=\"_blank\" rel=\"noopener\">convicted in 2015</a> of swindling businesses throughout the U.K. that were struggling financially and seeking to restructure their debt. For roughly six years, Davies ran a series of firms that pretended to offer insolvency services, but instead simply siphoned what little remaining money these companies had.</p>\n<p>The very first entity mentioned in the technology portfolio advertised on the CodesToYou website is called &#8220;<strong>MySolve</strong>,&#8221; and it purports to offer a &#8220;multi-feature platform for insolvency practitioners.&#8221;</p>\n<p>Mr. Davies&#8217; fourth wife, <strong>Iryna Davies</strong>, is listed as a director of one of the insolvency consulting businesses in the U.K. that was part of John Davies’ 2015 fraud conviction. Prior to his trial for fraud, Davies served 16 months in jail before <a href=\"https://www.bbc.com/news/uk-wales-21850549\" target=\"_blank\" rel=\"noopener\">being cleared</a> of murdering his third wife on their honeymoon in India: <strong>Colette Davies</strong>, 39, died after falling 80 feet from a viewing point at a steep gorge in the Himachal Pradesh region of India.</p>\n<p>Mr. Davies was charged with murder and fraud after he attempted to collect GBP 132,000 in her life insurance payout, but British prosecutors ultimately conceded they did not have enough evidence to convict him.</p>\n<p>The scams favored by Davies and his alter egos are smart because he never approaches investors directly; rather, investors are incentivized to put his portfolio in front of tech firms seeking financial backing. And all the best cons begin as an idea or possibility planted in the target’s mind.</p>\n<p>It&#8217;s also a reliable scam because companies bilked by small-time investment schemes rarely pursue legal action, mainly because the legal fees involved can quickly surpass the losses. On top of that, many victims will likely be too ashamed to admit their duping. Victims who do press their case in court and win then face the daunting challenge of collecting damages from a slew of ephemeral shell corporations.</p>\n<p>The latest Bernard victim to speak publicly — a Norwegian company hoping to build a fleet of environmentally friendly shipping vessels — is now <a href=\"https://krebsonsecurity.com/2022/01/fake-investor-john-bernard-sinks-norwegian-green-shipping-dreams/\" target=\"_blank\" rel=\"noopener\">embroiled in a lawsuit over a deal gone bad</a>. As part of that scam, Bernard falsely claimed to have secured $100 million from six other wealthy investors, including the founder of <strong>Uber</strong> and the artist <strong>Abel Makkonen Tesfaye</strong>, better known as <strong>The Weeknd</strong>.</p>\n<div class=\"entry-content\">\n<p>If you liked this story, check out my previous reporting on John Bernard/Davies:</p>\n<p><a href=\"https://krebsonsecurity.com/2020/09/due-diligence-that-money-cant-buy/\" target=\"_blank\" rel=\"noopener\">Due Diligence That Money Can’t Buy</a></p>\n<p><a href=\"https://krebsonsecurity.com/2020/09/who-is-tech-investor-john-bernard/\" target=\"_blank\" rel=\"noopener\">Who is Tech Investor John Bernard?</a></p>\n<p><a href=\"https://krebsonsecurity.com/2020/10/promising-infusions-of-cash-fake-investor-john-bernard-walked-away-with-30m/\" target=\"_blank\" rel=\"noopener\">Promising Infusions of Cash, Fake Investor John Bernard Walked Away With $30 Million</a></p>\n<p><a href=\"https://krebsonsecurity.com/2021/05/investment-scammer-john-davies-reinvents-himself/\" target=\"_blank\" rel=\"noopener\">Investment Scammer John Davies Reinvents Himself?</a></p>\n<p><a href=\"https://krebsonsecurity.com/2022/01/fake-investor-john-bernard-sinks-norwegian-green-shipping-dreams/\" target=\"_blank\" rel=\"noopener\">Fake Investor John Bernard Sinks Norwegian Green Shipping Dreams</a></p>\n</div>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/04/a-serial-tech-investment-scammer-takes-up-coding/feed/","slash:comments":"9"},{"title":"German Police Raid DDoS-Friendly Host ‘FlyHosting’","link":"https://krebsonsecurity.com/2023/03/german-police-raid-ddos-friendly-host-flyhosting/","comments":"https://krebsonsecurity.com/2023/03/german-police-raid-ddos-friendly-host-flyhosting/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Fri, 31 Mar 2023 18:35:15 +0000","category":[{"#cdata-section":"DDoS-for-Hire"},{"#cdata-section":"Ne'er-Do-Well News"},{"#cdata-section":"ddos-for-hire"},{"#cdata-section":"FlyHosting"},{"#cdata-section":"German Federal Criminal Police Office"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63189"},"description":{"#cdata-section":"Authorities in Germany this week seized Internet servers that powered FlyHosting, a dark web service that catered to cybercriminals operating DDoS-for-hire services. Fly Hosting first advertised on cybercrime forums in November 2022, saying it was a Germany-based hosting firm that was open for business to anyone looking for a reliable place to host malware, botnet controllers, or DDoS-for-hire infrastructure."},"content:encoded":{"#cdata-section":"<p>Authorities in Germany this week seized Internet servers that powered <strong>FlyHosting</strong>, a dark web offering that catered to cybercriminals operating DDoS-for-hire services, KrebsOnSecurity has learned. FlyHosting first advertised on cybercrime forums in November 2022, saying it was a Germany-based hosting firm that was open for business to anyone looking for a reliable place to host malware, botnet controllers, or DDoS-for-hire infrastructure.</p>\n<div id=\"attachment_63256\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63256\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-63256\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/flyhostingseizure.png\" alt=\"\" width=\"749\" height=\"414\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/flyhostingseizure.png 1124w, https://krebsonsecurity.com/wp-content/uploads/2023/03/flyhostingseizure-768x424.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/03/flyhostingseizure-782x432.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /><p id=\"caption-attachment-63256\" class=\"wp-caption-text\">A seizure notice left on the FlyHosting domains.</p></div>\n<p>A <a href=\"https://www.presseportal.de/blaulicht/pm/4356\" target=\"_blank\" rel=\"noopener\">statement</a> released today by the German Federal Criminal Police Office says they served eight search warrants on March 30, and identified five individuals aged 16-24 suspected of operating &#8220;an internet service&#8221; since mid-2021. The German authorities did not name the suspects or the Internet service in question.</p>\n<p>&#8220;Previously unknown perpetrators used the Internet service provided by the suspects in particular for so-called &#8216;DDoS attacks&#8217;, i.e. the simultaneous sending of a large number of data packets via the Internet for the purpose of disrupting other data processing systems,&#8221; the statement reads.</p>\n<p>News of a raid on FlyHosting first surfaced Thursday in a <strong>Telegram</strong> chat channel that is frequented by people interested or involved in the DDoS-for-hire industry, where a user by the name Dstatcc broke the news to FlyHosting customers:</p>\n<p>&#8220;So Flyhosting made a &#8216;migration&#8217; with it[s] systems to new rooms of the police ;),&#8221; the warning read. &#8220;Police says: They support ddos attacks, C&amp;C/C2 and stresser a bit too much. We expect the police will take a deeper look into the files, payment logs and IP&#8217;s. If you had a server from them and they could find &#8216;bad things&#8217; connected with you (payed with private paypal) you may ask a lawyer.&#8221;</p>\n<div id=\"attachment_63255\" style=\"width: 784px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63255\" decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-63255\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/flyhosting.png\" alt=\"\" width=\"774\" height=\"733\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/flyhosting.png 774w, https://krebsonsecurity.com/wp-content/uploads/2023/03/flyhosting-768x727.png 768w\" sizes=\"(max-width: 774px) 100vw, 774px\" /><p id=\"caption-attachment-63255\" class=\"wp-caption-text\">An ad for FlyHosting posted by the the user &#8220;bnt&#8221; on the now-defunct cybercrime forum BreachForums. Image: Ke-la.com.</p></div>\n<p>The German authorities said that as a result of the DDoS attacks facilitated by the defendants, the websites of various companies as well as those of the Hesse police have been overloaded in several cases since mid-2021, &#8220;so that they could only be operated to a limited extent or no longer at times.&#8221;</p>\n<p>The statement says police seized mobile phones, laptops, tablets, storage media and handwritten notes from the unnamed defendants, and confiscated servers operated by the suspects in Germany, Finland and the Netherlands.</p>\n<p>In response to questions from KrebsOnSecurity, Germany&#8217;s Hessen Police confirmed that the seizures were executed against FlyHosting.</p>\n<p>The raids on FlyHosting come amid a broader law enforcement crackdown on DDoS-for-hire services internationally. The U.K.&#8217;s National Crime Agency announced last week that it&#8217;s been busy <a href=\"https://krebsonsecurity.com/2023/03/uk-sets-up-fake-booter-sites-to-muddy-ddos-market/\" target=\"_blank\" rel=\"noopener\">setting up phony DDoS-for-hire websites</a> that seek to collect information on users, remind them that launching DDoS attacks is illegal, and generally increase the level of paranoia for people looking to hire such services.</p>\n<p>In mid-December 2022, the U.S. Department of Justice (DOJ) announced “<a href=\"https://krebsonsecurity.com/2022/12/six-charged-in-mass-takedown-of-ddos-for-hire-sites/\" target=\"_blank\" rel=\"noopener\">Operation Power Off</a>,” which seized four-dozen DDoS-for-hire domains responsible for more than 30 million DDoS attacks, and charged six U.S. men with computer crimes related to their alleged ownership of popular DDoS-for-hire services.</p>\n<p><strong>Update, April 3, 9:30 a.m. ET:</strong> Added confirmation from Hesse Police.</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/german-police-raid-ddos-friendly-host-flyhosting/feed/","slash:comments":"9"},{"title":"UK Sets Up Fake Booter Sites To Muddy DDoS Market","link":"https://krebsonsecurity.com/2023/03/uk-sets-up-fake-booter-sites-to-muddy-ddos-market/","comments":"https://krebsonsecurity.com/2023/03/uk-sets-up-fake-booter-sites-to-muddy-ddos-market/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Tue, 28 Mar 2023 17:26:07 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"DDoS-for-Hire"},{"#cdata-section":"Web Fraud 2.0"},{"#cdata-section":"booter"},{"#cdata-section":"ddos-for-hire"},{"#cdata-section":"National Crime Agency"},{"#cdata-section":"Operation Power Off"},{"#cdata-section":"stresser"},{"#cdata-section":"U.S. Department of Justice"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63197"},"description":{"#cdata-section":"The United Kingdom's National Crime Agency (NCA) has been busy setting up phony DDoS-for-hire websites that seek to collect information on users, remind them that launching DDoS attacks is illegal, and generally increase the level of paranoia for people looking to hire such services. "},"content:encoded":{"#cdata-section":"<p>The United Kingdom&#8217;s <strong>National Crime Agency</strong> (NCA) has been busy setting up phony DDoS-for-hire websites that seek to collect information on users, remind them that launching DDoS attacks is illegal, and generally increase the level of paranoia for people looking to hire such services.</p>\n<div id=\"attachment_63209\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63209\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-63209\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/ncabootersplash.png\" alt=\"\" width=\"751\" height=\"423\" /><p id=\"caption-attachment-63209\" class=\"wp-caption-text\">The warning displayed to users on one of the NCA&#8217;s fake booter sites. Image: NCA.</p></div>\n<p>The NCA says all of its fake so-called &#8220;booter&#8221; or &#8220;stresser&#8221; sites &#8212; which have so far been accessed by several thousand people &#8212; have been created to look like they offer the tools and services that enable cyber criminals to execute these attacks.</p>\n<p>&#8220;However, after users register, rather than being given access to cyber crime tools, their data is collated by investigators,&#8221; reads an NCA advisory on the program. &#8220;Users based in the UK will be contacted by the National Crime Agency or police and warned about engaging in cyber crime. Information relating to those based overseas is being passed to international law enforcement.&#8221;</p>\n<p>The NCA declined to say how many phony booter sites it had set up, or for how long they have been running. The NCA says hiring or launching attacks designed to knock websites or users offline is punishable in the UK under the Computer Misuse Act 1990.</p>\n<p>&#8220;Going forward, people who wish to use these services can&#8217;t be sure who is actually behind them, so why take the risk?&#8221; the NCA announcement continues.</p>\n<p>The NCA campaign comes closely on the heels of an international law enforcement takedown involving four-dozen websites that made powerful DDoS attacks a point-and-click operation.<span id=\"more-63197\"></span></p>\n<p>In mid-December 2022, the <strong>U.S. Department of Justice</strong> (DOJ) announced &#8220;<a href=\"https://krebsonsecurity.com/2022/12/six-charged-in-mass-takedown-of-ddos-for-hire-sites/\" target=\"_blank\" rel=\"noopener\">Operation Power Off,</a>&#8221; which seized four-dozen booter business domains responsible for more than 30 million DDoS attacks, and charged six U.S. men with computer crimes related to their alleged ownership of popular DDoS-for-hire services. In connection with that operation, the NCA also arrested an 18-year-old man suspected of running one of the sites.</p>\n<p>According to U.S. federal prosecutors, the use of booter and stresser services to conduct attacks is punishable under both wire fraud laws and the Computer Fraud and Abuse Act (18 U.S.C. § 1030), and may result in arrest and prosecution, the seizure of computers or other electronics, as well as prison sentences and a penalty or fine.</p>\n<p>The United Kingdom, which has been battling its fair share of domestic booter bosses, <a href=\"https://krebsonsecurity.com/2020/05/uk-ad-campaign-seeks-to-deter-cybercrime/\" target=\"_blank\" rel=\"noopener\">started running online ads in 2020</a> aimed at young people who search the Web for booter services.</p>\n<p>As part of last year&#8217;s mass booter site takedown, the FBI and the Netherlands Police joined the NCA in announcing they are running targeted placement ads to steer those searching for booter services toward <a href=\"https://www.fbi.gov/contact-us/field-offices/anchorage/fbi-intensify-efforts-to-combat-illegal-ddos-attacks\" target=\"_blank\" rel=\"noopener\">a website detailing the potential legal risks of hiring an online attack</a>.</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/uk-sets-up-fake-booter-sites-to-muddy-ddos-market/feed/","slash:comments":"37"},{"title":"Google Suspends Chinese E-Commerce App Pinduoduo Over Malware","link":"https://krebsonsecurity.com/2023/03/google-suspends-chinese-e-commerce-app-pinduoduo-over-malware/","comments":"https://krebsonsecurity.com/2023/03/google-suspends-chinese-e-commerce-app-pinduoduo-over-malware/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Wed, 22 Mar 2023 23:11:08 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"Data Breaches"},{"#cdata-section":"Latest Warnings"},{"#cdata-section":"Web Fraud 2.0"},{"#cdata-section":"BreachForums"},{"#cdata-section":"ByteDance"},{"#cdata-section":"DarkNavy"},{"#cdata-section":"google"},{"#cdata-section":"Liu Huafang"},{"#cdata-section":"PDD Holdings"},{"#cdata-section":"Pinduoduo"},{"#cdata-section":"Project Zero"},{"#cdata-section":"Temu"},{"#cdata-section":"Tiktok"},{"#cdata-section":"Weibo"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63156"},"description":{"#cdata-section":"Google says it has suspended the app for the Chinese e-commerce giant Pinduoduo after malware was found in versions of the app. The move comes just weeks after Chinese security researchers published an analysis suggesting the popular e-commerce app sought to seize total control over affected devices by exploiting multiple security vulnerabilities in a variety of Android-based smartphones."},"content:encoded":{"#cdata-section":"<p><strong>Google</strong> says it has suspended the app for the Chinese e-commerce giant <strong>Pinduoduo </strong>after malware was found in versions of the software. The move comes just weeks after Chinese security researchers published an analysis suggesting the popular e-commerce app sought to seize total control over affected devices by exploiting multiple security vulnerabilities in a variety of Android-based smartphones.</p>\n<p>In November 2022, researchers at Google&#8217;s <a href=\"https://googleprojectzero.blogspot.com/2022/11/a-very-powerful-clipboard-samsung-in-the-wild-exploit-chain.html\" target=\"_blank\" rel=\"noopener\">Project Zero warned</a> about active attacks on <strong>Samsung</strong> mobile phones which chained together three security vulnerabilities that Samsung patched in March 2021, and which would have allowed an app to add or read any files on the device.</p>\n<p>Google said it believes the exploit chain for Samsung devices belonged to a &#8220;commercial surveillance vendor,&#8221; without elaborating further. The <a href=\"https://googleprojectzero.blogspot.com/2022/11/a-very-powerful-clipboard-samsung-in-the-wild-exploit-chain.html\" target=\"_blank\" rel=\"noopener\">highly technical writeup</a> also did not name the malicious app in question.</p>\n<p>On Feb. 28, 2023, researchers at the Chinese security firm <strong>DarkNavy</strong> published <a href=\"https://mp.weixin.qq.com/s/P_EYQxOEupqdU0BJMRqWsw\" target=\"_blank\" rel=\"noopener\">a blog post</a> purporting to show evidence that a major Chinese ecommerce company&#8217;s app was using this same three-exploit chain to read user data stored by other apps on the affected device, and to make its app nearly impossible to remove.</p>\n<p>DarkNavy likewise did not name the app they said was responsible for the attacks. In fact, the researchers took care to redact the name of the app from multiple code screenshots published in their writeup. DarkNavy did not respond to requests for clarification.</p>\n<p>&#8220;At present, a large number of end users have complained on multiple social platforms,&#8221; reads a translated version of the DarkNavy blog post. &#8220;The app has problems such as inexplicable installation, privacy leakage, and inability to uninstall.&#8221;</p>\n<p><strong>Update, March 27, 1:24 p.m. ET:</strong> <strong>Dan Goodin</strong> over at Ars Technica has <a href=\"https://arstechnica.com/information-technology/2023/03/android-app-from-china-executed-0-day-exploit-on-millions-of-devices/\" target=\"_blank\" rel=\"noopener\">an important update on this story</a> that indicates the Pinduoduo code was exploiting a zero-day vulnerability in Android &#8212; not Samsung. From that piece:</p>\n<blockquote><p>&#8220;A preliminary analysis by Lookout found that at least two off-Play versions of Pinduoduo for Android exploited CVE-2023-20963, the tracking number for an Android vulnerability <a href=\"https://source.android.com/docs/security/bulletin/2023-03-01\" data-uri=\"2f91afaefaa71366f96183d779b86ea1\">Google patched</a> in updates that became available to end users <a href=\"https://arstechnica.com/information-technology/2023/03/critical-vulnerabilities-allow-some-android-phones-to-be-hacked/\" data-uri=\"430ba8def2437cf27f66ddde273dffed\">two weeks ago</a>. This privilege-escalation flaw, which was exploited prior to Google’s disclosure, allowed the app to perform operations with elevated privileges. The app used these privileges to download code from a developer-designated site and run it within a privileged environment.</p>\n<p>&#8220;The malicious apps represent “a very sophisticated attack for an app-based malware,” Christoph Hebeisen, one of three Lookout researchers who analyzed the file, wrote in an email. “In recent years, exploits have not usually been seen in the context of mass-distributed apps. Given the extremely intrusive nature of such sophisticated app-based malware, this is an important threat mobile users need to protect against.”</p></blockquote>\n<p>On March 3, 2023, a denizen of the <a href=\"https://krebsonsecurity.com/2023/03/feds-charge-ny-man-as-breachforums-boss-pompompurin/\" target=\"_blank\" rel=\"noopener\">now-defunct cybercrime community</a> <strong>BreachForums</strong> posted a thread which noted that a unique component of the malicious app code highlighted by DarkNavy also was found in the ecommerce application whose name was apparently redacted from the DarkNavy analysis: Pinduoduo.</p>\n<div id=\"attachment_63159\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/breached-pdd.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-63159\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-63159\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/breached-pdd.png\" alt=\"\" width=\"751\" height=\"339\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/breached-pdd.png 1151w, https://krebsonsecurity.com/wp-content/uploads/2023/03/breached-pdd-768x347.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/03/breached-pdd-782x353.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /></a><p id=\"caption-attachment-63159\" class=\"wp-caption-text\">A Mar. 3, 2023 post on BreachForums, comparing the redacted code from the DarkNavy analysis with the same function in the Pinduoduo app available for download at the time.</p></div>\n<p>On March 4, 2023, e-commerce expert <strong>Liu Huafang</strong> posted on the Chinese social media network <strong>Weibo</strong> that Pinduoduo&#8217;s app was using security vulnerabilities to gain market share by stealing user data from its competitors. That Weibo post has since been deleted.</p>\n<p><a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/lihuh-1.png\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-63176 \" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/lihuh-1.png\" alt=\"\" width=\"657\" height=\"431\" /></a></p>\n<p>On March 7, the newly created Github account Davinci1010 published <a href=\"https://github.com/davinci1010/pinduoduo_backdoor\" target=\"_blank\" rel=\"noopener\">a technical analysis</a> claiming that until recently Pinduoduo&#8217;s source code included a &#8220;backdoor,&#8221; a hacking term used to describe code that allows an adversary to remotely and secretly connect to a compromised system at will.<span id=\"more-63156\"></span></p>\n<p>That analysis includes <a href=\"http://github.com/davinci1012/Pinduoduo_backdoor_unpacker\" target=\"_blank\" rel=\"noopener\">links to archived versions of Pinduoduo&#8217;s app</a> released before March 5 (version 6.50 and lower), which is when Davinci1010 says a new version of the app removed the malicious code.</p>\n<p>Pinduoduo has not yet responded to requests for comment. Pinduoduo parent company <strong>PDD Holdings</strong> told Reuters Google has not shared details about why it suspended the app.</p>\n<p>The company <a href=\"https://www.cnn.com/2023/03/21/tech/china-google-pinduoduo-malware-app-intl-hk/index.html\" target=\"_blank\" rel=\"noopener\">told CNN</a> that it strongly rejects “the speculation and accusation that Pinduoduo app is malicious just from a generic and non-conclusive response from Google,” and said there were &#8220;several apps that have been suspended from Google Play at the same time.&#8221;</p>\n<p>Pinduoduo is among China&#8217;s most popular e-commerce platforms, boasting approximately 900 million monthly active users.</p>\n<p>Most of the news coverage of Google&#8217;s move against Pinduoduo emphasizes that the malware was found in versions of the Pinduoduo app available outside of Google&#8217;s app store &#8212; <strong>Google Play</strong>.</p>\n<p>&#8220;Off-Play versions of this app that have been found to contain malware have been enforced on via Google Play Protect,&#8221; a Google spokesperson said in a statement to <a href=\"https://www.reuters.com/technology/google-suspends-chinas-pinduoduo-app-due-malware-issues-2023-03-21/\" target=\"_blank\" rel=\"noopener\">Reuters</a>, adding that the Play version of the app has been suspended for security concerns.</p>\n<p>However, Google Play is not available to consumers in China. As a result, the app will still be available via other mobile app stores catering to the Chinese market &#8212; including those operated by <strong>Huawei</strong>, <strong>Oppo</strong>, <strong>Tencent</strong> and <strong>VIVO</strong>.</p>\n<p>Google said its ban did not affect the PDD Holdings app <strong>Temu</strong>, which is an online shopping platform in the United States. According to <a href=\"https://www.washingtonpost.com/technology/2023/03/21/tiktok-ceo-profile-congress/\" target=\"_blank\" rel=\"noopener\">The Washington Post</a>, four of the Apple App Store&#8217;s 10 most-downloaded free apps are owned by Chinese companies, including Temu and the social media network <strong>TikTok</strong>.</p>\n<p>The Pinduoduo suspension comes as lawmakers in Congress this week are gearing up to grill the CEO of TikTok over national security concerns. TikTok, which is owned by Beijing-based <strong>ByteDance</strong>, said last month that it now has roughly 150 million monthly active users in the United States.</p>\n<p>A <a href=\"https://krebsonsecurity.com/2023/03/highlights-from-the-new-u-s-cybersecurity-strategy/\" target=\"_blank\" rel=\"noopener\">new cybersecurity strategy</a> released earlier this month by the Biden administration singled out China as the greatest cyber threat to the U.S. and Western interests. The strategy says China now presents the &#8220;broadest, most active, and most persistent threat to both government and private sector networks,” and says China is “the only country with both the intent to reshape the international order and, increasingly, the economic, diplomatic, military, and technological power to do so.”</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/google-suspends-chinese-e-commerce-app-pinduoduo-over-malware/feed/","slash:comments":"24"},{"title":"Why You Should Opt Out of Sharing Data With Your Mobile Provider","link":"https://krebsonsecurity.com/2023/03/why-you-should-opt-out-of-sharing-data-with-your-mobile-provider/","comments":"https://krebsonsecurity.com/2023/03/why-you-should-opt-out-of-sharing-data-with-your-mobile-provider/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Mon, 20 Mar 2023 14:47:56 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"Data Breaches"},{"#cdata-section":"AT&T"},{"#cdata-section":"CCPA"},{"#cdata-section":"CPNI"},{"#cdata-section":"Custom Experience Plus"},{"#cdata-section":"customer proprietary network information"},{"#cdata-section":"Electronic Privacy Information Center"},{"#cdata-section":"Enhanced Relevant Advertising Program"},{"#cdata-section":"FCC"},{"#cdata-section":"Federal Communications Commission"},{"#cdata-section":"Gavin Wright"},{"#cdata-section":"MAIDs"},{"#cdata-section":"mashable"},{"#cdata-section":"mobile advertising IDs"},{"#cdata-section":"T-Mobile"},{"#cdata-section":"TechTarget"},{"#cdata-section":"Verizon"},{"#cdata-section":"Verizon Custom Experience Plus"},{"#cdata-section":"Verizon Selects"},{"#cdata-section":"Verizon Wireless"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=62964"},"description":{"#cdata-section":"A new breach involving data from nine million AT&#038;T customers is a fresh reminder that your mobile provider likely collects and shares a great deal of information about where you go and what you do with your mobile device -- unless and until you affirmatively opt out of this data collection. Here's a primer on why you might want to do that, and how.\r\nCertain questions might be coming to mind right now, like \"What the heck is CPNI?\" And, 'If it's so 'customer proprietary,' why is AT&#038;T sharing it with marketers?\" Also maybe, \"What can I do about it?\" Read on for answers to all three questions."},"content:encoded":{"#cdata-section":"<p>A new breach involving data from nine million <strong>AT&amp;T</strong> customers is a fresh reminder that your mobile provider likely collects and shares a great deal of information about where you go and what you do with your mobile device &#8212; unless and until you affirmatively opt out of this data collection. Here&#8217;s a primer on why you might want to do that, and how.</p>\n<div id=\"attachment_63008\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63008\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-63008\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/attbldg.png\" alt=\"\" width=\"750\" height=\"498\" /><p id=\"caption-attachment-63008\" class=\"wp-caption-text\">Image: Shutterstock</p></div>\n<p>Telecommunications giant <strong>AT&amp;T</strong> disclosed this month that a breach at a marketing vendor exposed certain account information for nine million customers. AT&amp;T said the data exposed did not include sensitive information, such as credit card or Social Security numbers, or account passwords, but was limited to &#8220;Customer Proprietary Network Information&#8221; (CPNI), such as the number of lines on an account.</p>\n<p>Certain questions may be coming to mind right now, like &#8220;What the heck is CPNI?&#8221; And, &#8216;If it&#8217;s so &#8216;customer proprietary,&#8217; why is AT&amp;T sharing it with marketers?&#8221; Also maybe, &#8220;What can I do about it?&#8221; Read on for answers to all three questions.</p>\n<p>AT&amp;T&#8217;s disclosure said the information exposed included customer first name, wireless account number, wireless phone number and email address. In addition, a small percentage of customer records also exposed the rate plan name, past due amounts, monthly payment amounts and minutes used.</p>\n<p>CPNI refers to customer-specific &#8220;metadata&#8221; about the account and account usage, and may include:</p>\n<p>-Called phone numbers<br />\n-Time of calls<br />\n-Length of calls<br />\n-Cost and billing of calls<br />\n-Service features<br />\n-Premium services, such as directory call assistance</p>\n<p>According to <a href=\"https://www.techtarget.com/searchnetworking/definition/CPNI\" target=\"_blank\" rel=\"noopener\">a succinct CPNI explainer at TechTarget</a>, CPNI is private and protected information that cannot be used for advertising or marketing directly.</p>\n<p>&#8220;An individual&#8217;s CPNI can be shared with other telecommunications providers for network operating reasons,&#8221; wrote TechTarget&#8217;s <strong>Gavin Wright</strong>. &#8220;So, when the individual first signs up for phone service, this information is automatically shared by the phone provider to partner companies.&#8221;</p>\n<p>Is your mobile Internet usage covered by CPNI laws? That&#8217;s less clear, as the CPNI rules were established before mobile phones and wireless Internet access were common. TechTarget&#8217;s CPNI primer explains:</p>\n<p>&#8220;Under current U.S. law, cellphone use is only protected as CPNI when it is being used as a telephone. During this time, the company is acting as a telecommunications provider requiring CPNI rules. Internet use, websites visited, search history or apps used are not protected CPNI because the company is acting as an information services provider not subject to these laws.&#8221;</p>\n<p>Hence, the carriers can share and sell this data because they&#8217;re not explicitly prohibited from doing so. All three major carriers say they take steps to anonymize the customer data they share, but researchers have shown it is not terribly difficult <a href=\"https://www.vice.com/en/article/gygx7y/your-anonymous-browsing-data-isnt-actually-anonymous\" target=\"_blank\" rel=\"noopener\">to de-anonymize supposedly anonymous web-browsing data</a>.</p>\n<p>&#8220;Your phone, and consequently your mobile provider, know a lot about you,&#8221; <a href=\"https://mashable.com/article/how-to-stop-tmobile-att-verizon-from-sharing-my-data\" target=\"_blank\" rel=\"noopener\">wrote</a> Jack Morse for <strong>Mashable</strong>. &#8220;The places you go, apps you use, and the websites you visit potentially reveal all kinds of private information — e.g. religious beliefs, health conditions, travel plans, income level, and specific tastes in pornography. This should bother you.&#8221;</p>\n<p>Happily, all of the U.S. carriers are required to offer customers ways to opt out of having data about how they use their devices shared with marketers. Here&#8217;s a look at some of the carrier-specific practices and opt-out options.<span id=\"more-62964\"></span></p>\n<h2>AT&amp;T</h2>\n<p>AT&amp;T&#8217;s policy says it shares device or &#8220;ad ID&#8221;, combined with demographics including age range, gender, and ZIP code information with third parties which explicitly include advertisers, programmers, and networks, social media networks, analytics firms, ad networks and other similar companies that are involved in creating and delivering advertisements.</p>\n<p>AT&amp;T said the data exposed on 9 million customers was several years old, and mostly related to device upgrade eligibility. This may sound like the data went to just one of its partners who experienced a breach, but in all likelihood it also went to hundreds of AT&amp;T&#8217;s partners.</p>\n<p>AT&amp;T&#8217;s <a href=\"https://www.att.com/ecpnioptout/InitiateCPNIForm.action\" target=\"_blank\" rel=\"noopener\">CPNI opt-out page</a> says it shares CPNI data with several of its affiliates, including <strong>WarnerMedia</strong>, <strong>DirecTV</strong> and <strong>Cricket Wireless</strong>. Until recently, AT&amp;T also shared CPNI data with <strong>Xandr</strong>, whose <a href=\"https://docs.xandr.com/bundle/service-policies/page/third-party-providers.html\" target=\"_blank\" rel=\"noopener\">privacy policy</a> in turn explains that it shares data with <em>hundreds of other advertising firms</em>. Microsoft <a href=\"https://about.att.com/story/2022/xandr-microsoft.html\" target=\"_blank\" rel=\"noopener\">bought Xandr from AT&amp;T last year</a>.</p>\n<h2>T-MOBILE</h2>\n<p>According to the <a href=\"https://www.epic.org\" target=\"_blank\" rel=\"noopener\">Electronic Privacy Information Center</a> (EPIC),<strong> T-Mobile</strong> seems to be the only company out of the big three to extend to all customers the rights conferred by the <a href=\"https://en.wikipedia.org/wiki/California_Consumer_Privacy_Act\" target=\"_blank\" rel=\"noopener\">California Consumer Privacy Act</a> (CCPA).</p>\n<p>EPIC says T-Mobile customer data sold to third parties uses another unique identifier called mobile advertising IDs or &#8220;<strong>MAIDs</strong>.&#8221; T-Mobile claims that MAIDs don&#8217;t directly identify consumers, but under the CCPA MAIDs are considered &#8220;personal information&#8221; that can be connected to IP addresses, mobile apps installed or used with the device, any video or content viewing information, and device activity and attributes.</p>\n<p>T-Mobile customers can opt out by logging into their account and navigating to the profile page, then to &#8220;Privacy and Notifications.&#8221; From there, toggle off the options for &#8220;Use my data for analytics and reporting&#8221; and &#8220;Use my data to make ads more relevant to me.&#8221;</p>\n<h2>VERIZON</h2>\n<p>Verizon&#8217;s privacy policy says it does not sell information that personally identities customers (e.g., name, telephone number or email address), but it does allow third-party advertising companies to collect information about activity on Verizon websites and in Verizon apps, through MAIDs, <a href=\"https://en.wikipedia.org/wiki/Web_beacon\" target=\"_blank\" rel=\"noopener\">pixels, web beacons</a> and social network plugins.</p>\n<p>According to <a href=\"https://www.wired.com/story/verizon-user-privacy-settings/\" target=\"_blank\" rel=\"noopener\">Wired.com&#8217;s tutorial</a>, Verizon users can opt out by logging into their Verizon account through a web browser or the My Verizon mobile app. From there, select the Account tab, then click Account Settings and Privacy Settings on the web. For the mobile app, click the gear icon in the upper right corner and then Manage Privacy Settings.</p>\n<p>On the privacy preferences page, web users can choose &#8220;Don’t use&#8221; under the Custom Experience section. On the My Verizon app, toggle any green sliders to the left.</p>\n<p>EPIC notes that all three major carriers say resetting the consumer&#8217;s device ID and/or clearing cookies in the browser will similarly reset any opt-out preferences (i.e., the customer will need to opt out again), and that blocking cookies by default may also block the opt-out cookie from being set.</p>\n<p>T-Mobile says its opt out is device-specific and/or browser-specific. &#8220;In most cases, your opt-out choice will apply only to the specific device or browser on which it was made. You may need to separately opt out from your other devices and browsers.&#8221;</p>\n<p>Both AT&amp;T and Verizon offer <em>opt-in</em> programs that gather and share far more information, including device location, the phone numbers you call, and which sites you visit using your mobile and/or home Internet connection. AT&amp;T calls this their <strong>Enhanced Relevant Advertising Program</strong>; Verizon&#8217;s is called <strong>Custom Experience Plus</strong>.</p>\n<p>In 2021, multiple media outlets <a href=\"https://arstechnica.com/information-technology/2021/12/verizon-ignored-users-previous-opt-outs-in-latest-push-to-scan-web-browsing/?amp=1\" target=\"_blank\" rel=\"noopener\">reported</a> that some Verizon customers were being automatically enrolled in Custom Experience Plus &#8212; even after those customers had already opted out of the same program under its previous name &#8212; &#8220;Verizon Selects.&#8221;</p>\n<p>If none of the above opt out options work for you, at a minimum you should be able to opt out of CPNI sharing by calling your carrier, or by visiting one of their stores.</p>\n<h2>THE CASE FOR OPTING OUT</h2>\n<p>Why should you opt out of sharing CPNI data? For starters, some of the nation&#8217;s largest wireless carriers don&#8217;t have a great track record in terms of protecting the sensitive information that you give them solely for the purposes of becoming a customer &#8212; let alone the information they collect about your use of their services after that point.</p>\n<p>In January 2023, T-Mobile disclosed that someone <a href=\"https://krebsonsecurity.com/2023/01/new-t-mobile-breach-affects-37-million-accounts/\" target=\"_blank\" rel=\"noopener\">stole data on 37 million customer accounts</a>, including customer name, billing address, email, phone number, date of birth, T-Mobile account number and plan details. In August 2021, T-Mobile <a href=\"https://krebsonsecurity.com/2021/08/t-mobile-breach-exposed-ssn-dob-of-40m-people/\" target=\"_blank\" rel=\"noopener\">acknowledged</a> that hackers made off with the names, dates of birth, Social Security numbers and driver’s license/ID information on more than 40 million current, former or prospective customers who applied for credit with the company.</p>\n<p>Last summer, a cybercriminal began selling the names, email addresses, phone numbers, SSNs and dates of birth on 23 million Americans. An <a href=\"https://krebsonsecurity.com/2022/08/it-might-be-our-data-but-its-not-our-breach/\" target=\"_blank\" rel=\"noopener\">exhaustive analysis of the data</a> strongly suggested it all belonged to customers of one AT&amp;T company or another. AT&amp;T stopped short of saying the data wasn&#8217;t theirs, but said the records did not appear to have come from its systems and may be tied to a previous data incident at another company.</p>\n<p>However frequently the carriers may alert consumers about CPNI breaches, it&#8217;s probably nowhere near often enough. Currently, the carriers are required to report a consumer CPNI breach only in cases &#8220;when a person, without authorization or exceeding authorization, has intentionally gained access to, used or disclosed CPNI.&#8221;</p>\n<p>But that definition of breach was crafted eons ago, back when the primary way CPNI was exposed was through &#8220;pretexting,&#8221; such when the phone company&#8217;s employees are tricked into giving away protected customer data.</p>\n<p>In January, regulators at the <strong>U.S. Federal Communications Commission</strong> (FCC) <a href=\"https://www.fcc.gov/document/fcc-proposes-updated-data-breach-reporting-requirements\" target=\"_blank\" rel=\"noopener\">proposed</a> amending the definition of &#8220;breach&#8221; to include things like inadvertent disclosure &#8212; such as when companies expose CPNI data on a poorly-secured server in the cloud. The FCC is accepting public comments on the matter until March 24, 2023.</p>\n<p>While it&#8217;s true that the leak of CPNI data does not involve sensitive information like Social Security or credit card numbers, one thing AT&amp;T&#8217;s breach notice doesn&#8217;t mention is that CPNI data &#8212; such as balances and payments made &#8212; can be abused by fraudsters to make scam emails and text messages more believable <em>when they&#8217;re trying to impersonate AT&amp;T and phish AT&amp;T customers</em>.</p>\n<p>The other problem with letting companies share or sell your CPNI data is that the wireless carriers can change their privacy policies at any time, and you are assumed to be okay with those changes as long as you keep using their services.</p>\n<p>For example, location data from your wireless device is most definitely CPNI, and yet until very recently all of the major carriers sold their customers&#8217; real-time location data to third party data brokers without customer consent.</p>\n<p>What was their punishment? In 2020, the FCC <a href=\"https://arstechnica.com/tech-policy/2020/02/fcc-issues-wrist-slap-fines-to-carriers-that-sold-your-phone-location-data/\" target=\"_blank\" rel=\"noopener\">proposed fines totaling $208 million against all of the major carriers</a> for selling their customers&#8217; real-time location data. If that sounds like a lot of money, consider that all of the major wireless providers reported tens of billions of dollars in revenue last year (e.g., Verizon&#8217;s consumer revenue alone was more than $100 billion last year).</p>\n<p>If the United States had federal privacy laws that were at all consumer-friendly and relevant to today&#8217;s digital economy, this kind of data collection and sharing would always be opt-in by default. In such a world, the enormously profitable wireless industry would likely be forced to offer clear financial incentives to customers who choose to share this information.</p>\n<p>But until that day arrives, understand that the carriers can change their data collection and sharing policies when it suits them. And regardless of whether you actually read any notices about changes to their privacy policies, you will have agreed to those changes as long as you continue using their service.</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/why-you-should-opt-out-of-sharing-data-with-your-mobile-provider/feed/","slash:comments":"39"},{"title":"Feds Charge NY Man as BreachForums Boss “Pompompurin”","link":"https://krebsonsecurity.com/2023/03/feds-charge-ny-man-as-breachforums-boss-pompompurin/","comments":"https://krebsonsecurity.com/2023/03/feds-charge-ny-man-as-breachforums-boss-pompompurin/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Fri, 17 Mar 2023 23:39:22 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"Ne'er-Do-Well News"},{"#cdata-section":"BreachForums"},{"#cdata-section":"Conor Brian Fitzpatrick"},{"#cdata-section":"DC Health Link"},{"#cdata-section":"fbi"},{"#cdata-section":"John Longmire"},{"#cdata-section":"pompompurin"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63100"},"description":{"#cdata-section":"The U.S. Federal Bureau of Investigation (FBI) this week arrested a New York man on suspicion of running BreachForums, a popular English-language cybercrime forum where some of the world biggest hacked databases routinely first show up for sale. The forum's administrator \"Pompompurin\" has been a thorn in the side of the FBI for years, and BreachForums is widely considered a reincarnation of RaidForums, a remarkably similar crime forum that the FBI infiltrated and dismantled in 2022."},"content:encoded":{"#cdata-section":"<p>The <strong>U.S. Federal Bureau of Investigation</strong> (FBI) this week arrested a New York man on suspicion of running <strong>BreachForums</strong>, a popular English-language cybercrime forum where some of the world biggest hacked databases routinely show up for sale. The forum&#8217;s administrator &#8220;<strong>Pompompurin</strong>&#8221; has been a thorn in the side of the FBI for years, and BreachForums is widely considered a reincarnation of <strong>RaidForums</strong>, a remarkably similar crime forum that the FBI infiltrated and dismantled in 2022.</p>\n<div id=\"attachment_63107\" style=\"width: 725px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63107\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-63107 size-full\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/pompompshome.png\" alt=\"\" width=\"715\" height=\"402\" /><p id=\"caption-attachment-63107\" class=\"wp-caption-text\">Federal agents carting items out of Fitzpatrick&#8217;s home on March 15. Image: News 12 Westchester.</p></div>\n<p>In an affidavit filed with the District Court for the Southern District of New York, FBI Special Agent <strong>John Longmire</strong> said that at around 4:30 p.m. on March 15, 2023, he led a team of law enforcement agents that made a probable cause arrest of a <strong>Conor Brian Fitzpatrick</strong> in Peekskill, NY.</p>\n<p>&#8220;When I arrested the defendant on March 15, 2023, he stated to me in substance and in part that: a) his name was Conor Brian Fitzpatrick; b) he used the alias &#8216;pompompurin/&#8217; and c) he was the owner and administrator of &#8216;BreachForums&#8217; the data breach website referenced in the Complaint,&#8221; Longmire wrote.</p>\n<p>Pompompurin has been something of a nemesis to the FBI for several years. In November 2021, KrebsOnSecurity broke the news that <a href=\"https://krebsonsecurity.com/2021/11/hoax-email-blast-abused-poor-coding-in-fbi-website/\" target=\"_blank\" rel=\"noopener\">thousands of fake emails about a cybercrime investigation were blasted out from the FBI&#8217;s email systems and Internet addresses</a>.</p>\n<p>Pompompurin took credit for that stunt, and said he was able to send the FBI email blast by exploiting a flaw in an FBI portal designed to share information with state and local law enforcement authorities. The FBI later acknowledged that a software misconfiguration allowed someone to send the fake emails.</p>\n<p>In December, 2022, KrebsOnSecurity broke the news that <a href=\"https://krebsonsecurity.com/2022/12/fbis-vetted-info-sharing-network-infragard-hacked/\" target=\"_blank\" rel=\"noopener\">hackers active on BreachForums had infiltrated the FBI&#8217;s InfraGard program</a>, a vetted FBI program designed to build cyber and physical threat information sharing partnerships with experts in the private sector. The hackers impersonated the CEO of a major financial company, applied for InfraGard membership in the CEO&#8217;s name, and were granted admission to the community.</p>\n<p>From there, the hackers plundered the InfraGard member database, and proceeded to sell contact information on more than 80,000 InfraGard members in an auction on BreachForums. The FBI responded by disabling the portal for some time, before ultimately forcing all InfraGard members to re-apply for membership.<span id=\"more-63100\"></span></p>\n<p>More recently, BreachForums was the sales forum for <a href=\"https://cyberscoop.com/dc-health-data-posted-online/\" target=\"_blank\" rel=\"noopener\">data stolen</a> from <strong>DC Health Link</strong>, a health insurance exchange based in Washington, D.C. that suffered a data breach this month. The sales thread initially said the data included the names, Social Security numbers, dates of birth, health plan and enrollee information and more on 170,000 individuals, although the official notice about the breach says 56,415 people were affected.</p>\n<p>In April 2022, U.S. Justice Department <a href=\"https://krebsonsecurity.com/2022/04/raidforums-get-raided-alleged-admin-arrested/\" target=\"_blank\" rel=\"noopener\">seized the servers and domains for RaidForums</a>, an extremely popular English-language cybercrime forum that sold access to more than 10 billion consumer records stolen in some of the world’s largest data breaches since 2015. As part of that operation, the feds also charged the alleged administrator, 21-year-old Diogo Santos Coelho of Portugal, with six criminal counts.</p>\n<p>Coelho was arrested in the United Kingdom on Jan. 31, 2022. By that time, the new BreachForums had been live for just under a week, but with a familiar look.</p>\n<p>BreachForums remains accessible online, and from reviewing the live chat stream on the site&#8217;s home page it appears the forum&#8217;s active users are only just becoming aware that their administrator &#8212; and the site&#8217;s database &#8212; is likely now in FBI hands:</p>\n<div id=\"attachment_63109\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/breachedruhroh.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-63109\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-63109\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/breachedruhroh.png\" alt=\"\" width=\"751\" height=\"281\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/breachedruhroh.png 1409w, https://krebsonsecurity.com/wp-content/uploads/2023/03/breachedruhroh-768x287.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/03/breachedruhroh-782x292.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /></a><p id=\"caption-attachment-63109\" class=\"wp-caption-text\">Members of BreachForums discuss the arrest of the forum&#8217;s alleged owner.</p></div>\n<p>&#8220;Wait if they arrested pom then doesn&#8217;t the FBI have all of our details we&#8217;ve registered with?&#8221; asked one worried BreachForums member.</p>\n<p>&#8220;But we all have good VPNs I guess, right&#8230;right guys?&#8221; another denizen offered.</p>\n<p>&#8220;Like pom would most likely do a plea bargain and cooperate with the feds as much as possible,&#8221; replied another.</p>\n<p>Fitzpatrick could not be immediately reached for comment. The FBI declined to comment for this story.</p>\n<p>There is only one page to the <a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/pomcomplaint.pdf\" target=\"_blank\" rel=\"noopener\">criminal complaint against Fitzpatrick</a> (PDF), which charges him with one count of conspiracy to commit access device fraud. The affidavit on his arrest is available <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.595805/gov.uscourts.nysd.595805.1.0.pdf\" target=\"_blank\" rel=\"noopener\">here</a> (PDF).</p>\n<p><strong>Update:</strong> Corrected spelling of FBI agent&#8217;s last name.</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/feds-charge-ny-man-as-breachforums-boss-pompompurin/feed/","slash:comments":"59"},{"title":"Microsoft Patch Tuesday, March 2023 Edition","link":"https://krebsonsecurity.com/2023/03/microsoft-patch-tuesday-march-2023-edition/","comments":"https://krebsonsecurity.com/2023/03/microsoft-patch-tuesday-march-2023-edition/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Wed, 15 Mar 2023 15:19:32 +0000","category":[{"#cdata-section":"Security Tools"},{"#cdata-section":"The Coming Storm"},{"#cdata-section":"Time to Patch"},{"#cdata-section":"CVE-2023-23397"},{"#cdata-section":"CVE-2023-24880"},{"#cdata-section":"Dustin Childs"},{"#cdata-section":"Immersive Labs"},{"#cdata-section":"Kevin Breen"},{"#cdata-section":"Microsoft 365 Apps for Enterprise"},{"#cdata-section":"Microsoft Patch Tuesday March 2023"},{"#cdata-section":"Rapid7"},{"#cdata-section":"Windows SmartScreen"},{"#cdata-section":"Zero Day Initiative"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63082"},"description":{"#cdata-section":"Microsoft on Tuesday released updates to quash at least 74 security bugs in its Windows operating systems and software. Two of those flaws are already being actively attacked, including an especially severe weakness in Microsoft Outlook that can be exploited without any user interaction."},"content:encoded":{"#cdata-section":"<p><strong>Microsoft </strong>on Tuesday released updates to quash at least 74 security bugs in its <strong>Windows</strong> operating systems and software. Two of those flaws are already being actively attacked, including an especially severe weakness in <strong>Microsoft Outlook</strong> that can be exploited without any user interaction.</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-60331\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate.png\" alt=\"\" width=\"749\" height=\"496\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate.png 923w, https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate-768x508.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/07/winupdatedate-782x518.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /></p>\n<p>The Outlook vulnerability (<a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-23397\" target=\"_blank\" rel=\"noopener\">CVE-2023-23397</a>) affects all versions of Microsoft Outlook from 2013 to the newest. Microsoft said it has seen evidence that attackers are exploiting this flaw, which can be done without any user interaction by sending a booby-trapped email that triggers automatically when retrieved by the email server &#8212; <em>before the email is even viewed in the Preview Pane</em>.</p>\n<p>While CVE-2023-23397 is labeled as an &#8220;Elevation of Privilege&#8221; vulnerability, that label doesn’t accurately reflect its severity, said <strong>Kevin Breen</strong>, director of cyber threat research at <strong>Immersive Labs</strong>.</p>\n<p>Known as an NTLM relay attack, it allows an attacker to get someone’s NTLM hash [Windows account password] and use it in an attack commonly referred to as &#8220;<a href=\"https://en.wikipedia.org/wiki/Pass_the_hash\" target=\"_blank\" rel=\"noopener\">Pass The Hash</a>.&#8221;</p>\n<p>&#8220;The vulnerability effectively lets the attacker authenticate as a trusted individual without having to know the person’s password,&#8221; Breen said. &#8220;This is on par with an attacker having a valid password with access to an organization’s systems.&#8221;</p>\n<p>Security firm <strong>Rapid7</strong> points out that this bug affects self-hosted versions of Outlook like <strong>Microsoft 365 Apps for Enterprise</strong>, but Microsoft-hosted online services like <strong>Microsoft 365</strong> are <em>not</em> vulnerable.<span id=\"more-63082\"></span></p>\n<p>The other zero-day flaw being actively exploited in the wild &#8212; <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-24880\" target=\"_blank\" rel=\"noopener\">CVE-2023-24880</a> &#8212; is a &#8220;Security Feature Bypass&#8221; in <strong>Windows SmartScreen</strong>, part of Microsoft&#8217;s slate of endpoint protection tools.</p>\n<p>Patch management vendor <strong>Action1</strong> notes that the exploit for this bug is low in complexity and requires no special privileges. But it does require some user interaction, and can&#8217;t be used to gain access to private information or privileges. However, the flaw can allow other malicious code to run without being detected by SmartScreen reputation checks.</p>\n<p><strong>Dustin Childs</strong>, head of threat awareness at Trend Micro&#8217;s <strong>Zero Day Initiative</strong>, said CVE-2023-24880 allows attackers to create files that would bypass Mark of the Web (MOTW) defenses.</p>\n<p>&#8220;Protective measures like SmartScreen and Protected View in Microsoft Office rely on MOTW, so bypassing these makes it easier for threat actors to spread malware via crafted documents and other infected files that would otherwise be stopped by SmartScreen,&#8221; Childs said.</p>\n<p>Seven other vulnerabilities Microsoft patched this week earned its most-dire &#8220;critical&#8221; severity label, meaning the updates address security holes that could be exploited to give the attacker full, remote control over a Windows host with little or no interaction from the user.</p>\n<p>Also this week, Adobe released eight patches addressing a whopping 105 security holes across a variety of products, including <strong>Adobe Photoshop</strong>, <strong>Cold Fusion</strong>, <strong>Experience Manager</strong>, <strong>Dimension</strong>, <strong>Commerce</strong>, <strong>Magento</strong>, <strong>Substance 3D Stager</strong>, <strong>Cloud Desktop Applicatio</strong>n, and <strong>Illustrator</strong>.</p>\n<p>For a more granular rundown on the updates released today, see the <a href=\"https://isc.sans.edu/diary/Microsoft%20March%202023%20Patch%20Tuesday/29634\" target=\"_blank\" rel=\"noopener\">SANS Internet Storm Center roundup</a>. If today’s updates cause any stability or usability issues in Windows, <a href=\"https://www.askwoody.com/2023/march-madness-here-we-come/\" target=\"_blank\" rel=\"noopener\">AskWoody.com</a> will likely have the lowdown on that.</p>\n<p>Please consider backing up your data and/or imaging your system before applying any updates. And feel free to sound off in the comments if you experience any problems as a result of these patches.</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/microsoft-patch-tuesday-march-2023-edition/feed/","slash:comments":"31"},{"title":"Two U.S. Men Charged in 2022 Hacking of DEA Portal","link":"https://krebsonsecurity.com/2023/03/two-us-men-charged-in-2022-hacking-of-dea-portal/","comments":"https://krebsonsecurity.com/2023/03/two-us-men-charged-in-2022-hacking-of-dea-portal/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Wed, 15 Mar 2023 01:25:20 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"Data Breaches"},{"#cdata-section":"Ne'er-Do-Well News"},{"#cdata-section":"Web Fraud 2.0"},{"#cdata-section":"Convict"},{"#cdata-section":"Doxbin"},{"#cdata-section":"emergency data request"},{"#cdata-section":"KT"},{"#cdata-section":"Nicholas Ceraolo"},{"#cdata-section":"Ominus"},{"#cdata-section":"Phobia"},{"#cdata-section":"Ryan Stevenson"},{"#cdata-section":"Sagar Steven Singh"},{"#cdata-section":"U.S. Drug Enforcement Agency"},{"#cdata-section":"ViLE"},{"#cdata-section":"Weep"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=63055"},"description":{"#cdata-section":"Two U.S. men have been charged with hacking into a U.S. Drug Enforcement Agency (DEA) online portal that taps into 16 different federal law enforcement databases. Both are alleged to be part of a larger criminal organization that specializes in using fake emergency data requests from compromised police and government email accounts to publicly threaten and extort their victims."},"content:encoded":{"#cdata-section":"<p>Two U.S. men have been charged with hacking into a <strong>U.S. Drug Enforcement Agency</strong> (DEA) online portal that taps into 16 different federal law enforcement databases. Both are alleged to be part of a larger criminal organization that specializes in using fake emergency data requests from compromised police and government email accounts to publicly threaten and extort their victims.</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-59128\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/03/legalrequest.png\" alt=\"\" width=\"742\" height=\"616\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/03/legalrequest.png 864w, https://krebsonsecurity.com/wp-content/uploads/2022/03/legalrequest-768x638.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/03/legalrequest-782x650.png 782w\" sizes=\"(max-width: 742px) 100vw, 742px\" /></p>\n<p>Prosecutors for the Eastern District of New York today unsealed criminal complaints against <strong>Sagar Steven Singh</strong> &#8212; a.k.a &#8220;<strong>Weep</strong>&#8221; &#8212; a 19-year-old from Pawtucket, Rhode Island; and <strong>Nicholas Ceraolo</strong>, 25, of Queens, NY, who allegedly went by the handles &#8220;<strong>Convict</strong>&#8221; and &#8220;<strong>Ominus</strong>.&#8221;</p>\n<p>The Justice Department says Singh and Ceraolo belong to a group of cybercriminals known to its members as &#8220;<strong>ViLE</strong>,&#8221; who specialize in obtaining personal information about third-party victims, which they then use to harass, threaten or extort the victims, a practice known as &#8220;doxing.&#8221;</p>\n<p>&#8220;ViLE is collaborative, and the members routinely share tactics and illicitly obtained information with each other,&#8221; prosecutors charged.</p>\n<p>The government alleges the defendants and other members of ViLE use various methods to obtain victims’ personal information, including:</p>\n<p>-tricking customer service employees;<br />\n-submitting fraudulent legal process to social media companies to elicit users’ registration information;<br />\n-co-opting and corrupting corporate insiders;<br />\n-searching public and private online databases;<br />\n-accessing a nonpublic United States government database without authorization<br />\n-unlawfully using official email accounts belonging to other countries.</p>\n<p>The complaint says once they obtained a victim&#8217;s information, Singh and Ceraolo would post the information in an online forum. The government refers to this community only as &#8220;<strong>Forum-1</strong>,&#8221; saying that it is administered by the leader of ViLE (referenced in the complaint as &#8220;CC-1&#8221;).</p>\n<p>&#8220;Victims are extorted into paying CC-1 to have their information removed from Forum-1,&#8221; prosecutors allege. &#8220;Singh also uses the threat of revealing personal information to extort victims into giving him access to their social media accounts, which Singh then resells.&#8221;</p>\n<p>Sources tell KrebsOnSecurity in addition to being members of ViLE, both Weep and Ominous are or were staff members for <strong>Doxbin</strong>, a highly toxic online community that provides a forum for digging up personal information on people and posting it publicly. This is supported by the Doxbin administrator&#8217;s claimed responsibility for a high-profile intrusion at the DEA&#8217;s law enforcement data sharing portal last year.</p>\n<div id=\"attachment_59765\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2022/05/esp-screenshot.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-59765\" decoding=\"async\" loading=\"lazy\" class=\"wp-image-59765\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/05/esp-screenshot.png\" alt=\"\" width=\"751\" height=\"372\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/05/esp-screenshot.png 1283w, https://krebsonsecurity.com/wp-content/uploads/2022/05/esp-screenshot-768x380.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/05/esp-screenshot-782x387.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /></a><p id=\"caption-attachment-59765\" class=\"wp-caption-text\">A screenshot of alleged access to the Drug Enforcement Agency&#8217;s intelligence sharing portal, shared by &#8220;KT,&#8221; the current administrator of the doxing and harassment community Doxbin.</p></div>\n<p>The government alleges that on May 7, 2022, Singh used stolen credentials to log into a U.S. federal government portal without authorization. The complaint doesn&#8217;t specify which agency portal was hacked, but it does state that the portal included access to law enforcement databases that track narcotics seizures in the United States.</p>\n<p>On May 12, 2022, KrebsOnSecurity <a href=\"https://krebsonsecurity.com/2022/05/dea-investigating-breach-of-law-enforcement-data-portal/\" target=\"_blank\" rel=\"noopener\">broke the news</a> that hackers had gained access to a DEA portal that taps into 16 different federal law enforcement databases. As reported at the time, the inside scoop on how that hack went down came from <strong>KT</strong>, the current administrator of the Doxbin and the individual referenced in the government&#8217;s complaint as &#8220;CC-1.&#8221;</p>\n<p><span id=\"more-63055\"></span></p>\n<p>Indeed, a screenshot of the ViLE group website includes the group&#8217;s official roster, which lists KT at the top, followed by Weep and Ominus.</p>\n<div id=\"attachment_63060\" style=\"width: 729px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63060\" decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-63060\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/ViLE.png\" alt=\"\" width=\"719\" height=\"475\" /><p id=\"caption-attachment-63060\" class=\"wp-caption-text\">A screenshot of the website for the cybercriminal group &#8220;ViLE.&#8221; Image: USDOJ.</p></div>\n<p>In March 2022, KrebsOnSecurity <a href=\"https://krebsonsecurity.com/2022/03/hackers-gaining-power-of-subpoena-via-fake-emergency-data-requests/\" target=\"_blank\" rel=\"noopener\">warned</a> that multiple cybercrime groups were finding success with fraudulent Emergency Data Requests (EDRs), wherein the hackers use compromised police and government email accounts to file warrantless data requests with social media firms and mobile telephony providers, attesting that the information being requested can&#8217;t wait for a warrant because it relates to an urgent matter of life and death.</p>\n<p>That story showed that the previous owner of the Doxbin also was part of a teenage hacking group that specialized in offering fake EDRs as a service on the dark web.</p>\n<p>Prosecutors say they tied Singh to the government portal hack because he connected to it from an Internet address that he&#8217;d previously used to access a social media account registered in his name. When they raided Singh&#8217;s residence on Sept. 8, 2022 and seized his devices, investigators with Homeland Security found a cellular phone and laptop that allegedly &#8220;contained extensive evidence of access to the Portal.&#8221;</p>\n<p>The complaint alleges that between February 2022 and May 2022, Ceraolo used an official email account belonging to a Bangladeshi police official to pose as a police officer in communication with U.S.-based social media platforms.</p>\n<p>&#8220;In these communications, Ceraolo requested personal information about users of these platforms, under the false pretense that the users were committing crimes or in life-threatening danger,&#8221; the complaint states.</p>\n<p>For example, on or about March 13, 2022, Ceraolo allegedly used the Bangladeshi police email account to falsely claim that the target of the EDR had sent bomb threats, distributed child pornography and threatened officials of the Bangladeshi government.</p>\n<p>On or about May 9, 2022, the government says, Singh sent a friend screenshots of text messages between himself and someone he had doxed on the Doxbin and was trying to extort for their Instagram handle. The data included the victim&#8217;s Social Security number, driver’s license number, cellphone number, and home address.</p>\n<p>&#8220;Look familiar?” Singh allegedly wrote to the victim. &#8220;You’re gonna comply to me if you don’t want anything negative to happen to your parents. . . I have every detail involving your parents . . . allowing me to do whatever I desire to them in malicious ways.&#8221;</p>\n<p>Neither of the defendants could be immediately reached for comment. KT, the current administrator of Doxbin, declined a request for comment on the charges.</p>\n<p>Ceraolo is a self-described security researcher who has been credited in <a href=\"https://www.google.com/search?q=%22nicholas+convict+ceraolo%22#ip=1\" target=\"_blank\" rel=\"noopener\">many news stories over the years</a> with discovering security vulnerabilities at <strong>AT&amp;T</strong>, <strong>T-Mobile</strong>, <strong>Comcast</strong> and <strong>Cox Communications</strong>.</p>\n<p>Ceraolo&#8217;s stated partner in most of these discoveries &#8212; a 30-year-old Connecticut man named <strong>Ryan &#8220;Phobia&#8221; Stevenson</strong> &#8212; was charged in 2019 with being part of a group that stole millions of dollars worth of cryptocurrencies via <a href=\"https://krebsonsecurity.com/?s=sim-swapping\" target=\"_blank\" rel=\"noopener\">SIM-swapping</a>, a crime that involves tricking a mobile provider into routing a target&#8217;s calls and text messages to another device.</p>\n<p>In 2018, KrebsOnSecurity detailed how Stevenson earned bug bounty rewards and public recognition from top telecom companies for finding and reporting security holes in their websites, all the while <a href=\"https://krebsonsecurity.com/2018/11/bug-bounty-hunter-ran-isp-doxing-service/\" target=\"_blank\" rel=\"noopener\">secretly peddling those same vulnerabilities to cybercriminals</a>.</p>\n<p>According to the Justice Department, if convicted Ceraolo faces up to 20 years’ imprisonment for conspiracy to commit wire fraud; both Ceraolo and Singh face five years’ imprisonment for conspiracy to commit computer intrusions.</p>\n<p>A copy of the complaint against Ceraolo and Singh is <a href=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/Singh-and-Ceraolo-Complaint.pdf\" target=\"_blank\" rel=\"noopener\">here</a> (PDF).</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/two-us-men-charged-in-2022-hacking-of-dea-portal/feed/","slash:comments":"25"},{"title":"Who’s Behind the NetWire Remote Access Trojan?","link":"https://krebsonsecurity.com/2023/03/whos-behind-the-netwire-remote-access-trojan/","comments":"https://krebsonsecurity.com/2023/03/whos-behind-the-netwire-remote-access-trojan/#comments","dc:creator":{"#cdata-section":"BrianKrebs"},"pubDate":"Thu, 09 Mar 2023 18:52:25 +0000","category":[{"#cdata-section":"A Little Sunshine"},{"#cdata-section":"Breadcrumbs"},{"#cdata-section":"Ne'er-Do-Well News"},{"#cdata-section":"Constella Intelligence"},{"#cdata-section":"domaintools"},{"#cdata-section":"Dugidox"},{"#cdata-section":"fbi"},{"#cdata-section":"Mario Zanko"},{"#cdata-section":"NetWire RAT"}],"guid":{"@isPermaLink":"false","#text":"https://krebsonsecurity.com/?p=62987"},"description":{"#cdata-section":"A Croatian national has been arrested for allegedly operating NetWire, a Remote Access Trojan (RAT) marketed on cybercrime forums since 2012 as a stealthy way to spy on infected systems and siphon passwords. The arrest coincided with a seizure of the NetWire sales website by the U.S. Federal Bureau of Investigation (FBI). While the defendant in this case hasn’t yet been named publicly, the NetWire website has been leaking information about the likely true identity and location of its owner for the past 11 years."},"content:encoded":{"#cdata-section":"<p>A Croatian national has been arrested for allegedly operating <strong>NetWire</strong>, a Remote Access Trojan (RAT) marketed on cybercrime forums since 2012 as a stealthy way to spy on infected systems and siphon passwords. The arrest coincided with a seizure of the NetWire sales website by the <strong>U.S. Federal Bureau of Investigation</strong> (FBI). While the defendant in this case hasn&#8217;t yet been named publicly, the NetWire website has been leaking information about the likely true identity and location of its owner for the past 11 years.</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-62995\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/wwls.png\" alt=\"\" width=\"750\" height=\"536\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/wwls.png 799w, https://krebsonsecurity.com/wp-content/uploads/2023/03/wwls-768x549.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/03/wwls-782x559.png 782w, https://krebsonsecurity.com/wp-content/uploads/2023/03/wwls-100x70.png 100w\" sizes=\"(max-width: 750px) 100vw, 750px\" /></p>\n<p>Typically installed by <a href=\"https://unit42.paloaltonetworks.com/guloader-installing-netwire-rat/\" target=\"_blank\" rel=\"noopener\">booby-trapped Microsoft Office documents</a> and distributed via email, <strong>NetWire</strong> is a multi-platform threat that is capable of targeting not only <strong>Microsoft Windows</strong> machines but also <strong>Android</strong>, <strong>Linux</strong> and <strong>Mac</strong> systems.</p>\n<p>NetWire&#8217;s reliability and relatively low cost ($80-$140 depending on features) has made it an extremely popular RAT on the cybercrime forums for years, and NetWire infections consistently rank among the <a href=\"https://decoded.avast.io/threatresearch/avast-q4-2022-threat-report/\" target=\"_blank\" rel=\"noopener\">top 10 most active RATs in use</a>.</p>\n<p>NetWire has been sold openly on the same website since 2012: <strong>worldwiredlabs[.]com</strong>. That website now features a seizure notice from the <strong>U.S. Department of Justice </strong>(DOJ), which says the domain was taken as part of &#8220;a coordinated law enforcement action taken against the NetWire Remote Access Trojan.&#8221;</p>\n<p>&#8220;As part of this week’s law enforcement action, authorities in Croatia on Tuesday arrested a Croatian national who allegedly was the administrator of the website,&#8221; reads <a href=\"https://www.justice.gov/usao-cdca/pr/federal-authorities-seize-internet-domain-selling-malware-used-illegally-control-and\" target=\"_blank\" rel=\"noopener\">a statement</a> by the DOJ today. &#8220;This defendant will be prosecuted by Croatian authorities. Additionally, law enforcement in Switzerland on Tuesday seized the computer server hosting the NetWire RAT infrastructure.&#8221;</p>\n<p>Neither the DOJ&#8217;s statement nor <a href=\"https://www-index-hr.translate.goog/vijesti/clanak/kod-zagreba-uhicen-haker-hrvatskoj-policiji-u-istrazi-pomogao-fbi/2445145.aspx?index_tid=328489&amp;index_ref=naslovnica_vijesti_ostalo_d&amp;_x_tr_sl=auto&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=wapp\" target=\"_blank\" rel=\"noopener\">a press release</a> on the operation published by Croatian authorities mentioned the name of the accused. But it&#8217;s fairly remarkable that it has taken so long for authorities in the United States and elsewhere to move against NetWire and its alleged proprietor, given that the RAT&#8217;s author apparently did very little to hide his real-life identity.</p>\n<p>The WorldWiredLabs website first came online in February 2012 using a dedicated host with no other domains. The site&#8217;s true WHOIS registration records have always been hidden by privacy protection services, but there are plenty of clues in historical Domain Name System (DNS) records for WorldWiredLabs that point in the same direction.</p>\n<p>In October 2012, the WorldWiredLabs domain moved to another dedicated server at the Internet address 198.91.90.7, which was home to just one other domain: <strong>printschoolmedia[.]org</strong>, also registered in 2012.</p>\n<p>According to <a href=\"https://www.domaintools.com\" target=\"_blank\" rel=\"noopener\">DomainTools.com</a>, printschoolmedia[.]org was registered to a <strong>Mario Zanko</strong> in Zapresic, Croatia, and to the email address <strong>zankomario@gmail.com</strong>. DomainTools further shows this email address was used to register one other domain in 2012: <strong>wwlabshosting[.]com</strong>, also registered to Mario Zanko from Croatia.</p>\n<p>A review of DNS records for both printschoolmedia[.]org and wwlabshosting[.]com shows that while these domains were online they both used the DNS name server <strong>ns1.worldwiredlabs[.]com</strong>. No other domains have been recorded using that same name server.</p>\n<div id=\"attachment_62996\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-62996\" decoding=\"async\" loading=\"lazy\" class=\" wp-image-62996\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/wwl2013.png\" alt=\"\" width=\"750\" height=\"586\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/wwl2013.png 952w, https://krebsonsecurity.com/wp-content/uploads/2023/03/wwl2013-768x600.png 768w, https://krebsonsecurity.com/wp-content/uploads/2023/03/wwl2013-782x611.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\" /><p id=\"caption-attachment-62996\" class=\"wp-caption-text\">The WorldWiredLabs website, in 2013. Source: Archive.org.</p></div>\n<p>DNS records for worldwiredlabs[.]com also show the site forwarded incoming email to the address <strong>tommaloney@ruggedinbox.com</strong>. <a href=\"https://www.constellaintelligence.com\" target=\"_blank\" rel=\"noopener\">Constella Intelligence</a>, a service that indexes information exposed by public database leaks, shows this email address was used to register an account at the clothing retailer romwe.com, using the password &#8220;<strong>123456xx</strong>.&#8221;</p>\n<p>Running a reverse search on this password in Constella Intelligence shows there are more than 450 email addresses known to have used this credential, and two of those are <strong>zankomario@gmail.com</strong> and <strong>zankomario@yahoo.com</strong>.</p>\n<p><span id=\"more-62987\"></span></p>\n<p>A search on zankomario@gmail.com in <strong>Skype</strong> returns three results, including the account name &#8220;Netwire&#8221; and the username &#8220;<strong>Dugidox</strong>,&#8221; and another for a Mario Zanko (username zanko.mario).</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"alignright wp-image-63016\" src=\"https://krebsonsecurity.com/wp-content/uploads/2023/03/zankomarioskype.png\" alt=\"\" width=\"371\" height=\"299\" />Dugidox corresponds to the hacker handle most frequently associated with NetWire sales and support discussion threads on multiple cybercrime forums over the years.</p>\n<p>Constella ties dugidox@gmail.com to a number of website registrations, including the Dugidox handle on BlackHatWorld and HackForums, and to IP addresses in Croatia for both. Constella also shows the email address zankomario@gmail.com used the password &#8220;dugidox2407.&#8221;</p>\n<p>In 2010, someone using the email address dugidox@gmail.com registered the domain <strong>dugidox[.]com</strong>. The WHOIS registration records for that domain list a &#8220;Senela Eanko&#8221; as the registrant, but the address used was the same street address in Zapresic that appears in the WHOIS records for printschoolmedia[.]org, which is registered in Mr. Zanco&#8217;s name.</p>\n<p>Prior to the demise of <strong>Google+</strong>, the email address dugidox@gmail.com mapped to an account with the nickname &#8220;<strong>Netwire wwl</strong>.&#8221; The dugidox email also was tied to a Facebook account (<strong>mario.zanko3</strong>), which featured check-ins and photos from various places in Croatia.</p>\n<p>That Facebook profile is no longer active, but back in January 2017, the administrator of WorldWiredLabs posted that he was considering adding certain Android mobile functionality to his service. Three days after that, the Mario.Zank3 profile posted a photo saying he was selected for an Android instruction course &#8212; with his dugidox email in the photo, naturally.</p>\n<p>Incorporation records from the U.K.&#8217;s Companies House show that in 2017 Mr. Zanko became an officer in a company called <strong>Godbex Solutions LTD</strong>. A <a href=\"https://www.youtube.com/watch?v=jO_qmXaiJ98\" target=\"_blank\" rel=\"noopener\">Youtube video</a> invoking this corporate name describes Godbex as a &#8220;next generation platform&#8221; for exchanging gold and cryptocurrencies.</p>\n<p>The U.K. Companies House records show Godbex was dissolved in 2020. It also says Mr. Zanko was born in July 1983, and lists his occupation as &#8220;electrical engineer.&#8221;</p>\n<p>Mr. Zanko did not respond to multiple requests for comment.</p>\n<p>A statement from the Croatian police about the NetWire takedown is <a href=\"https://policija.gov.hr/vijesti/u-sklopu-medjunarodne-policijske-akcije-hrvatska-policija-uhitila-hakera-s-podrucja-zagrebacke-zupanije/6944\" target=\"_blank\" rel=\"noopener\">here</a>.</p>\n"},"wfw:commentRss":"https://krebsonsecurity.com/2023/03/whos-behind-the-netwire-remote-access-trojan/feed/","slash:comments":"29"}]}}/*
Performance optimized by W3 Total Cache. Learn more: https://www.boldgrid.com/w3-total-cache/

Object Caching 206/206 objects using memcached
Page Caching using memcached 
Database Caching using memcached

Served from: krebsonsecurity.com @ 2023-04-07 23:30:23 by W3 Total Cache
*/}